{
    "id": "0363472",
    "localized title": "Bewafaa",
    "cast": [
        "Anil Kapoor",
        "Akshay Kumar",
        "Kareena Kapoor",
        "Sushmita Sen",
        "Shamita Shetty",
        "Manoj Bajpayee",
        "Supriya Pathak",
        "Kabir Bedi",
        "Nafisa Ali",
        "Beneka",
        "Cote Jean Charles",
        "Supriya Karnik",
        "Goolshan Mazdiasni",
        "Sudhir Mittu",
        "Nilofar",
        "Navneet Nishan",
        "Raj Premi",
        "Guy Letourneau",
        "Melia Morgan",
        "Gregory Terlecki",
        "Shawn Zimmerman"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "151",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Germany:6",
        "India:UA",
        "Singapore:PG",
        "South Africa:PG",
        "United Kingdom:PG"
    ],
    "original air date": "25 Feb 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2U3ZGJmOWEtNGRhMS00ZjU3LTg3ZjItMTlmMzg0NzliYzJlXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0363472",
    "plot outline": "Anjali, living in Canada with her parents, hides her relationship to the musician Raja from her parents. When her sister dies during the birth of twins, she abandons her love, marries the widower Aditya and moves to New Delhi to become the new mother of her sister's children. Three years later, when Raja visits Delhi on his concert tour their love inflames again.",
    "languages": "Hindi",
    "title": "Bewafaa",
    "kind": "movie",
    "directors": "Dharmesh Darshan",
    "writers": "Dharmesh Darshan",
    "producers": [
        "Boney Kapoor",
        "Ravi Sarin",
        "Rajesh Shah",
        "Kanwalinder Singh"
    ],
    "composers": [
        "Shravan Rathod",
        "Nadeem Saifi"
    ],
    "cinematographers": "W.B. Rao",
    "editorial department": [
        "Rohan Desai",
        "Shakeel Khan"
    ],
    "casting directors": "Helene Rousse",
    "production designers": [
        "Nikhil Saini",
        "Shyam Sunder"
    ],
    "art directors": "Bijon Das Gupta",
    "costume designers": "Manish Malhotra",
    "production managers": "Kalindar Mulani",
    "assistant directors": [
        "Saheem Jah",
        "Naveen Shetty",
        "Angira Vats"
    ],
    "sound department": [
        "Matias Caldarella",
        "Subir Kumar Das",
        "Anup Dev",
        "Nikhil v Pathare",
        "Arvind Rathod"
    ],
    "stunts": "Abbas Ali Moghul",
    "camera department": [
        "Piyush Acharya",
        "Navin Gadkari"
    ],
    "music department": [
        "Abhijeet",
        "Amin Akhtar",
        "Ghulam Ali",
        "Asha Bhosle",
        "Lata Mangeshkar",
        "Pritesh Mehta",
        "Sapna Mukherjee",
        "Udit Narayan",
        "Sonu Nigam",
        "Sameer",
        "Kumar Sanu",
        "Shaan",
        "Tabun Sutradhar",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Mehul Gadani",
        "Raju Khan",
        "Nikhil Saini"
    ],
    "akas": [
        "Bewafaa - Untreu (Germany)",
        "Geheime Liebe (Germany)",
        "Неверная (Russia)",
        "Geheime Liebe (Austria)"
    ],
    "writer": "Dharmesh Darshan",
    "director": "Dharmesh Darshan",
    "production companies": "Sridevi Productions",
    "distributors": "EuroVideo",
    "plot": [
        "Anjali sacrifices her love for Raja after her sister's death and marries her brother-in-law. Years later, she meets Raja and is torn between him and her loyalties.",
        "Anjali, living in Canada with her parents, hides her relationship to the musician Raja from her parents. When her sister dies during the birth of twins, she abandons her love, marries the widower Aditya and moves to New Delhi to become the new mother of her sister's children. Three years later, when Raja visits Delhi on his concert tour their love inflames again.::Moritz Muehlenhoff <jmm@inutil.org>",
        "Anjali lives in Canada with her parents and is in love with Rockstar Raja.Aarti elder sister of Anjali is married to Aditya she is the only one aware of their relationship.Aarti passes away after giving birth two twin daughters then Anjali scarifies her love by marrying much older Aditya to take care of the newborns living Raja heart broken.Anjali tries her best to fulfill Aarti's place in Aditya's life but Aditya feels no one can replace her.Anjali and Aditya later move to Delhi with their kids few years later Raja also comes to Delhi for his concert and comes across Anjali they start getting old feelings for each other but will Anjali sacrifice Aditya and her kids for Raja.::alex.mjacko@gmail.com",
        "With a mixed ethnic background of English and Hindi, Anjali lives in Montreal, Quebec, Canada with her parents. There she meets with a young struggling musician named Raja, and they both fall in love, but cannot share their love openly. Anjali's parents are very strict with their Hindu values and Anjali fears they won't consent of Raja and her. When Anjali's India-based, married, and pregnant sister, Aarti Sahani, comes for a visit she takes her to be introduced to Raja, and Aarti approves of him, promising Anjali she will try to convince their parents to allow Raja to marry Anjali. Then Aarti goes into delivery mode and tragically dies after giving birth to twin daughters. This crisis is resolved when Anjali is asked to consider marrying Aarti's businessman husband, Aditya, in accordance with Hindu traditions. Fearing that the twins will be neglected and harmed if Aditya re-marries someone else, she consents, and a quiet marriage ceremony takes place, and thereafter they relocate to India with the twins. Years pass by, Aditya is engrossed in his business, and has no time for Aarti, who yearns for his company and makes every attempt to be a good wife, going to the extent of trying to look exactly like Aarti and to please him. However, he shows no signs of affection. And then in a twist of fate, Raja comes to India for a tour, and re-meets with a much more subdued and mature Anjali bringing back old feelings. The only thing stopping these two from being together is Anjali's sacrifice and commitment for Aarti to take care of her children and husband, Aditya-not to mention two busy bodies Aditya calls \"friends,\" Dil and Pallo::sk828715",
        "Anjali lives in Montreal, Canada with her parents. She meets with a young man named Raja, and both fall in love. When Anjali's India-based married sister, Aarti Sahai, comes for a visit she takes her to be introduced to Raja, and Aarti approves of him. Raja is also introduced to the family, and there is all-round approval. Then Aarti gets pregnant, tragically passes away, after giving birth to twin daughters, which results in a crisis in the family. This crisis is resolved when Anjali is asked to marry Aarti's businessman husband, Aditya, in accordance with Hindu traditions. Fearing that the twins will be neglected and harmed if Aditya re-marries someone else, she consents, and a quiet marriage ceremony takes place, and thereafter they relocate to India with the twins. Years pass by, Aditya is engrossed in his business, and has no time for Aarti, who yearns for his company and makes every attempt to be a good wife, going to the extent of trying to look exactly like Anjali, and to please him. However, Raja shows no signs of affection. And then Raja comes to India for a tour, meets with a much more subdued and mature Aarti - and they rekindle old flames - only to run into an angry Aditya and his friends - who will do their best to prevent Aarti from getting back with Raja.::rAjOo (gunwanti@hotmail.com)",
        "Of Indian-origin Anjali lives in Canada with her Canadian mother and Indian father. She loves a budding musician Raja, of which she kept as a secret from her parents, she meets Raja on the sly and both has plans to get married after she has reveal this secret to her parents. When Anjali's elder married sister, Aarti Sahai, comes for a visit she reveal the secret about Raja to her sister and introduces her to him. Aarti does approve of Raja and promises the couple that she will convince her parents of their true love. Then Aarti has the sullen of the occurrence of an unknown pregnancy, gives birth to twin daughters and passed away. On discovering the plight of Aarti's businessman husband, Aditya and her nieces, Anjali decides to fill the place of Aarti and so get married to Aditya and relocates to India in Delhi with the twin. Aditya, is so much engrossed in business activities that he hardly finds any time for his sister-in-law turned wife Anjali or his two lovable daughters from Aarti. Anjali fulfills every role asked for her by the society but cannot bridge the gap between herself and Aditya. She finds herself in a marriage that has no compatibility but only compromise. Her only source of solace are the twins. Amidst all this, one fine day Raja who is now a famous fusion singer walks back into her life. Suddenly Anjali is torn between two men - her indifferent husband and her ex-lover. And before you know it she had embarked on to an extra-marital affair with Raja. But Aditya soon makes friends with Dil Arora and Pallavi Arora who will only wait for an opportunity to expose Anjail and her true colours to Aditya.::gavin (gunmasterM@hotmail.com)"
    ]
}