{
    "id": "0389680",
    "localized title": "Shaktimaan: The First Indian Superhero",
    "original title": "Shaktimaan",
    "cast": [
        "Mukesh Khanna",
        "Vaishnavi Mahant",
        "Surendra Pal",
        "Rajendra Gupta",
        "Tom Alter",
        "Nawab Shah",
        "Raju Srivastava",
        "Deepshikha Nagpal",
        "Manjeet Kular",
        "Lalit Parimoo",
        "Gaurav Pareek",
        "Ajit Mehra",
        "Govind Khatri",
        "Kitu Gidwani",
        "Priyanka",
        "Supriya Khan",
        "Swati Anand",
        "Harsh Soni",
        "Urvashi Dholakia",
        "Arun Bakshi",
        "Preeti Puri",
        "Vinod Kapoor",
        "Shamsuddin",
        "Raman Khatri",
        "Vinod Tharani",
        "Kavish Mishra"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Family",
        "Fantasy",
        "Sci-Fi"
    ],
    "runtimes": "60",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "4:3",
    "certificates": [
        "India:U",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzQyYmE2NDItZTBlZS00MmEyLWI4MjctMWM1NWVkY2MxNzg3XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "0389680",
    "plot outline": "When evil was ruling the world, the Suryanshis chose an ordinary man as the warrior to fight evil. When the five natural elements of life, fire, earth, water, wind and sky invigorated his body, he gained superpowers from these elements. Eventually he transformed into Shaktimaan. Shaktimaan was the rebirth of Shri Satya who had formed the Suryanshi Sect after the war of the Mahabharata 7,500 years ago. He got his powers from 7 spiritual gurus who had blessed him with mystical yogic shakti and trained him in ancient combat forms. During his training, Shaktimaan was taught the way to energize the 7 chakras of body through Kundalini Yoga that helped him get mystical and supernatural powers. He also conducted the ritual of death in order to get total control over his powers. This process, instead of killing him, made him almost immortal and stronger than any mere human being. Towards the end the Suryanshis performed a Yagya (Yajna) through which he entered holy fire and immersed his physical body in it. After which the five natural elements of life, namely fire, earth, water, wind and sky invigorated his body and he gained further super powers from these elements. Eventually he transformed into a super human warrior in order to fight against the forces of evil in the world and ultimately becomes the super hero Shaktimaan.",
    "languages": "Hindi",
    "title": "Shaktimaan",
    "kind": "tv series",
    "series years": "1997-2005",
    "akas": [
        "शक्तिमान (India, Hindi title)",
        "Shaktimaan: The First Indian Superhero (India, English title)",
        "シャクティマーン (Japan, Japanese title)"
    ],
    "writer": "Brij Mohan Pandey",
    "production companies": "Bheeshm International",
    "distributors": [
        "Doordarshan",
        "Primo Video"
    ],
    "plot": [
        "When darkness get strengthened to destroy the world, Suryanshis chose _Shaktimaan_ (qv) in order to fight against the forces of evil.",
        "When evil was ruling the world, the Suryanshis chose an ordinary man as the warrior to fight evil. When the five natural elements of life, fire, earth, water, wind and sky invigorated his body, he gained superpowers from these elements. Eventually he transformed into _Shaktimaan_ (qv). _Shaktimaan_ (qv) was the rebirth of Shri Satya who had formed the Suryanshi Sect after the war of the Mahabharata 7,500 years ago. He got his powers from 7 spiritual gurus who had blessed him with mystical yogic shakti and trained him in ancient combat forms. During his training, _Shaktimaan_ (qv) was taught the way to energize the 7 chakras of body through Kundalini Yoga that helped him get mystical and supernatural powers. He also conducted the ritual of death in order to get total control over his powers. This process, instead of killing him, made him almost immortal and stronger than any mere human being. Towards the end the Suryanshis performed a Yagya (Yajna) through which he entered holy fire and immersed his physical body in it. After which the five natural elements of life, namely fire, earth, water, wind and sky invigorated his body and he gained further super powers from these elements. Eventually he transformed into a super human warrior in order to fight against the forces of evil in the world and ultimately becomes the super hero _Shaktimaan_ (qv).::Swarup Basak",
        "Far from the reach of general public, an ordinary human undergoes spiritual training with the Suryanshis and in the process gains powers that turn him into a superhuman. He pledges to protect the mankind and fight the evil prevailing in the world. Soon, as he shifts to a city, his heroic acts start to shake the very foundations of evil, due to which he earns the name \"_Shaktimaan_ (qv)\", given to him by Geeta Vishwas, a news reporter. He joins Geeta as Gangadhar, a funny photographer and often assists her in bringing news related to _Shaktimaan_ (qv). He is also aware of the rising number of enemies who want his existence eradicated along with that of goodness.::Prashast Singh"
    ]
}