{
    "id": "0420123",
    "localized title": "Revati",
    "cast": [
        "Kashmira Shah",
        "Shreyas Talpade",
        "Ayub Khan",
        "Vijay Kadam",
        "Javed Khan Amrohi",
        "Kiran Kumar",
        "Utkarsha Naik",
        "Sulabha Arya",
        "Akram Khan"
    ],
    "genres": "Drama",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "India:A",
    "original air date": "07 May 2005 (India)",
    "imdbID": "0420123",
    "plot outline": "The story of a rebel trash picker living in the slums of Bombay India. She dreams of being able to have simple luxuries like a bath or decent clothes to cover her body. One day she gets her opportunity through a drug smuggler of Bombay and quickly learns all that glitters is not gold. Whether it be a drug lord, a murder, rapist or the legal system; Revati is a fighter that keeps a sense of humor about her plight. Revati shows the life's struggles of a woman struggling to keep her morality and dignity in a place that tries hard to strip her of all she has in many extreme circumstances. Revati dares to be different and live by her own rules. Will she win and yet keep her morality? Will she survive?",
    "languages": "Hindi",
    "title": "Revati",
    "kind": "movie",
    "directors": "Farogh Siddique",
    "writers": "Farogh Siddique",
    "producers": "Vikas Kate",
    "composers": [
        "Jatin Pandit",
        "Nazakat Shujat"
    ],
    "cinematographers": "Akram Khan",
    "editors": "Suresh Chaturvedi",
    "art directors": "Devdas Bhandare",
    "assistant directors": "Imdad Husain Usmani",
    "visual effects": "Sanjay Naik",
    "music department": [
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Sonu Kakkar",
        "Kailash Kher",
        "Vinod Rathod",
        "Farogh Siddique"
    ],
    "akas": "Revati (India)",
    "writer": "Farogh Siddique",
    "director": "Farogh Siddique",
    "production companies": "Victory International",
    "plot": "The story of a rebel trash picker living in the slums of Bombay India. She dreams of being able to have simple luxuries like a bath or decent clothes to cover her body. One day she gets her opportunity through a drug smuggler of Bombay and quickly learns all that glitters is not gold. Whether it be a drug lord, a murder, rapist or the legal system; _Revati_ (qv) is a fighter that keeps a sense of humor about her plight. _Revati_ (qv) shows the life's struggles of a woman struggling to keep her morality and dignity in a place that tries hard to strip her of all she has in many extreme circumstances. _Revati_ (qv) dares to be different and live by her own rules. Will she win and yet keep her morality? Will she survive?::Co producer"
}