{
    "id": "0442855",
    "localized title": "Vaada",
    "cast": [
        "Arjun Rampal",
        "Zayed Khan",
        "Ameesha Patel",
        "Alok Nath",
        "Rakesh Bedi",
        "Virendra Saxena",
        "Rajesh Vivek",
        "Sarfaraz Khan",
        "Shashi Kiran",
        "Achyut Potdar",
        "Anil Saxena",
        "Kuldeep Sharma",
        "Anjan Srivastav"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "122",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:U::(Cable TV rating)",
        "India:UA",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "07 Jan 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTIwNjA2NTY5OF5BMl5BanBnXkFtZTcwOTc2ODgzMQ@@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0442855",
    "plot outline": "Rahul and Puja are married and totally devoted to each other. One day they meet with a terrible accident and Rahul loses his eyesight. On a business trip abroad Rahul meets a friend Karan. Impressed by his dynamism and business acumen, Rahul asks him to join his business. They return to India and Puja is stunned to see her husband with her friend Karan. Rahul's love for Puja is blind and unquestioning. Karan's love for Puja is obsessive and uncontrollable. Puja is trapped between a blind husband and a sighted lover.",
    "languages": "Hindi",
    "title": "Vaada",
    "kind": "movie",
    "directors": "Satish Kaushik",
    "writers": "Rumi Jaffery",
    "producers": [
        "Vashu Bhagnani",
        "Pooja Bhatt",
        "Mudit Jain"
    ],
    "composers": [
        "Salim Merchant",
        "Himesh Reshammiya"
    ],
    "cinematographers": "Johny Lal",
    "editors": "Steven H. Bernard",
    "editorial department": "Dilip Kumar Sah",
    "costume designers": [
        "Shaahid Amir",
        "Komal Shahani"
    ],
    "assistant directors": [
        "Mukesh Bansal",
        "Mohd. Shahnawaz Khan",
        "Anant Vidhaat Sharma",
        "Lovely Singh",
        "Rakesh Singh"
    ],
    "art department": "Swapnil Keny",
    "sound department": [
        "Leslie Fernandes",
        "Jayant Haldar",
        "Umesh Patel"
    ],
    "visual effects": "Sanjiv Naik",
    "stunts": [
        "Abbas Ali Moghul",
        "Pradyumna Kumar Swain"
    ],
    "music department": [
        "Sunidhi Chauhan",
        "Kailash Kher",
        "Sangeeta Kopalkar",
        "Udit Narayan",
        "Sameer",
        "Kumar Sanu",
        "Kavita Seth",
        "Shaan",
        "Aamir Shaikh",
        "Sandeep Shirodkar",
        "Anuradha Sriram",
        "Babul Supriyo",
        "Alka Yagnik"
    ],
    "akas": [
        "The Promise (India, English title)",
        "Обещание (Russia)"
    ],
    "writer": "Rumi Jaffery",
    "director": "Satish Kaushik",
    "production companies": "Puja Films",
    "distributors": [
        "Eros Multimedia Pvt. Ltd.",
        "Eros Worldwide",
        "Eros Worldwide"
    ],
    "plot": [
        "A blind husband. An obsessed lover. And the missing body of a murdered wife...?",
        "Rahul and Puja are married and totally devoted to each other. One day they meet with a terrible accident and Rahul loses his eyesight. On a business trip abroad Rahul meets a friend Karan. Impressed by his dynamism and business acumen, Rahul asks him to join his business. They return to India and Puja is stunned to see her husband with her friend Karan. Rahul's love for Puja is blind and unquestioning. Karan's love for Puja is obsessive and uncontrollable. Puja is trapped between a blind husband and a sighted lover.::gavin@sunny_deol2009@yahoo.com",
        "Rahul a blind man and Karan are business partners.Once Karan returns from his morning walk an finds Rahul's wife Pooja has committed suicide by hanging herself.Rahul believes that Pooja cant commit suicide and its a murder later her body goes missing during postmortem and her belongings like jewelry and shoes are found in house of Karan thus making him the main suspect.It is also reveled that many years back Karan and Pooja were in relationship and Pooja broke up has Karan was shot tempered and over possessive.Karan has doubts about Rahul's visibility and he is also trying to frame him for the murder.When a fight ensures between the two it reveled that Rahul is indeed not blind and framing Karan for the murder.::alex.mjacko@gmail.com",
        "Sparks fly when Pooja Sharma meets with Karan and both fall deeply in love with each other. When Pooja's dad comes to know of this, he disapproves of Karan as he has no steady job and decent accommodations, and as a result forbids Pooja to see him again. Karan does not help matters when he gets into a physical argument with Sharma. Karan is counseled by his friend, Rahul Verma, and is told to get a job and suitable accommodation. Karan goes abroad, gets a job, saves enough money to buy a house and returns to India after two years - only to find out that Sharma has passed away and that Pooja is married to none other than Rahul himself. But Rahul is not aware of their past relationship, and additionally he has lost his vision and unable to notice the visible tension between his wife and his buddy. Karan decides to hang on, and hopefully convince Pooja to divorce Rahul. But things go seriously wrong when Pooja is found dead. Her body is taken to a hospital and a few days later mysteriously vanishes. Then her ashes are found near a beach - along with a shoe that belongs to Karan. The police suspect Karan and arrest him. Karan's pleas that he is not guilty and that not only the real culprit is Rahul, but is just pretending to be blind, is ignored by the police and then subsequently by the Court. The question is did Pooja die, or was she killed, and who, out of the two men in her, life killed her.::rAjOo (gunwanti@hotmail.com)"
    ]
}