{
    "id": "0444849",
    "localized title": "Karam",
    "cast": [
        "John Abraham",
        "Priyanka Chopra Jonas",
        "Bharat Dabholkar",
        "Vishwajeet Pradhan",
        "Shiney Ahuja",
        "Anjan Srivastav",
        "Bikramjeet Kanwarpal",
        "Murali Sharma",
        "Kanwar Pal",
        "Rajesh Khera",
        "Aakash",
        "Nitin Arora",
        "Pear Barsiwala",
        "Ashok Beniwal",
        "Pawan Chopra",
        "Shree Rammy Pandey",
        "Shabana Raza",
        "Sanjay Swaraj"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "117",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Germany:16",
        "India:A",
        "India:U::(video)",
        "Singapore:NC16",
        "Singapore:PG",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "11 Mar 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDgxMGI5YTEtMTY3Yy00NmUxLThmMjYtNmE4OGU1MGRiMzZkXkEyXkFqcGdeQXVyNDY5MTUyNjU@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0444849",
    "plot outline": "This action-thriller follows John, an assassin working for a mobster named Captain. After killing an entire family, he is hit by the consequences of his actions and decides to quit his job. He starts life anew with his pregnant wife Shalini. Meanwhile, John's boss, Captain, is facing a threat from a rival don, Yunus. After being attacked, Captain decides to teach the city a lesson by killing the city's top industrialist, top film producer, the cop backing Yunus and Yunus himself; so that everyone else falls in line and no one dreams of becoming another Yunus. He decides that John must carry out this plan of his. To achieve this, he takes Shalini hostage. John is given 36 hours to kill the five targets on the hit list. Things get worse when the city's toughest cop Wagh traces John who is pressed for time and the body count is growing.",
    "languages": "Hindi",
    "title": "Karam",
    "kind": "movie",
    "directors": "Sanjay F. Gupta",
    "writers": "Suparn Varma",
    "producers": [
        "Harry Baweja",
        "Pammi Baweja"
    ],
    "composers": [
        "Vishal Dadlani",
        "Shekhar Ravjiani"
    ],
    "cinematographers": "Narendra Khanna",
    "editors": [
        "Reupal D. Rawal",
        "Merzin Tavaria"
    ],
    "editorial department": "Rohan Desai",
    "art directors": "Ajay Verekar",
    "costume designers": [
        "Dipika Lal",
        "Anirudh Singh"
    ],
    "production managers": "Khalid Khan",
    "assistant directors": [
        "Manpreet Singh Arshi",
        "Rowena Baweja",
        "Abhijeet Lamture",
        "Jayesh Yadav"
    ],
    "sound department": [
        "Sajjan Choudhary",
        "Vijay Kumar",
        "Nishant Menon",
        "Karnail Singh",
        "Sreejesh"
    ],
    "visual effects": [
        "Mahesh Baria",
        "Ketan Kale",
        "Jignesh Patel",
        "Susheel Peris",
        "Reupal D. Rawal",
        "Merzin Tavaria"
    ],
    "camera department": [
        "Surendra Singh Farswan",
        "Pramod Khandale",
        "Prameelkumar",
        "Bharat Sunanda"
    ],
    "music department": [
        "Pankaj Awasthi",
        "Sunidhi Chauhan",
        "Alisha Chinai",
        "Vishal Dadlani",
        "Mahalakshmi Iyer",
        "Irshad Kamil",
        "Harshdeep Kaur",
        "Dev Kohli",
        "Amit Mishra",
        "Sonu Nigam"
    ],
    "miscellaneous": [
        "Caesar Gonsalves",
        "Bosco Martis"
    ],
    "akas": [
        "Deeds (United States)",
        "Судьба в твоих руках (Russia)"
    ],
    "writer": "Suparn Varma",
    "director": "Sanjay F. Gupta",
    "production companies": "Baweja Movies",
    "distributors": "EuroVideo",
    "other companies": "Glamsham.com",
    "plot": [
        "A guilt-ridden hit man tries to quit his job after a traumatic killing, before his boss kidnaps his wife in order to make him do one last job.",
        "This action-thriller follows John, an assassin working for a mobster named Captain. After killing an entire family, he is hit by the consequences of his actions and decides to quit his job. He starts life anew with his pregnant wife Shalini. Meanwhile, John's boss, Captain, is facing a threat from a rival don, Yunus. After being attacked, Captain decides to teach the city a lesson by killing the city's top industrialist, top film producer, the cop backing Yunus and Yunus himself; so that everyone else falls in line and no one dreams of becoming another Yunus. He decides that John must carry out this plan of his. To achieve this, he takes Shalini hostage. John is given 36 hours to kill the five targets on the hit list. Things get worse when the city's toughest cop Wagh traces John who is pressed for time and the body count is growing.::gavin@sunny_deol2009@yahoo.com"
    ],
    "synopsis": "The film begins with Shalini (Priyanka Chopra) narrating how much she loved John (John Abraham) despite of knowing he was contract killer and how things might have been different had he not picked up a gun. The film goes into flashback mode and John is shown to be an assassin working for a mobster named Captain (Bharat Dabholkar). Accompanied by two friends Kaif (Murali Sharma) and Bull (Rajesh Khera), he is assigned a hit which he carries out but also ends up killing an entire family which arrives untimely to the house from where the hit was planned. Apart from the adults, one of their daughters gets shot unintentionally by John. He gets traumatized and despite of his friends telling him to move on, he becomes guilt-ridden and explains everything to Shalini, with whom he plans to escape away. The city's toughest cop, Wagh (Shiney Ahuja), starts investigating the murder and in the process, comes close to the surviving daughter of the deceased family.Meanwhile, Captain is attacked by the rival don, Yunus (Vishwajeet Pradhan), and as a result decides to teach the city a lesson by killing the city's top industrialist, top film producer, the cop backing Yunus and Yunus himself; so that everyone else falls in line and no one dreams of becoming another Yunus. He decides that John must carry out this plan of his. To achieve this, he takes Shalini hostage. John is given 36 hours to kill the five targets on the hit-list. John re-unites with his friends but struggles to carry out the hits initially due to still being traumatized. He, however, manages to kill the targets one by one, while his wife tries to escape in order to stop him from killing. Kaif, however, gets killed by Wagh after John manages to kill a few more targets. Shalini slashes her wrist and is admitted to a hospital, where she realizes she's pregnant and manages to escape. She manages to contact John, who arrives to pick her up, only to find himself trapped when she gets taken hostage once again. Realizing that he has been double-crossed, John shoots Bull in front of Captain, who reminds him of the remaining time he has.John meets Wagh and asks for his help in exchange for providing all evidence against Captain, to which Wagh agrees. Along with sub-inspector Naik, he arrives on spot and after a gunfight, manages to free Shalini. John, on the other hand, meets Yunus and his friend, DCP Patil (Aanjjan Srivastav). He blackmails Patil into bringing him Shalini, which he does. However, John kills both Yunus and Patil, escaping with Shalini. A chase ensues, resulting in a rough fight between John and Captain. John manages to kill Captain and his team, but when one of his surviving members tries to shoot, John shoots him and himself gets shot unintentionally by Naik, the same way John mistakenly shot the young girl. He breathes his last near Shalini, who gets shattered by his death.The film ends with the story returning to the present time, where Shalini is happily playing with two kids."
}