{
    "id": "0453978",
    "localized title": "Yakeen",
    "cast": [
        "Arjun Rampal",
        "Priyanka Chopra Jonas",
        "Kim Sharma",
        "Sudhanshu Pandey",
        "Saurabh Shukla",
        "Anang Desai",
        "Atul Parchure",
        "Ankur Nayyar"
    ],
    "genres": [
        "Drama",
        "Thriller"
    ],
    "runtimes": "116",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "01 Jul 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDdlZDBlZWMtMzgzMi00YmRkLWI1ZDctYzE5ZWMyNWQ2Nzg5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0453978",
    "plot outline": "The film begins with the recovery of Simar (Priyanka Chopra) and her husband Nikhil (Arjun Rampal) from a car accident. Simar is almost unscratched but Nikhil not only has major internal and external damage, but he also has amnesia. Simar is determined that Nikhil will get better and resume his life, and immediately begins by bringing in the best surgeons to reconstruct his damaged leg and face, and then later helping him with the hospital therapy. Although Nikhil is at first cautious and wary, Simar's obvious love and dedication wins him over. After six months of therapy he's released from the hospital and the couple return home. Simar insists that Nikhil continue with his life and encourages him to go back to work, though beforehand she warns him that there are both good and bad people all around, and it's up to him to decide whom to trust. Once Nikhil meets up with his old friends and goes through his personal files, he finds evidence that all was not well in his previous life. Now uncertain of his wife's true motives, Nikhil starts retracing his steps from the night of the accident, and learns that things are not quite what they appear.",
    "languages": "Hindi",
    "title": "Yakeen",
    "kind": "movie",
    "directors": "Girish Dhamija",
    "writers": [
        "Vikram Bhatt",
        "",
        "Vikram Bhatt",
        "",
        "Girish Dhamija"
    ],
    "producers": [
        "Sheel Kumar",
        "Sujit Kumar Singh"
    ],
    "composers": [
        "Amar Mohile",
        "Himesh Reshammiya"
    ],
    "cinematographers": "Anshuman Mahaley",
    "editors": "Kuldip K. Mehan",
    "costume designers": "Reza Shariffi",
    "production managers": [
        "Santosh K. Mishra",
        "Vijay Shukla"
    ],
    "assistant directors": "Mahender Singh",
    "sound department": [
        "Sajjan Choudhary",
        "Karnail Singh"
    ],
    "visual effects": "Biju Dhanpalan",
    "music department": [
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Udit Narayan",
        "Sonu Nigam",
        "Sameer",
        "Shaan",
        "Aamir Shaikh",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Mehul Gadani",
        "Abu Kumar Jain"
    ],
    "akas": [
        "Trust (United States)",
        "Вспомнить всё (Russia)"
    ],
    "writer": [
        "Vikram Bhatt",
        "Vikram Bhatt",
        "Girish Dhamija"
    ],
    "director": "Girish Dhamija",
    "production companies": "Shreya Creations Pvt. Ltd.",
    "other companies": "Seek Red",
    "plot": [
        "Left with amnesia after a car accident, a man (Arjun Rampal) believes his wife (Priyanka Chopra) is having an affair.",
        "The film begins with the recovery of Simar (Priyanka Chopra) and her husband Nikhil (Arjun Rampal) from a car accident. Simar is almost unscratched but Nikhil not only has major internal and external damage, but he also has amnesia. Simar is determined that Nikhil will get better and resume his life, and immediately begins by bringing in the best surgeons to reconstruct his damaged leg and face, and then later helping him with the hospital therapy. Although Nikhil is at first cautious and wary, Simar's obvious love and dedication wins him over. After six months of therapy he's released from the hospital and the couple return home. Simar insists that Nikhil continue with his life and encourages him to go back to work, though beforehand she warns him that there are both good and bad people all around, and it's up to him to decide whom to trust. Once Nikhil meets up with his old friends and goes through his personal files, he finds evidence that all was not well in his previous life. Now uncertain of his wife's true motives, Nikhil starts retracing his steps from the night of the accident, and learns that things are not quite what they appear.::gavin@sunny_deol2009@yahoo.com",
        "Simar and her husband Nikhil meet with a major accident .Simar luckily escapes with minor injuries while Nikhil is critical the accident damages his face and legs badly.Nikhil comes to his sense's but has lost his memory he returns home after a long stay in the hospital and things around make him believe that all wasn't well between him and Simar before the accident.Nikhil hires a private detective Chamanlal and finds that before the accident Simar was having an affair with a man named Kabir.Nikhil finds Simar still meets Kabir and chases her but finds that Simar had planned the whole story of meeting Kabir as she wanted to save Nikhil who had killed Kabir the same night they met with an accident.Tanya a friend of Nikhil finds some important information relating Nikhil and his life before the accident but is killed before Nikhil meets her.::alex.mjacko@gmail.com",
        "Wealthy Architect, Nikhil Oberoi and his wife, Simar, are driving in the mountainous Simla border region when he loses control of his car, which hurtles through a barrier, falling down a deep snow-covered ravine. While Simar is able to walk away with a few injuries, Nikhil is not only disfigured, but also loses his memory. Simar slowly helps him get back to health, and gets a plastic surgeon to operate on him, riding the scars of the accident. Soon, Nikhil is discharged from hospital, returns home, recuperates and is well enough to go to work along with his partner Siddharth Thakur. One day while driving, Nikhil comes across some photographs showing Simar and a male in very compromising positions. Intrigued and angered, he hires a private detective, Chamanlal, only to find out that Simar is indeed having an affair with a singer named Kabir. Nikhil finds out that Simar continues to meet Kabir on the sly, and one day follows her. She does meet with Kabir, but an argument ensues between them, and Kabir leaves her. Nikhil follows him, apprehends him at gun-point, and it is then he finds out that Kabir is none other than Simar disguised as a male. Nikhil must now find out why his wife chose to pretend to have an affair with a seemingly imaginative lover, and the identity of the male in the photographs.::rAjOo (gunwanti@hotmail.com)"
    ]
}