{
    "id": "0459566",
    "localized title": "Thotti Jaya",
    "cast": [
        "T.R. Silambarasan",
        "Gopika",
        "Pradeep Singh Rawat",
        "Cochin Hanifa",
        "O.A.K. Sunder",
        "Linda Arsenio",
        "G.M. Kumar"
    ],
    "genres": "Thriller",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:UA",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:12A"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjBhNWFmYTQtN2YxNS00MWY1LWFiNjQtOGNiYmI0ZmJmZTg5XkEyXkFqcGdeQXVyODE0NjUxNzY@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0459566",
    "plot outline": "Jaya (Simbu) is an orphan and a born rowdy working in a hotel as a helper. He gets his title name \"Thotti Jaya\" as he is born in a garbage bin. People who confront him dread even his shear presence. Seena Thana (Pradeep Rawat), a local rowdy notices Jaya's qualities as a rowdy, makes him his right hand henchman and uses him in his anti social activities. In an incident, Jaya gets entangled in a political and police trap. To escape from police, Jaya slips to Calcutta and goes into hiding. Meanwhile Brinda (Gopika), a college lace from Kanyakumari comes to Calcutta on a tour along with her friends. Pimps operating in the red light area of Calcutta take away Brinda and force her into brothel business. Jaya accidentally meets Brinda who is held captive by the gang. He helps Brinda escape from the gang and takes her safely to Kanyakumari. On her way back home by train, Brinda starts admiring Jaya's niceties and gradually falls in love with him. When she expresses her desire, Jaya reciprocates her love, and both decide to enter into wedlock but little does he know that Brindha is actually the daughter of Seena Thana. Jaya takes away Brinda from her house and in turn, earns the wrath of Seena Thana. Angst at this, Seena Thana summons his rowdy gangs and plots to bump off Thotti Jaya. How Thottijaya accomplishes his hopes of marrying Brinda is told eloquently in the remaining part of the story.",
    "languages": "Tamil",
    "title": "Thotti Jaya",
    "kind": "movie",
    "directors": "V.Z. Dhorai",
    "writers": [
        "V.Z. Dhorai",
        "",
        "V.Z. Dhorai"
    ],
    "producers": "Kalaippuli S. Thanu",
    "composers": [
        "Harris Jayaraj",
        "Yuvan Shankar Raja"
    ],
    "cinematographers": "R.D. Rajasekhar",
    "editors": "Anthony",
    "visual effects": [
        "Thirumurugan Krishnan",
        "Caarthick Raju",
        "Andrew Shibi"
    ],
    "camera department": "Jeyaprakash",
    "music department": [
        "Harini",
        "Bombay Jayashri",
        "Kabilan",
        "Karthik",
        "Shankar Mahadevan",
        "Ceylon Manohar",
        "Na. Muthukumar",
        "Srilekha Parthasarathy",
        "Sriram Parthasarathy",
        "Yuvan Shankar Raja",
        "Ranjith",
        "Saindhavi",
        "Anuradha Sriram",
        "Thamarai",
        "Ramesh Vinayakam",
        "Dharma Vish"
    ],
    "akas": "Thotti Jaya (India)",
    "writer": [
        "V.Z. Dhorai",
        "V.Z. Dhorai"
    ],
    "director": "V.Z. Dhorai",
    "production companies": [
        "An Ak Audio",
        "Ayngaran Music",
        "V. Creations"
    ],
    "distributors": [
        "AP International",
        "Kalaipuli Films International",
        "Jaya TV"
    ],
    "special effects": "Land Marvel Animation Studios",
    "other companies": [
        "AP International",
        "Aditya Music"
    ],
    "plot": [
        "An orphan gets noticed by a local gangster and is recruited by him. However, trouble ensues as he falls in love with a girl who turns out to be the daughter of the gangster.",
        "Jaya (Simbu) is an orphan and a born rowdy working in a hotel as a helper. He gets his title name \"_Thotti Jaya_ (qv)\" as he is born in a garbage bin. People who confront him dread even his shear presence. Seena Thana (Pradeep Rawat), a local rowdy notices Jaya's qualities as a rowdy, makes him his right hand henchman and uses him in his anti social activities. In an incident, Jaya gets entangled in a political and police trap. To escape from police, Jaya slips to Calcutta and goes into hiding. Meanwhile Brinda (Gopika), a college lace from Kanyakumari comes to Calcutta on a tour along with her friends. Pimps operating in the red light area of Calcutta take away Brinda and force her into brothel business. Jaya accidentally meets Brinda who is held captive by the gang. He helps Brinda escape from the gang and takes her safely to Kanyakumari. On her way back home by train, Brinda starts admiring Jaya's niceties and gradually falls in love with him. When she expresses her desire, Jaya reciprocates her love, and both decide to enter into wedlock but little does he know that Brindha is actually the daughter of Seena Thana. Jaya takes away Brinda from her house and in turn, earns the wrath of Seena Thana. Angst at this, Seena Thana summons his rowdy gangs and plots to bump off _Thotti Jaya_ (qv). How Thottijaya accomplishes his hopes of marrying Brinda is told eloquently in the remaining part of the story.::SoMeOnE"
    ]
}