{
    "id": "0488836",
    "localized title": "Hanuman",
    "cast": [
        "Mukesh Khanna",
        "Viraj",
        "Mona Shetty",
        "Sumeet Pathak",
        "Rajesh Jolly",
        "Manoj Pandey",
        "Pawan Shukla",
        "Shahnawaz Pradhan",
        "Parminder Ghumman",
        "Sanket Jaiswal",
        "Saptrishi Ghosh",
        "Kishore Bhatt",
        "Anju Jamwal",
        "Pinky Pal Rajput",
        "Anup Shukla",
        "Sanjeev Jaiswal",
        "Shailendra Pandey",
        "Amar Babaria",
        "Raj Joshi",
        "Vinod Kulkarni",
        "Manish Wadhwa",
        "Saurabh Agarwal",
        "Arijeet Sengupta",
        "Aparna Jarna",
        "Kaustav",
        "Kumar Pravesh",
        "Mukul Nag",
        "Rajesh Gupta",
        "Asha",
        "Sandeep",
        "Julie Tejwani",
        "Roshan Awle",
        "Bedanto Biswas",
        "Arunabho Mukherjee",
        "Cal Babu Pandit",
        "Irawati",
        "Archi",
        "Sushmita Mukherjee",
        "Kinshuk Sen"
    ],
    "genres": "Animation",
    "runtimes": "89",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Singapore:PG"
    ],
    "original air date": "21 Oct 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZmRiMDcwY2EtZDViMC00NWQ3LWE5ZGQtMjEwNGZkNGVjZjQzXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0488836",
    "plot outline": "When Hanuman was born to Anjani a female Apsara and Kesari, by the blessings of Vayu-Dev, the Wind God. Hanuman, who is the 11th rudra avatar of supreme being GOD Shiva himself. He was blessed with supreme intelligence, strength and divine powers. As a baby, Hanuman was quite naughty and used his powers to pester the saints living in the nearby forest. On the insistence of Vayu, Indra and the other Gods came together to bless baby Hanuman of immortal life. Amongst the other blessing a few are: no fear/harm from the Brahmastra, no harm could befall him from any weapons, fire and water. He could overcome death and he could transform his body to take the smallest form or attain the biggest form of life. Blessed with divine powers Hanuman grew up to be powerful and mighty.",
    "languages": "Hindi",
    "title": "Hanuman",
    "kind": "movie",
    "directors": [
        "V.G. Samant",
        "Milind Ukey"
    ],
    "writers": [
        "Sulekha Bajpai",
        "",
        "Shantanu Ganesh Rode",
        "",
        "Bhring Tupkari",
        "",
        "Milind Ukey"
    ],
    "producers": [
        "Manmohan Challa",
        "Sumit Kumar",
        "Sharat Marar",
        "Purva Naresh",
        "Mahesh Ramanathan",
        "Shailendra Singh"
    ],
    "composers": "Tapas Relia",
    "cinematographers": "Ashok Mishra",
    "editors": "Huzefa Lokhandwala",
    "casting directors": "Gufi Paintal",
    "production managers": [
        "Jitendra Badgujar",
        "Armit Chhabra",
        "Devendra Chodankar",
        "Sunil Devne",
        "Ashish Kukian",
        "Nandikesh Nair",
        "Sachin Salvi",
        "Bipin Samant"
    ],
    "art department": [
        "Nagakar Ajit",
        "Gajanan Akkawar",
        "Ankur Dahake",
        "Prashant Dahake",
        "Mahesh Gailwad",
        "Ravi Gulhane",
        "Kiran Hanamshet",
        "Sadashiv Hogale",
        "Ajay Yaswant Kamble",
        "Pramod Khairnar",
        "Rajesh Khele",
        "Naresh Kolekar",
        "Raju Kolhe",
        "Vinayak Krishna Kurne",
        "Ashutosh Kushe",
        "Sandeep Lawate",
        "Kiran Mungekar",
        "Shishir Naik",
        "Anand Parulekar",
        "Vaibhav Piwlatkar",
        "Balasaheb Sawant",
        "Shantaram Thoravat"
    ],
    "sound department": [
        "Javed Khan",
        "Prashant Nayar",
        "Ajay Kumar P.B.",
        "Harjeet Singh",
        "Anchal Srivastava"
    ],
    "special effects": [
        "Vishruta Churi",
        "Vijay Ghatkar",
        "Arshad Saeednodri"
    ],
    "visual effects": "Pratheesh P.V.",
    "animation department": [
        "Jitendra Amberkar",
        "Anil Bhor",
        "Atul Chouthmal",
        "Vishruta Churi",
        "Prashant Dahake",
        "Nayana Gaikawad",
        "Kavita Kashikar",
        "Sangeeta Kesarkar",
        "Ashutosh Kushe",
        "Kiran Manorkar",
        "Uday Mumbarekar",
        "Ajit Nagarkar",
        "Shishir Naik",
        "Nitin Nigde",
        "Manish Panchal",
        "Vaibhav Piwlatkar",
        "Munna Kumar Rahi",
        "Ravi Rambhad",
        "Sunil Rewale",
        "Arshad Saeednodri",
        "Balasaheb Sawant",
        "Stanley Rajesh Selvamani",
        "Sarfaraz Subhan Shaikh"
    ],
    "music department": [
        "Satish Mutatkar",
        "Palash Sen"
    ],
    "miscellaneous": [
        "Saurabh Agarwal",
        "Swapna Aher",
        "Sanjay Ahire",
        "Ashok Ahuja",
        "Gail Aiman",
        "Smita Babhale",
        "Mohan Bangera",
        "Sanjay Bankar",
        "Rajesh Bhosale",
        "Armit Chhabra",
        "Kirit Chiwalkar",
        "Nikita Choksi",
        "Sharmistha Choudhury",
        "Richard D'Abro",
        "Nilesh Dabre",
        "Amit Dalvi",
        "Jitendra Darekar",
        "Parag Desai",
        "Rajkumar Didwania",
        "Atul Gadkar",
        "Mahindra Hathi",
        "Nitin Honovar",
        "Sudhakar Kalgutkar",
        "Sunny Khanna",
        "Sumit Kumar",
        "Pallavi Naik",
        "Sheel Nimbalkar",
        "Vivek Pathak",
        "Vijay Pawar",
        "Bhanudas Salunkhe",
        "Yusuf Shaikh",
        "Chhitra Subramaniam",
        "Shushant Surve",
        "Archana Tawre",
        "Rajesh Thakkar",
        "Abraham Thomas",
        "Nilesh Vaishampayan",
        "Nishad Valunjkar",
        "Sameer Vastak",
        "Anand Vengurlekar"
    ],
    "akas": [
        "Хануман (Russia)",
        "ハヌマーン (Japan, Japanese title)"
    ],
    "writer": [
        "Sulekha Bajpai",
        "Shantanu Ganesh Rode",
        "Bhring Tupkari"
    ],
    "director": [
        "V.G. Samant",
        "Milind Ukey"
    ],
    "production companies": [
        "Silvertoons Studio",
        "Hyderabad Innovatives",
        "Percept Picture Company",
        "Sahara One Motion Pictures"
    ],
    "distributors": "Eagle Home Entertainment",
    "plot": [
        "This animated movie depicts _Hanuman_ (qv)'s life from birth. The narrator is actor Mukesh Khanna. The movie relays how _Hanuman_ (qv) was born to Anjani a female Apsara and Kesari, by the blessings of Vayu-Dev, the Wind God.",
        "When _Hanuman_ (qv) was born to Anjani a female Apsara and Kesari, by the blessings of Vayu-Dev, the Wind God. _Hanuman_ (qv), who is the 11th rudra avatar of supreme being GOD Shiva himself. He was blessed with supreme intelligence, strength and divine powers. As a baby, _Hanuman_ (qv) was quite naughty and used his powers to pester the saints living in the nearby forest. On the insistence of Vayu, Indra and the other Gods came together to bless baby _Hanuman_ (qv) of immortal life. Amongst the other blessing a few are: no fear/harm from the Brahmastra, no harm could befall him from any weapons, fire and water. He could overcome death and he could transform his body to take the smallest form or attain the biggest form of life. Blessed with divine powers _Hanuman_ (qv) grew up to be powerful and mighty.::Anthony Pereyra {hypersonic91@yahoo.com}"
    ],
    "synopsis": "This movie depicts the story of the Indian epic hero Hanuman (Mukesh Khanna): the demi-god son of Pawan Dev (Anup Shukla), a god of wind, and Anjani (Pinky Rajput), a princess or noblewoman of the half-human, half-monkeylike subspecies known as Vanaras. As a child, Hanuman picks a fight with Rahu (Arijeet Sengupta), god of the solar eclipse, but is educated by Surya the sun-god (Shailendra Pandey), blessed by Indra the rain-god (Manish Wadhwa), and introduced by god Shiv (Kishore Bhatt) to the young princes Ram (Aparna Jarna/Viraj), Lakshman (Kaustav/Sumeet Pathak), Bharat, and Shatrughan. As a young man, he plays tricks on priests, saints, sages, and hermits, until one of them enchants him never to use his superhuman strength except in the service of others. Subsequently, Hanuman befriends Sugreev (Shahnawaz Pradhan), the brother of Vali (Sanjeev Jaiswal), king of the Vanaras. Meanwhile, Ram grows up to marry the neighboring princess Sita (Mona Shetty).When Vali and Sugreev fight over the throne, Hanuman goes with Sugreev into exile. About the same time, Sita is kidnapped by Ravan (Rajesh Jolly), king of the island of Lanka: a lifelong enemy of Ram's father Dasharath (Kumar Pravesh). Ram and Lakshman turn to Sugreev for help in rescuing her, and reunite with Hanuman. With Ram's help, Sugreev kills Vali to claim the throne; he is later persuaded by Hanuman and Lakshman to send his army, under the veteran Jambavant (Raj Joshi) and Vali's son Angad (Amar Babaria), in search of Sita.After a long search, the Vanaras meet Sampati the vulture-king (Vinod Kulkarni), who confirms Ravan has Sita captive, and shows them the way to Lanka. Hanuman goes alone to find her, and assures her that Ram and the army will come to her rescue; then challenges Ravan's guards. When captured by Ravan's son Meghnath (Manoj Pandey), Hanuman demands Sita's safe return, and Ravan instead orders Hanuman to be set afire. By virtue of his divine heritage and numerous blessings, Hanuman is unharmed, and sets fire to Ravan's palace, and escapes.After Hanuman's return, the Vanara army build a bridge across the Palk Strait to invade Lanka. A brief war follows, with heavy losses on both sides; prominently Ravan's gigantic brother Kumbhkaran (Parminder Ghumman). Lakshman is severely wounded by Meghnath, and Hanuman is sent by Sushain (Chanddhar), the Vanaras' medical officer, to the Himalayas for ingredients for the necessary medicine. Unable to identify the proper plant, Hanuman brings the entire mountain, and later puts it back.Ultimately, Ram kills Ravan, and Ravan's brother Vibhishan (Pawan Shukla) becomes king of Lanka, and frees Sita. The dying Ravan repents of his past, and recognizes Ram as an incarnation of the god Vishnu (Saptrishi Ghosh), and Hanuman as a partial incarnation of Shiv. Ram, Hanuman, and the army return home in triumph, and the film concludes."
}