{
    "id": "0889168",
    "localized title": "Amrithadhare",
    "cast": [
        "Sameer",
        "Ramya",
        "Raju Ananthaswamy",
        "Avinash",
        "Amitabh Bachchan",
        "Bhavya",
        "Mukhyamantri Chandru",
        "Mimicry Dayanand",
        "Ganesh",
        "Karibasavaiah",
        "Harnath Policherla",
        "Venkatesh Prasad",
        "Mandya Ramesh",
        "Mandeep Roy",
        "Vijaya Sarathi",
        "Yashwanth Sardeshpande"
    ],
    "genres": "Drama",
    "runtimes": "108",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "07 Oct 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTEwMjUzMWYtZTZmZS00YWFlLTgyYzYtMjAyOGU4YjFjOGIyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0889168",
    "plot outline": "Puru (Dhyan) and Amritha (Ramya) are a couple deeply in love with each other. It is a case of opposite poles attracting. Puru is everything that Amritha is not! The boy is religious and tight-fisted in money matters. His only ambition in life: to construct a house. Amritha likes to splurge and is an atheist. In the course of time, Puru realizes his ambition, and names the dream house as Amrithadhare - a birthday gift to his beloved wife. Everything is hunky dory in their small world. But fate springs an unpleasant surprise on them. Amritha is diagnosed as having brain cancer, and the doctor tells Puru that her days are numbered! A shocked Puru decides to make her remaining days as happy as possible. He takes her on a Bharat darshan. In the process, Amritha realizes a long-standing wish of hers too: to meet her favourite actor Amitabh Bachchan in Mumbai, who makes an appearance in the climax.",
    "languages": "Kannada",
    "title": "Amrithadhare",
    "kind": "movie",
    "directors": "Nagathihalli Chandrashekar",
    "writers": [
        "Ramesh Aravind",
        "",
        "Nagathihalli Chandrashekar"
    ],
    "composers": "Mano Murthy",
    "cinematographers": "A.V. Krishna Kumar",
    "editors": "B.S. Kemparaju",
    "art directors": "Arun Sagar",
    "sound department": "Shamim Sharfuddin Shaikh",
    "stunts": [
        "Thriller Manju",
        "Nanjundi Nagaraj"
    ],
    "music department": [
        "Supriya Acharya",
        "Raju Ananthaswamy",
        "C. Ashwath",
        "Nagathihalli Chandrashekar",
        "Chaitra H.G.",
        "Rajesh Krishnan",
        "Nandita",
        "Harish Raghavendra"
    ],
    "miscellaneous": [
        "Chinni Prakash",
        "Rekha Prakash",
        "Imran Sardhariya"
    ],
    "akas": "Amrithadhare (India)",
    "writer": [
        "Ramesh Aravind",
        "Nagathihalli Chandrashekar"
    ],
    "director": "Nagathihalli Chandrashekar",
    "plot": "Puru (Dhyan) and Amritha (Ramya) are a couple deeply in love with each other. It is a case of opposite poles attracting. Puru is everything that Amritha is not! The boy is religious and tight-fisted in money matters. His only ambition in life: to construct a house. Amritha likes to splurge and is an atheist. In the course of time, Puru realizes his ambition, and names the dream house as _Amrithadhare_ (qv) - a birthday gift to his beloved wife. Everything is hunky dory in their small world. But fate springs an unpleasant surprise on them. Amritha is diagnosed as having brain cancer, and the doctor tells Puru that her days are numbered! A shocked Puru decides to make her remaining days as happy as possible. He takes her on a Bharat darshan. In the process, Amritha realizes a long-standing wish of hers too: to meet her favourite actor Amitabh Bachchan in Mumbai, who makes an appearance in the climax.::Zamaanat"
}