{
    "id": "0907106",
    "localized title": "Aadi",
    "cast": [
        "N.T. Rama Rao Jr.",
        "Keerthi Chawla",
        "Mohammad Ali",
        "Rajeev Kanakala",
        "Venu Madhav",
        "M.S. Narayana",
        "Aditya",
        "Raghu Babu",
        "Chalapathi Rao",
        "Rajan P. Dev",
        "Jenny",
        "Raghu Kumar Karumanchi",
        "Jabardasth Naveen",
        "Aahuthi Prasad",
        "Sangeetha",
        "Chitram Seenu",
        "L.B. Sriram",
        "Fish Venkat"
    ],
    "genres": [
        "Action",
        "Drama",
        "Romance"
    ],
    "runtimes": "157",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:18",
        "United States:Not Rated"
    ],
    "original air date": "01 Jan 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTBhYzM0NTgtN2RiOC00ZTg5LTkyNjMtYjEzNmU5Y2MwYjkyXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0907106",
    "plot outline": "Veera Reddy (Ahuti Prasad), his wife and their child Aadi Keshava Reddy (Nandamuri Taraka Rama Rao Jr./Jr. NTR) return to their home estate in Rayalaseema from America. Veera had left his father's vast estate under the management of Siva Reddy (Rajan P Dev), but realized that he was corrupt and cruel to the villagers. Siva discovers that Veera is intent on distributing the estate among the villagers so they can provide for themselves. Since Siva doesn't wish to lose his lordship over them, he murders the family. Aadi escapes the massacre with Veeranna (Chalapati Rao), a trusted agent of Veera, and is raised as his own. Twelve years later, a grown Aadi is attending college where he meets and falls in love with Nandu (Keerthi Chawla). He returns home from his exile in Hyderabad and meets with several villagers, only to find out that they have been falsely imprisoned for years for the murder of his parents. He vows vengeance against Siva Reddy and promises to distribute the lands as his father had planned. His trusted \"uncle\" Veeranna shows him how to check his emotions and plan his moves well. However, he is not aware that his love, Nandu, is none other than Siva's daughter.",
    "languages": "Telugu",
    "title": "Aadi",
    "kind": "movie",
    "directors": "V.V. Vinayak",
    "writers": [
        "V.V. Vinayak",
        "",
        "V.V. Vinayak",
        "",
        "Paruchuri Venkateswara Rao",
        "Gopalakrishna Paruchuri"
    ],
    "producers": "Nallamalupu Sreenivas",
    "composers": "Mani Sharma",
    "cinematographers": "C. Ram Prasad",
    "editors": "Gautham Raju",
    "sound department": "Madhusudhan Reddy",
    "stunts": [
        "Lakshman Chella",
        "Ram Chella",
        "Vikram Dharma"
    ],
    "music department": [
        "S.P. Balasubrahmanyam",
        "Bhuvanchandra",
        "Chandrabose",
        "K.S. Chithra",
        "Ganga",
        "Mallikharjuna",
        "Udit Narayan",
        "Gopika Purnima",
        "Sunitha",
        "Tippu"
    ],
    "miscellaneous": [
        "Pradeep Anthony",
        "Lawrence Raghavendra"
    ],
    "thanks": [
        "Sameer Reddy",
        "Bellamkonda Suresh"
    ],
    "akas": "Mazduron Ka Daata",
    "writer": [
        "V.V. Vinayak",
        "V.V. Vinayak",
        "Paruchuri Venkateswara Rao"
    ],
    "director": "V.V. Vinayak",
    "production companies": "Sri Lakshmi Narasimha Productions",
    "distributors": "KAD Entertainment USA",
    "other companies": "Ramoji Film City",
    "plot": [
        "_Aadi_ (qv) Keshava Reddy, a youngster, returns to his homeland after 14 years to take revenge on Nagi Reddy who killed his family.",
        "Veera Reddy (Ahuti Prasad), his wife and their child _Aadi_ (qv) Keshava Reddy (Nandamuri Taraka Rama Rao Jr./Jr. NTR) return to their home estate in Rayalaseema from America. Veera had left his father's vast estate under the management of Siva Reddy (Rajan P Dev), but realized that he was corrupt and cruel to the villagers. Siva discovers that Veera is intent on distributing the estate among the villagers so they can provide for themselves. Since Siva doesn't wish to lose his lordship over them, he murders the family. _Aadi_ (qv) escapes the massacre with Veeranna (Chalapati Rao), a trusted agent of Veera, and is raised as his own. Twelve years later, a grown _Aadi_ (qv) is attending college where he meets and falls in love with Nandu (Keerthi Chawla). He returns home from his exile in Hyderabad and meets with several villagers, only to find out that they have been falsely imprisoned for years for the murder of his parents. He vows vengeance against Siva Reddy and promises to distribute the lands as his father had planned. His trusted \"uncle\" Veeranna shows him how to check his emotions and plan his moves well. However, he is not aware that his love, Nandu, is none other than Siva's daughter.::Soumitra"
    ]
}