{
    "id": "0953605",
    "localized title": "Sukran",
    "cast": [
        "Bobby Bedi",
        "Santhana Bharathi",
        "M.S. Bhaskar",
        "S.A. Chandrashekhar",
        "Rajan P. Dev",
        "Ravi Krishna",
        "Chitra Lakshmanan",
        "Nalini",
        "Nassar",
        "Ragasiya",
        "Rambha",
        "Ajay Ratnam",
        "Anita Hassanandani Reddy",
        "Mahanadi Shankar",
        "Sriman",
        "Joseph Vijay"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "165",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "07 May 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzJjYzVmNGEtODJlYy00YmJjLWJjMTQtZTRhNWM4ZDFkNGNkXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0953605",
    "languages": "Tamil",
    "title": "Sukran",
    "kind": "movie",
    "directors": "S.A. Chandrashekhar",
    "writers": "S.A. Chandrashekhar",
    "composers": "Vijay Antony",
    "cinematographers": "R. Rathnavelu",
    "editors": "Marthand K. Venkatesh",
    "visual effects": "K.V. Sanjit",
    "akas": "Венера (Russia)",
    "writer": "S.A. Chandrashekhar",
    "director": "S.A. Chandrashekhar",
    "plot": "College classmates Ravi and Sandhya are in love with each other. But Sandhya's cruel stepmother wants to marry her off to her uncle, a rowdy and will go to any extent to stop them.",
    "synopsis": "Ravi Shankar (Ravi Krishna) and Sandhya (Anita Hassanandani), who are students of a school in Dindigul, are in love. However, Sandhya faces an issue at home as her uncle is pulled in to her. At some point, he looks into her bathroom while she showers, and she complains about it to her pernicious stepmother (Nalini), yet she pardons and energizes him and reveals to her that they will one day wed. Sandhya additionally supports Ravi, telling him that they will marry someday.At the point when Sandhya's stepmother comes to know about their undertaking, she jabs her nose in their wheel. Ravi's dad (Nassar), who is mindful and cherishing, sends them to Chennai. After they arrive at Chennai, he calls them to check how they're doing, and during the call, he gets slaughtered by Sandhya's uncle via Sandhya's stepmother's order, and in turn, before dying, Ravi's father also kills Sandhya'a uncle. From that point forward, Sandhya's stepmother files a complaint against Ravi saying that he murdered his father. Later, a degenerate cop named Mahesh (Sriman) arrives in Chennai and blames Ravi for killing his own dad and captures Ravi on a protest given by Sandhya's stepmother that he had killed his own dad when he put his foot down on their affair. Ravi is then put in jail.Sandhya is convinced to look for the assistance of an appointed authority named Needhi Manikkam (Rajan P. Dev) to get a bail for Ravi. Manikkam, being an inaccurate person, forces her to lay down with him, making her spit all over him and also beat Tamil Kumaran with a slipper. Sandhya runs away but she is stopped by Mahesh once again and tells her that he heard that Sandhya spit on the judge's face and also beat Tamil Kumaran up with a slipper. She is taken to a castle by him, where she gets assaulted by Mahesh, Manikkam, and Tamil Kumaran (Bobby Bedi), the child of Minister Janardhanan (Vijayan). Meanwhile, a fair cop discharges Ravi, with the goal that he can help Sandhya. While Ravi runs to save her, those three people take off her clothes, tie her to the bed, and assault her by turns, which they additionally videotape. Ravi reaches her destination and attempts to enter to help her but is unsuccessful and gets beaten by Needhi Manikkam's associates. After some time, Sandhya gets unconscious. Ravi is also unconscious after an extreme beating from the goons and then subsequently, he gets thrown into the gallows and then the goons leave assuming he is dead.After a progression of events, Sandhya chooses to commit suicide, since she says that she has gone through a great deal of torment and agony, and the torment is so horrendous that she is unable to disregard it until she dies. Ravi is reluctant to release her since he already lost his parents and he does not want to lose her. He also points out that they have lived together and he says that since she has chosen to die, they should die together because even during death they should not part. At this point, here shows up a criminal lawyer named Sukran (Vijay), who saves them, shows them the estimation of life, and encourages them to confront all the difficulties strongly. From that point onward, he also instructs them to begin another life and to be happy and successful when they meet next time. They earn jobs and money, marry, move into a little house, and have a better life.Later, at some point, when Sandhya is in her nightdress, Mahesh, Manikkam, and Kumaran drive her once more, making the couple get irritated by the police. This event makes Sandhya get arrested for incorrect charges of prostitution. All attempts by Ravi to save her from jail are worthless. In court, the judge discusses what happened with everyone and he then announces that Sandhya will go to jail and be fined. At that point, an irritated Ravi shoots Mahesh, Manikkam, Kumaran, and Sandhya's stepmother dead and runs away with Sandhya from the court.Sukran steps in and vows to spare the couple. He shows up for Ravi's sake and advances enough proof to get him out. He furthermore ultimately kills Janardhanan, who was responsible for all the violations as well as because of his previous disputes with him, although Sukran intended that Janardhanan should be hanged to death. From that point onward, Sukran himself gives up to the police, expressing that despite the fact that Janardhanan was an infamous and abominable criminal, he should have thought about it before doing the murder in front of the judge. The movie ends with a message that wrongdoers should be punished is the dictum."
}