{
    "id": "13775936",
    "localized title": "Sevvel",
    "cast": [
        "Jai Akash",
        "Raj Kiran",
        "Kalabhavan Mani"
    ],
    "genres": "Drama",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "08 Apr 2005 (India)",
    "imdbID": "13775936",
    "plot outline": "Sudalai (Raj Kiran) is a village chieftain who enjoys great respect among villagers. He leads a happy life with his wife Sevandhi (Seetha). However, due to some turn of events, he is forced to clean the slippers of the villagers by the local police. Unable to tolerate the insult meted out, he and his wife decide to leave the village with their young son Sevvel (Jai Akash). Sudalai manages to join a State Minister as his car driver and stays in her house in Chennai and visits his house once a week. One day, an advocate Parasuram (Kalabhavan Mani) in a fit of rage murders the Minister and manages to escape, leaving the blame on Sudalai. He is arrested and gets life imprisonment. On hearing the news, his wife dies of shock and the child gets orphaned only to be taken care by a noble heart. Years roll by and Sudalai settles down in Chennai and ekes out a livelihood by running an old paper mart. Meanwhile, Sevvel grows up and his search for his father continues. He grows up to a noble hearted youth who joins a law college. He works in Sudalai's paper mart without knowing that he is his father. He passed out in flying colours in his law exams and joins as Parasuram's junior.The rest is all emotional drama which culminates with Jai Akash taking revenge of Parasuram and a reunion with his father.",
    "languages": "Tamil",
    "title": "Sevvel",
    "kind": "movie",
    "directors": "P. Primus",
    "writers": "P. Primus",
    "producers": "P. Primus",
    "composers": "Aasan",
    "akas": "Sevvel (India)",
    "writer": "P. Primus",
    "director": "P. Primus",
    "production companies": "Therace Film",
    "plot": "Sudalai (Raj Kiran) is a village chieftain who enjoys great respect among villagers. He leads a happy life with his wife Sevandhi (Seetha). However, due to some turn of events, he is forced to clean the slippers of the villagers by the local police. Unable to tolerate the insult meted out, he and his wife decide to leave the village with their young son _Sevvel_ (qv) (Jai Akash). Sudalai manages to join a State Minister as his car driver and stays in her house in Chennai and visits his house once a week. One day, an advocate Parasuram (Kalabhavan Mani) in a fit of rage murders the Minister and manages to escape, leaving the blame on Sudalai. He is arrested and gets life imprisonment. On hearing the news, his wife dies of shock and the child gets orphaned only to be taken care by a noble heart. Years roll by and Sudalai settles down in Chennai and ekes out a livelihood by running an old paper mart. Meanwhile, _Sevvel_ (qv) grows up and his search for his father continues. He grows up to a noble hearted youth who joins a law college. He works in Sudalai's paper mart without knowing that he is his father. He passed out in flying colours in his law exams and joins as Parasuram's junior.The rest is all emotional drama which culminates with Jai Akash taking revenge of Parasuram and a reunion with his father."
}