{
    "id": "4736078",
    "localized title": "Manik",
    "cast": [
        "Jeet",
        "Koyel Mallick",
        "Biplab Chatterjee",
        "Sagnik Chatterjee",
        "Samata Das",
        "Soma Dey",
        "Rajatabha Dutta",
        "Ranjit Mallick",
        "Santilal Mukherjee",
        "Alakananda Ray",
        "Rajesh Sharma"
    ],
    "genres": "Drama",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "aspect ratio": "4:3",
    "sound mix": "Stereo",
    "certificates": "India:UA",
    "original air date": "22 Apr 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDhlYmQ1OGItNTY0Zi00ZDZkLTk1MjMtYmMwMzBmYzQ5NjBjXkEyXkFqcGdeQXVyODY4NzIzNjE@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "4736078",
    "plot outline": "Samir Mitra is an unemployed educated guy who is looking for a job. His father Abir Mitra is a retired person. Samir's mother is suffering from cancer. One day Samir suddenly meets Manik Chandra Sadhukhan. Manik's father is Niranjan Sadhukan, he is also ill. Latika is Manik's younger sister. Manik has come to Kolkata to meet his father's friend Chandrakanta Majumadar who is an established businessman. Manik meets with an accident on the way. Samir tries to save his life. Before his death Manik requests Samir to take care of his father and younger sister; he also tells Samir not to disclose the news of his accident. Manik gives Samir all required information. Samir becomes Manik; he meets Chandrakanta as Manik. Chandrakanta appoints him in his own office. Samir meets Chandrakanta's daughter Ria and wife Manju, Ria and Samir gradually fall in love but Samir feels uncomfortable whenever he thinks that when everybody will come to know the truth that he is not Manik then what will happen. From his salary he maintains his own family and Manik's family. Everybody is impressed with his behavior and honesty. Suddenly Niranjan and Latika come to Kolkata because Niranjan is unwell. Niranjan has lost his eyesight and there is some problem in his heart also. Samir tries to hide from Niranjan but every body comes to know the truth. Kartik Sen, the business rival of Chandrakanta, kidnaps Ria and demands ransom. Samir and Chandrakanta rescue her with the help of police. Samir donates his father's eye to Niranjan. Niranjan gets back his eyesight.",
    "languages": "Bangla",
    "title": "Manik",
    "kind": "movie",
    "directors": "Prabhat Roy",
    "producers": "Pradip Bhardwaj",
    "composers": "Babul Bose",
    "director": "Prabhat Roy",
    "production companies": "Eskay Movies",
    "plot": "Samir Mitra is an unemployed educated guy who is looking for a job. His father Abir Mitra is a retired person. Samir's mother is suffering from cancer. One day Samir suddenly meets _Manik_ (qv) Chandra Sadhukhan. _Manik_ (qv)'s father is Niranjan Sadhukan, he is also ill. Latika is _Manik_ (qv)'s younger sister. _Manik_ (qv) has come to Kolkata to meet his father's friend Chandrakanta Majumadar who is an established businessman. _Manik_ (qv) meets with an accident on the way. Samir tries to save his life. Before his death _Manik_ (qv) requests Samir to take care of his father and younger sister; he also tells Samir not to disclose the news of his accident. _Manik_ (qv) gives Samir all required information. Samir becomes _Manik_ (qv); he meets Chandrakanta as _Manik_ (qv). Chandrakanta appoints him in his own office. Samir meets Chandrakanta's daughter Ria and wife Manju, Ria and Samir gradually fall in love but Samir feels uncomfortable whenever he thinks that when everybody will come to know the truth that he is not _Manik_ (qv) then what will happen. From his salary he maintains his own family and _Manik_ (qv)'s family. Everybody is impressed with his behavior and honesty. Suddenly Niranjan and Latika come to Kolkata because Niranjan is unwell. Niranjan has lost his eyesight and there is some problem in his heart also. Samir tries to hide from Niranjan but every body comes to know the truth. Kartik Sen, the business rival of Chandrakanta, kidnaps Ria and demands ransom. Samir and Chandrakanta rescue her with the help of police. Samir donates his father's eye to Niranjan. Niranjan gets back his eyesight.::Swarup Basak"
}