{
    "id": "8238236",
    "localized title": "Selvam",
    "cast": "Nandha",
    "genres": "Romance",
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "12 Aug 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODJlNGExNTAtMTY0OS00NmE5LTllNjEtNjc5YzgwNzI3NjNkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "8238236",
    "plot outline": "The movie begins with Selvam (Nandha Durairaj) coming to Chennai. After a quarrel with a person, he suffers an injury on his head and he forgets all about his past. Selvam rushes to a hospital where he seeks the help of Dr. Lakshmi (Ranjitha). Dr. Lakshmi assigns Dr. Thendral (Uma) to treat him back to his normal self. Selvam does not even remember his name so he is christened as Kannan by the doctors of the hospital. Thendral falls in love with Kannan and expresses her love for him. A couple of incidents helps Kannan to know about his past and he returns to his village. He meets his parents and his fiancee Jyothy (Vani) waiting for his return. What transpires later forms the crux of the story.",
    "languages": "Tamil",
    "title": "Selvam",
    "kind": "movie",
    "directors": "Ahathian",
    "writers": "Ahathian",
    "producers": "Ahathian",
    "akas": "Selvam (India)",
    "writer": "Ahathian",
    "director": "Ahathian",
    "plot": "The movie begins with _Selvam_ (qv) (Nandha Durairaj) coming to Chennai. After a quarrel with a person, he suffers an injury on his head and he forgets all about his past. _Selvam_ (qv) rushes to a hospital where he seeks the help of Dr. Lakshmi (Ranjitha). Dr. Lakshmi assigns Dr. Thendral (Uma) to treat him back to his normal self. _Selvam_ (qv) does not even remember his name so he is christened as Kannan by the doctors of the hospital. Thendral falls in love with Kannan and expresses her love for him. A couple of incidents helps Kannan to know about his past and he returns to his village. He meets his parents and his fiancee Jyothy (Vani) waiting for his return. What transpires later forms the crux of the story."
}