{
    "id": "0155487",
    "localized title": "Amaram",
    "cast": [
        "Mammootty",
        "Mathu",
        "Chitra",
        "Murali",
        "Asokan",
        "K.P.A.C. Lalitha",
        "Kuthiravattam Pappu",
        "Balan K. Nair",
        "Sainuddin",
        "Bharathan",
        "A.K. Lohithadas",
        "Santo Krishnan"
    ],
    "genres": "Drama",
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "01 Feb 1991 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2NiZmIwMjEtMDZiNi00ODBhLTlhYzMtMjk1ZWI4ZDQyZWRmXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0155487",
    "plot outline": "Amaram is the story of Achootty (Mammootty), a fisherman and his daughter, Radha (Maathu). The uneducated Achootty wants his daughter to be educated and also wants her to become a doctor. His dreams get shattered when she falls in love with her childhood friend. One fine day Achootys's daughter and her lover elope and get married. Achootty does not like his son-in-law initially and in disappointment does not talk to his daughter either. But slowly the young chap shows that he is an able and hard-working fisherman and gains Achootty's silent admiration. Achooty does not acknowledge this publicly, but keeps heckling his son-in-law in public, taunting him to catch a shark and prove himself before he dares talk to Achooty. One day, the son-in-law decides he's had enough of the taunting and goes to the deep sea to capture a shark. But he is inexperienced, and in a fit of daring goes out alone in his catamaran. When he does not return, people think that Achootty killed him at sea since Achootty had also been to the sea that day. It is a stormy night and everyone is afraid of going to the sea to search for him. At this point, Achootty's daughter also feels that her father has killed her husband. Having nothing to lose, Achootty goes to the sea and he sees his son-in-law lying unconscious on the remains of his boat which is wrecked. Achootty rescues him and brings him back to the shore. Everyone understands Achootty's innocence but he feels let down by them. In the end they show him taking his boat and venturing into the sea which Achootty says that is the only thing which has loved him unconditionally.",
    "languages": "Malayalam",
    "title": "Amaram",
    "kind": "movie",
    "directors": "Bharathan",
    "writers": "A.K. Lohithadas",
    "producers": [
        "Peter Njarakkal",
        "Babu Thiruvalla"
    ],
    "composers": [
        "Johnson",
        "Raveendran"
    ],
    "cinematographers": "Madhu Ambat",
    "editorial department": [
        "B. Lenin",
        "V.T. Vijayan"
    ],
    "art directors": [
        "Bharathan",
        "Sabu Cyril"
    ],
    "make up department": [
        "P.N. Mani",
        "Seenu"
    ],
    "assistant directors": [
        "George Kithu",
        "Aryanad Sunil",
        "Gireesh Vennala",
        "Sarath Chandran Wayanadu"
    ],
    "sound department": "Manohar",
    "costume departmen": [
        "Bhai",
        "Durai",
        "Palani",
        "Pazhani"
    ],
    "music department": [
        "K.S. Chithra",
        "Lathika",
        "Kaithapram D. Nampoothiri",
        "Raveendran",
        "K.J. Yesudas"
    ],
    "akas": "Immortal",
    "writer": "A.K. Lohithadas",
    "director": "Bharathan",
    "production companies": "MAK Productions",
    "distributors": "Symphony creations",
    "other companies": [
        "Amrita TV",
        "Tharangini"
    ],
    "plot": [
        "An uneducated fisherman wants his daughter to be educated and become a doctor but his dreams get shattered when she falls in love with her childhood friend.",
        "_Amaram_ (qv) is the story of Achootty (Mammootty), a fisherman and his daughter, Radha (Maathu). The uneducated Achootty wants his daughter to be educated and also wants her to become a doctor. His dreams get shattered when she falls in love with her childhood friend. One fine day Achootys's daughter and her lover elope and get married. Achootty does not like his son-in-law initially and in disappointment does not talk to his daughter either. But slowly the young chap shows that he is an able and hard-working fisherman and gains Achootty's silent admiration. Achooty does not acknowledge this publicly, but keeps heckling his son-in-law in public, taunting him to catch a shark and prove himself before he dares talk to Achooty. One day, the son-in-law decides he's had enough of the taunting and goes to the deep sea to capture a shark. But he is inexperienced, and in a fit of daring goes out alone in his catamaran. When he does not return, people think that Achootty killed him at sea since Achootty had also been to the sea that day. It is a stormy night and everyone is afraid of going to the sea to search for him. At this point, Achootty's daughter also feels that her father has killed her husband. Having nothing to lose, Achootty goes to the sea and he sees his son-in-law lying unconscious on the remains of his boat which is wrecked. Achootty rescues him and brings him back to the shore. Everyone understands Achootty's innocence but he feels let down by them. In the end they show him taking his boat and venturing into the sea which Achootty says that is the only thing which has loved him unconditionally.::ARUN"
    ]
}