{
    "id": "0314008",
    "localized title": "Durga",
    "cast": [
        "J.D. Chakravarthi",
        "Snehal Dabi",
        "Jayaprakash",
        "Sayaji Shinde",
        "Anjan Srivastav",
        "Priyanka Upendra"
    ],
    "genres": "Drama",
    "runtimes": "116",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "hi"
    ],
    "sound mix": "DTS",
    "certificates": [
        "India:A",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzkyMzFmY2MtZjQyOC00Y2RjLTg4ZGMtMzUzNmQyYjc1NDE1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0314008",
    "plot outline": "Durga is a percocious, but peace-loving, college student. He has a group of friends, who he hangs around with. He meets with Gayetri, and falls in love with her. She also seems attracted to him. When they meet at the bus stop, Gayetri refuses to recognize him, and he gets arrested. After his interrogation, he is released, and hates Gayetri and will not have anything to do with her. When he finds out the reason behind Gayetri's refusal to recognize him, both reconcile their differences, and decide to get married. Gayetri's dad, Shivaji Rao, who is a Manager with the local Cinema Hall, does not like Durga, and wants Gayetri to marry someone else, which Gayetri does not agree to. In desperation, Shivaji turns for help to a local gangster and asks him to kill Durga. What Shivaji does not know is Durga is the only son of notorious gangster and criminal don, Ramdas, who will not spare anyone who will even dare to think about harming his son.",
    "languages": [
        "Malayalam",
        "Hindi"
    ],
    "title": "Durga",
    "kind": "movie",
    "directors": "J.D. Chakravarthi",
    "producers": "J.D. Chakravarthi",
    "composers": "Sandeep Chowta",
    "music department": "Sudhakar Sharma",
    "akas": "Durga: It's Not Just a Love Story (India, Hindi title)",
    "director": "J.D. Chakravarthi",
    "plot": "_Durga_ (qv) is a percocious, but peace-loving, college student. He has a group of friends, who he hangs around with. He meets with Gayetri, and falls in love with her. She also seems attracted to him. When they meet at the bus stop, Gayetri refuses to recognize him, and he gets arrested. After his interrogation, he is released, and hates Gayetri and will not have anything to do with her. When he finds out the reason behind Gayetri's refusal to recognize him, both reconcile their differences, and decide to get married. Gayetri's dad, Shivaji Rao, who is a Manager with the local Cinema Hall, does not like _Durga_ (qv), and wants Gayetri to marry someone else, which Gayetri does not agree to. In desperation, Shivaji turns for help to a local gangster and asks him to kill _Durga_ (qv). What Shivaji does not know is _Durga_ (qv) is the only son of notorious gangster and criminal don, Ramdas, who will not spare anyone who will even dare to think about harming his son.::rAjOo (gunwanti@hotmail.com)"
}