{
    "id": "1202517",
    "localized title": "Barah Aana",
    "cast": [
        "Naseeruddin Shah",
        "Vijay Raaz",
        "Arjun Mathur",
        "Violante Placido",
        "Tannishtha Chatterjee",
        "Jayati Bhatia",
        "Mahabanoo Mody-Kotwal",
        "Benjamin Gilani",
        "Jehangir Karkaria",
        "Ashwin Kaushal",
        "Nissar Khan"
    ],
    "genres": [
        "Comedy",
        "Crime",
        "Drama"
    ],
    "runtimes": "97",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": "Singapore:PG",
    "original air date": "13 Mar 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTQ2MjI0MzQ3N15BMl5BanBnXkFtZTcwMjYzMDQzMg@@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "1202517",
    "plot outline": "Barah Aana is a comedy of real life, set in today's Mumbai. The story revolves around three unlikely friends: a driver (Shukla), a watchman (Yadav), and a waiter (Aman). The driver is an older man, stoic but dependable. The watchman, in his 30s, is a pushover at work but otherwise mischievous. The waiter is a young, swaggering chap, brimming with ambition. Living together, their differing attitudes spark playful banter. At some point, misfortune befalls the watchman and, due to a series of chance events, he stumbles into a crime. Striking upon a seemingly low-risk way to make good money, and discovering a new sense of self-confidence, he tries to entice the others to join him in a series of such crimes. Cat and mouse games ensue between the three as personalities change, but events soon spiral out of control, leading them in a direction none of them had wanted to take... Featuring a talented ensemble cast, Barah Aana is based on an original script. The running time is 97 minutes.",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Barah Aana",
    "kind": "movie",
    "directors": "Raja Menon",
    "writers": [
        "Raj Kumar Gupta",
        "",
        "Raja Menon"
    ],
    "producers": [
        "Giulia Achilli",
        "Raja Menon",
        "Nirva Patel",
        "Paresh Patel",
        "Raj Yerasi"
    ],
    "composers": "Shri Sriram",
    "cinematographers": "Priya Seth",
    "editors": "Hemanti Sarkar",
    "editorial department": [
        "Sourabh Dutta",
        "Sanjay Gharat",
        "Robert Lang",
        "Manu Moses",
        "S.N.V. Ramana",
        "Prashant Sharma",
        "Aman Shukla"
    ],
    "casting directors": "Nandini Shrikent",
    "production designers": "Anuradha Shetty Menon",
    "art directors": "Shree Kumar Nair",
    "make up department": "Gladwin James",
    "production managers": [
        "Sanjay Baing",
        "Abdul Rahman Khan"
    ],
    "assistant directors": [
        "Gaurav Madan",
        "Nishant Menon",
        "Sushma Reddy"
    ],
    "sound department": [
        "Boby John",
        "Rajesh Kodadi",
        "Debasish Mishra",
        "Gandhar Mokashi",
        "Ajay Kumar P.B.",
        "George Shijomon",
        "Umang Prasad Tewari"
    ],
    "visual effects": [
        "Bobby",
        "Ritu Chaurasia",
        "Jayesh Chavan",
        "Ilamuruguselvan",
        "Pankaj Kalbende",
        "Ranadheer Reddy",
        "Sohel Rodrigues",
        "Ashok Uchil"
    ],
    "camera department": [
        "Rudhraveer Singh Bhati",
        "Kalyani Kallapa",
        "Nawab Shaikh",
        "Ahmed Sheikh",
        "B.K. Sivan"
    ],
    "location management": "Deepak Gawade",
    "script department": "Rohit Jayaswal",
    "miscellaneous": [
        "Parag Desai",
        "Nitin Gadia",
        "Sachin Kalekar",
        "Arvind Kochrekar",
        "Rohn Meijer",
        "Sachin Nimbalkar",
        "Rajesh Potphode",
        "Anant Rathod",
        "A.K. Srinivasan",
        "Rahul Srivastava",
        "Asheet Thakur",
        "Vipul Vora",
        "Robert Lang",
        "Rajesh Potphode"
    ],
    "thanks": [
        "John Abraham",
        "Gulzar",
        "Aamir Khan"
    ],
    "akas": [
        "Twelve Annas (World-wide, English title)",
        "75 центов (Russia)"
    ],
    "writer": [
        "Raj Kumar Gupta",
        "Raja Menon"
    ],
    "director": "Raja Menon",
    "production companies": [
        "Bandra West Pictures",
        "Shringar Films Pvt. Ltd."
    ],
    "special effects": "Pixion",
    "plot": [
        "Three impoverished room-mates kidnap middle-classed men and demand small ransoms to improve their respective lifestyles.",
        "_Barah Aana_ (qv) is a comedy of real life, set in today's Mumbai. The story revolves around three unlikely friends: a driver (Shukla), a watchman (Yadav), and a waiter (Aman). The driver is an older man, stoic but dependable. The watchman, in his 30s, is a pushover at work but otherwise mischievous. The waiter is a young, swaggering chap, brimming with ambition. Living together, their differing attitudes spark playful banter. At some point, misfortune befalls the watchman and, due to a series of chance events, he stumbles into a crime. Striking upon a seemingly low-risk way to make good money, and discovering a new sense of self-confidence, he tries to entice the others to join him in a series of such crimes. Cat and mouse games ensue between the three as personalities change, but events soon spiral out of control, leading them in a direction none of them had wanted to take... Featuring a talented ensemble cast, _Barah Aana_ (qv) is based on an original script. The running time is 97 minutes.::Anonymous",
        "Mumbai-based Kedar Shukla is employed as a chauffeur with Anoop and Simone Mehta, and silently absorbs abuse heaped on him by the latter. He lives an impoverished lifestyle in a small room along with Yadav - a watchman; and Aman - a waiter. While Yadav has family in a village, and sends money regularly, he must come up with more as his son is ill. Aman is friendly with a Caucasian-Italian woman, Kate, and would like to marry her but she tells him that she desperately needs Rs.20,000/-. Kedar lends some money to Yadav but a pickpocket steals the money, leaving the latter depressed. In this state of mind, a male picks on him, Yadav knocks him down, and takes him home much to the chagrin of Kedar and Aman. Yadav offers to get rid of the male via Kedar's car but secretly negotiates a ransom deal with the male's family, and after obtaining the monies, shares it with his room-mates which they refuse to accept. They subsequently relent and decide to partner with Yadav by abducting middle-classed men, demanding a small ransom, and thus improving their lifestyle. Things do start to improve, Yadav gains confidence, while Aman saves enough money to lend to Kate - but the silent and brooding Kedar has secret plans of his own - plans that will shatter and change their lives forever.::rAjOo (gunwanti@hotmail.com)",
        "Shukla a driver,Yadav a watchman and Aman a waiter work in Mumbai and share the same room ,Shukla has a abusive employer ,Yadav is also frequently abused by his society and Aman has fallen for a foreigner guest whose regular in his hotel.Yadav requires money for his sons treatment in village unable to arrange, he gets in tiff with a man on road making him unconscious and gets him home Shukla and Aman want him to get rid of him and plan accordingly.Yadav revels how he had extorted money from the man's family and divides with Aman which angers Shukla.Yadav then tells his plans to Aman on how to extort money from people at first Shukla is against it but later joins them.::alex.mjacko@gmail.com"
    ]
}