{
    "id": "1286811",
    "localized title": "Kanchivaram",
    "cast": [
        "Prakash Raj",
        "Shreya Reddy",
        "Shammu",
        "Sreekumar",
        "Geetha Vijayan",
        "Sacchin Nachiappan",
        "Vimal"
    ],
    "genres": "Drama",
    "runtimes": "117",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "certificates": "United Kingdom:12A",
    "original air date": "13 Mar 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDJhM2FiNTYtMmFiMC00ZmJhLWJjYzItZmY0ODk4YjY2YzQzXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "1286811",
    "plot outline": "An aging man named Vengadam (Prakash Raj) is being released from jail in 1948. He is only being escorted for two days (the reason not revealed) back to his hometown of Kanchipuram. He is being transported under the custody of two policemen on a bus from the jail. As the journey takes place, Vengadam recalls his past symbolically as several events that occur in the bus (such as sounds) remind him of his past. Vengadam is a silk weaver in the town of Kanchivaram, and has just recently got married (with Shreya Reddy). He had vowed once that he will only wed a woman wearing a silk saree, but had to settle for normalcy as he unable to garner enough savings to buy one. It is then revealed through his life proceedings that silk weavers are only paid a very low sum 7 rupees for each silk saree woven. This means that despite being weavers, they can't afford, nor even see the silk saree being worn by other people. Vengadam is shown as a talented weaver and best of the lot. Few years down the road, his wife gives birth to a baby girl, and according to tradition, the father has to give the daughter a promise by whispering into her ears. He shockingly promises that he will marry her off with a silk saree, which is met with skepticism by villagers and even his wife. He later reveals to his wife that he had saved a lot of money over his life, but couldn't save enough to marry her with a silk saree, but will be able to garner enough by the time their daughter grows to marriageable age. But soon after, Vengadam's brother-in-law suffers losses in his business, and tells Vengadam that he will have to abandon Vengadam's sister because he wouldn't afford to take care of her. In desperation to preserve his sister's life and dignity, Vengadam hands over his life savings to his brother-in-law, leaving his silk saree ambitions in tatters.",
    "languages": "Tamil",
    "title": "Kanchivaram",
    "kind": "movie",
    "directors": "Priyadarshan",
    "writers": "Priyadarshan",
    "producers": [
        "Abilash Nair",
        "Sarita Patil",
        "Shailendra Singh"
    ],
    "composers": "M.G. Sreekumar",
    "cinematographers": "S. Tirru",
    "editors": "Arun Kumar",
    "production designers": "Sabu Cyril",
    "make up department": "Pattanam Rasheed",
    "production managers": "Akshay Sujir",
    "assistant directors": [
        "Sandeep Adhikari",
        "Ike"
    ],
    "sound department": [
        "Ramachandran Anand",
        "Deepan Chatterjee",
        "Rajakrishnan M.R.",
        "P.C. Vishnu"
    ],
    "visual effects": [
        "Prince Chaurasia",
        "Santosh Choudhary",
        "Rohit Sardesai"
    ],
    "miscellaneous": [
        "Milind Dabke",
        "Abhishek Nayar",
        "Lalji Wagh"
    ],
    "akas": "Kanchivaram (India)",
    "writer": "Priyadarshan",
    "director": "Priyadarshan",
    "production companies": [
        "Percept Picture Company",
        "Four Frames Pictures"
    ],
    "distributors": [
        "Hotstar",
        "Star VijayTV"
    ],
    "plot": [
        "A poor silk weaver promises his wife to dress their newborn daughter in a silk saree for her marriage. Facing systemic oppression and the vicissitudes of his fortune, he struggles to keep his word.",
        "An aging man named Vengadam (Prakash Raj) is being released from jail in 1948. He is only being escorted for two days (the reason not revealed) back to his hometown of Kanchipuram. He is being transported under the custody of two policemen on a bus from the jail. As the journey takes place, Vengadam recalls his past symbolically as several events that occur in the bus (such as sounds) remind him of his past. Vengadam is a silk weaver in the town of _Kanchivaram_ (qv), and has just recently got married (with Shreya Reddy). He had vowed once that he will only wed a woman wearing a silk saree, but had to settle for normalcy as he unable to garner enough savings to buy one. It is then revealed through his life proceedings that silk weavers are only paid a very low sum 7 rupees for each silk saree woven. This means that despite being weavers, they can't afford, nor even see the silk saree being worn by other people. Vengadam is shown as a talented weaver and best of the lot. Few years down the road, his wife gives birth to a baby girl, and according to tradition, the father has to give the daughter a promise by whispering into her ears. He shockingly promises that he will marry her off with a silk saree, which is met with skepticism by villagers and even his wife. He later reveals to his wife that he had saved a lot of money over his life, but couldn't save enough to marry her with a silk saree, but will be able to garner enough by the time their daughter grows to marriageable age. But soon after, Vengadam's brother-in-law suffers losses in his business, and tells Vengadam that he will have to abandon Vengadam's sister because he wouldn't afford to take care of her. In desperation to preserve his sister's life and dignity, Vengadam hands over his life savings to his brother-in-law, leaving his silk saree ambitions in tatters."
    ]
}