{
    "id": "1324059",
    "localized title": "Wake Up Sid",
    "cast": [
        "Ranbir Kapoor",
        "Konkona Sen Sharma",
        "Supriya Pathak",
        "Anupam Kher",
        "Rahul Khanna",
        "Kashmira Shah",
        "Namit Das",
        "Shikha Talsania",
        "Shruti Bapna",
        "Krutika Bolaki",
        "Mohsin Ali Khan",
        "Munir Kabani",
        "Atisha Naik",
        "Rahul Pendkalkar",
        "Kainaz Motivala",
        "Asif Ali Baig",
        "Huzefa Gadiwala",
        "Kalki Koechlin"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "138",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:PG",
        "Canada:PG::(Alberta)",
        "Canada:PG::(Ontario)",
        "Canada:G::(Quebec)",
        "Hong Kong:I",
        "India:U",
        "Ireland:PG",
        "Malaysia:U",
        "New Zealand:PG",
        "Singapore:PG",
        "South Africa:PG",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "02 Oct 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDc1ZDBkODMtYjI0MC00NDcyLWFhMGUtYzM4NDQyMzgyYzg1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1324059",
    "plot outline": "In Mumbai, Sid Mehra is, in the words of his father, an arrogant, spoiled brat. He lives with a doting mother, subservient brother, and a father who covers his expenses and credit card bills. Sid takes his college finals then starts work at his father's business; he lasts less than a week before walking out. At a graduation party, he meets Aisha, newly arrived from Calcutta and set on becoming a writer. He shows her the city and helps her refurbish a rented flat. He asks if she'd like to progress from friend to something more, but she says no: he lacks ambition and isn't her type. Will her words, his exam results, a confrontation with his parents, and a break with his friends be enough to wake Sid up?",
    "languages": "Hindi",
    "title": "Wake Up Sid",
    "kind": "movie",
    "directors": "Ayan Mukherjee",
    "writers": [
        "Ayan Mukherjee",
        "",
        "Niranjan Iyengar"
    ],
    "producers": [
        "Govind Agarwal",
        "Hiroo Johar",
        "Karan Johar",
        "Apoorva Mehta",
        "Sanjay Mehta"
    ],
    "composers": [
        "Shankar Mahadevan",
        "Loy Mendonsa",
        "Ehsaan Noorani",
        "Amit Trivedi"
    ],
    "cinematographers": "Anil Mehta",
    "editors": "Shan Mohammed",
    "editorial department": [
        "Rohan Desai",
        "Tushar Desai",
        "Ritika Rai",
        "Divya Taneja"
    ],
    "casting directors": "Nandini Shrikent",
    "production designers": "Amrita Mahal",
    "art directors": "Kabir Singh Chowdhry",
    "costume designers": [
        "Priyanjali Lahiri",
        "Manish Malhotra",
        "Nakul Sen"
    ],
    "production managers": [
        "Rajesh Balkate",
        "Prashant Kunder",
        "Sanjay Solanki"
    ],
    "assistant directors": [
        "Kirnay Bhatt",
        "Karan Boolani",
        "Panchami Ghavri",
        "Varun Lalwani",
        "Manjari Makijany",
        "Sonam Nair",
        "Piyush Puty",
        "Santosh Singh",
        "Sneha Taurani"
    ],
    "art department": "Sumayya Shaikh",
    "sound department": [
        "Sanjay Chaturvedi",
        "Prashant Dcruz",
        "Baylon Fonseca",
        "Sanjay Kurian K.",
        "R. Nitish Kumar",
        "Gandhar Mokashi",
        "Ajay Kumar P.B.",
        "Koteswara Rao S.V.",
        "Jitendra Vajpayee"
    ],
    "visual effects": [
        "Swapnil Ambre",
        "Uday Bhaskar Bandaru",
        "Praveen Bareria",
        "Yatin Bhave",
        "Asif Bhushan",
        "Goolzar Buchia",
        "Satyendra Chaturvedi",
        "Santosh Choudhary",
        "Michael D'Sa",
        "Danish Davis",
        "Sandeep Gamre",
        "Sandesh Gawali",
        "Ranjit Gosavi",
        "Anish Holla",
        "Rohinton Irani",
        "Sudhakar Kankanampati",
        "Vishal Kapoor",
        "Ashutosh Khandelwal",
        "Swapnil Kulkarni",
        "Suryakant Mahunta",
        "Stephen Mascarenhas",
        "Aziz Merchant",
        "Vishram Mondkar",
        "Abhijit Mulye",
        "Sunny Nair",
        "Tsering Namgyal",
        "Payankulath Nandakumar",
        "Anand Nayak",
        "Gauri Patil",
        "Reupal D. Rawal",
        "Ramsai Rayanapati",
        "Chandrasekhar Reddy",
        "Chandrachur Roy",
        "Ankur Sachdev",
        "Rohit Sardesai",
        "Swapnil Shahane",
        "Nitesh Sutrave",
        "Merzin Tavaria",
        "Parikshat Tyagi",
        "Anuj Upadhyay",
        "Yatin Vij"
    ],
    "camera department": [
        "Subala Kishor Baboo",
        "Kapil Dubey",
        "Anirudh Garbyal",
        "Rashid Jam",
        "Shiv Karal",
        "Manmath Khatoi",
        "Ishika Mohan Motwane",
        "Lalit Sahoo",
        "Ganesh Sud"
    ],
    "casting department": [
        "Panchami Ghavri",
        "Aadore Mukherjee"
    ],
    "costume departmen": "Sheena Sitlani",
    "music department": [
        "Javed Akhtar",
        "Uday Benegal",
        "Amitabh Bhattacharya",
        "Clinton Cerejo",
        "Dominique Cerejo",
        "Baylon Fonseca",
        "Nitish R Kumar",
        "R. Nitish Kumar",
        "Andrew T. Mackay",
        "Shankar Mahadevan",
        "Loy Mendonsa",
        "Annu Poojari",
        "Shadab Rayeen",
        "Kavita Seth",
        "Sandeep Thakur"
    ],
    "miscellaneous": [
        "Gopal Babel",
        "Alnoor Merchant",
        "Prakash Nathan",
        "Gautam Parvi",
        "Malika Singh",
        "Ranju Varghese"
    ],
    "akas": [
        "Сид, проснись (Russia)",
        "Ébresztő, Sid! (Hungary)"
    ],
    "writer": [
        "Ayan Mukherjee",
        "Niranjan Iyengar"
    ],
    "director": "Ayan Mukherjee",
    "production companies": "Dharma Productions",
    "distributors": [
        "Dharma Productions",
        "Star VijayTV",
        "UTV Motion Pictures"
    ],
    "special effects": "Prime Focus",
    "other companies": [
        "Prime Focus",
        "Shree Ganesh Movie Lights",
        "Sony Music India",
        "Trigger Happy Entertainment"
    ],
    "plot": [
        "The story of a lazy Mumbai college student who does absolutely nothing, with a turn of events will Sid realize his potential in this world and become a success in the fast-paced life of Mumbai.",
        "In Mumbai, Sid Mehra is, in the words of his father, an arrogant, spoiled brat. He lives with a doting mother, subservient brother, and a father who covers his expenses and credit card bills. Sid takes his college finals then starts work at his father's business; he lasts less than a week before walking out. At a graduation party, he meets Aisha, newly arrived from Calcutta and set on becoming a writer. He shows her the city and helps her refurbish a rented flat. He asks if she'd like to progress from friend to something more, but she says no: he lacks ambition and isn't her type. Will her words, his exam results, a confrontation with his parents, and a break with his friends be enough to wake Sid up?::<jhailey@hotmail.com>",
        "Ram Mehra used to live in a shanty Chawl in Jogeshwari, Bombay, but worked hard, married Sarita, opened his own business ('Mehra Furnishings Company'), became the parent of Sidharth, and moved to a bungalow in Juhu. He and Sarita had hoped that Sidharth would be good in his studies and eventually take over the business; but, instead, Sidharth turned out to be a slacker failing his final year exams and rude to his mother. Asked to shape up, Sidharth moves out to live with his new-found friend, Aisha Banerjee, a woman fresh from Kolkata who has just landed a job with Mumbai Beats magazine (and is in love with her boss, Kabir Chaudhary). She permits Sidharth to live with her but ends up frustrated when she realizes he cannot cook nor clean up after himself and is very childish and immature. With daily arguments ensuing between the two, it will not be long before Sidharth may have to move out again - but where will Sidharth (with all doors closed in on him) move out to now?::rAjOo (gunwanti@hotmail.com)",
        "Sid is a quintessentially Mumbai slacker boy - wealthy, lazy and completely lacking in focus. An unexpected meeting with Aisha, a driven, bold and ambitious writer from Calcutta, results in summer of discoveries, realizations and coming of age.",
        "A childish, rich,spoiled boy sidharth 'sid' who is without the aspiration finds a unmarried girl with the ambition in his hometown 'Bombay' .From the first conversation in college farewell party only they became friends.After geting closer in short period of time. She inspires him to be a fruitful person in life.He works hard and finally knows the work he loves to do and does that particular work with great enthusiasm.In small period of time he becames good job holder. In the process,they both get closed to eachother. A girl through a article expresses her love towards boy who is still confused with relationship with that girl. But at the end of the article he finds the article's issue and finds the love of a girl towards him.As he was confused before now with a article he becames clear on the idea of relationship. So he goes to her place and hugs her. They express their true love towards eachother and film ends."
    ],
    "synopsis": "Siddharth \"Sid\" Mehra (Ranbir Kapoor) is the spoiled, carefree son of wealthy businessman Ram Mehra (Anupam Kher). A resident of Bombay, his only interest is to have fun with friends and to spend his father's money. Thus, he spends little time at college and is not prepared for the exit exams. His father however, not being aware of this fact, tells Sid it is time to join his company, which Sid reluctantly does only after his father tempts him with the promise of a new car.\nMeanwhile, Sid meets Aisha (Konkona Sen Sharma) a woman from Calcutta, who is an aspiring writer. On their first meeting, they go out on a walk along the streets of Bombay. Sid shows her the city and takes her to Marine Drive by the sea. Sid tells her that one of the fascinating things of being in Bombay is its luscious monsoon. They seem to strike a chord instantly and a friendship ensues. Sid helps her to find (and furnish) her own apartment. She also lands a job with Mumbai Beat, (based on Time Out! Mumbai)[1] a hip magazine run by the handsome, sophisticated editor-in-chief Kabir (Rahul Khanna). On the eve of her 27th birthday Aisha invites Sid to her place because she does not want to be alone. When Sid tentatively explores moving their relationship beyond friendship, he finds that Aisha perceives him as boyish and immature. Despite feeling hurt, he maintains his friendship with her.\nTheir relationship intensifies when the exam results come out and Sid finds that he failed. His failure leads to a family fight that ends with him moving out of the house. With nowhere to go, Sid (who has never been on his own) asks Aisha if he can stay with her. Aisha is initially happy to have the company (although she clarifies that his stay is purely platonic). Eventually, however, Sid's bad habits revive themselves as he leaves her place a mess and makes the kind of demands on her that he is used to making on everyone. When she finds he has not eaten all day, Aisha is amused by the fact that Sid cannot cook and does not know how to feed himself. Over time, Sid learns that to survive in the world he has to begin cooking and cleaning. He has also realized he must work and Aisha helps him become a photography intern at the magazine she works for.\nAisha who had a crush on her boss, editor in chief Kabir, is ecstatic when he selects her article for the magazine and also asks her out on a live jazz performance. However, as she goes out with him, she realizes she does not much in common with Kabir. Meanwhile, she slowly realizes her feelings toward Sid and understands she is in love with him.\nAs Sid begins working, he finds meaning in life and realizes that there are more options than working in a standard corporate environment. He also begins to see for the first time how his behavior has hurt everyone he loves and that he needs to change his ways. After he is hired as full-time staff and receives his first pay check, he confronts his father. They reconcile and Sid's father asks him to come home. Sid, who often feels a burden to Aisha, tells her that he won't be dependent on her charity anymore and expects her to be thrilled. He doesn't realize that Aisha has fallen in love with him and thus is furious to hear that he is leaving. Their departure is a hostile one and Sid leaves without resolution.\nWhen Sid returns home from Aisha's place, he thinks constantly of her. However, he remembers that she had told him they can only be friends and so he does not consider that she might share his feelings. When the latest issue of Mumbai Beat arrives, Sid reads Aisha's column and is startled to discover that it is about her feelings for him. As rain starts pouring, he rushes to meet her at the same beach where they had sat the very first day they met. Sid expresses his love for her and the two embrace."
}