{
    "id": "13600376",
    "localized title": "Naai Kutty",
    "cast": [
        "Nicole",
        "Selvin",
        "Soori"
    ],
    "genres": "Drama",
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "31 Dec 2009 (India)",
    "imdbID": "13600376",
    "plot outline": "In a slum in Chennai, Naai Kutty (Selvin), an orphan, is brought up by a cycle rickshaw puller. He spends his time drinking alcohol in the company of his friend Maari (Soori), and he does not go for any work. Malli (Nicole) sells flowers in a temple near the slum, and she is in love with Naai Kutty, while her friend Ammu (Sippy) treats him like her brother. After the death of his adoptive father, Naai Kutty decides to ride his cycle rickshaw. Naai Kutty then comes in contact with prostitutes who uses his rickshaw and he gets paid handsomely for his service. Naai Kutty starts to carry prostitutes and he eventually buys an auto rickshaw. One day, rowdies try to misbehave with the prostitutes in a brothel, Naai Kutty beats the rowdies up and saves the prostitutes. Impressed by his strength, the kingpin of the flesh trade Reddy (Jayakumaran) hires Naai Kutty as his henchman. One day, Ammu is sold by her father to Reddy, Naai Kutty clashes with Reddy to save her and he quits his job in disgust. Later, Naai Kutty sells his auto rickshaw and buys a van to start a new life. In the meantime, Maari, who runs in the councillor election, begs Naai Kutty to lend him money for the election, but Naai Kutty refuses because he has run out of money. A vengeful Reddy hatches a conspiracy against Naai Kutty, and he convinces Maari to leave Malli to him. Malli is drugged, and wealthy clients rape an unconscious Malli in the brothel. Naai Kutty then meets Reddy, and Reddy gives him money to dispose of a body. At the cemetery, a drunk Naai Kutty discovers the body of Malli, and he is in shock. The slum dwellers who come across Naai Kutty misunderstand the situation and beat Naai Kutty to death. The film ends with Ammu killing Maari for betraying Naai Kutty.",
    "languages": "Tamil",
    "title": "Naai Kutty",
    "kind": "movie",
    "directors": "Sathaji",
    "writers": "Sathaji",
    "producers": "V.A. Durai",
    "composers": "Vijayabharathi",
    "akas": "Naai Kutty (India)",
    "writer": "Sathaji",
    "director": "Sathaji",
    "production companies": "Evergreen Movie International",
    "plot": "In a slum in Chennai, _Naai Kutty_ (qv) (Selvin), an orphan, is brought up by a cycle rickshaw puller. He spends his time drinking alcohol in the company of his friend Maari (Soori), and he does not go for any work. Malli (Nicole) sells flowers in a temple near the slum, and she is in love with _Naai Kutty_ (qv), while her friend Ammu (Sippy) treats him like her brother. After the death of his adoptive father, _Naai Kutty_ (qv) decides to ride his cycle rickshaw. _Naai Kutty_ (qv) then comes in contact with prostitutes who uses his rickshaw and he gets paid handsomely for his service. _Naai Kutty_ (qv) starts to carry prostitutes and he eventually buys an auto rickshaw. One day, rowdies try to misbehave with the prostitutes in a brothel, _Naai Kutty_ (qv) beats the rowdies up and saves the prostitutes. Impressed by his strength, the kingpin of the flesh trade Reddy (Jayakumaran) hires _Naai Kutty_ (qv) as his henchman. One day, Ammu is sold by her father to Reddy, _Naai Kutty_ (qv) clashes with Reddy to save her and he quits his job in disgust. Later, _Naai Kutty_ (qv) sells his auto rickshaw and buys a van to start a new life. In the meantime, Maari, who runs in the councillor election, begs _Naai Kutty_ (qv) to lend him money for the election, but _Naai Kutty_ (qv) refuses because he has run out of money. A vengeful Reddy hatches a conspiracy against _Naai Kutty_ (qv), and he convinces Maari to leave Malli to him. Malli is drugged, and wealthy clients rape an unconscious Malli in the brothel. _Naai Kutty_ (qv) then meets Reddy, and Reddy gives him money to dispose of a body. At the cemetery, a drunk _Naai Kutty_ (qv) discovers the body of Malli, and he is in shock. The slum dwellers who come across _Naai Kutty_ (qv) misunderstand the situation and beat _Naai Kutty_ (qv) to death. The film ends with Ammu killing Maari for betraying _Naai Kutty_ (qv)."
}