{
    "id": "13606834",
    "localized title": "Eesa",
    "cast": [
        "M.S. Bhaskar",
        "Lakshana",
        "Singampuli"
    ],
    "genres": "Drama",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "07 Aug 2009 (India)",
    "imdbID": "13606834",
    "plot outline": "The film begins with the young man Sudaleeswaran aka Eesa (Vignesh) killing a salt pan owner in a remote village in Thoothukudi. Eesa lives in a small hut with his wife Selvi (Lakshana). He then continues to kill a couple of salt pan owners and bumps them off in his hut. Thanga Malai Annachi (Thoothukudi M. Rajendran) is the local bigwig and the owner of a salt pan in which Eesa works. Upset to see his partners and friends killed by a mysterious person, Thanga Malai Annachi starts to kill all his enemies. He then finds out that the killer is none other than Eesa, so he sends the police to catch him. The police discovers multiple corpses in Eesa's hut, including Selvi's. It is revealed that Eesa lives in a world of his own and believes that Selvi, who was killed a few months back, is still alive. He keeps her body in his hut and kills the murderers. A few months back, Eesa, who spent most of the time with his friend Kadukkai (Singampuli), fell in love with Selvi. Selvi accepted his love, and they got married. She later became pregnant. One day, Selvi saw Thanga Malai Annachi and his gang brutally murdering a government official and his wife. Selvi questioned them, resulting in her brutal murder. Eesa, who was working in the salt pan, heard a cry of pain and discovered his wife in blood. Eesa tried to save her, but she died in his arms. The rest of the story is how Eesa killed Thanga Malai Annachi.",
    "languages": "Tamil",
    "title": "Eesa",
    "kind": "movie",
    "directors": "Bala Ganesha",
    "writers": "Bala Ganesha",
    "producers": "J. Jayakrishnan",
    "composers": "Haran",
    "akas": "Eesa (India)",
    "writer": "Bala Ganesha",
    "director": "Bala Ganesha",
    "production companies": "J.K. Creations",
    "plot": "The film begins with the young man Sudaleeswaran aka _Eesa_ (qv) (Vignesh) killing a salt pan owner in a remote village in Thoothukudi. _Eesa_ (qv) lives in a small hut with his wife Selvi (Lakshana). He then continues to kill a couple of salt pan owners and bumps them off in his hut. Thanga Malai Annachi (Thoothukudi M. Rajendran) is the local bigwig and the owner of a salt pan in which _Eesa_ (qv) works. Upset to see his partners and friends killed by a mysterious person, Thanga Malai Annachi starts to kill all his enemies. He then finds out that the killer is none other than _Eesa_ (qv), so he sends the police to catch him. The police discovers multiple corpses in _Eesa_ (qv)'s hut, including Selvi's. It is revealed that _Eesa_ (qv) lives in a world of his own and believes that Selvi, who was killed a few months back, is still alive. He keeps her body in his hut and kills the murderers. A few months back, _Eesa_ (qv), who spent most of the time with his friend Kadukkai (Singampuli), fell in love with Selvi. Selvi accepted his love, and they got married. She later became pregnant. One day, Selvi saw Thanga Malai Annachi and his gang brutally murdering a government official and his wife. Selvi questioned them, resulting in her brutal murder. _Eesa_ (qv), who was working in the salt pan, heard a cry of pain and discovered his wife in blood. _Eesa_ (qv) tried to save her, but she died in his arms. The rest of the story is how _Eesa_ (qv) killed Thanga Malai Annachi."
}