{
    "id": "13606506",
    "localized title": "Vedappan",
    "cast": [
        "Apsara",
        "Hemanth Kumar",
        "Venniradai Moorthy"
    ],
    "genres": "Drama",
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "09 Oct 2009 (India)",
    "imdbID": "13606506",
    "plot outline": "In a village, Vedappan (Hemanth Kumar) works in a tea stall owned by Panneer (Venniradai Moorthy) and he is also a hardcore fan of cinema actress Deepika (Apsara). He wants to meet Deepika by any means and an aspiring director (Crane Manohar) promises him to make him a hero. In the meantime, the flower seller Kanaka (Nikitha) falls in love with Vedappan. Vedappan then gets a small role in Deepika's film. During the shooting, instead of shooting towards Deepika with a replica gun, Vedappan shoots her with a real gun and Deepika is wounded on the shoulder. Vedappan then escapes from the shooting spot and Deepika is admitted to the hospital. Thereafter, the police arrest Vedappan and he is forced to tell them the reason for shooting her. In the past, Vedappan and his widow father (Balu Anand) were poor workers who repaired metal vessels while Deepika was a poor karakattam dancer who lived with her widow mother (Sabitha Anand). Despite being a street dancer, Deepika wanted to be treated with dignity and Vedappan was deeply in love with her. Deepika and her mother then left the village without notice. Afterwards, Vedappan came to know that she had become a cinema actress in Chennai. One day, Vedappan saw Deepika's sex tape video and he was flabbergasted by it, so he decided to kill her. The police tell him that the video was morphed and the girl in the video was not Deepika thus Vedappan realises his mistake and he is released. The film ends with Vedappan accepting Kanaka's love.",
    "languages": "Tamil",
    "title": "Vedappan",
    "kind": "movie",
    "directors": "Aanaivari A. Sridhar",
    "writers": "Aanaivari A. Sridhar",
    "producers": "P. Radhakrishnan",
    "composers": "Nesan",
    "akas": "Vedappan (India)",
    "writer": "Aanaivari A. Sridhar",
    "director": "Aanaivari A. Sridhar",
    "production companies": "PRK Movies",
    "plot": "In a village, _Vedappan_ (qv) (Hemanth Kumar) works in a tea stall owned by Panneer (Venniradai Moorthy) and he is also a hardcore fan of cinema actress Deepika (Apsara). He wants to meet Deepika by any means and an aspiring director (Crane Manohar) promises him to make him a hero. In the meantime, the flower seller Kanaka (Nikitha) falls in love with _Vedappan_ (qv). _Vedappan_ (qv) then gets a small role in Deepika's film. During the shooting, instead of shooting towards Deepika with a replica gun, _Vedappan_ (qv) shoots her with a real gun and Deepika is wounded on the shoulder. _Vedappan_ (qv) then escapes from the shooting spot and Deepika is admitted to the hospital. Thereafter, the police arrest _Vedappan_ (qv) and he is forced to tell them the reason for shooting her. In the past, _Vedappan_ (qv) and his widow father (Balu Anand) were poor workers who repaired metal vessels while Deepika was a poor karakattam dancer who lived with her widow mother (Sabitha Anand). Despite being a street dancer, Deepika wanted to be treated with dignity and _Vedappan_ (qv) was deeply in love with her. Deepika and her mother then left the village without notice. Afterwards, _Vedappan_ (qv) came to know that she had become a cinema actress in Chennai. One day, _Vedappan_ (qv) saw Deepika's sex tape video and he was flabbergasted by it, so he decided to kill her. The police tell him that the video was morphed and the girl in the video was not Deepika thus _Vedappan_ (qv) realises his mistake and he is released. The film ends with _Vedappan_ (qv) accepting Kanaka's love."
}