{
    "id": "13612770",
    "localized title": "Maasilamani",
    "cast": [
        "Nakhul",
        "Santhanam",
        "Sunaina"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Drama"
    ],
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "19 Jun 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2ZmNmI0ZjgtNDlkNC00NWI4LTk4MGItZTU5OTYwYjlmY2ZkXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "13612770",
    "plot outline": "Maasilamani aka Maasi (Nakul) is an orphan living in a lower middle class colony. With a heart of gold, he is a popular guy who takes up local issues, fights for them, and is considered a rowdy by those who do not know him. Enters the heroine Divya (Sunaina), a rich upper middle class girl who is a dance instructor and with whom Maasi falls in love at first sight. However, Divya shows aversion to his rowdyism and gets offended with his proposal. Maasi attempts to win her family by being a good person and dons another name, Mani. All are aware that Mani and Maasi are one person except Divya. When Divya finds out the truth, she gets into a dilemma as whom she has to choose. Bhoopathy (Pawan), the local corrupt sub-inspector who is also behind Divya, is determined to flop Maasi's plans and prove that Mani is none other than Maasi. How Mani wins over Divya serves the climax of the movie.",
    "languages": "Tamil",
    "title": "Maasilamani",
    "kind": "movie",
    "directors": "R.N.R. Manohar",
    "writers": "Manohar",
    "producers": "Kalpathi S. Agoram",
    "composers": "D. Imman",
    "akas": "Maasilamani (India)",
    "writer": "Manohar",
    "director": "R.N.R. Manohar",
    "production companies": "AGS Entertainment",
    "distributors": "Sun Pictures",
    "other companies": "Sony Music India",
    "plot": "_Maasilamani_ (qv) aka Maasi (Nakul) is an orphan living in a lower middle class colony. With a heart of gold, he is a popular guy who takes up local issues, fights for them, and is considered a rowdy by those who do not know him. Enters the heroine Divya (Sunaina), a rich upper middle class girl who is a dance instructor and with whom Maasi falls in love at first sight. However, Divya shows aversion to his rowdyism and gets offended with his proposal. Maasi attempts to win her family by being a good person and dons another name, Mani. All are aware that Mani and Maasi are one person except Divya. When Divya finds out the truth, she gets into a dilemma as whom she has to choose. Bhoopathy (Pawan), the local corrupt sub-inspector who is also behind Divya, is determined to flop Maasi's plans and prove that Mani is none other than Maasi. How Mani wins over Divya serves the climax of the movie."
}