{
    "id": "14148980",
    "localized title": "Dubai Babu",
    "cast": [
        "Saloni Aswani",
        "Patre Nagaraj",
        "Nikita Thukral",
        "Upendra"
    ],
    "genres": "Drama",
    "runtimes": "158",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "15 May 2009 (India)",
    "imdbID": "14148980",
    "plot outline": "Dubai Babu revolves around Babu (Upendra) whose only aim is to fly to Dubai and get rich. He takes the help of a broker to fulfill this ambition and promptly gets duped by him. Stranded in Mumbai, he and his friends open a Pav Stall to keep things going. While in Mumbai, he runs into Vasundhara (Nikitha) and instantly falls for her. After a few meetings, Vasundhara disappears from Mumbai. Babu then heads to Bangalore in search of Vasundhara, who has now become a radio jockey. Trouble crops up in the form of her uncle Inspector Kalaiah, who has evil designs to marry her and constantly terrorises Vasundhara and her father. How Babu hoodwinks Kalaiah to get close to Vasundhara forms the rest of the story.",
    "languages": "Kannada",
    "title": "Dubai Babu",
    "kind": "movie",
    "directors": "Naganna",
    "writers": "Rinu Vytla",
    "producers": "Shailendra Babu",
    "composers": "V. Sridhar",
    "akas": "Dubai Babu (India)",
    "writer": "Rinu Vytla",
    "director": "Naganna",
    "production companies": "Sri Shailendra Productions",
    "plot": "_Dubai Babu_ (qv) revolves around Babu (Upendra) whose only aim is to fly to Dubai and get rich. He takes the help of a broker to fulfill this ambition and promptly gets duped by him. Stranded in Mumbai, he and his friends open a Pav Stall to keep things going. While in Mumbai, he runs into Vasundhara (Nikitha) and instantly falls for her. After a few meetings, Vasundhara disappears from Mumbai. Babu then heads to Bangalore in search of Vasundhara, who has now become a radio jockey. Trouble crops up in the form of her uncle Inspector Kalaiah, who has evil designs to marry her and constantly terrorises Vasundhara and her father. How Babu hoodwinks Kalaiah to get close to Vasundhara forms the rest of the story."
}