{
    "id": "14188920",
    "localized title": "Gilli",
    "cast": [
        "Gururaj Jaggesh",
        "Sadhu Kokila",
        "Rakul Preet Singh"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "16 Oct 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWQ3ZDM2MDQtMDc5Yy00N2FkLWFiNWItZGI0ZjNhMjZjNzZkXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "14188920",
    "plot outline": "The movie begins with Girish (Gilli) (Gururaj) on his way to work. People stare at him and laugh behind his back as he travels to his office. He appears distracted throughout the day and even instructs his assistant to postpone an important meeting with a big client. He then waits for someone at Marina Beach with a bouquet of flowers. His best friend, Lakshmi sees him and asks him whom he is waiting for. Gilli explains he is waiting to meet his girlfriend, Arati (Rakul Preet Singh) for their date. In flashbacks, we are shown how Gilli first met Arati. Gilli belongs to a lower middle class family, living with his parents and younger sister in Rainbow Colony in Chennai. He is perceived as a good for nothing person as he skips classes, fails in exams, and gets involved in fights. Gilli believes that his father hates him and often quarrels with him, even threatening to leave the house, only to be persuaded not to do so by his mother. Gilli's life changes when a once well-to-do family moves into the same colony due to loss in business. Gilli is attracted to the daughter of his new neighbour, Arati. Although he tries to woo her, Arati treats him with disdain. One day, Gilli confesses to Arati that he loves her. He tells her that having always been ridiculed, he found respite in the fact that she at least bothered to look at him. He promises to wipe her thoughts out of his mind, as he is not right for her. Despite himself, Gilli continues pursuing her. Arati realizes that Gilli is not such a useless fellow when Lakshmi tells her that she has seen Gilli dismantle and assemble a motorcycle within minutes each time they steal a bike to get drunk. Arati takes Gilli to a Hero Honda dealer and asks them to give him a job. He is promised a job if he can assemble a bike. Initially, the lethargic Gilli is disinterested and gives up the task. Arati takes him to the washroom and slaps him before revealing that she has fallen in love with him. She then tells him that they can only be together if he gets a proper job and gets his life straightened out. Gilli then demonstrates his skill in motorcycle assembly, securing a good job with the dealer. Later that evening, Gilli plans a treat for his friends. However, Arati confronts him and makes him break the good news to his parents first to get their blessings. However, Gilli's father berates him as usual for getting a job instead of completing college. Then later at night, Gilli overhears his father telling his mother how proud he is of their son since getting a job at such a prestigious company, which is not easy. The only reason the father did not openly praise Gilli is because he feared his son might misjudge him for giving him respect, only now that he is earning money for their household. Only then does Gilli realize his father's love for him and weeps in joy. The intimacy between Gilli and Arati is discovered by her mother and she refuses to allow them to continue dating even as Gilli's father tries to persuade her otherwise. Arati's family is heavily indebted to another Northern Indian family that has been supporting them since Arati's father suffered losses in his business. Arati's parents want Arati to marry the son of the family that has helped them. Using her friend's marriage as a ruse and with unwitting help of her friend's aunt, Arati escapes her home and travels with Gilli to a tourist place near Thekkady in Kerala and they end up in a hotel room. Arati reveals that she has made the biggest decision of her life by deciding to make love to him, as he should not regret falling in love with her when she marries the man her parents chose. Though stunned by her decision, Gilli goes with her plan and the two consummate their love. The next morning Gilli and Arati argue when Gilli says he wants Arati to live with him, while Arati accuses him of being attracted to her only because of the sex. They continue arguing as they exit the hotel. While crossing the road, Arati is knocked down by a truck as a helpless Gilli watches. Gilli is also hit by a speeding vehicle. Arati dies gruesomely on the spot and Gilli is injured. Gilli is heavily shocked to find the mere remains of Arati in Hospital mortuary. Though the Police want to file a murder case on Gilli, Arati's mother refuses to name Gilli as a murderer. Gilli tells the Police that Arati never accepted his love, and her death was really an accident. This way, Gilli saves Arati's dignity and her mother blesses him as she leaves. After sadly returning to Chennai, Gilli tries to commit suicide only to be helped by a group of nuns. Gilli then hallucinates about Arati's spirit coming to him and advising him to live life to the fullest. Back in present day, it is revealed that Gilli has become very successful person in his life but has remained mentally damaged since Arati's death. He still believes that she is alive and always imagines talking to her. The film ends with Gilli talking to himself at the beach, thinking that he is talking to Arati.",
    "languages": "Kannada",
    "title": "Gilli",
    "kind": "movie",
    "directors": "Raghava Loki",
    "writers": "Ram Narayan",
    "producers": "Anaji Nagaraj",
    "composers": "Yuvan Shankar Raja",
    "akas": "Gilli (India)",
    "writer": "Ram Narayan",
    "director": "Raghava Loki",
    "plot": "The movie begins with Girish (_Gilli_ (qv)) (Gururaj) on his way to work. People stare at him and laugh behind his back as he travels to his office. He appears distracted throughout the day and even instructs his assistant to postpone an important meeting with a big client. He then waits for someone at Marina Beach with a bouquet of flowers. His best friend, Lakshmi sees him and asks him whom he is waiting for. _Gilli_ (qv) explains he is waiting to meet his girlfriend, Arati (Rakul Preet Singh) for their date. In flashbacks, we are shown how _Gilli_ (qv) first met Arati. _Gilli_ (qv) belongs to a lower middle class family, living with his parents and younger sister in Rainbow Colony in Chennai. He is perceived as a good for nothing person as he skips classes, fails in exams, and gets involved in fights. _Gilli_ (qv) believes that his father hates him and often quarrels with him, even threatening to leave the house, only to be persuaded not to do so by his mother. _Gilli_ (qv)'s life changes when a once well-to-do family moves into the same colony due to loss in business. _Gilli_ (qv) is attracted to the daughter of his new neighbour, Arati. Although he tries to woo her, Arati treats him with disdain. One day, _Gilli_ (qv) confesses to Arati that he loves her. He tells her that having always been ridiculed, he found respite in the fact that she at least bothered to look at him. He promises to wipe her thoughts out of his mind, as he is not right for her. Despite himself, _Gilli_ (qv) continues pursuing her. Arati realizes that _Gilli_ (qv) is not such a useless fellow when Lakshmi tells her that she has seen _Gilli_ (qv) dismantle and assemble a motorcycle within minutes each time they steal a bike to get drunk. Arati takes _Gilli_ (qv) to a Hero Honda dealer and asks them to give him a job. He is promised a job if he can assemble a bike. Initially, the lethargic _Gilli_ (qv) is disinterested and gives up the task. Arati takes him to the washroom and slaps him before revealing that she has fallen in love with him. She then tells him that they can only be together if he gets a proper job and gets his life straightened out. _Gilli_ (qv) then demonstrates his skill in motorcycle assembly, securing a good job with the dealer. Later that evening, _Gilli_ (qv) plans a treat for his friends. However, Arati confronts him and makes him break the good news to his parents first to get their blessings. However, _Gilli_ (qv)'s father berates him as usual for getting a job instead of completing college. Then later at night, _Gilli_ (qv) overhears his father telling his mother how proud he is of their son since getting a job at such a prestigious company, which is not easy. The only reason the father did not openly praise _Gilli_ (qv) is because he feared his son might misjudge him for giving him respect, only now that he is earning money for their household. Only then does _Gilli_ (qv) realize his father's love for him and weeps in joy. The intimacy between _Gilli_ (qv) and Arati is discovered by her mother and she refuses to allow them to continue dating even as _Gilli_ (qv)'s father tries to persuade her otherwise. Arati's family is heavily indebted to another Northern Indian family that has been supporting them since Arati's father suffered losses in his business. Arati's parents want Arati to marry the son of the family that has helped them. Using her friend's marriage as a ruse and with unwitting help of her friend's aunt, Arati escapes her home and travels with _Gilli_ (qv) to a tourist place near Thekkady in Kerala and they end up in a hotel room. Arati reveals that she has made the biggest decision of her life by deciding to make love to him, as he should not regret falling in love with her when she marries the man her parents chose. Though stunned by her decision, _Gilli_ (qv) goes with her plan and the two consummate their love. The next morning _Gilli_ (qv) and Arati argue when _Gilli_ (qv) says he wants Arati to live with him, while Arati accuses him of being attracted to her only because of the sex. They continue arguing as they exit the hotel. While crossing the road, Arati is knocked down by a truck as a helpless _Gilli_ (qv) watches. _Gilli_ (qv) is also hit by a speeding vehicle. Arati dies gruesomely on the spot and _Gilli_ (qv) is injured. _Gilli_ (qv) is heavily shocked to find the mere remains of Arati in Hospital mortuary. Though the Police want to file a murder case on _Gilli_ (qv), Arati's mother refuses to name _Gilli_ (qv) as a murderer. _Gilli_ (qv) tells the Police that Arati never accepted his love, and her death was really an accident. This way, _Gilli_ (qv) saves Arati's dignity and her mother blesses him as she leaves. After sadly returning to Chennai, _Gilli_ (qv) tries to commit suicide only to be helped by a group of nuns. _Gilli_ (qv) then hallucinates about Arati's spirit coming to him and advising him to live life to the fullest. Back in present day, it is revealed that _Gilli_ (qv) has become very successful person in his life but has remained mentally damaged since Arati's death. He still believes that she is alive and always imagines talking to her. The film ends with _Gilli_ (qv) talking to himself at the beach, thinking that he is talking to Arati."
}