{
    "id": "1522133",
    "localized title": "Angshumaner Chhobi",
    "cast": [
        "Bhaskar Banerjee",
        "Anjana Basu",
        "Sabyasachi Chakrabarty",
        "Bobby Chakraborty",
        "Soma Chakraborty",
        "Ananya Chatterjee",
        "Soumitra Chatterjee",
        "Debesh Roy Chowdhury",
        "Suchandra Chowdhury",
        "Pijush Ganguly",
        "Rudranil Ghosh",
        "Chhanda Guha",
        "Indrani Haldar",
        "Tota Roy Chowdhury",
        "Koushik Sen",
        "Indraneil Sengupta"
    ],
    "genres": "Drama",
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color::(Fujicolor)",
    "original air date": "21 Aug 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDYzNWRmM2MtMDYzNy00YTE3LWI0MDktNmQ2YWE4ZmY2ZTJiXkEyXkFqcGdeQXVyNjA3OTI5MjA@._V1_SY150_CR11,0,101,150_.jpg",
    "imdbID": "1522133",
    "plot outline": "Angshuman, a young film director, comes back from Italy after eight years, having studied cinema there, to make his first film. He puts up a determined fight against all obstacles to complete his film. He picks an unusual script on which he is not prepared to compromise. The story is about a 72-year-old painter who is suffering from dementia. The painter has an illiterate ayah who looks after him. Anghsuman chooses an old actor Pradyut Mukherjee, a matinee idol at one time who has cut himself from the mainstream as much as he has cut himself away from films. Anghsuman persuades the actor to portray the character of the old painter. For the role of the ayah, the new director chooses Madhura, an actress who won the National Award for her debut film but lost her way somewhere in the maze of commercial cinema and then receded into the background. When Angshuman approaches her, she is reduced to a jatra artist who is a social recluse. As shooting begins, there is this continuous interaction between the actual character and those within the film. In fact, there is, as if, an exchange of molecules between the two. So, film-within-film is not just a form in Angshumaner Chhobi but is also embedded within the plot of the story. As Angshuman struggles to achieve his goal of making a very good first film, the story passes through many mutations - emotional drama, humour, and the detection of crime. Along the way, other issues come up. Among these are (a) the eternal tussle faced by every creative person between his mind and his emotions, (b) the psyche of being in and out of the limelight, (c) the inevitable pangs of conscience and humanism faced by celebrities, etc.",
    "languages": "Bangla",
    "title": "Angshumaner Chhobi",
    "kind": "movie",
    "directors": "Atanu Ghosh",
    "writers": [
        "Suchandra Chowdhury",
        "",
        "Atanu Ghosh",
        "",
        "Atanu Ghosh"
    ],
    "producers": [
        "Sumita Bhattacharya",
        "Mukul Sarkar"
    ],
    "composers": "Rocket Mondol",
    "cinematographers": "Sandip Sen",
    "editors": "Sujay Datta Ray",
    "art directors": "Joy Chandra Chandra",
    "assistant directors": "Rajdeep Ghosh",
    "sound department": [
        "Anup Mukhyopadhyay",
        "Gautam Nag"
    ],
    "miscellaneous": [
        "Sukalyan Bhattacharya",
        "Saubhik Das",
        "Debiprasad Kar"
    ],
    "thanks": [
        "Anindya Bandopadhyay",
        "Shameek Bandyopadhyay",
        "Anjana Basu",
        "Kanchan Bhattacharya",
        "Ranajoy Bhattacharya",
        "Abir Chatterjee",
        "Prashanta Chattopadhyay",
        "Aparajita Ghosh Das",
        "Anumita Dasgupta",
        "Debapratim Dasgupta",
        "Uttam Ghosh",
        "Shyamal Ghoshal",
        "Buddhadeb Guha",
        "Chandreyee Lahiri",
        "Satyapriyo Mukhopadhyay",
        "Mita Pal",
        "Paramita Raut",
        "Chinmoy Roy",
        "Kunal Sen",
        "Gautam Sil"
    ],
    "akas": "Angshumaner Chhobi (India)",
    "writer": [
        "Suchandra Chowdhury",
        "Atanu Ghosh",
        "Atanu Ghosh"
    ],
    "director": "Atanu Ghosh",
    "production companies": "Mukul Sarkar Production",
    "distributors": [
        "T. Sarkar Productions",
        "Databazaar Media Ventures",
        "SanGin Entertainment"
    ],
    "plot": "Angshuman, a young film director, comes back from Italy after eight years, having studied cinema there, to make his first film. He puts up a determined fight against all obstacles to complete his film. He picks an unusual script on which he is not prepared to compromise. The story is about a 72-year-old painter who is suffering from dementia. The painter has an illiterate ayah who looks after him. Anghsuman chooses an old actor Pradyut Mukherjee, a matinee idol at one time who has cut himself from the mainstream as much as he has cut himself away from films. Anghsuman persuades the actor to portray the character of the old painter. For the role of the ayah, the new director chooses Madhura, an actress who won the National Award for her debut film but lost her way somewhere in the maze of commercial cinema and then receded into the background. When Angshuman approaches her, she is reduced to a jatra artist who is a social recluse. As shooting begins, there is this continuous interaction between the actual character and those within the film. In fact, there is, as if, an exchange of molecules between the two. So, film-within-film is not just a form in _Angshumaner Chhobi_ (qv) but is also embedded within the plot of the story. As Angshuman struggles to achieve his goal of making a very good first film, the story passes through many mutations - emotional drama, humour, and the detection of crime. Along the way, other issues come up. Among these are (a) the eternal tussle faced by every creative person between his mind and his emotions, (b) the psyche of being in and out of the limelight, (c) the inevitable pangs of conscience and humanism faced by celebrities, etc.::Atanu Ghosh"
}