{
    "id": "1570417",
    "localized title": "Accident on Hill Road",
    "cast": [
        "Farooq Shaikh",
        "Celina Jaitly",
        "Abhimanyu Singh",
        "Rukhsar Rehman",
        "Shammi",
        "Shubha Khote",
        "Dadhi Raj",
        "Priya Ahuja",
        "Manmeet Singh Sawhney",
        "Monica Ajinkya",
        "Neelima Azim",
        "Freny Bhagat",
        "Sushma Bhagwat",
        "Sushma Bhagwat",
        "Bunty Chopra",
        "Parvez Khan",
        "Kanchi Ashok Kumar",
        "Krishnan Manav",
        "Anil Mhatre",
        "Krishna Prem",
        "Pranav Purohit",
        "Sabrina",
        "Sabrina Schaumburg",
        "Manhat Sharma",
        "Jay Prakash Singh",
        "Jay Thakker",
        "Ekram Kashmiri"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "105",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "bho",
        "en"
    ],
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "Singapore:NC-16"
    ],
    "original air date": "31 Dec 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjI3NDQ1YzMtNzg3Ni00Njk0LThiZDgtNDAwMWY3YjFiNDUzXkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1570417",
    "plot outline": "A thriller that takes it's premise from the real life incident of a woman who hit a man, then drove home, and parked the car in the garage with the man wedged halfway through her wind shield. what happens next makes the rest of the thrilling story.",
    "languages": [
        "Hindi",
        "Bhojpuri",
        "English"
    ],
    "title": "Accident on Hill Road",
    "kind": "movie",
    "directors": "Mahesh Nair",
    "writers": [
        "Varun Grover",
        "",
        "Rahul Mehta",
        "",
        "Mahesh Nair",
        "",
        "Sandeep Nath",
        "",
        "Siddhaarth Parmar"
    ],
    "producers": "Nari Hira",
    "composers": "Raju Singh",
    "cinematographers": "Ravi Walia",
    "editors": "Amit Parmar",
    "editorial department": "Vikram Parmar",
    "production designers": "Wasiq Khan",
    "art directors": "Tariq Umar Khan",
    "production managers": "Ravishankar Tiwari",
    "assistant directors": [
        "Srinivas Abrol",
        "Sandheep Mone",
        "Dipakk Srivastava"
    ],
    "art department": [
        "Sikander Ahmad",
        "Liyakat Ali Khan",
        "Malavika Sohoni"
    ],
    "sound department": [
        "Faisal Majeed",
        "Harsh Parekh"
    ],
    "visual effects": [
        "Dinesh Singh",
        "Chandu Vojjala"
    ],
    "stunts": "Parvez Khan",
    "music department": "Sonu Nigam",
    "writer": [
        "Varun Grover",
        "Rahul Mehta",
        "Mahesh Nair"
    ],
    "director": "Mahesh Nair",
    "production companies": "Magna Films",
    "distributors": "Magna Films",
    "plot": [
        "In order not to jeopardize her overseas career, an impaired woman, who had just run over a male, decides to conceal her crime with the victim trapped in the windshield.",
        "A thriller that takes it's premise from the real life incident of a woman who hit a man, then drove home, and parked the car in the garage with the man wedged halfway through her wind shield. what happens next makes the rest of the thrilling story.::Magna Stardust",
        "Employed at an Elders' Home, Sonam Chopra is thrilled when she is informed that her employment with Red Cross in London has been confirmed. She celebrates with her co-worker, Tina, and boyfriend, Sid, at a pub, where she consumes considerable alcohol. While driving home, she runs into a male crossing the street on Hill Road, and the impact throws him into the windshield. Fearful of losing her Visa, she takes the car and the victim home, places it in the garage and locks the door. She telephones Sid, and goes over to his residence to ask for his assistance. She, instead, finds another woman with him, but forgives him. The next day she informs him about the accident, and the duo decide to return back to her residence in order to survey the situation and plan what to do next. What they find there will change their plan and their lives forever.::rAjOo (gunwanti@hotmail.com)",
        "To celebrate the sanctioned of her visa for employment at the 'red-cross' located in London, U.K. Sonam Chopra, her boy-friend Siddharth and one of her co-worker celebrates at a local pub where she consumes an unreasonable amount of alcohol. While driving home she crashes into an elderly man crossing hill road which results in the man getting stuck in her car's windscreen. For fear of losing her visa she drives home and parks her car in the garage with the male still confine in the car's windscreen. She find that the man is still alive and in an estranged position the man started to call for help but instead she and her boyfriend Siddharth attempts to kill him albeit unsuccessful; while in the process she and her boyfriend ends up losing their lives with the man escaping.::gavin (racktoo@hotmail.com)",
        "Sonam Chopra works as a caretaker in old age home and is not happy with her job due to her rude warden,she gets a job in London and has to got for Visa appointment Sonam gets drunk the night after a party.Prakash Shrivastava who has just lost his wife wanders the street in depressive mind and is hit buy Sonam's car he gets stuck in the card windshield in fear of loosing her job in London Sonam drives the car home into her garage.Sonam tries to explain the situation to her boyfriend Sid but he is in a romantic mood and nothing works.The next morning Sonam finds that Prakash still stuck in windshield but very much alive asking for help to save him rather then helping Paraksh ,Sonam and Sid try to kill him and get rid of his body.::alex.mjacko@gmail.com"
    ]
}