{
    "id": "1649404",
    "localized title": "Sankham",
    "cast": [
        "Gopichand",
        "Trisha Krishnan",
        "Chandramohan",
        "Kota Srinivasa Rao",
        "Sathyaraj",
        "Mohammad Ali",
        "Banerjee",
        "Venu Madhav",
        "Telangana Sakuntala",
        "L.B. Sriram",
        "Fish Venkat",
        "Dharmavarapu Subramanyam",
        "Krishna Bhagavan",
        "Raghu Babu",
        "Raghunatha Reddy",
        "Pruthvi",
        "Melkote",
        "Rajitha",
        "Kavi Bandaru Danaiah",
        "M.S. Narayana",
        "Prasad Babu",
        "Srinivasa Reddy",
        "Seetha",
        "Swathi"
    ],
    "genres": [
        "Action",
        "Comedy"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "te",
        "hi",
        "en"
    ],
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "India:U::(video)",
        "United States:Not Rated"
    ],
    "original air date": "18 Sep 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjMzNTU0YjgtYzA5Yi00M2VjLWFkNjUtMGJjNWQ1MjdkNmM0XkEyXkFqcGdeQXVyNjQ3ODkxMjE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1649404",
    "plot outline": "Based in Australia, Chandu lives with his paternal uncle, Krishna Rao. He dramatically meets with Mahalakshmi, who manages 'Andhra Mirchi' restaurant, and both fall in love with each other. Their hopes to get married are in vain after her aunt forcibly takes her to India in order to get her married to her son, Prem Kumar. Chandu follows her, manages to convince her father, Pasupathi, by saving the life of the latter's son, Shriman Gajapati Naidu, from Sivaiah/Shivaji's goons. Pasupathi is ready to finalize the marriage but asks Chandu to complete a gruesome task - and it is this request that will change everyone's lives forever.",
    "languages": [
        "Telugu",
        "Hindi",
        "English"
    ],
    "title": "Sankham",
    "kind": "movie",
    "directors": "Siva",
    "writers": [
        "Anil Ravipudi",
        "",
        "Siva"
    ],
    "producers": [
        "Bhagawan J.",
        "J. Pulla Rao",
        "Anupam Sharma",
        "Ravi S. Sharma"
    ],
    "composers": "S. Thaman",
    "cinematographers": "Vetri Palanisamy",
    "editors": "Marthand K. Venkatesh",
    "art directors": "A.M. Vivek",
    "assistant directors": [
        "G. Adi Narayana",
        "Anil Ravipudi"
    ],
    "visual effects": [
        "Bhaskarponnala",
        "Satish Dayapule",
        "Bujji Gandi"
    ],
    "stunts": [
        "Lakshman Chella",
        "Ram Chella",
        "Stunt Silva",
        "Vijay"
    ],
    "music department": [
        "Karthik",
        "Paul Praveen Kumar",
        "Krishnakumar Kunnath",
        "Singer Megha",
        "Rahul Nambiar",
        "Udit Narayan",
        "Ranjith"
    ],
    "miscellaneous": "Shobi Paulraj",
    "thanks": [
        "Tanikella Bharani",
        "Kalyan C."
    ],
    "akas": "Conch (United States)",
    "writer": [
        "Anil Ravipudi",
        "Siva"
    ],
    "director": "Siva",
    "production companies": [
        "Friends Video",
        "Sri Balaji Cine Media"
    ],
    "other companies": [
        "Aditya Music",
        "Anand Cine Services",
        "Prime Focus"
    ],
    "plot": [
        "A cheerful young man gets drawn into a longtime conflict between two rivals after going through a series of life-changing and threatening challenges.",
        "Based in Australia, Chandu lives with his paternal uncle, Krishna Rao. He dramatically meets with Mahalakshmi, who manages 'Andhra Mirchi' restaurant, and both fall in love with each other. Their hopes to get married are in vain after her aunt forcibly takes her to India in order to get her married to her son, Prem Kumar. Chandu follows her, manages to convince her father, Pasupathi, by saving the life of the latter's son, Shriman Gajapati Naidu, from Sivaiah/Shivaji's goons. Pasupathi is ready to finalize the marriage but asks Chandu to complete a gruesome task - and it is this request that will change everyone's lives forever.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Chandu (Gopichand) is a rich, rough youth brought up by his uncle Krishna Rao (Chandra Mohan) in Australia. Mahalakshmi (Trisha) stays in Australia along with her uncle Pichaiah (Dharmavarapu Subrahmanyam), who runs a restaurant. Chandu is fond of martial arts, but he never gets a chance to exhibit them in real situations. Mahalakshmi is another martial arts freak. After a few misunderstandings, they fall in love. One day, Mahalakshmi is forced to come back to her hometown in Rayalaseema. Chandu comes in search of her. Meanwhile, Sivaiah (Sathyaraj) and his archenemy, Mahalakshmi's father Pashupati (Kota Srinivasa Rao) are the rich leaders of two neighboring villages, in rayalaseema. They have longtime enmity. Chandu comes to Mahalakshmi's village and asks her hand in marriage. Though Pashupati's sister opposes this, Pashupati agrees based on one condition, that Chandu must escort his brother from railway station to home safely. The brother Rajappa (Supreeth), has been on a 23-year self-imposed exile from the district, due to his life being under threat of Sivaiah and his entire village. Chandu agrees and does so, beating 30 men of Siviah on the way. Then Chandu is challenged to go to Siviah alone to his house. While walking in Sivaiah's house, he is beaten up badly by Sivaiah's men that he laid at the door of the house. When Sivaiah saw his face, he recognized Chandu and rushed him to the hospital where he is saved. The incident reached to Chandu's uncle who flew to India. Uncle Krishna Rao is shocked to see Chandu with Siviah and proceeds to tell Chandu about his parents. Siviah is actually Chandu's father. 23 years ago, there was a big feud between village for sharing water, in which multitude of lives were lost in clashes. Siviah's wife pleads him to stop the fight, to which he pays no heed. She gives birth to twins, but one child and her parents are killed in a car-bomb, before her very eyes. This makes her to take Chandu and go to her native. After 2 years, she has a change of heart and comes to meet Siviah. As they are about to reconcile, Rajappa ambushes Siviah, and kills his wife before his eyes, despite his pleas. He sent Chandu with the uncle and has paid for all of his expenses since then. Chandu then joins Siviah as his heir, and defeats both Pasupati and his brothers. Finally he marries Mahalakshmi and returns to Australia and they live happy ever after."
}