{
    "id": "1821281",
    "localized title": "Vaidehi",
    "cast": [
        "Aruna Irani",
        "Sushmita Daan",
        "Pallavi Kulkarni",
        "Ashlesha Sawant",
        "Sachin Shroff",
        "Vivan Bhatena"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWFlMmVlOTgtYmQxMy00YWJmLTk1ZDAtMjZkNDUxYzQyYmNjXkEyXkFqcGdeQXVyNzM4MjU3NzY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "1821281",
    "plot outline": "This is the story of a twenty one year old, spirited girl called Vaidehi. Hailing from a middle class family, Vaidehi dreams of having a loving husband, supportive family and a small house to call her own. In a true fairy tale-like fashion, Vaidehi's parents receive a marriage proposal from one of the richest families in the country for their only son Aryavardhan. Although apprehensive about the proposal, Vaidehi eventually ties the knot with Aryavardhan. However, on her wedding night she realizes that the wedding was a facade and that this isn't the end of her fairy tale but the beginning of a nightmare. Finding herself trapped in the marriage, Vaidehi's life comes to a standstill. To uncover the secrets that are hidden in her husband's past,",
    "languages": "Hindi",
    "title": "Vaidehi",
    "kind": "tv series",
    "series years": "2006-",
    "seasons": "1",
    "production companies": "A K Films",
    "distributors": "A K Films",
    "plot": "This is the story of a twenty one year old, spirited girl called _Vaidehi_ (qv). Hailing from a middle class family, _Vaidehi_ (qv) dreams of having a loving husband, supportive family and a small house to call her own. In a true fairy tale-like fashion, _Vaidehi_ (qv)'s parents receive a marriage proposal from one of the richest families in the country for their only son Aryavardhan. Although apprehensive about the proposal, _Vaidehi_ (qv) eventually ties the knot with Aryavardhan. However, on her wedding night she realizes that the wedding was a facade and that this isn't the end of her fairy tale but the beginning of a nightmare. Finding herself trapped in the marriage, _Vaidehi_ (qv)'s life comes to a standstill. To uncover the secrets that are hidden in her husband's past,"
}