{
    "id": "2011326",
    "localized title": "Thiru Thiru Thuru Thuru",
    "cast": [
        "Lakshmy Ramakrishnan",
        "Ajmal Ameer",
        "Rupa Manjari",
        "Mouli",
        "Baby Darshan",
        "Janani Iyer",
        "Yog Japee",
        "Jayalakshmi"
    ],
    "genres": "Comedy",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2UyNDM1YjQtYmNlOS00M2EyLThmMzMtOTc4YTkyYTFiMzMxXkEyXkFqcGdeQXVyMzYxOTQ3MDg@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2011326",
    "languages": "Tamil",
    "title": "Thiru Thiru Thuru Thuru",
    "kind": "movie",
    "directors": "J.S. Nandhini",
    "writers": [
        "J.S. Nandhini",
        "",
        "J.S. Nandhini",
        "",
        "J.S. Nandhini",
        "",
        "Aarthi Videep"
    ],
    "composers": "Mani Sharma",
    "cinematographers": "Sudhir K. Chaudhary",
    "sound department": "Nagavenkatakumar",
    "camera department": [
        "Gopal Balaji",
        "Sreedhar Karthavarayan"
    ],
    "music department": "Lalithanand",
    "akas": "Thiru Thiru Thuru Thuru (India)",
    "writer": [
        "J.S. Nandhini",
        "J.S. Nandhini",
        "J.S. Nandhini"
    ],
    "director": "J.S. Nandhini",
    "production companies": "Sathyam Cinemas",
    "distributors": "Sathyam Cinemas",
    "other companies": "AP International",
    "plot": "In order to help their boss from a financial crisis, Arjun and Archana manage to find a baby for a crucial ad campaign. However, they are shocked when they learn that the baby is an abductee.",
    "synopsis": "A comedy centering the lies and their following consequences of the duo (Ajmal Amir & Rupa Manjari) in shooting an ad for a baby product. Ajmal plays the role of an erratic, lazy and carefree lad working with Rupa Manjari, who has the exactly contrasting attributes, in an ad film making company run by Mouli. Mouli plays the role of a forgetful boss, who looks upon his employees with kindness and affection. When Mouli, at a stage, is forced to keep his house on mortgage for the further progress of the firm, Ajmal comes to his aid and promises to do his best for his boss. But, prone to carelessness, Ajmal messes up during the presentation in front of the delegates of the baby product company. Mouli still manages to keep the deal in hand and hands over the project to Ajmal and Rupa Manjari. The plot rolls over with the kidnap of the baby playing the lead role in the ad, and the duo playing the detective to save the baby and the name of their boss. The duo are haled to fill in the gaps with lies before they revive the baby to complete the film, not only for their sake, but also for the honor of their beloved boss."
}