{
    "id": "2255008",
    "localized title": "Manorama",
    "cast": [
        "Mohammad Ali",
        "Charmme Kaur",
        "M.S. Narayana",
        "Nishan",
        "Dheer Charan Srivastav",
        "Narsing Yadav"
    ],
    "genres": "Thriller",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "original air date": "27 Mar 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDM1MjE5MjctNzhkNS00ZWY0LThkMGEtOWQ3YjRjOGZjOTNkXkEyXkFqcGdeQXVyMjY1MTI1MDQ@._V1_SY150_CR49,0,101,150_.jpg",
    "imdbID": "2255008",
    "plot outline": "The main star of the story is Gilli (Charmy Kaur), who came to Hyderabad to spend some time with her friends. She was staying in an apartment overlooking the Manorama cafe. One day she was bored and looking at the people in the cafe. As she could lip read, she started to test her skill on different peoples. Suddenly she realized that a boy is threatening to commit suicide on phone to his girlfriend. Gilli gets worried and take actions to clear the misunderstanding between these love birds. She went to the cafe to talk to the boy, where a strange man Nishan was sitting with a bag, which contained a powerful time bomb. The moment Nishan saw Gilli entering the cafe he instantly became attracted to her and suddenly his mission of blowing up the cafe became unimportant. Will the bomb explode or there will be a happy ending?",
    "languages": "Telugu",
    "title": "Manorama",
    "kind": "movie",
    "directors": "Y. Eshwara Reddy",
    "writers": "Padmasri",
    "composers": "Koti",
    "editors": "Marthand K. Venkatesh",
    "assistant directors": [
        "Ravi.Wuyyuru",
        "Tirupatikiran",
        "Ravi Wuyyuru"
    ],
    "visual effects": "Sriram Namana",
    "writer": "Padmasri",
    "director": "Y. Eshwara Reddy",
    "production companies": "Zee Television Network",
    "plot": "The main star of the story is Gilli (Charmy Kaur), who came to Hyderabad to spend some time with her friends. She was staying in an apartment overlooking the _Manorama_ (qv) cafe. One day she was bored and looking at the people in the cafe. As she could lip read, she started to test her skill on different peoples. Suddenly she realized that a boy is threatening to commit suicide on phone to his girlfriend. Gilli gets worried and take actions to clear the misunderstanding between these love birds. She went to the cafe to talk to the boy, where a strange man Nishan was sitting with a bag, which contained a powerful time bomb. The moment Nishan saw Gilli entering the cafe he instantly became attracted to her and suddenly his mission of blowing up the cafe became unimportant. Will the bomb explode or there will be a happy ending?::Niaz Islam Arif"
}