{
    "id": "2294769",
    "localized title": "Pokkisham",
    "cast": [
        "Cheran",
        "Padmapriya",
        "Aryan Rajesh"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "14 Aug 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZmU2MmRiYjEtOTFmMS00MWExLTgxNmMtNjY1YmY5ZWFlOWEyXkEyXkFqcGdeQXVyODk1MzE5NDA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2294769",
    "languages": "Tamil",
    "title": "Pokkisham",
    "kind": "movie",
    "directors": "Cheran",
    "producers": "Hitesh Jhabak",
    "editors": "Vasanth Nagarajan",
    "editorial department": "K. Sasi Kumar",
    "sound department": [
        "A.M. Rahmathulla",
        "S. Sivakumar"
    ],
    "visual effects": "Shri Bindhu Madhav",
    "camera department": "Gopal Balaji",
    "akas": "Pokkisham (India)",
    "director": "Cheran",
    "production companies": "Nemichand Jhabak",
    "distributors": [
        "Parasakthi Films",
        "Ayngaran International",
        "Kalaignar Tv"
    ],
    "other companies": "Sony Music India",
    "synopsis": "In 1970, a marine engineer Lenin (Cheran) from Calcutta comes across a Nagore girl Nadira (Padmapriya). Started with friendship, later seeded with love, Lenin mails a letter once a month. When Lenin came to Nagore, he was disappointed and sad as Nadira and her family left the place after selling their home. Years later, Mahesh (Aryan Rajesh), son of Lenin, found his father's hidden life from reading his diary. With help from his friend Shamsudeen (Ajai.R), He marches his way to find Nadira and deliver the letter to her. He comes to know that Nadira has shifted to Malaysia after marriage. He goes to Malaysia to meet her. Once he reaches her house, he is greeted by Nadira's son who welcomes him to the house. Nadira is now very old and asks Mahesh as to who he is and how does he know her? He replies saying he is Lenin's son and also informs her that his father died few years back. Nadira is grief-stricken. Mahesh gives her Lenin's last few letters which he could not post because he did not have Nadira's address. In those letters, Lenin has spoken about his journey to find Nadira after she and her family shifted from Nagore. He describes his pain and grief over not knowing about her situation during those days, and also about his father who coaxed him to marry another girl (played by Anupama Kumar), who is now his wife and is very understanding. Nadira then drops Mahesh to the airport and while on the way she request him to let her talk to his mother. Nadira and Mahesh's mother exchange good notes and then she finally drops him to the airport. While coming back, she is talking to her herself as well as to Lenin saying that she showed her anguish and punished her father by denying to marry anyone. She currently lives with her sister and her lovable family and apologises and promises Lenin that she will join him soon and never separate."
}