{
    "id": "2497024",
    "localized title": "Bokya Satbande",
    "cast": [
        "Kaluram Dhobale",
        "Aryan Narvekar",
        "Dilip Prabhavalkar",
        "Alok Rajwade"
    ],
    "genres": "Family",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "17 Apr 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWNjNDgwZTctMTJkMS00MGFmLTg5YzQtZGM3YzYwNDJjYmYwXkEyXkFqcGdeQXVyMTgwMjgwMjM@._V1_SY150_CR7,0,101,150_.jpg",
    "imdbID": "2497024",
    "plot outline": "\"Bokya Satbande\" is a naughty and mischievous seven year old boy. Once while playing cricket he accidentally hits the ball into an old couple's - the \"Belwandi's\" apartment. Their only son has settled in the US years ago. Though he is reprimanded \"Bokya\" admits that he'll continue to play but will be careful that his game doesn't bother anyone. The old couple take an immediate liking for this mischievous but honest little boy. \"Bokya\" begins to run errands for them and helps fills a void in their life. He even convinces his brother to act as their grandson. The story takes us through the various activities of \"Bokya\" and his friends during their school vacation which along with fun and games also includes several noble and brave deeds.",
    "languages": "Marathi",
    "title": "Bokya Satbande",
    "kind": "movie",
    "directors": "Raj Pendurkar",
    "writers": [
        "Raj Pendurkar",
        "",
        "Dilip Prabhawalkar"
    ],
    "producers": "Kanchan Satpute",
    "composers": "Shailendra Barve",
    "cinematographers": "Amalendu Chaudhary",
    "editors": [
        "Radhey Lalsa",
        "Majid Shaikh"
    ],
    "editorial department": [
        "Prashant Dhotre Colorist",
        "Lavesh Rampurkar"
    ],
    "art directors": "Chetan Shikarkhane",
    "production managers": "Vishal Bhujbal",
    "sound department": [
        "Suraj Jaisingh",
        "Renganaath Ravee"
    ],
    "camera department": "Vijay Mishra",
    "miscellaneous": [
        "Thirsty Fish",
        "Ajay Phutane"
    ],
    "akas": "Bokya Satbande (India)",
    "writer": [
        "Raj Pendurkar",
        "Dilip Prabhawalkar"
    ],
    "director": "Raj Pendurkar",
    "production companies": "Nishad Audio Visuals",
    "distributors": "Video Palace",
    "plot": [
        "The adventures of a ten-year-old boy are chronicled in this movie, based on a series of books by Dilip Prabhavalkar.",
        "\"_Bokya Satbande_ (qv)\" is a naughty and mischievous seven year old boy. Once while playing cricket he accidentally hits the ball into an old couple's - the \"Belwandi's\" apartment. Their only son has settled in the US years ago. Though he is reprimanded \"Bokya\" admits that he'll continue to play but will be careful that his game doesn't bother anyone. The old couple take an immediate liking for this mischievous but honest little boy. \"Bokya\" begins to run errands for them and helps fills a void in their life. He even convinces his brother to act as their grandson. The story takes us through the various activities of \"Bokya\" and his friends during their school vacation which along with fun and games also includes several noble and brave deeds."
    ]
}