{
    "id": "3778178",
    "localized title": "Houseful",
    "cast": [
        "Prasenjit Chatterjee",
        "Rimjhim Gupta",
        "Sreelekha Mitra",
        "Nitya Ganguly",
        "Rwita Datta Chakraborty",
        "Rashaana Shah",
        "Arthur Benjamins"
    ],
    "genres": "Drama",
    "runtimes": "127",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "bn"
    ],
    "color info": "Color",
    "original air date": "2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzc4NGVhZmItOWZmNC00MzBkLThhMGEtMDYyNzUxNGViMzkyXkEyXkFqcGdeQXVyNjA3OTI5MjA@._V1_SY150_CR60,0,101,150_.jpg",
    "imdbID": "3778178",
    "plot outline": "Nikhil Banerjee's films are a disaster at the box office and at the festival circuit. Yet, he watches his own film at an empty theatre as the theatre owner threatens to pull the film away on the day following its release. Creditors make threatening calls and a bank's henchmen cart his car away as he remains silent, carrying cans of his film from the theatre in local trains with his distributor for company. As he bags a shady producer for his new film on the condition that he will have to cast the girl the producer tells him to, he discovers to his surprise, that the story of his earlier film is actually being replicated in real life.",
    "languages": [
        "Hindi",
        "Bangla"
    ],
    "title": "Houseful",
    "kind": "movie",
    "directors": "Bappaditya Bandopadhyay",
    "writers": [
        "Bappaditya Bandopadhyay",
        "",
        "Neel Sarkar"
    ],
    "producers": [
        "Debashish Saha",
        "Seema Saha"
    ],
    "composers": "Kaya Ki Band",
    "cinematographers": "Bappaditya Bandopadhyay",
    "editors": "Dipak Mandal",
    "assistant directors": "Rakasree Basu",
    "music department": [
        "Abhijit Basu",
        "Kaya Ki Band"
    ],
    "akas": "Houseful (India)",
    "writer": [
        "Bappaditya Bandopadhyay",
        "Neel Sarkar"
    ],
    "director": "Bappaditya Bandopadhyay",
    "plot": [
        "Nikhil Banerjee's films are a disaster at the box office and at the festival circuit.",
        "Nikhil Banerjee's films are a disaster at the box office and at the festival circuit. Yet, he watches his own film at an empty theatre as the theatre owner threatens to pull the film away on the day following its release. Creditors make threatening calls and a bank's henchmen cart his car away as he remains silent, carrying cans of his film from the theatre in local trains with his distributor for company. As he bags a shady producer for his new film on the condition that he will have to cast the girl the producer tells him to, he discovers to his surprise, that the story of his earlier film is actually being replicated in real life.::anonymous",
        "Nikhil (Prosenjit Chatterjee), the battling overseer associated with Bengali artwork movies is within serious straits in the end their movie washout and also the cinemas won't display their movies. Their individual existence is actually sin shambles as well as he's defaulted upon a number of their obligations. Their helper requires him to create an industrial movie about the outlines of the Tamil movie to bring back their profession. He chooses towards this for the moment as well as chooses to create their own movie through switching maker themselves because he's were able to persuade their dad in order to home loan their property.He gets the phone from the guy eventually that choose to supply him or her having a financier, however in come back he or she would need to have a heroine from the man's option. Nikhil concurs plus they begin capturing using the woman Sujata much better referred to as Nandita (Rimjhim Gupta). A number of explosions occur within the town and also the primary charged Subhash that experienced supplied Nikhil using the financial as well as he's additionally Sujata's sweetheart. Sujata can also be imprisoned within because of span of period which movie additionally fulfills using exactly the same destiny such as their additional movies. Nikhil lastly chooses to create an industrial movie about the outlines of the Tamil movie.::Swarup Basak"
    ]
}