{
    "id": "0256719",
    "localized title": "Devadasu",
    "cast": [
        "Akkineni Nageshwara Rao",
        "Savitri",
        "S.V. Ranga Rao",
        "Seeta Rama Anjaneyulu Chilakalapudi",
        "Lalita",
        "Doraiswamy",
        "Satyanarayana Aarani",
        "Sivaram Peketi",
        "Nageswara Rao R.",
        "Chandrakumari",
        "Bellary Lalitha",
        "Sitaram",
        "Narasimha Rao Kanchi",
        "Sudhakar"
    ],
    "genres": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "runtimes": "191",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Black and White",
    "aspect ratio": "1.37 : 1",
    "sound mix": "Mono",
    "certificates": [
        "India:U",
        "United States:Not Rated"
    ],
    "original air date": "26 Jun 1953 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTc0MzdlNjQtNTAwOS00MTUxLTkwODQtNWQ2YTZkYmQxMGFkXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0256719",
    "plot outline": "It's a Telugu adaptation of Sharat Chandra chatterjee famous novel Devdas. It's eternal love story between Devadasu (ANR) and Parvathi(Savithri). Devadasu son of a landlord is a egoistic and spoiled brat from childhood itself. Due to his mischievous acts he will be sent to Britain for higher studies. After coming back from foreign he meets paru aka parvathi feels attraction. Due to social status differences Paru's parents were forced to fix marriage with a Zamindar widower with 5 children. Paru approaches Devdas for eloping from home, Devdas a fickle minded person cannot go against his father's wish and traditions. Paru marriages a old widower whose daughter is elder than his daughter. Paru takes responsibility of the family n streamlined everything. Devdas starts missing Paru under the influence of a friend becomes alcoholic and comes in touch with prostitute Chandrakala. Chandrakala understands the pain of devdas and she loves him wholeheartedly. Due to his father's death, his elder brother throws Devdas out of home. As Devdas suffering from TB, he understands that end is near. For last time he wants to see Paru on the way he dies as an unknown person. As Paru's husband is village head, msg reaches him that a person named Devdasu from another village died in his village limits. Coincidentally Paru listening this news becomes hysteric and rushes to see him. Feeling some thing wrong Paru's husband orders to close the main entrance of the palace. In the running Paru's head hits the door and dies on the spot. It's classic example of a love birds whose life ruined by prevailing social conditions between rich and poor and false prestige issue",
    "languages": "Telugu",
    "title": "Devadasu",
    "kind": "movie",
    "directors": "Vedantam Raghavaiah",
    "writers": [
        "Saratchandra Chatterjee",
        "",
        "Samudrala Raghavacharya"
    ],
    "producers": [
        "Subburaman C.R.",
        "Narayana D.L.",
        "Samudrala Raghavacharya",
        "Vedantam Raghavaiah"
    ],
    "composers": "Subburaman C.R.",
    "cinematographers": "Ranga B.S.",
    "editors": "Narayana",
    "art directors": "Godgaonkar",
    "make up department": "Mangayya",
    "music department": [
        "Krishnaveni Jikki",
        "Rani K.",
        "Balasaraswathi Raavu",
        "Ghantasala Venkateswara Rao",
        "M.S. Viswanathan"
    ],
    "akas": "Devadasu (India)",
    "writer": [
        "Saratchandra Chatterjee",
        "Samudrala Raghavacharya"
    ],
    "director": "Vedantam Raghavaiah",
    "production companies": "Vinoda Pictures",
    "other companies": "H.M.V.",
    "plot": [
        "Adapted from a popular Bengali novel, _Devadasu_ (qv) narrates the story of a rich guy and poor girl separated by class system of India. Parvati is forcefully married off to a middle-aged rich man and _Devadasu_ (qv) becomes a drunkard.",
        "It's a Telugu adaptation of Sharat Chandra chatterjee famous novel Devdas. It's eternal love story between _Devadasu_ (qv) (ANR) and Parvathi(Savithri). _Devadasu_ (qv) son of a landlord is a egoistic and spoiled brat from childhood itself. Due to his mischievous acts he will be sent to Britain for higher studies. After coming back from foreign he meets paru aka parvathi feels attraction. Due to social status differences Paru's parents were forced to fix marriage with a Zamindar widower with 5 children. Paru approaches Devdas for eloping from home, Devdas a fickle minded person cannot go against his father's wish and traditions. Paru marriages a old widower whose daughter is elder than his daughter. Paru takes responsibility of the family n streamlined everything. Devdas starts missing Paru under the influence of a friend becomes alcoholic and comes in touch with prostitute Chandrakala. Chandrakala understands the pain of devdas and she loves him wholeheartedly. Due to his father's death, his elder brother throws Devdas out of home. As Devdas suffering from TB, he understands that end is near. For last time he wants to see Paru on the way he dies as an unknown person. As Paru's husband is village head, msg reaches him that a person named Devdasu from another village died in his village limits. Coincidentally Paru listening this news becomes hysteric and rushes to see him. Feeling some thing wrong Paru's husband orders to close the main entrance of the palace. In the running Paru's head hits the door and dies on the spot. It's classic example of a love birds whose life ruined by prevailing social conditions between rich and poor and false prestige issue::Sarath Chandra",
        "_Devadasu_ (qv) and Parvati love each other. But their relationship is not accepted. So Parvati marries another person. So _Devadasu_ (qv) becomes a drunkard. One day on his way to meet Parvati for one last time, he dies. Knowing this, Parvathi dies too.::Samrudh David",
        "_Devadasu_ (qv), the son of Ravulapalle Zamindar Narayana Rao, and Parvati, the daughter of his poor neighbor Neelakantham, are childhood friends. The friendship turns into love when _Devadasu_ (qv) returns to the village after completing his education. Narayana Rao rejects the marriage proposal and the enraged Neelakantham vows to marry her off to a wealthier bridegroom. Neelakantham arranges Parvati's marriage with Zamindar of Durgapuram, an elderly widower with children. Parvati requests _Devadasu_ (qv) to marry her but he sends her away unable to go against his father's wishes. Parvati marries Zamindar and _Devadasu_ (qv) becomes despondent. His friend, Bhagawan, encourages him to become alcoholic and introduces him to a prostitute, Chandramukhi. While Parvati tries to settle in her new house, _Devadasu_ (qv) goes on a path of self-destruction. On the advice of Chandramukhi, he leaves for village but visits Durgapuram and breathes his last in front of her house to keep his promise to visit her before his death. The heartbroken Parvati rushes to see him but is not allowed by her family and she collapses."
    ]
}