{
    "id": "0363787",
    "localized title": "Mahaguru",
    "cast": [
        "Rajinikanth",
        "Meenakshi Sheshadri",
        "Rakesh Roshan",
        "Nirupa Roy",
        "Gulshan Grover",
        "Kader Khan",
        "Shafi Inamdar",
        "Shubha Khote",
        "Jeetendra",
        "Sridevi",
        "Raj Kishore"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Crime",
        "Drama"
    ],
    "runtimes": "92",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "ta"
    ],
    "color info": "Color",
    "sound mix": "Mono",
    "certificates": "United States:Not Rated",
    "original air date": "26 Apr 1985 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjc5ZDE5ZjctNzkzZC00Y2U0LWJlZDEtNmQ2N2I3ZjQyM2QxXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0363787",
    "plot outline": "Naag Raj Darbari and his associate Shyam Kumar Talwari rule over a small community in India with an iron hand. When former military officer, Subhash, comes home to his mother and sister, he is appalled at the conditions that the community is living in, and decides to do everything possible to improve their lot. This gets him in the bad books of Darbari and Talwari, who recruit a hit-man named Mahaguru to deal with Subhash. Mahaguru confronts Subhash, and severely beats him up, resulting in Subhash being crippled for life. Shortly thereafter, Mahaguru rescues Subhash's sister from some men who were molesting her. Village belle Basanti, a close friend of Subhash, decides to have a go at turning Mahaguru around. She starts a friendship with him, finds out his name is really Vijay, and he does respond positively and becomes attracted to her. This leaves Subhash free to assist the community, thus angering Darbari and Talwari all the more. They abduct Subhash and hold him prisoner, and then instruct Mahaguru to do away with him. Will Basanti's influence change Mahaguru? Or will he just act for anyone who gives him money?",
    "languages": [
        "Hindi",
        "Tamil"
    ],
    "title": "Mahaguru",
    "kind": "movie",
    "directors": "S.S. Ravichandra",
    "writers": [
        "Gyandev Agnihotri",
        "",
        "Indivar",
        "",
        "Kader Khan",
        "",
        "Ravi"
    ],
    "producers": [
        "U.S.N. Babu",
        "K.C.N. Chandrasekhar",
        "Y. Kannaiah"
    ],
    "composers": "Bappi Lahiri",
    "cinematographers": "D. Prasad Babu",
    "editors": "Gopal Rao K.",
    "stunts": "Fefsi Vijayan",
    "camera department": "Manasathyam",
    "music department": [
        "Asha Bhosle",
        "Amit Kumar",
        "Kishore Kumar",
        "Shabbir Kumar",
        "Manhar Udhas"
    ],
    "miscellaneous": [
        "P. Babji",
        "N. Sreenivas"
    ],
    "akas": "Rajaguru (India, Tamil title)",
    "writer": [
        "Gyandev Agnihotri",
        "Indivar",
        "Kader Khan"
    ],
    "director": "S.S. Ravichandra",
    "production companies": "Krishna Arts Combines",
    "plot": "Naag Raj Darbari and his associate Shyam Kumar Talwari rule over a small community in India with an iron hand. When former military officer, Subhash, comes home to his mother and sister, he is appalled at the conditions that the community is living in, and decides to do everything possible to improve their lot. This gets him in the bad books of Darbari and Talwari, who recruit a hit-man named _Mahaguru_ (qv) to deal with Subhash. _Mahaguru_ (qv) confronts Subhash, and severely beats him up, resulting in Subhash being crippled for life. Shortly thereafter, _Mahaguru_ (qv) rescues Subhash's sister from some men who were molesting her. Village belle Basanti, a close friend of Subhash, decides to have a go at turning _Mahaguru_ (qv) around. She starts a friendship with him, finds out his name is really Vijay, and he does respond positively and becomes attracted to her. This leaves Subhash free to assist the community, thus angering Darbari and Talwari all the more. They abduct Subhash and hold him prisoner, and then instruct _Mahaguru_ (qv) to do away with him. Will Basanti's influence change _Mahaguru_ (qv)? Or will he just act for anyone who gives him money?::rAjOo (gunwanti@hotmail.com)"
}