{
    "id": "0459605",
    "localized title": "Eklavya",
    "cast": [
        "Amitabh Bachchan",
        "Saif Ali Khan",
        "Sanjay Dutt",
        "Vidya Balan",
        "Jackie Shroff",
        "Boman Irani",
        "Jimmy Shergill",
        "Raima Sen",
        "Sharmila Tagore",
        "Parikshit Sahni",
        "Adhir Bhat",
        "Swanand Kirkire",
        "Mita Vashisht"
    ],
    "genres": [
        "Action",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "105",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:M",
        "India:U",
        "Ireland:PG",
        "New Zealand:M",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "16 Feb 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2FiM2YzMGMtNzhhZS00N2E3LWI3MDEtNzAxODIxNWY5ZTkzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0459605",
    "plot outline": "It has been chronicled in the Geeta that Eklavya wanted to be Sage Dronacharya's disciple in order to excel at bow and arrow shooting, but was refused because of his low caste. He decided to teach himself, and did excel to such an extent that Dronacharya felt threatened that he would beat his ace disciple, Arjun, so he asked Eklavya for his fee - his right thumb, which Eklavya dutifully cut off and presented it to his Guru. Now in modern India, Nishab, whose father was Eklavya, who gave his life trying to protect his master, has now been re-named Eklavya himself, and has been entrusted to guard the lives of Rana Jaywardhan, Ranimaa Suhasinidevi, and their children, Harsh and Nandini, will be called upon to pay the ultimate price, after he learns that his master, the Rana, has been killed. Eklavya, who also carries a dark family secret, slays the two assailants of the Rana, but then in the process also finds out that th! e one who hired them is his very own son. What will prevail - duty or the love of his son?",
    "languages": "Hindi",
    "title": "Eklavya: The Royal Guard",
    "kind": "movie",
    "directors": "Vidhu Vinod Chopra",
    "writers": [
        "Vidhu Vinod Chopra",
        "",
        "Abhijat Joshi",
        "",
        "Swanand Kirkire"
    ],
    "producers": [
        "Vidhu Vinod Chopra",
        "Vir Chopra",
        "Anil Davda",
        "Rajkumar Hirani",
        "Ajay Sharma"
    ],
    "composers": "Shantanu Moitra",
    "cinematographers": "Nataraja Subramanian",
    "editors": "Rabiranjan Maitra",
    "editorial department": [
        "Rajib Biswas",
        "Rohan Desai",
        "Rachel Reuben"
    ],
    "production designers": "Nitin Chandrakant Desai",
    "costume designers": [
        "Subarna Ray Chaudhuri",
        "Raghavendra Rathore"
    ],
    "make up department": [
        "Vidyadhar Bhatte",
        "Yogesh Yewale"
    ],
    "production managers": [
        "Sayed Ashfaque",
        "Parshuram Mane"
    ],
    "assistant directors": [
        "Tania Bath",
        "Mithun Gangopadhyay",
        "Ajay Kumar",
        "Gautam Parvi",
        "Michael Remedios"
    ],
    "art department": [
        "Eknath Kadam",
        "Mitali Mahajan"
    ],
    "sound department": [
        "Andrew Belletty",
        "Bishwadeep Chatterjee",
        "Bruce Emery",
        "Leslie Fernandes",
        "Shashi Kasare",
        "Vijay Kumar",
        "Paul Pirola",
        "Ajit Singh Rathore",
        "Sachin K. Sanghvi",
        "Roger Savage",
        "Karnail Singh"
    ],
    "visual effects": [
        "Vishal Bengare",
        "Danish Davis",
        "Chetan Gaur",
        "Sandesh Gawali",
        "Ranjit Gosavi",
        "Rohinton Irani",
        "Tarun Kripalani",
        "P. Mohan",
        "Prashant Nair",
        "Prasad Patel",
        "Susheel Peris",
        "Sumant Rao",
        "Ranadheer Reddy",
        "Kaushal Shah",
        "Raghvendra Shrivastava",
        "Jagdeep Singh",
        "Dinesh Solanki",
        "Prasad Sutar",
        "Yatin Tamhane",
        "Griboshin V.C.",
        "Jitendra Vaghani",
        "Pankaj Kalbende"
    ],
    "stunts": [
        "James Barla",
        "Kishore Verma",
        "Tinnu Verma"
    ],
    "animation department": "Chetan Sharma",
    "casting department": "Saad Mansoor",
    "costume departmen": "Subarna Ray Chaudhuri",
    "location management": "Shalendra Suwalka",
    "music department": [
        "Pranab Biswas",
        "Daniel B. George",
        "Hamsika Iyer",
        "Swanand Kirkire",
        "Sonu Nigam",
        "Ravindra Sathe"
    ],
    "script department": [
        "Supriya Kelkar",
        "Sheena Parikh"
    ],
    "miscellaneous": [
        "Vinod Bhalla",
        "Savyna Indranee Darby",
        "Sam S Fernandes",
        "Vijay Iyer",
        "Supriya Kelkar",
        "Kiran Magham",
        "Rajesh Pandey",
        "Pradeep Sarkar",
        "Chetan Sharma",
        "Tom Thudiyanplackal"
    ],
    "thanks": [
        "Vikram Chandra",
        "Shah Rukh Khan",
        "Gayatri Rao",
        "Steven Saschen"
    ],
    "akas": [
        "Yagna (India, Hindi title)",
        "Eklavya: The Royal Guard (United States)",
        "The Royal Guard (United States)",
        "Eklavya - Der königliche Wächter (Germany)",
        "A Guarda Real (Brazil)"
    ],
    "writer": [
        "Vidhu Vinod Chopra",
        "Abhijat Joshi",
        "Swanand Kirkire"
    ],
    "director": "Vidhu Vinod Chopra",
    "production companies": "Vinod Chopra Productions",
    "distributors": [
        "Eros Worldwide",
        "AMC Entertainment",
        "Lionsgate Home Entertainment"
    ],
    "special effects": "Animagic Special Effects",
    "plot": [
        "As the kingdom of Devigarh comes apart at the seams, an aging bodyguard attempts to protect the Royal Family, as well as keep its darkest secrets from ever coming to light.",
        "It has been chronicled in the Geeta that Eklavya wanted to be Sage Dronacharya's disciple in order to excel at bow and arrow shooting, but was refused because of his low caste. He decided to teach himself, and did excel to such an extent that Dronacharya felt threatened that he would beat his ace disciple, Arjun, so he asked Eklavya for his fee - his right thumb, which Eklavya dutifully cut off and presented it to his Guru. Now in modern India, Nishab, whose father was Eklavya, who gave his life trying to protect his master, has now been re-named Eklavya himself, and has been entrusted to guard the lives of Rana Jaywardhan, Ranimaa Suhasinidevi, and their children, Harsh and Nandini, will be called upon to pay the ultimate price, after he learns that his master, the Rana, has been killed. Eklavya, who also carries a dark family secret, slays the two assailants of the Rana, but then in the process also finds out that th! e one who hired them is his very own son. What will prevail - duty or the love of his son?::rAjOo (gunwanti@hotmail.com)",
        "Contemporary India. A majestic fort. A royal dynasty that no longer rules. A king without a kingdom. Yet Eklavya (Amitabh Bachchan), their royal guard, lives in a time warp. He lives only to protect the fort, the dynasty, and the king. For nine generations Eklavya's family has protected Devigarh, a centuries old citadel in Rajasthan. His marksmanship is stuff of legends. His unflinching loyalty inspires ballads. Eklavya has spent his entire life serving the royals and closely guarding their secrets but now he's getting old and increasingly blind. Unable to cope with the suffocating customs of his land, the heir, Prince Harshwardhan (Saif Ali Khan), has stayed away in London. But the sudden demise of the queen, Rani Suhasinidevi (Sharmila Tagore), forces the Prince back to the kingdom he had left behind. The Prince's return brings a rush of joy into the moribund fort. His mentally challenged twin sister, Princess Nandini (Raima Sen) and his childhood love Rajjo (Vidya Balan) are delighted to see him. But the joy of reunion is short-lived. There is unrest in the kingdom: Farmers are being stripped of their lands. The king, Rana Jaywardhan (Boman Irani), influenced by his brother, Rana Jyotiwardhan (Jackie Shroff), supports the atrocities being forced upon the helpless peasants. The king receives a death threat over the phone. An irreverent police officer, Pannalal Chohar (Sanjay Dutt), is called in to investigate. But he might be too late. The fragile peace of the land is suddenly shattered by a barrage of bullets. And amidst the mayhem, the safely guarded secrets of the fort are unveiled. What follows is a contemporary, edge-of-the-seat dramatic action thriller with a stellar ensemble cast - Amitabh Bachchan, Sanjay Dutt, Saif Ali Khan, Vidya Balan, Boman Irani, Jackie Shroff, Jimmy Sheirgill, Raima Sen and Sharmila Tagore. The film marks the return of Vidhu Vinod Chopra who directs after a hiatus of seven years::Vinod Chopra Films"
    ],
    "synopsis": "Contemporary India. A majestic fort. A royal dynasty that no longer rules. A king without a kingdom.Yet Eklavya (Amitabh Bachchan), their royal guard, lives in a time warp. He lives only to protect the fort, the dynasty, and the king.For nine generations Eklavyas family has protected Devigarh, a centuries old citadel in Rajasthan. His marksmanship is stuff of legends. His unflinching loyalty inspires ballads. Eklavya has spent his entire life serving the royals and closely guarding their secrets but now hes getting old and increasingly blind. Unable to cope with the suffocating customs of his land, the heir, Prince Harshwardhan (Saif Ali Khan), has stayed away in London. But the sudden demise of the queen, Rani Suhasinidevi (Sharmila Tagore), forces the Prince back to the kingdom he had left behind.The Princes return brings a rush of joy into the moribund fort. His mentally challenged twin sister, Princess Nandini (Raima Sen) and his childhood love Rajjo (Vidya Balan) are delighted to see him. But the joy of reunion is short-lived.There is unrest in the kingdom: Farmers are being stripped of their lands. The king, Rana Jaywardhan (Boman Irani), influenced by his brother, Rana Jyotiwardhan (Jackie Shroff), supports the atrocities being forced upon the helpless peasants. The king receives a death threat over the phone. An irreverent police officer, Pannalal Chohar (Sanjay Dutt), is called in to investigate. But he might be too late. The fragile peace of the land is suddenly shattered by a barrage of bullets. And amidst the mayhem, the safely guarded secrets of the fort are unveiled.What follows is a contemporary, edge-of-the-seat dramatic action thriller with a stellar ensemble cast Amitabh Bachchan, Sanjay Dutt, Saif Ali Khan, Vidya Balan, Boman Irani, Jackie Shroff, Jimmy Sheirgill, Raima Sen and Sharmila Tagore. The film marks the return of Vidhu Vinod Chopra who directs after a hiatus of seven years."
}