{
    "id": "0807758",
    "localized title": "Partner",
    "cast": [
        "Salman Khan",
        "Govinda",
        "Lara Dutta",
        "Katrina Kaif",
        "Rajpal Naurang Yadav",
        "Ali Haji",
        "Dalip Tahil",
        "Aarti Chhabria",
        "Puneet Issar",
        "Deepshikha Nagpal",
        "Suresh Menon",
        "Atul Parchure",
        "Tiku Talsania",
        "Ali Asgar",
        "Rajat Bedi",
        "Shashi Kiran",
        "Razak Khan",
        "Howard Rosemeyer",
        "Madhav Moghe",
        "Vindu Dara Singh",
        "Payal",
        "Ameya Pandya",
        "Supreet Bedi",
        "Bhupindder Bhoopii",
        "Salim Khan Ding-Dong",
        "Gulnaaz Khan",
        "Mumait Khan",
        "Shree Rammy Pandey",
        "Teena Paradkar",
        "Jason Shah",
        "Sujeet Kumar Sharma",
        "Himanshu Tanna"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "France:Tous publics",
        "India:UA",
        "Ireland:PG",
        "New Zealand:PG",
        "South Africa:PG",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "20 Jul 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzMwMWY2Y2YtZGExMi00ZTAzLWI0MWItMjNhNWFmNmI2MzAyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0807758",
    "plot outline": "The only male child in the family that sired six daughters, Prem has empathy towards the fair sex and decides to assist males to woo women so much so that he becomes popular as the 'Love Guru'. Amongst the men he assists are Bhaskar Chaudhry and Neil Bakshi. Klutz-like Bhaskar has fallen head over heels with his boss, a model and heiress, Priya Jaisingh. A disbelieving Prem refuses to assist him, but subsequently relents. Bhaskar uses his own charm to woo Priya successfully, and is introduced to her dad, Raj. Prem himself falls in love with a widowed single mother, Naina Shahani, a Journalist. Both men are satisfied with her respective lives not knowing that a scandalous secret will surface in the media - changing their lives forever.",
    "languages": "Hindi",
    "title": "Partner",
    "kind": "movie",
    "directors": "David Dhawan",
    "writers": [
        "Shabbir Ahmed",
        "",
        "Sanjay Chhel",
        "",
        "David Dhawan",
        "",
        "Yunus Sajawal",
        "",
        "Jalees Sherwani"
    ],
    "producers": [
        "Sanjay Ahluwalia",
        "Sohail Khan",
        "Zia Khan",
        "Kulthep Narula",
        "Parag Sanghvi"
    ],
    "composers": [
        "Sajid Ali",
        "Wajid Ali",
        "Salim Merchant"
    ],
    "cinematographers": [
        "Aamir Lal",
        "Johny Lal"
    ],
    "editors": "Nitin Rokade",
    "editorial department": "Rohan Desai",
    "production designers": [
        "Sailesh Mahadik",
        "Imran Manzoor",
        "Sheetal"
    ],
    "costume designers": [
        "Theia Bomanbehran",
        "Alvira Khan",
        "Shadab Malik",
        "Pooja Sarin",
        "Theia Tekchandaney"
    ],
    "production managers": [
        "Mohan Ballary",
        "Sachin Kesarkar",
        "Adil Shah Nawaz Khan",
        "Dilawar Singh Rana",
        "Prakash Uchil"
    ],
    "assistant directors": [
        "Rohit Dhawan",
        "Umesh Ghadge",
        "Karishma Mehta",
        "A.K. Rana",
        "Alok Upadhyay"
    ],
    "art department": "Abhijit Khatu",
    "sound department": [
        "Abhijit Deo",
        "Boloy Kumar Doloi",
        "Leslie Fernandes",
        "Parikshit Lalwani",
        "Kunal Mehta",
        "Tushar Pandit",
        "Dipesh Patel",
        "Umesh Patel",
        "Anand Pawar",
        "Joe Rodrigues",
        "Shankar Singh"
    ],
    "special effects": "Babu Tyagi",
    "visual effects": [
        "Shrinath Agrawal",
        "Dwivedi Amit",
        "Vishal Bengare",
        "Parminder Singh Chadda",
        "Prince Chaurasia",
        "Santosh Choudhary",
        "Danish Davis",
        "Rohan Desai",
        "Chetan Gaur",
        "Vivek Gaur",
        "Sandesh Gawali",
        "Somesh Ghosh",
        "Rohinton Irani",
        "Sandeep Kamal",
        "Vishal Kapoor",
        "Debabrata Maity",
        "Abrez Mohammed",
        "Rahul Mullick",
        "Vikas Surajbali Nag",
        "Kunjan Oza",
        "Hiren Patel",
        "Prasad Patel",
        "Virendra Prajapati",
        "Roby Raj",
        "Reupal D. Rawal",
        "Rohit Sardesai",
        "Mayank Shrivastava",
        "Raghvendra Shrivastava",
        "Dinesh Singh",
        "Sunny Singh",
        "Yashmit Singh",
        "Dinesh Solanki",
        "Merzin Tavaria",
        "Sumit Verma",
        "Rahul Vishwakarma",
        "Kinjal Vora"
    ],
    "stunts": [
        "Daniel O'Neill",
        "Mahendra Verma"
    ],
    "camera department": [
        "Rubb Bhungdawala",
        "Biswanath Pattanaik"
    ],
    "animation department": "Sridhar Neelkantan",
    "location management": "Islam Yahia",
    "music department": [
        "Sajid Ali",
        "Wajid Ali",
        "Sunidhi Chauhan",
        "Sanjay Chhel",
        "Kunal Ganjawala",
        "Labh Janjua",
        "Udit Narayan",
        "Sonu Nigam",
        "Shweta Pandit",
        "Sneha Pant",
        "Shaan",
        "Sandeep Shirodkar"
    ],
    "miscellaneous": [
        "Vinod Bhalla",
        "Pankaj Chaturvedi",
        "R. Dee",
        "Caesar Gonsalves",
        "Zia Khan",
        "Pankaj Kothari",
        "Bosco Martis",
        "Mahadeo Mogre",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Binny Padda",
        "Ravi Padda",
        "Siddharth Pande",
        "Naveen Parmar",
        "Vinay Rajput",
        "Raka",
        "Ajay Singh",
        "Roshan Singh",
        "Ranju Varghese",
        "Abhishek D Bhola"
    ],
    "thanks": "Jawahar Kotwani",
    "akas": "Партнер (Russia)",
    "writer": [
        "Shabbir Ahmed",
        "Sanjay Chhel",
        "David Dhawan"
    ],
    "director": "David Dhawan",
    "production companies": [
        "Eros Worldwide",
        "K Sera Sera",
        "Sohail Khan Production"
    ],
    "distributors": "K Sera Sera",
    "other companies": [
        "Benetone Films",
        "Glamsham.com",
        "Prime Focus",
        "Rocky S. Fashions"
    ],
    "plot": [
        "A 'Love Guru' assists other males, woos a widowed single mother, but becomes embroiled in controversies.",
        "The only male child in the family that sired six daughters, Prem has empathy towards the fair sex and decides to assist males to woo women so much so that he becomes popular as the 'Love Guru'. Amongst the men he assists are Bhaskar Chaudhry and Neil Bakshi. Klutz-like Bhaskar has fallen head over heels with his boss, a model and heiress, Priya Jaisingh. A disbelieving Prem refuses to assist him, but subsequently relents. Bhaskar uses his own charm to woo Priya successfully, and is introduced to her dad, Raj. Prem himself falls in love with a widowed single mother, Naina Shahani, a Journalist. Both men are satisfied with her respective lives not knowing that a scandalous secret will surface in the media - changing their lives forever.::rAjOo (gunwanti@hotmail.com)",
        "So engrossed in the female sex; Prem decides that he will assist his fellow males to successfully woo the girls they love and nick-name himself 'Love Guru'. Among the males he is currently assisting is Bhaskar Diwakar Chaudhry who has fallen head-over-heels in love with his female boss Priya Jaisingh. After a number of hilarious attempts Bhaskar does get Priya to accept him while Prem is in love with Naina Sahani; an activist. Both men attempt to get settled when scandalous news shattered their lives forever.::gavin (racktoo@hotmail.com)",
        "Prem (Salman Khan) likes to think he knows more about women than the average man. Growing up with six sisters made him more sensitive to the female psyche, and he's turned that experience into a successful career helping other men land the women of their dreams. One of his newest clients is Bhaskar (Govinda), who has fallen in love with his wealthy boss, Priya (Katrina Kaif). While helping Bhaskar, Prem develops feelings for Naina (Lara Dutta), a journalist who doubts his matchmaking skills.",
        "Prem is a Love Guru who solves out love problems of everyone. He meets Bhaskar Diwakar Chaudhary who comes to Prem for help in his love life. Bhaskar loves his boss Priya Jaisingh but unable to express his love to her as she is the daughter of a wealthy businessman. Prem initially refuses to help Bhaskar and goes to Thailand. Bhaskar follows him there and convinces him to help him. After coming back from Thailand, Prem meets Naina a photo journalist who was running from some gangsters led by Chhota Don, (who mimics Shah Rukh Khan in Don), Prem saves her and falls in love with her. Meanwhile he starts teaching Bhaskar how to impress Priya. But Bhaskar uses his own simplicity and non-sense acts to impress Priya. Priya finally falls in love with Bhaskar but does not disclose it to him. Prem comes to know from Bhaskar that Priya is getting married to someone according to her father's will. They both come to Priya's wedding ceremony with Naina and Priya's father is convinced by Bhaskar's acts. Priya now gets ready to marry Bhaskar. Meanwhile a spoiled brat named Neel comes to Prem for love help and he asks Prem to convince a girl for a one night stand. Prem gets angry with Neel and tells him that he does not help people who have such bad intentions. Neel somehow manages to get his one night stand and then ditches her, telling her the love guru gave him advice to do so. Unfortunately the girl turns out to be a friend of Naina's. Naina hates Prem for what he did to her friend and Naina started hating Prem and frames him and Bhaskar for ditching Priya. At last Prem makes up with Naina and Bhaskar patches up with Priya and they get married. On the honeymoon night Bhaskar again asks Prem for help but this time they both get mingled with their respective wives.::hEmRaJ (gavin_coolhgr@hotmail.com)"
    ],
    "synopsis": "Prem (Salman Khan) is a Love Guru who solves out love problems of everyone. He meets Bhaskar Diwakar Chaudhary (Govinda) who comes to Prem for help in his love life. Bhaskar loves his Boss Priya Jaisingh (Katrina Kaif) but unable to express his love to her as she is the daughter of a wealthy buisinessman. Prem initially refuses to help Bhaskar and goes to Thailand. Bhaskar followes him there and convinces him to help him.After coming back from Thailand, Prem meets Naina (Lara Dutta) a photo journalist who was running from some gangsters led by Chhota Don, who mimicks Shah Rukh Khan in Don, in one scene Rohan, Naina's child urinates on Chotta Don and is, at the end a big character in the story. (Rajpal Yadav). Prem saves her and falls in love with her. Meanwhile he starts teaching Bhaskar how to impress Priya. But Bhaskar uses his own simplicity and non-sense acts to impress Priya. Priya finally falls in love with Bhaskar but does not disclose it to him.Prem comes to know from Bhaskar that Priya is getting married to someone according to her father's will. They both come to Priya's wedding ceremony with Naina and Priya's father is convinced by Bhaskar's acts. Priya now gets ready to marry Bhaskar.Meanwhile a spoiled brat named Neil comes to Prem for love help and he asks Prem to convince a girl for a one night stand. Prem gets angry with Neel and tells him that he does not help people who have such bad intentions. Neel somehow manages to get his one night stand and then ditches her, telling her the love guru gave him advice to do so. Unfortunately the girl turns out to be a friend of Naina's. Naina hates Prem for what he did to her friend and Naina started hating Prem and frames him and Bhaskar for ditching Priya.At last Prem makes up with Naina and Bhaskar patches up with Priya and they get married. On the honeymoon night Bhaskar again asks Prem for help but this time they both get mingled with their respective wives."
}