{
    "id": "0811066",
    "localized title": "Shootout at Lokhandwala",
    "cast": [
        "Amitabh Bachchan",
        "Sanjay Dutt",
        "Suniel Shetty",
        "Arbaaz Khan",
        "Abhishek Bachchan",
        "Vivek Oberoi",
        "Tusshar Kapoor",
        "Rohit Roy",
        "Shabbir Ahluwalia",
        "Dia Mirza",
        "Amrita Singh",
        "Neha Dhupia",
        "Aditya Lakhia",
        "Ravi Gosain",
        "Aarti Chhabria",
        "Aftab Ahmed Khan",
        "Akhilendra Mishra",
        "Daya Shankar Pandey",
        "Shri Vallabh Vyas",
        "Nirmal Soni",
        "Vineet Kapoor",
        "Pramatesh Mehta",
        "Keerti Kapoor",
        "Naren Kumar",
        "Sarang Soni",
        "Aditi Bhatia",
        "Amit Singh Kharbanda",
        "Shakti Kumar",
        "Rakhi Sawant"
    ],
    "genres": [
        "Action",
        "Crime",
        "History"
    ],
    "runtimes": "122",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.20 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:MA15+",
        "Canada:18A::(Alberta)",
        "Canada:16+::(Quebec)",
        "India:A",
        "New Zealand:R16",
        "Singapore:NC16",
        "South Africa:16",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "25 May 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDNhNTI0NmItMzE0NS00ZDljLWI1YjktOGM0OTU5NjljZjFmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0811066",
    "plot outline": "On a calm summer day in 1991, in the bustling Lokhandwala Complex, five criminals including Maya and Dilip were counting 70 lakhs in flat no. 32 B, when 286 policemen, headed by ACP Khan, took strategic positions around their building. A gunfire ensued and the entire nation witnessed the most talked about daylight encounter lasting 6 hours that transformed suburban Mumbai into a virtual war zone. Shootout At Lokhandwala is the story of a seasoned cop, Khan, who chased Khalistani extremists, handpicked cops like Inspector Kaviraj Patil and Constable Javed Shaikh, and dared to engage trigger-happy gangsters in a residential locality of Mumbai. Khan's fight went beyond the encounter as he faced inquisition from his own department and legal charges of human rights violations. Shootout At Lokhandwala is the story of an upcoming underworld gangster, Maya, and his highly skilled partner, Dilip. The two made extortion the buzzword in the early 90s and dared to disobey the big bhai of the underworld, drawing the attention of Khan and his newly formed ATS squad. Both Khan and Maya were men obsessed, so devoted to their professions that their personal lives were a disaster.",
    "languages": "Hindi",
    "title": "Shootout at Lokhandwala",
    "kind": "movie",
    "directors": "Apoorva Lakhia",
    "writers": [
        "Apoorva Lakhia",
        "",
        "Suresh Nair",
        "",
        "Raj Vasant"
    ],
    "producers": [
        "Hanif Chunawala",
        "Sanjay Dutt",
        "Sanjay Gupta",
        "Ekta Kapoor",
        "Shobha Kapoor",
        "Dharam Oberoi",
        "Laxmi Singh",
        "Gary Van Shipley"
    ],
    "composers": [
        "Anand Raj Anand",
        "Biddu",
        "Euphoria",
        "Shibani Kashyap",
        "Mika Singh"
    ],
    "cinematographers": "R.J. Gururaj",
    "editors": "Bunty Nagi",
    "editorial department": [
        "Rohan Desai",
        "Sandeep Sethy"
    ],
    "production designers": "Sunil Nigvekar",
    "costume designers": "Theia Tekchandaney",
    "make up department": "Nitin Shitole",
    "production managers": [
        "Baylon Fonseca",
        "Kamal R. Mishra",
        "Abdullah Shaikh",
        "Ranjeet Upadhyay"
    ],
    "assistant directors": [
        "Gary Aranha",
        "Raul Aranjo",
        "Shawn Arranha",
        "Aditya Mandke",
        "Pretti Siingh",
        "Prachi Thadani"
    ],
    "art department": [
        "Ramakant Kanojia",
        "Abhijeet Lamture",
        "Mihir Shah"
    ],
    "sound department": [
        "Vikram Biswas",
        "Subir Kumar Das",
        "Anup Dev",
        "Udit Duseja",
        "Baylon Fonseca",
        "Vijay Kumar",
        "Kohinoor Mukherjee",
        "Karnail Singh"
    ],
    "special effects": "Babu Tyagi",
    "visual effects": [
        "Dwivedi Amit",
        "Amiteshwar Anand",
        "Prince Chaurasia",
        "Santosh Choudhary",
        "Vikas Surajbali Nag",
        "Anand Nayak",
        "Prasad Patel",
        "Roby Raj",
        "Tuhin Rana",
        "Mazdiar Santoke",
        "Rohit Sardesai",
        "Yashmit Singh"
    ],
    "stunts": [
        "Abdul Javed",
        "Javed Karim"
    ],
    "camera department": [
        "Rubb Bhungdawala",
        "Lalit Sahoo",
        "Rajendra Sharma",
        "Dhananjay Singh",
        "Kapil Verma"
    ],
    "costume departmen": "Jagruti Parmar",
    "music department": [
        "Salil Amrute",
        "Anand Raj Anand",
        "Biddu",
        "Sunidhi Chauhan",
        "Raman Dandyan",
        "Subir Kumar Das",
        "Aditya Dev",
        "Bhanuka Fernando",
        "Sanjay Gupta",
        "Faisal Kapadia",
        "Dev Kohli",
        "Anwar Maqsood",
        "Virag Mishra",
        "Malin Samarasekara",
        "Palash Sen",
        "Mika Singh",
        "Sukhwinder Singh"
    ],
    "script department": "Sachin Saraf",
    "miscellaneous": [
        "Nabeel Abbas",
        "Remo D'Souza",
        "Gautam Kohli",
        "Tanvi Modi",
        "Sahil Sai",
        "Jeet Singh"
    ],
    "akas": [
        "ラカンドワーラーの抗争 (Japan, Japanese title)",
        "Перестрелка в Локандвале (Russia)",
        "Shootout at Lokhandwala: Based on True Rumours"
    ],
    "writer": [
        "Apoorva Lakhia",
        "Suresh Nair",
        "Raj Vasant"
    ],
    "director": "Apoorva Lakhia",
    "production companies": [
        "Balaji Motion Pictures",
        "White Feather Films"
    ],
    "distributors": [
        "Bharat Entertainment International",
        "MG Distribution",
        "Raksha Entertainment",
        "White Feather Films"
    ],
    "other companies": "Movie Talkies",
    "plot": [
        "An account of the gangster Mahindra Dolas and his gang, which terrorized Mumbai City, and a massive war between Mumbai Police and gangs during 16 November 1991.",
        "On a calm summer day in 1991, in the bustling Lokhandwala Complex, five criminals including Maya and Dilip were counting 70 lakhs in flat no. 32 B, when 286 policemen, headed by ACP Khan, took strategic positions around their building. A gunfire ensued and the entire nation witnessed the most talked about daylight encounter lasting 6 hours that transformed suburban Mumbai into a virtual war zone. Shootout At Lokhandwala is the story of a seasoned cop, Khan, who chased Khalistani extremists, handpicked cops like Inspector Kaviraj Patil and Constable Javed Shaikh, and dared to engage trigger-happy gangsters in a residential locality of Mumbai. Khan's fight went beyond the encounter as he faced inquisition from his own department and legal charges of human rights violations. Shootout At Lokhandwala is the story of an upcoming underworld gangster, Maya, and his highly skilled partner, Dilip. The two made extortion the buzzword in the early 90s and dared to disobey the big bhai of the underworld, drawing the attention of Khan and his newly formed ATS squad. Both Khan and Maya were men obsessed, so devoted to their professions that their personal lives were a disaster.::Becca",
        "Shamsher S. Khan lives a wealthy lifestyle in Bombay along with his wife, Rohini, and school-going daughter, Heena, and is employed as the A.C.P. with Bombay Police. Encouraged by the Police Commissioner he forms the ATS (Anti-Terrorist Squad) during 1990, which is based on U.S.A.'s SWAT team, recruits Inspectors Kaviraj Patil and Javed Khan, as well as 27 other fit members from different Police Stations. After Operation Blue Star many Sikh terrorists fled to different parts of Bombay, including Antop Hill, Charkop, and Bhandup, and then began a reign of terror by abducting children from wealthy Sikh families, demanding high ransoms, and instilling fear amongst witnesses who never dared to report them to the Police. Then one day S.I. Abhishek Mhatre witnesses them carrying automatic weapons, challenges them, and is killed. Shamsher asks Mita Mattu, a TVN Reporter, to take live shots of himself and his team as they hunt down and kill Baldev Singh and his gang at Antop Hill. This media coverage makes him a hero overnight, and instills considerable fear in the underworld. But Shamsher and his team have a much bigger challenge ahead when two gangsters, Maya Dolas and Dilip Buva, owing allegiance to their Dubai-based boss, unite to extort money from wealthy businessmen, including Sidhwani and Wadhwani. Shamsher's efforts to force the duo to come into the open by pressurizing their respective families prove deadly as the duo end up threatening him, his family, as well as Javed's and Kaviraj himself. Shamsher is unable to apprehend the duo as they keep on changing their hideouts, but gets his break when he finds out that the duo, along with their associates, are holed up in Flat No.302, at the A Wing of Swati Building in Lokhwandwala Complex, in Andheri West off of Char Bungla. Hoping to trap and kill them, Shamsher enlists approximately 400 armed police officers - little knowing that his efforts to kill them will be hampered as the gangsters have a hostage, are armed with automatic weapons, including a rocket launcher, and that JCP Tripathi, will soon be reaching the site to instruct Shamsher to withdraw the entire operation, amidst allegations that Shamsher himself may have connections with Maya's Dubai-based boss.::rAjOo (gunwanti@hotmail.com)",
        "Mumbai. Organized Crime and gang violence are on an all-time high through the 1980s. Police and allied agencies are constantly finding it difficult to deal with the menace of new rising criminal operatives, prominent amongst them being Maya Dolas and Dilip Buwa. Answerable directly to their bosses in Dubai, Maya and Buwa are well armed, well financed and brutally adamant on reigning over Mumbai together. Enter ACP Shamsher Khan. Determined to bring down the entire armed crimes nexus, Khan, inspired by LAPD's SWAT division, creates the Anti-Terrorist Squad, assisted by his trusted lieutenants sharp shooter Inspector Kaviraj Patil and informants network specialist Head Constable Javed Sheikh. Slowly and steadily, ATS eliminates most of Maya's and Buwa's accomplices, leading to personal confrontations between the officers and their targets. It all comes to a head on 16th November, 1991 at Swati Building in Lokhandwala where Maya and Buwa have camped. Tipped off by informants, ATS takes strategic positions around Swati Building. Now it's the last opportunity for the ATS to eliminate Maya, since it's already under the knife of Human Rights organizations and failure would mean Maya and Buwa's continued reign of terror.::ankit-singh92",
        "Based on the shootout in Lokhhandwala 1992, when commissioner of police, Aftaab Ahmed Khan, shot Dawood Ibrahim's aides including Maya Dolas and Dilip Bua. This caused massive controversy after it was rumored that Dawood asked for the shootings to take revenge on his aides who has fallen out with him.::Kelli Eyres"
    ],
    "synopsis": "From director Apoorva Lakhia comes Shootout At Lokhandwala, a shocking, hypnotic look at a real-life disaster.On a calm summer day in 1991, in the bustling Lokhandwala Complex, five criminals including Maya and Dilip were counting 70 lakhs in flat no. 32 B, when 286 policemen, headed by ACP Khan, took strategic positions around their building. A gunfire ensued and the entire nation witnessed the most talked about daylight encounter lasting 6 hours that transformed suburban Mumbai into a virtual war zone.Shootout At Lokhandwala is the story of a seasoned cop, Khan, who chased Khalistani extremists, handpicked cops like Inspector Kaviraj Patil and Constable Javed Shaikh, and dared to engage trigger-happy gangsters in a residential locality of Mumbai. Khan's fight went beyond the encounter as he faced inquisition from his own department and legal charges of human rights violations. Shootout At Lokhandwala is the story of an upcoming underworld gangster, Maya, and his highly skilled partner, Dilip. The two made extortion the buzzword in the early 90s and dared to disobey the big bhai of the underworld, drawing the attention of Khan and his newly formed ATS squad. Both Khan and Maya were men obsessed, so devoted to their professions that their personal lives were a disaster.Shootout At Lokhandwala explores the personal obsessions and sacrifices of the two protagonists with absorbing insight, with some of the most riveting action sequences to be ever filmed."
}