{
    "id": "0814014",
    "localized title": "Apne",
    "cast": [
        "Dharmendra",
        "Sunny Deol",
        "Bobby Deol",
        "Shilpa Shetty Kundra",
        "Katrina Kaif",
        "Kirron Kher",
        "Victor Banerjee",
        "Jawed Sheikh",
        "Aryan Vaid",
        "Sanjeeb Banerjee",
        "Amman Batala",
        "Bhupindder Bhoopii",
        "Dolly Bindra",
        "Jonnie Brown",
        "Parvin Dabas",
        "Kurush Deboo",
        "Nishikant Dixit",
        "Divya Dutta",
        "Guddu",
        "Rajendra Gupta",
        "Gurinder Makna",
        "Erik Markus Schuetz",
        "Amrit Pal",
        "Jonathan Samson",
        "Kuldeep Sharma",
        "Glen David Short",
        "Manmeet Singh Sawhney",
        "Samar Jai Singh",
        "Marvina Vinique"
    ],
    "genres": [
        "Drama",
        "Sport"
    ],
    "runtimes": "173",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Canada:14A::(Alberta)",
        "Canada:G::(Quebec)",
        "Ireland:15A",
        "New Zealand:M",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "29 Jun 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzBmZDc3YTUtOTc0Yy00YmFhLWI0ZDMtOWQwNDQ3NTg5ODI3XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0814014",
    "plot outline": "Ex-boxer Baldev Choudhary has had a stain in his boxing career. He wanted to cleanse it with his son Angad's success, but times were hard and a financial crunch kept him from achieving this dream. Though Angad pulled through fine, Baldev never forgot who ruined his chance. An opportunity strikes Baldev in the form of a TV show. He trains a local boy to get onto this media-hyped boxing show, but is ditched for a better coach at the last minute. Baldev's younger son Karan has just launched his first album. Realizing his father is in a crisis, he gives up his dream of a musical career to get into boxing. Karan works hard and wins all through thinking that his victory will bring his family together. After winning within the nation, he wins all over the world. The final match is with the current world heavyweight champion.",
    "languages": "Hindi",
    "title": "Apne",
    "kind": "movie",
    "directors": "Anil Sharma",
    "writers": [
        "Neeraj Pathak",
        "",
        "Neeraj Pathak"
    ],
    "producers": [
        "Sangeetha Ahir",
        "Sahni Bob",
        "Bantoo Khanna",
        "Ganesh Nankoosingh",
        "Prashant Shah",
        "Anuj Sharma",
        "Sunil Sharma",
        "Rahul Sughand"
    ],
    "composers": "Himesh Reshammiya",
    "cinematographers": "Kabir Lal",
    "editors": "Ashfaq Makrani",
    "editorial department": [
        "Rohan Desai",
        "Shekhar Koditkar",
        "Preetam Naik",
        "Santosh Pawar"
    ],
    "art directors": "Sanjay Dhabade",
    "make up department": "Raju Naag",
    "production managers": "Ravi Singh",
    "assistant directors": [
        "Chris Anderson",
        "Balwinder Singh Janjua",
        "Hidayat Khan",
        "Gaurav Mishra",
        "Bhoopendra Raghhav",
        "Sachin Saraf",
        "A. Shital"
    ],
    "sound department": [
        "Nimish Chheda",
        "Sajjan Choudhary",
        "Leslie Fernandes",
        "Vijay Kumar",
        "Karnail Singh"
    ],
    "visual effects": [
        "Dwivedi Amit",
        "Anil",
        "Mahesh Baria",
        "Vishal Bengare",
        "Tanu Datta",
        "Chetan Gaur",
        "Sandesh Gawali",
        "Somesh Ghosh",
        "Rohinton Irani",
        "Kabir",
        "Sameer Malik",
        "Vikas Surajbali Nag",
        "Prasad Patel",
        "Virendra Prajapati",
        "Roby Raj",
        "Tuhin Rana",
        "Naina Sabrawal",
        "Raghvendra Shrivastava",
        "Dinesh Solanki",
        "Nitesh Sutrave",
        "Ashok Kumar Verma"
    ],
    "stunts": "Abbas Ali Moghul",
    "camera department": [
        "David Basu",
        "Akashdeep Pandey",
        "Harish Sandhu",
        "Bobby Sanivarapu",
        "B.K. Sivan",
        "Sandeep Tyagi"
    ],
    "casting department": "Jasbir Dhillon",
    "music department": [
        "Earl D'Souza",
        "Jayesh Gandhi",
        "Kunal Ganjawala",
        "Amrita Kak",
        "Akriti Kakar",
        "Pritesh Mehta",
        "Jaspinder Narula",
        "Sonu Nigam",
        "Himesh Reshammiya",
        "Sameer",
        "Shaan",
        "Aamir Shaikh",
        "Monty Sharma"
    ],
    "miscellaneous": [
        "Murli Chhatwani",
        "Jasbir Dhillon",
        "Hitesh Gandhi",
        "Ahmed Khan",
        "Pankaj Kothari",
        "Siddharth Pande"
    ],
    "akas": [
        "Ours (India, English title)",
        "Родные люди (Russia)"
    ],
    "writer": [
        "Neeraj Pathak",
        "Neeraj Pathak"
    ],
    "director": "Anil Sharma",
    "production companies": [
        "Glamour Entertainments Pvt. Ltd.",
        "Prime Focus",
        "Shantketan Films"
    ],
    "other companies": "Seek Red",
    "plot": [
        "A disgraced ex-boxer attempts to make his two sons champion boxers in order to clear his name. One son agrees with this goal, but the other does not, causing family conflicts.",
        "Ex-boxer Baldev Choudhary has had a stain in his boxing career. He wanted to cleanse it with his son Angad's success, but times were hard and a financial crunch kept him from achieving this dream. Though Angad pulled through fine, Baldev never forgot who ruined his chance. An opportunity strikes Baldev in the form of a TV show. He trains a local boy to get onto this media-hyped boxing show, but is ditched for a better coach at the last minute. Baldev's younger son Karan has just launched his first album. Realizing his father is in a crisis, he gives up his dream of a musical career to get into boxing. Karan works hard and wins all through thinking that his victory will bring his family together. After winning within the nation, he wins all over the world. The final match is with the current world heavyweight champion.::Raj Singh",
        "Indian-based boxer Baldev Singh Choudhary lives with his wife Raavi, daughter Pooja, and sons Angad and Karan. Baldev travels to the U.S to boost his boxing career, but unfortunately things don't go in his favor when he's placed before the court on drug charges and banned from boxing. Upon his return to India, Baldev attempts to redeem himself by coaching Angad in boxing, but Angad isn't interested; he doesn't consider boxing a profession or think it can sustain a family. Baldev loses faith in him. 10 years later, Baldev sees a chance in the form of a TV ad to coach a young aspiring boxer named Gaurav Ghera. Unfortunately, Guarav leaves him, and his younger son Karan, who lost the use of one arm in a childhood accident, to give up his music career for boxing. The qualifying match is with Gaurav; Karan manages to qualify himself, prompting his dad to take him to the U.S for the World Heavyweight Champion match facing runner-up Luca Gracia. Karan is badly bagged, severely injured and hospitalized. Angad then rises to the occasion to give his father the surprise of a lifetime.::gavin (racktoo@hotmail.com)",
        "Former boxer Baldev Chaudhary lives a retired life in his village in India. He was falsely accused of doping charges and had to quit the sport. He challenges that elder son Angad will win the boxing championship someday and regain his pride. Baldev trains Angad hard but he quits the sport in favor of supporting his family, creating a feud between father and son. Angad's younger son Karan can't step into the ring as one of his hands has been immobile since a childhood accident. Bladev gets a ray of hope when younger boxer Gaurav considers having him as a coach, and things are going well until Guarav ditches him for an International coach. Baldev's dreams are shattered again, but suddenly Karan's hand gets better, and he agrees to train for the boxing championship. He manages to reach the final match against the world heavyweight champion Luca Gracia, who manages to overcome him by cheating--and badly damages Karan's liver. Angad flies to the US where he finds from Karan how Luca cheated to win the match. Angad bashes Luca in public and challenges him to a match which would give the pride back to his family, much to chagrin of Baldev.::alex.mjacko@gmail.com",
        "Baldev Singh Choudhary lives a poor lifestyle in Kiratpur, Punjab with his wife Raavi, sons Angad and Karan, and daughter Pooja. His passion is boxing, so he virtually abandons his family and relocates to America. In his absence, Karan gets into an accident and ends up disabled, unable to use his left arm. The children grow up, Baldev returns home, after first being honored with a silver medal, but subsequently banned from boxing after testing positive for drug abuse. He swears to avenge this humiliation by training Angad to be a world-class boxer. But Angad has other plans, like building a house, opening his own business, getting Pooja married to U.S.-based Saket, and looking after his wife Simran and their son; he openly denounces boxing as a worthless sport. Embittered by his son's refusal, Baldev decides to find someone else, and he does: Gaurav Ghera. He enthusiastically trains Gaurav, only to be betrayed by him. How will Baldev avenge his humiliation?::rAjOo (gunwanti@hotmail.com)"
    ]
}