{
    "id": "0983990",
    "localized title": "1971",
    "cast": [
        "Manoj Bajpayee",
        "Ravi Kishan",
        "Deepak Dobriyal",
        "Kumud Mishra",
        "Manav Kaul",
        "Chittaranjan Giri",
        "Piyush Mishra",
        "Gyan Prakash",
        "Farida Dadi",
        "Satyajit Sharma",
        "Pramod Kapoor",
        "Pankaj Kalra",
        "Sunil Chauhan",
        "Sagar Saini",
        "Rao Devender",
        "Amrendra Sharma",
        "Nitinn Rana",
        "Aslam Khan",
        "Deepti Gupta",
        "Bikramjeet Kanwarpal",
        "Vivek Mushran",
        "Narinder Nina",
        "Pankaj Rathod",
        "Rajeev Sharma",
        "Yogi Singha",
        "Sanjeev Wilson"
    ],
    "genres": [
        "Action",
        "Drama",
        "War"
    ],
    "runtimes": "136",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:UA",
        "United Kingdom:12",
        "United States:PG-13"
    ],
    "original air date": "09 Mar 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDQyZWI4MjktZDNlYS00MDM1LWEzNzAtYTIyZDk4MTBkZjUwXkEyXkFqcGdeQXVyMzE0Njk1NjI@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0983990",
    "plot outline": "The story is set 6 years post 1971 Indo-Pak war, that culminated in the creation of Bangladesh. Despite winning the war, a large number of Indian Defence personnel have found themselves held captive in various jails in Pakistan and are faced with the fact that the Pakistani government denies their existence. International pressure has forced the Pakistani government to make changes in the way they treat the prisoners. In a very calculated move, the Pakistani army is ordered to assemble all the Indian prisoners of war in various Pakistani jails and transfer them to a secret location somewhere in the mountainous terrain of Pakistan. In the light of these events, Major Suraj Singh (Manoj Bajpyaee) along with Captain Jacob (Ravi Kishan), Captain Kabir(Kumud Mishra), Ft. Lt. Ram and Gurtu (Manav Kaul and Deepak Dobriyal) and Subedar Ahmad (Chittaranjan Giri) decide to escape the Pakistani POW establishment, in a daring attempt to reach India.",
    "languages": "Hindi",
    "title": "1971",
    "kind": "movie",
    "directors": "Amrit Sagar",
    "writers": "Piyush Mishra",
    "producers": [
        "Arjun Bagga",
        "Arun Govil",
        "Amrit Sagar",
        "Moti Sagar",
        "Neelam Sethi"
    ],
    "composers": "Akash Sagar Chopra",
    "cinematographers": "Chirantan Das",
    "editors": [
        "Shyam Salgaonkar",
        "Shyam K. Salgonkar"
    ],
    "editorial department": "Jespal Nadar",
    "casting directors": "Gufi Paintal",
    "art directors": "Mukesh Kalola",
    "costume designers": "Fabeha",
    "assistant directors": [
        "Bilbo Dasgupta",
        "Aridhman Ghulati",
        "Gautam Kishanchandani",
        "Pradnesh Kulkarni",
        "Vijay Kumar",
        "Vijay Singh"
    ],
    "art department": "Ram More",
    "sound department": [
        "Sushant Amin",
        "Sajjan Choudhary",
        "Justin Jose",
        "Rajesh Kodadi",
        "Faisal Majeed",
        "Allwin Rego",
        "Kunal Sharma",
        "Pramod Thomas"
    ],
    "visual effects": "Paresh Navlakha",
    "stunts": [
        "Shyamsundar Kalani",
        "Sham Kaushal",
        "Paramjeet Singh"
    ],
    "camera department": "Sangram Giri",
    "location management": [
        "Ajay Ahire",
        "Rajesh Patel",
        "Ajay Sharma",
        "Gyan Kishan Sharma"
    ],
    "music department": [
        "Zaheer Anwar",
        "Suzanne D'Mello",
        "Shibani Kashyap",
        "Harshdeep Kaur",
        "Kailash Kher",
        "Dev Kohli",
        "Suresh Lalwani",
        "Neeraj",
        "Shyam Raj"
    ],
    "miscellaneous": "Aman Gill",
    "writer": "Piyush Mishra",
    "director": "Amrit Sagar",
    "production companies": [
        "Sagar Art International",
        "Sagar Pictures",
        "Studio 18"
    ],
    "distributors": "Studio 18",
    "plot": [
        "Based on true facts, the film revolves around 6 brave soldiers who escape from the clutches of the Pakistan Army and risk death with honour and courage with sacrifice towards their journey home.",
        "The story is set 6 years post _1971_ (qv) Indo-Pak war, that culminated in the creation of Bangladesh. Despite winning the war, a large number of Indian Defence personnel have found themselves held captive in various jails in Pakistan and are faced with the fact that the Pakistani government denies their existence. International pressure has forced the Pakistani government to make changes in the way they treat the prisoners. In a very calculated move, the Pakistani army is ordered to assemble all the Indian prisoners of war in various Pakistani jails and transfer them to a secret location somewhere in the mountainous terrain of Pakistan. In the light of these events, Major Suraj Singh (Manoj Bajpyaee) along with Captain Jacob (Ravi Kishan), Captain Kabir(Kumud Mishra), Ft. Lt. Ram and Gurtu (Manav Kaul and Deepak Dobriyal) and Subedar Ahmad (Chittaranjan Giri) decide to escape the Pakistani POW establishment, in a daring attempt to reach India.::Official Source"
    ],
    "synopsis": "All the prisoners of war (POWs) of 1971 Indo-Pak war have been moved to a temporary but heavily fortified prison camp; much to amazement of Maj. Suraj Singh (Manoj Bajpai) and his group of five. Maj. Suraj Singh and his fellow men have yet again fruitlessly tried to break through only to get caught and suffer torture at the hands of their Pakistani counterparts. The group realizes the motives of Pakistani authorities behind gathering all POWs at one place and plan to break free once and for all on the eve of Pakistani independence day. After a lot of planning the day finally arrives and does not start the way it was intended as one of the bomb fails to explode. The struggle to reach the Indian border begins anyway as these prisoners escape while the Pakistani forces are alerted in the whole region. This struggle too takes its toll as Maj. Suraj Singh watches his fellow soldiers die bravely and honorably at the hands of responsive Pakistani army."
}