{
    "id": "10168650",
    "localized title": "Veerasamy",
    "cast": [
        "M.S. Bhaskar",
        "Mumtaj",
        "Prema Priya",
        "Thesingu Rajendar",
        "Santhanam"
    ],
    "genres": "Action",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "02 Feb 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNGVjOGY5ZjQtOGZmYy00ZjFkLWExNjQtMjcwOTBkOThmODE2XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "10168650",
    "plot outline": "Veerasamy (T. Rajendar) is a lawyer party leader and Member of the Legislative Assembly (MLA) in Chennai. His party has 13 MLAs and is in support to the sitting government (126/234). He tries to do good things to people. His sister falls in love with a pimp's brother, and a neighbor Sarasu (Mumtaj) falls in love with Veerasamy. Veerasamy then has to handle family conflicts as well as working to win the local elections. Due to some false witness, Veerasamy is found guilty of involvement in corruption. On hearing this, he dies of a heart attack. When he dies, Sarasu also drops dead.",
    "languages": "Tamil",
    "title": "Veerasamy",
    "kind": "movie",
    "directors": "Thesingu Rajendar",
    "writers": "Thesingu Rajendar",
    "producers": "Thesingu Rajendar",
    "composers": "Thesingu Rajendar",
    "cinematographers": "Thesingu Rajendar",
    "writer": "Thesingu Rajendar",
    "director": "Thesingu Rajendar",
    "production companies": "Chimbu Cine Arts",
    "plot": "_Veerasamy_ (qv) (T. Rajendar) is a lawyer party leader and Member of the Legislative Assembly (MLA) in Chennai. His party has 13 MLAs and is in support to the sitting government (126/234). He tries to do good things to people. His sister falls in love with a pimp's brother, and a neighbor Sarasu (Mumtaj) falls in love with _Veerasamy_ (qv). _Veerasamy_ (qv) then has to handle family conflicts as well as working to win the local elections. Due to some false witness, _Veerasamy_ (qv) is found guilty of involvement in corruption. On hearing this, he dies of a heart attack. When he dies, Sarasu also drops dead."
}