{
    "id": "1020937",
    "localized title": "Awarapan",
    "cast": [
        "Emraan Hashmi",
        "Mrinalini Sharma",
        "Ashish Vidyarthi",
        "Ashutosh Rana",
        "Salil Acharya",
        "J. Brandon Hill",
        "Rehan Khan",
        "Purab Kohli",
        "Atul Parchure",
        "Shaad Randhawa",
        "Shriya Saran"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "126",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Denmark:15",
        "India:UA",
        "Singapore:NC16",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "29 Jun 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2FiMjQ2NTktOWY0ZS00NTE5LTk4OTAtZTc4NTBhMTIxYTg3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1020937",
    "plot outline": "Brought up by a gangster named Bharat Malik, Shivam Pandit lives a faithless and reckless lifestyle, doing the bidding of his mentor - which also includes being a hit-man. Bharat does not get along with his brother, Raj, and nephew, Munna, who also resent the fact that Bharat trusts Shivam more than he even trusts his son, Ronnie. Shivam's life does change when he meets and falls in love with a devout Muslim woman, Aaliyah. Shivam wants to wed Aaliyah, but her father opposes this due to Shivam's criminal background, and the fact that he has been in prison twice. When Shivam insists on getting married regardless of the consequences, Aaliyah's dad aims a gun at him, but Shivam ducks and the bullet hits Aaliyah, killing her instantly. Shivam returns to his aimless lifestyle, this time in Hong Kong, still continuing to work for Bharat. When Bharat asks him to spy on his Pakistani mistress, Reema, Shivam does so, and finds out that she has a lover named Bilal. Shivam agrees to it but finally has a change of heart when he sees parallel between Reema and the caged birds Aaliyah used to sell to people for the purpose for freeing them from the cage. This leads to a face off between Shivam and Bharat leading to the movie's climax.",
    "languages": "Hindi",
    "title": "Awarapan",
    "kind": "movie",
    "directors": "Mohit Suri",
    "writers": "Shagufta Rafique",
    "producers": [
        "Mukesh Bhatt",
        "Sahni Bob"
    ],
    "composers": "Pritam Chakraborty",
    "cinematographers": "Raaj Chakravarti",
    "editors": "Aditya Joshi",
    "editorial department": "Rahul Purav",
    "art directors": "Rajat Poddar",
    "costume designers": [
        "Ashish Dwyer",
        "Tabrez Khan"
    ],
    "make up department": [
        "Shriniwas Narayan Reddy",
        "Shyam Reddy"
    ],
    "production managers": "Naveen Mathur",
    "assistant directors": [
        "Yaseen Barmawar",
        "Vishal Mahadkar",
        "Rishab Tolani"
    ],
    "art department": "Chanchal Bisht",
    "sound department": "Jayesh Dhakan",
    "visual effects": [
        "Patil Rajiv",
        "Vikas Sawlani",
        "Steve Shaw",
        "Manoj Sundriyal"
    ],
    "stunts": "Abbas Ali Moghul",
    "camera department": [
        "Anil Akki",
        "Prakashchandra",
        "Sandeep Tyagi"
    ],
    "casting department": "Sameer Banerjee",
    "music department": [
        "DJ AKS",
        "Annie",
        "Asif Ali Beg",
        "Hamim Hossain Bhuyain",
        "Suzanne D'Mello",
        "Baba Farid",
        "Rafaqat Ali Khan",
        "Sayeed Qadri",
        "Mustafa Zahid"
    ],
    "miscellaneous": [
        "Remo D'Souza",
        "Aman Gill",
        "Shree Rammy Pandey",
        "Jayesh Pradhan",
        "Raj Shetty"
    ],
    "akas": [
        "आवारापन (India, Hindi title)",
        "Amor Errante (Brazil)",
        "Amore vagabondo (Italy)",
        "Скиталец (Russia)",
        "Zlecenie na miłość (Poland)"
    ],
    "writer": "Shagufta Rafique",
    "director": "Mohit Suri",
    "production companies": [
        "NH Studioz",
        "Vishesh Films"
    ],
    "distributors": "NH Studioz",
    "special effects": "Futureworks",
    "other companies": "Gaurav Digital",
    "plot": [
        "A loyal henchman is ordered by his boss to keep an eye on his mistress, and trouble begins when he refuses to kill her.",
        "Brought up by a gangster named Bharat Malik, Shivam Pandit lives a faithless and reckless lifestyle, doing the bidding of his mentor - which also includes being a hit-man. Bharat does not get along with his brother, Raj, and nephew, Munna, who also resent the fact that Bharat trusts Shivam more than he even trusts his son, Ronnie. Shivam's life does change when he meets and falls in love with a devout Muslim woman, Aaliyah. Shivam wants to wed Aaliyah, but her father opposes this due to Shivam's criminal background, and the fact that he has been in prison twice. When Shivam insists on getting married regardless of the consequences, Aaliyah's dad aims a gun at him, but Shivam ducks and the bullet hits Aaliyah, killing her instantly. Shivam returns to his aimless lifestyle, this time in Hong Kong, still continuing to work for Bharat. When Bharat asks him to spy on his Pakistani mistress, Reema, Shivam does so, and finds out that she has a lover named Bilal. Shivam agrees to it but finally has a change of heart when he sees parallel between Reema and the caged birds Aaliyah used to sell to people for the purpose for freeing them from the cage. This leads to a face off between Shivam and Bharat leading to the movie's climax.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "The story line revolves around Shivam (Emraan Hashmi), a heart broken and introvert atheist, gangster, and right-hand man of Bharat Malik (Ashutosh Rana), officially a businessman who runs a chain of hotels in Hong Kong. Shivam is given the responsibility of one of these hotels, which he bears capably and well, making it much more successful than Malik's other hotels. Malik holds Shivam in the highest esteem due to Shivam's loyalty, reliability, and business acumen, and treats him like an adored son whom he entrusts with almost everything - indeed, more so than his biological son, Ronnie (Salil Acharya). This is the cause of much jealousy on Ronnie's part against Shivam, but due to Malik's outspoken support for Shivam, Ronnie does not dare do openly oppose him. Shivam has a very close childhood friend, Kabir (Shaad Randhawa), who assists him with everything.Malik's brother, Rajan (Ashish Vidyarthi), and Rajan's spoilt son Munna (Purab Kohli) nurture a grudge against Shivam because of Shivam's repeated conflicts with Munna. Munna is mainly responsible for the start of most of these conflicts; he time and again puts Shivam down as Malik's slave, once by murdering an employee of Shivam's hotel who resisted Munna in bed. When Shivam comes to investigate this incident, Munna taunts him, the dead girl, and dares him to tell Malik, resulting in Shivam lashing out against Munna and all his henchmen. This causes an escalation of the feud between Munna, his father Rajan, and Shivam.One day, Malik asks Shivam to keep an eye on his young mistress Reema (Mrinalini Sharma), whom he suspects of having an affair with someone else, while he is away on a brief business trip. Reema is a young Pakistani girl, a devout Muslim, and a victim of sex trafficking, whom Malik had 'bought' in the Bangkok flesh market. If Reema is found cheating on Malik, Shivam is to inform him immediately.In Shivam's interactions with Reema, he recalls his lost love, Aliyah (Shriya Saran) in a series of flashbacks. Aliyah was a devout Muslim, who Shivam had met by chance in the marketplace one day. The duo eventually fell in love, but when her father saw them together, he wrathfully confronted them, reprimanding Aliyah physically in public for maintaining physical contact with her lover in a non-private place. He also exposed Shivam's gangster background to a shocked Aliyah, leading to Shivam's instantly offering her father his gun, saying that he was willing to let go of everything, start anew, and legitimately provide for Aliyah if he is allowed to be with her. Aliyah's father recovers from his initial surprise quickly, and shoots at Shivam with the gun, who ducks to avoid the bullet. The bullet hits Aliyah instead, killing her and temporarily driving Shivam over the edge. A feeling of guilt and sorrow, at Aliyah having died because he tried to save his own life, remains with him hereafter. Aliyah's father instantly commits suicide when he realizes what he has done.Shivam discovers one night that Reema has a secret boyfriend Bilal (Rehaan Khan), who convinces her to run away with him back to Pakistan. Shivam informs Malik, who orders Reema's elimination. However, when he confronts the couple to eliminate them, she dares him to shoot her, claiming that freedom is her right, requesting mercy \"for God's sake\". Shivam is reminded of Aliyah's religious mannerisms, which bear a strong resemblance to Reema's, and is unable to shoot her, leaving her alive. Malik tries to reach Shivam, who severs contact with the former, leading to Malik finding out about his disobedience.Shivam plans to quickly run away from Hong Kong back to India with Kabir, who is extremely unwilling to do so. Eventually, he betrays Shivam to Malik, whose regard for Kabir goes up. Malik has Shivam captured, and orders Ronnie to torture Shivam until he agrees to kill Reema when Shivam refuses to do so even after Malik offers him a second chance. Malik is shown to be genuinely hurt and sorrowful at what he perceives as Shivam's betrayal, and hands over Shivam's responsibilities in the business to Kabir. Malik makes up the old feud with Rajan and Munna, and merges their gangs and businesses, with Malik demanding that Shivam be brought before him alive so that Malik can kill him personally. This occurs in Kabir's presence, who is bitterly penitent to the point of not wishing to live any more over his betrayal of Shivam.Shivam manages to escape Ronnie, and seeks refuge in the monastery of a monk whom he had once set free from certain death. He recovers from his injuries, and reminded of Aliyah and her belief in freedom, decides to not continue running all his life to save his own skin, but to \"fulfill someone else's dreams\" - namely, unite Bilal and Reema and send them to safety. He manages to save Bilal from Malik's henchmen, led by Kabir, whom Shivam still trusts and regards as his best friend, who tearfully reiterates that he is ready to die for Shivam, as he always was. Kabir takes Bilal to the monastery, where arrangements are made to ship Bilal and Reema to Hong Kong.Shivam tracks Reema, killing Rajan when he taunts Reema and refuses to divulge where she is. At the cost of a knife wound to his side, he tricks Munna into revealing Malik's plans regarding Reema, which are to sell her to the person who \"enjoys\" her the most. Munna tells Shivam everything about it, including the location, believing Shivam to be crippled by his wounds, and is immediately killed by Shivam when he tries to run away upon realizing that is not the case. Shivam finds Reema and Malik, who is madly enraged at Shivam's standing against him, when he had cared for Shivam so much, deriding Shivam's new belief in God and freedom. Shivam kills Malik, escapes with Reema to the shipping docks, where Bilal is waiting. Kabir shows up to fight Malik's men and buy Shivam time, and is brutally murdered in the process. Bilal manages to force a reluctant Reema to escape to the ship, who is loath to leave Shivam behind. Ronnie and his men arrive and Shivam manages to kill them all in a gunfight, but is mortally wounded himself. As he lies dying, he comes to terms with his past, forgiving himself and envisioning Aliyah smiling down upon him. The movie ends with Reema in a conference in Pakistan, where she tells her story of the \"awara\" who sacrificed his life to save her, and incites those present to stand up for victims of trafficking."
}