{
    "id": "1083447",
    "localized title": "Buddha Mar Gaya",
    "cast": [
        "Mona Ambegaonkar",
        "Jitender Bhargava",
        "Birbal",
        "Heenaa Biswas",
        "Prem Chopra",
        "Jayant Gadekar",
        "Manoj Joshi",
        "Mannat Kaur",
        "Pratima Kazmi",
        "Anupam Kher",
        "Khurshed Lawyer",
        "Mahabanoo Mody-Kotwal",
        "Bobby Parvez",
        "Vinay Pathak",
        "Om Puri",
        "Sunita Rajwar",
        "Paresh Rawal",
        "Rakhi Sawant",
        "Murali Sharma",
        "Ranvir Shorey",
        "Madhavi Singh",
        "Jay Soni",
        "Raj Tilak",
        "Mukesh Tiwari"
    ],
    "genres": "Comedy",
    "runtimes": "93",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "17 Aug 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDY5YmM2MWUtYmNiYy00ZjRhLTlkZjYtNDAyOWE0NDQ3MTgwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1083447",
    "plot outline": "Laxmikant Kabadiya and his twin-sister, Prerna, started as mere beggars near Dadar Railway Station, and with the assistance of Vidyut Baba, they moved to collecting garbage, and recyclables, established their own recycling business, slowly acquired wealth and became multi-millionaires. Laxmikant went on to get married and sired two sons, Sameer and Ranjeet, who, in turn, went on to get married to Anju and Shruti. While Ranjeet has two daughters, Sanjana and Namrata, Sameer has one son, Pawan. Vidyut Baba, a Bi-sexual, is now their family Guru, and they have a trusted family servant named Ramu. The Kabadia family is now ready to launch it's first Public Offering, which will generate Crores of Rupees. The entire family is all set to enjoy this new-found wealth when they find out that while being intimate with a sexy, struggling actress, Kim, widower Laxmikant has passed away. The entire family know that this will ruin their future plans and decide to keep his death a secret. They threaten Kim with dire consequences and criminal charges, and let her flee. Unfortunately for them, Ramu finds out and starts to blackmail them collectively for jewelry and cash. The desperate family is all set to secretly cremate Laxmikant, but things get out of hand and they, after buying the dead body of a poor man, announce the death of Laxmikant's cousin. Amidst media frenzy, the Kabadias arrange for the public appearance of Laxmikant, followed quickly by another funeral, this time of an unknown Christian male, who they pass off as another family relative. Watch what happens when Ramu goes live on TV to announce the untimely passing away of a very much alive Vidyut Baba, throwing open a virtual Pandora's box. Amidst hilarious chaos, the family's lives are complicated even more when they find out to their shock that Laxmikant was leading a dual life and had sired a third son from another woman.",
    "languages": "Hindi",
    "title": "Buddha Mar Gaya",
    "kind": "movie",
    "directors": "Rahul Rawail",
    "writers": [
        "Raju Saigal",
        "",
        "Anand Sivakumaran"
    ],
    "producers": [
        "Gyanchand Chauhan",
        "Sunil Lulla",
        "Rahul Rawail",
        "Rohit Kumar Sharma"
    ],
    "composers": "Bappi Lahiri",
    "cinematographers": "Suhas Gujarathi",
    "art directors": [
        "Tarun Ahuja",
        "Swapnil Keny"
    ],
    "assistant directors": "Prerna Singh",
    "visual effects": [
        "Himanshu Gohil",
        "Vishal Parmar"
    ],
    "stunts": "Javed Karim",
    "camera department": "Sanjay Mehta",
    "music department": [
        "Sunidhi Chauhan",
        "Bhavin Dhanah",
        "Kunal Ganjawala",
        "Manoj Muntashir",
        "Shaan"
    ],
    "miscellaneous": [
        "Vinod Bhalla",
        "Murli Chhatwani"
    ],
    "writer": [
        "Raju Saigal",
        "Anand Sivakumaran"
    ],
    "director": "Rahul Rawail",
    "production companies": "Rahul Theatre",
    "distributors": "Eros Worldwide",
    "other companies": [
        "Avitel Post Studioz",
        "Glamsham.com"
    ],
    "plot": [
        "A rich industrialist pops it just before the IPO of his company - the family must now conceal his death till all the shares are sold.",
        "Laxmikant Kabadiya and his twin-sister, Prerna, started as mere beggars near Dadar Railway Station, and with the assistance of Vidyut Baba, they moved to collecting garbage, and recyclables, established their own recycling business, slowly acquired wealth and became multi-millionaires. Laxmikant went on to get married and sired two sons, Sameer and Ranjeet, who, in turn, went on to get married to Anju and Shruti. While Ranjeet has two daughters, Sanjana and Namrata, Sameer has one son, Pawan. Vidyut Baba, a Bi-sexual, is now their family Guru, and they have a trusted family servant named Ramu. The Kabadia family is now ready to launch it's first Public Offering, which will generate Crores of Rupees. The entire family is all set to enjoy this new-found wealth when they find out that while being intimate with a sexy, struggling actress, Kim, widower Laxmikant has passed away. The entire family know that this will ruin their future plans and decide to keep his death a secret. They threaten Kim with dire consequences and criminal charges, and let her flee. Unfortunately for them, Ramu finds out and starts to blackmail them collectively for jewelry and cash. The desperate family is all set to secretly cremate Laxmikant, but things get out of hand and they, after buying the dead body of a poor man, announce the death of Laxmikant's cousin. Amidst media frenzy, the Kabadias arrange for the public appearance of Laxmikant, followed quickly by another funeral, this time of an unknown Christian male, who they pass off as another family relative. Watch what happens when Ramu goes live on TV to announce the untimely passing away of a very much alive Vidyut Baba, throwing open a virtual Pandora's box. Amidst hilarious chaos, the family's lives are complicated even more when they find out to their shock that Laxmikant was leading a dual life and had sired a third son from another woman.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Money corrupts and a humongous amount of money corrupts humongously. That's the take off point for Buddha Mar Gaya - a black comedy about dead bodies, mucho moolah and funerals. Laxmikant Kabadiya aka LK (Anupam Kher), is one of India's richest industrialists, a self made man who's risen from selling scrap to become a construction magnate. His conglomerate is on the verge of a 5000 crore IPO that should make them one of the largest companies in the country. LK's family - comprising of his spinster twin sister Prerna, his two sons Ranjeet and Sameer, their wives Shruti and Anju respectively and Ranjeet's daughters Sanjana and Namrata, and Sameer's son, Pawan, can't stop salivating at the thought of all that money. Unfortunately for all of them fate displays a wicked sense of humour. On the night before the IPO opens, LK dies. The family is distraught and horrified. Not because a loved one has died but because now no one will buy their shares. So, on the advice of their family guru - Vidyut Baba (Om Puri), the family decides to hide the death of LK for a period of two days till the shares are all sold out. Little do they realize the crazy series of events that will follow on account of this duplicity. After all, hiding the death of a man as famous as LK, is a Herculean task. To make matters worse, every time they're ready to announce LK's death, fate intervenes forcing them to keep his death hidden for another couple of days. Which results in them having to announce the death of a fictitious friend or relative of LK's... And stage fake funerals. Which of course means generating dead bodies and worse, getting the dead LK to make appearances at these funerals. Complicating matters further are an inquisitive and greedy servant, the Prime Minister's fixer, a procurer of dead bodies, the paparazzi and for good measure a couple of cops. And of course internal jealousies, greed, rivalries within the family only add spice to the goings on. Buddha Mar Gaya takes you on a rip-roaring ride into a world littered with dead bodies, body parts, unending greed, corruption, funerals and ice cubes."
}