{
    "id": "1093370",
    "localized title": "Jab We Met",
    "cast": [
        "Shahid Kapoor",
        "Kareena Kapoor",
        "Tarun Arora",
        "Dara Singh",
        "Pawan Malhotra",
        "Kamal Tiwari",
        "Kiran Juneja",
        "Divya Seth Shah",
        "Saumya Tandon",
        "Nihar Thakkar",
        "Manushka Khisty",
        "F.J. Jussawala",
        "Vishal Om Prakash",
        "Rohini Sahni",
        "Deepak Sharma",
        "Sheikh Noor Islam",
        "Basant Sinha",
        "Shyam Mashalkar",
        "Lalit Parashar",
        "Vidyasagar Singh",
        "Arnab Mukherjee",
        "Nishikant Dixit",
        "Abbas Saed",
        "Nishi Singh",
        "Arvind Jayant",
        "Brijendra Kala",
        "Asif Basra",
        "Sada Yadav",
        "Sushil Pandey",
        "Vijay Singh",
        "Raymond D'Souza",
        "Jitendra Rai",
        "Kishore Pradhan",
        "Yajuvendra Singh",
        "Teddy Maurya",
        "Ismeet Kaur",
        "Shreya Bhatt",
        "Veer Pratap Singh",
        "Pravin Purva",
        "Veer Rajwant Singh",
        "Billa",
        "Anita Meet",
        "Jassimrat Kaur",
        "Prem Puneeta",
        "Kaka Canadian",
        "Ananya Khare",
        "Zoya",
        "Narendra Neena",
        "Aman Bhogal",
        "Harkeerat",
        "Meenakshi",
        "Harsimran",
        "Raman Dhillon",
        "Aman Sahota",
        "Ikhatar Singh",
        "Majhi",
        "Amanda Jajoo",
        "Rubina"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "138",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "Dolby Digital",
        "Stereo::(Song Recording and Mixing Engineer)"
    ],
    "certificates": [
        "Australia:M",
        "Brazil:12",
        "Germany:0",
        "India:U",
        "Italy:T",
        "Netherlands:6",
        "New Zealand:PG",
        "Norway:7::(Netflix self-rating)",
        "Portugal:M/12",
        "Singapore:PG",
        "South Africa:PG",
        "South Korea:15",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "26 Oct 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYmIzYmY4MGItM2I4YS00OWZhLWFmMzQtYzI2MWY1MmM3NGU1XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1093370",
    "plot outline": "Depressed after the passing of his father (Dharamraj) and a ditching by his gorgeous girlfriend, Mumbai-based businessman Aditya Kashyap takes a BEST bus, goes to the Chatrapati Shivaji Train Terminus, and boards a train. There he meets Geet Kaur Dhillon, who is returning home to Bhatinda, and who pays for his ticket. At Bar Nagar, he decides to leave, but she follows him, missing her train. They manage to get a ride to Ratlam, miss the train again, but eventually make it to Bhatinda. Once there, he gets to meet her family, her pretty sister Roop as well as her to-be betrothed, Manjeet Singh Mann. Before the engagement can be finalized, she manages to convince her fiancé that she wants to marry Aditya. Before Aditya can take stock of these new developments, she elopes with him - not to get married but to re-locate to Manali where her true love, Anshuman, awaits, and to whom she hopes to get married.",
    "languages": "Hindi",
    "title": "Jab We Met",
    "kind": "movie",
    "directors": "Imtiaz Ali",
    "writers": "Imtiaz Ali",
    "producers": [
        "Deepak Bhagra",
        "Singh Maan Bikramjit",
        "Hiren Gandhi",
        "Dhilin Mehta",
        "Chacha Mogambo",
        "Manu Sud"
    ],
    "composers": [
        "Pritam Chakraborty",
        "Sanjoy Chowdhury",
        "Sandesh Shandilya"
    ],
    "cinematographers": "Nataraja Subramanian",
    "editors": "Aarti Bajaj",
    "editorial department": [
        "Rohan Desai",
        "Ranendu Ranjan"
    ],
    "production designers": "Rafi Kaizi",
    "art directors": "Teddy Maurya",
    "costume designers": [
        "Uma Biju",
        "Nandita Heggde",
        "Shabinaa Khan",
        "Manish Malhotra",
        "Roopa Sood"
    ],
    "production managers": [
        "Sachin Agarwal",
        "Ashish Chauhan",
        "Subhash Lakara",
        "Nitesh Mogre",
        "Chandra Pathak",
        "Shyam Rawat",
        "Rajesh Sharma",
        "Raju Yadav"
    ],
    "assistant directors": [
        "Vikash Agarwal",
        "Sunaina Bhatnagar",
        "Suma K.",
        "Satish Raj Kasireddi",
        "Rajesh Tibrawal",
        "Rajesh Tibrewal"
    ],
    "art department": [
        "Ramesh Andhale",
        "Tariq Umar Khan"
    ],
    "sound department": [
        "Cherag Cama",
        "Alok De",
        "Shashi Kasare",
        "Faisal Majeed",
        "Anand Pawar",
        "Dhrubajyoti Phukan",
        "Dipesh Sharma",
        "Dileep Subramaniam"
    ],
    "visual effects": [
        "Dwivedi Amit",
        "Vishal Bengare",
        "Chetan Gaur",
        "Somesh Ghosh",
        "Ashirwad Hadkar",
        "Sameer Malik",
        "Vikas Surajbali Nag",
        "Prasad Patel",
        "Virendra Prajapati",
        "Roby Raj",
        "Sriranjan Rath",
        "Rohit Sardesai",
        "Vaidehi Shinde",
        "Raghvendra Shrivastava",
        "Avdesh Shukla"
    ],
    "stunts": "R.P. Yadav",
    "camera department": [
        "Gaurav C. Bhat",
        "Falgunee Bhusan",
        "Prakashchandra",
        "Harish Sandhu",
        "Bobby Sanivarapu",
        "Sagar Singh",
        "Rajesh Tanwar"
    ],
    "casting department": [
        "Jasbir Dhillon",
        "Kumar Vijay Sippy"
    ],
    "music department": [
        "Javed Ali",
        "Faaiz Anwar",
        "Bhavesh Bhatt",
        "Mohit Chauhan",
        "Shreya Ghoshal",
        "Irshad Kamil",
        "Ustad Rashid Khan",
        "Ustad Sultan Khan",
        "Sonu Nigam",
        "Sandeep Patil",
        "Dhrubajyoti Phukan",
        "Shaan",
        "Sandesh Shandilya",
        "Dipesh Sharma",
        "Sandeep Shirodkar",
        "Mika Singh",
        "Abhijit Vaghani",
        "Jackie Vanjari"
    ],
    "transportation department": "Lukas Vozarik",
    "miscellaneous": [
        "Nazar Abbas",
        "Joe D'Souza",
        "Parag Desai",
        "Yashika Dhillon",
        "Aman Gill",
        "Caesar Gonsalves",
        "Rafi Kazi",
        "Ahmed Khan",
        "Saroj Khan",
        "Radhey Lalsa",
        "Ashley Lobo",
        "Bosco Martis",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Binny Padda",
        "Ravi Padda",
        "Siddharth Pande",
        "Shubham Patel",
        "Raka",
        "Rajesh Sharma",
        "Tripur Singh",
        "Ranju Varghese",
        "Nikhil Jassawalla"
    ],
    "thanks": "Sushil Rajpal",
    "akas": [
        "When We Met (World-wide, English title)",
        "When We Met (United States)",
        "Als ich Dich traf (Germany)",
        "L'amore arriva in treno (Italy)",
        "Quando nos Encontrarmos (Brazil)"
    ],
    "writer": "Imtiaz Ali",
    "director": "Imtiaz Ali",
    "production companies": "Shree Ashtavinayak Cine Vision",
    "distributors": "Studio 18",
    "special effects": "Prime Focus",
    "other companies": [
        "Creative Canvas Entertainment",
        "Fiesta",
        "Hariani & Co.",
        "Sony Pictures Networks",
        "T-Series",
        "Universal Communications"
    ],
    "plot": [
        "A depressed wealthy businessman finds his life changing after he meets a spunky and care-free young woman.",
        "Depressed after the passing of his father (Dharamraj) and a ditching by his gorgeous girlfriend, Mumbai-based businessman Aditya Kashyap takes a BEST bus, goes to the Chatrapati Shivaji Train Terminus, and boards a train. There he meets Geet Kaur Dhillon, who is returning home to Bhatinda, and who pays for his ticket. At Bar Nagar, he decides to leave, but she follows him, missing her train. They manage to get a ride to Ratlam, miss the train again, but eventually make it to Bhatinda. Once there, he gets to meet her family, her pretty sister Roop as well as her to-be betrothed, Manjeet Singh Mann. Before the engagement can be finalized, she manages to convince her fiancé that she wants to marry Aditya. Before Aditya can take stock of these new developments, she elopes with him - not to get married but to re-locate to Manali where her true love, Anshuman, awaits, and to whom she hopes to get married.::rAjOo (gunwanti@hotmail.com)",
        "Multi-millionaire businessman Aditya Kashyap faces trying times when his father passes away while his fiancée ditches him to marry someone else. In order to get some relief, he boards a bus only to end up on a train with a female troublemaker (Geet Dhillon) who is going home to her residence in Bhatinda. She tries her best to get his attention but Aditya, traumatized by what he's gone through in life, is little interested. When Aditya decides to alight from the train at a certain point, Geet decides to follow him only to end up missing her train. The duo then takes a lift to another train terminal but ends up missing the train again. After a series of mishaps, they manage to reach Bhatinda where Geet introduces Aditya to her family and to her fiancé Manjeet Singh. Geet does not want to marry Manjeet, so she uses Aditya to run away from home and towards her lover, Anshuman, who stays in Manali. With Geet settled in life, Aditya move on to his business life again only to meet up with Geet many months later to find that things are not quite rosy between her and Anshuman. In trying to make things right between the couple, Aditya and Geet end up falling in love. Now Aditya must decide what to tell her family about Geet and Anshuman.::gavin (racktoo@hotmail.com)",
        "Emotionally reeling after the passing of his father and the marriage of his girlfriend to another, wealthy businessman (and heir to a family fortune) Aditya Kashyab meets chatterbox Geet Dhillon aboard a train onto which he has wandered. Before she can pinpoint and fix his problem, he disembarks. She follows, and the two end up working together to literally get her back on track when she misses re-boarding her train for home. Once home, Geet uses Aditya to slip out of an arranged marriage to a childhood friend, via a staged elopement, in order to reunite with her secret, distant and true love, Anshuman. With their escape a success, they amicably part company right before her reunion with Anshuman. Nine months later, Geet's family tracks down Aditya, demanding her return (mistakenly believing they've been together all this time). Promising her return, Aditya investigates her whereabouts and finds her in an unhappy circumstance. In lifting her spirits, they awaken a spark of marital interest in Anshuman that wasn't there before. The three return to her home where everyone presumes Geet and Asitya have been living together and have only now returned for an official wedding. They fairly well ignore Anshuman, whom no one even remotely suspects is the true husband-to-be, which Geet finds herself very reluctant to correct.::statmanjeff"
    ],
    "synopsis": "Aditya Kashyap (Shahid Kapoor), the son of a recently-deceased famous industrialist, demoralized by his mother's public affair and subsequent departure, gets even more depressed after attending the marriage of the woman he loves to another man. Feeling ashamed to face the world, he walks out of the wedding, boards a train at night, and appears on the verge of committing suicide. While on board, he meets Geet Dhillon (Kareena Kapoor), a lively and talkative young woman who is leaving Mumbai to go to her hometown, Bhatinda in Punjab.\nInitially, Aditya finds Geet very irritating, and every meeting becomes mental torture for him. She discloses big plans of eloping with her boyfriend Anshuman (Tarun Arora), as she fears resentment from her parents. Geet irritates Aditya to the point where he leaves the train. In trying to get him back on the train, she ends up missing it and finds herself stranded on a desolate station, Badnagar, with no luggage or money. She confronts Aditya and tells him that he is now responsible for getting her safely to her house in Punjab. Both of them begin an idyllic journey through the exuberant North Indian heartland, making their way via buses, taxis and camel-carts to reach her house. Through spending so much time with Geet, Aditya begins to feel good about life again.\nOn arrival, Geet's family (Pawan Malhotra, Dara Singh and Kiran Juneja) mistakes the two for lovers, but they quickly assure them that there is nothing of the sort. Aditya tells her family he is a musician to avoid being recognized as the famous industrialist, and her family accepts this. A few days later, Manjeet, an old childhood friend of Geet's who wants to marry her, arrives as her suitor. While he is there, Geet leads him to believe that there is something intimate going on between her and Aditya, and successfully dissuades him from following through with the match. Later that night, Geet runs away from her home, along with Aditya, to marry Anshuman in Manali. However, Geet's sister sees them running away together and informs the entire family. The two hurriedly make their escape, but this confirms the suspicion in Geet's family that they are lovers. The two escape to Manali together, and then part to continue on their separate ways.\nUpon returning to Mumbai with a new conviction and positive outlook on life because of Geet's influence, Aditya guides his company to extreme success. Around nine months later, he launches a new product, a calling card named \"Geet\", as he has now fallen in love with Geet. Geets family sees this launch on TV and runs to Mumbai to meet Aditya. Aditya is shocked to learn that Geet has not returned home. He takes it upon himself to find her and return her to her family. He returns to Manali, where he expects her to be with her new husband. Instead, he finds that Anshuman had turned her out to the streets and refused to marry her.\nAfter chastising Anshuman for what he did to her, Aditya leaves and finally tracks Geet down in Shimla, shocked to see what she has become: a quiet, reserved, and miserable schoolteacher. Convincing her to face her circumstances, he manages to bring her back to normal life, and things start to look up for her again. However, Anshuman arrives and tries to patch up their relationship, claiming he realized he was a jerk. Initially, Geet does not want to accept his apology, but Aditya pushes her to be with him, even though he loves her too. All three then travel back to Bhatinda to unite Geet with her family, and to announce that Geet and Anshuman are together. However, upon their arrival, the family again assumes that Geet and Aditya are together and in all the confusion, there is no chance to right the family's misconceptions. While trying to clear the misconception, situations make Geet realize that she is in fact in love with Aditya, not Anshuman. She then confesses her love to Aditya, and the couple get married and have two daughters.\n[edit]Cast"
}