{
    "id": "1151299",
    "localized title": "68 Pages",
    "cast": [
        "Mouli Ganguly",
        "Joy Sengupta",
        "Jayati Bhatia",
        "Zafar Karachiwala",
        "Uday Sonawane",
        "Abhay Kulkarni",
        "Bakul Thakkar",
        "Sherrin Varghese",
        "Ajai Rohilla",
        "Ikhlaq Khan",
        "Mangala Kenkre",
        "Dilnaz Irani",
        "Aastha Jain",
        "Ram Awana",
        "Sujata Thakar",
        "Rupal Patel"
    ],
    "genres": "Drama",
    "runtimes": "92",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "1.66 : 1",
    "certificates": "United States:Not Rated",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTQzNjczMTEyMF5BMl5BanBnXkFtZTcwNzQ3MDMwMg@@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1151299",
    "plot outline": "Coming from a country like India that is still in denial, where being HIV+ is still a curse, '68 Pages' rips open the underbelly of its society to reveal how it stigmatizes and shuns those who are HIV+ or even those who just want to be what they are. Through 68 Pages of a counselors diary, we see the stories of Paayal, a sex worker; Nishit, an ID user; Kiran, a gay man and Umrao, a transgender bar dancer - their stories of pain and fear, humiliation and rejection - not only by the society, but even by their loved ones. While these stories expose the shallowness of the system, it also offers hope and healing by trying to bring about a better understanding of their fight to live with dignity. The film is a tribute to the human spirit of optimism and survival.",
    "languages": "Hindi",
    "title": "68 Pages",
    "kind": "movie",
    "directors": "Sridhar Rangayan",
    "writers": [
        "Vivek Anand",
        "",
        "Saagar Gupta",
        "",
        "Sridhar Rangayan"
    ],
    "producers": [
        "Vivek Anand",
        "Himanshu Kishan Mehra",
        "Sridhar Rangayan"
    ],
    "composers": "Aashish Rego",
    "cinematographers": "Subhransu",
    "editors": "Praveen Angre",
    "assistant directors": [
        "Anmol Dharmadhikari",
        "Niraj Kothari"
    ],
    "camera department": "Pramod Kumar Nayak",
    "miscellaneous": "Siva Romero Iyer",
    "writer": [
        "Vivek Anand",
        "Saagar Gupta",
        "Sridhar Rangayan"
    ],
    "director": "Sridhar Rangayan",
    "production companies": [
        "The Humsafar Trust",
        "Solaris Pictures"
    ],
    "plot": "Coming from a country like India that is still in denial, where being HIV+ is still a curse, '_68 Pages_ (qv)' rips open the underbelly of its society to reveal how it stigmatizes and shuns those who are HIV+ or even those who just want to be what they are. Through _68 Pages_ (qv) of a counselors diary, we see the stories of Paayal, a sex worker; Nishit, an ID user; Kiran, a gay man and Umrao, a transgender bar dancer - their stories of pain and fear, humiliation and rejection - not only by the society, but even by their loved ones. While these stories expose the shallowness of the system, it also offers hope and healing by trying to bring about a better understanding of their fight to live with dignity. The film is a tribute to the human spirit of optimism and survival.::Anonymous",
    "synopsis": "68 PAGES is the story of Mansi, a counsellor whose ethics demand that she has to maintain confidentiality of her counselees. She has to be objective in understanding their problems and give them options that would help them come to terms with their status. She cannot get emotional about any person she is counselling.But is it possible for a sensitive young woman to remain unaffected by the suffering that she witnesses around her? Mansi is after all human. She gives vent to true feelings by sharing it with her diary. Her pain and anguish are reflected only on the pages of her diary. There are some counselees whom she cannot leave behind in the counselling room. She carries their stories home and they become part of her diary.It is through the pages of Mansis diary that we see the stories of Paayal, Kiran, Nishit and Umrao, marginalised by the society, stigmatized for being themselves and not being able to find a place in the mainstream society. The film makes an effort to address issues of minority communities and their status as HIV positive people.Their stories have the capacity to touch, heal and change lives lives of those who are HIV positive but do not lose hope. 68 PAGES is a tribute to the human spirit of optimism and survival."
}