{
    "id": "11649338",
    "localized title": "Black Friday",
    "cast": [
        "Devon Sawa",
        "Ivana Baquero",
        "Ryan Lee",
        "Stephen Peck",
        "Michael Jai White",
        "Bruce Campbell",
        "Louie Kurtzman",
        "Celeste Oliva",
        "Ellen Colton",
        "Peg Holzemer",
        "Mark Steger",
        "Andria Blackman",
        "Mike Murphy",
        "Christopher Mikael",
        "Stanley Bruno",
        "Lonnie Farmer",
        "Stephen O'Neil Martin",
        "Ripley Thibeault",
        "Matea Thibeault",
        "Bates Wilder",
        "Cindy Lentol",
        "Randy Jay Burrell",
        "Adam Desautels",
        "Seth Green",
        "Marilyn Busch",
        "Amanda Cass",
        "Kayla Caulfield",
        "Chemi Che-Mponda",
        "Christian Cibotti",
        "Summer H. Howell",
        "Amanda Larson",
        "Derek Mellor",
        "Adrian M. Mompoint",
        "Victoria Lee Parella",
        "Leah Procito",
        "Christine Rodriguez",
        "Troy Roker"
    ],
    "genres": [
        "Comedy",
        "Horror"
    ],
    "runtimes": "84",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "aspect ratio": "2.39:1",
    "certificates": [
        "Australia:MA15+",
        "Canada:13+::(Quebec)",
        "Germany:16::(self-applied)",
        "Netherlands:16",
        "Philippines:18+::(self-applied)",
        "Poland:16",
        "United Arab Emirates:15+"
    ],
    "original air date": "19 Nov 2021 (Philippines)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2IyYjI3NTItYjcyNC00ZjE2LTk1ZDMtMTc1YTI2MGIwMDQ2XkEyXkFqcGdeQXVyODY5NzkyMjA@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "11649338",
    "plot outline": "On Thanksgiving night, a group of disgruntled toy store employees begrudgingly arrive for work to open the store at midnight for the busiest shopping day of the year. Meanwhile, an alien parasite crashes to Earth in a meteor. This group of misfits led by store manager Jonathan and longtime employee Ken soon find themselves battling against hordes of holiday shoppers who have been turned into monstrous creatures hellbent on a murderous rampage on Black Friday.",
    "languages": "English",
    "title": "Black Friday",
    "kind": "movie",
    "directors": "Casey Tebo",
    "writers": "Andy Greskoviak",
    "producers": [
        "Elliott Barker",
        "Bruce Campbell",
        "Warner Davis"
    ],
    "composers": "Patrick Stump",
    "cinematographers": "David Kruta",
    "editors": "Chris Tonick",
    "editorial department": [
        "Marcelo Aprile",
        "Nicholas Lundgren"
    ],
    "casting directors": "Brandon Henry Rodriguez",
    "production designers": "Jarrett Staaf",
    "set decorators": "Rebecca Greene",
    "costume designers": "Samantha Markey",
    "make up department": [
        "Jared Balog",
        "Kevin Carter",
        "Philip Harrah",
        "Johanna Heston",
        "Marcia King",
        "Robert Kurtzman",
        "Robert Kurtzman Mufx",
        "Shayna Passaretti",
        "Brian Spears",
        "Josh Turi",
        "Amber Voner"
    ],
    "assistant directors": [
        "Hristo Dimitrov",
        "Courtney Fusselman",
        "Teddy Pryor"
    ],
    "art department": [
        "Jason Allard",
        "Risa Uchida Battis",
        "Josh Bermel",
        "Justin Bliss",
        "Rory Brett",
        "Tina Hamilton",
        "Erik Malkovich",
        "Sean Martin",
        "Kayla Pacenka",
        "Kylie Paul",
        "Anthony Phelps",
        "Natalia Rozengard",
        "Brandon Warner"
    ],
    "sound department": [
        "Tom Boykin",
        "Dane Butler",
        "Jack Garrett",
        "Sean Higgins",
        "Dan Snow"
    ],
    "special effects": [
        "Robbie Bessler",
        "Tommy Carroll",
        "Robert Comire",
        "Mike Ricci"
    ],
    "visual effects": [
        "Juan Moreno",
        "Daniel Saldivar"
    ],
    "stunts": [
        "Amanda Cass",
        "Amy Greene",
        "Anthony Hoang",
        "Paul Marini",
        "Robert Marsella",
        "John Vincent Mason",
        "Christopher Mikael",
        "Victoria Lee Parella",
        "Kyle Wyman"
    ],
    "camera department": [
        "Nolan Ball",
        "Cheyenne Capri",
        "Robert Clark",
        "Matthew Dorris",
        "Michael Ficara",
        "Tom Fitzgerald",
        "David Hallas",
        "Ben Heald",
        "Chris Hebert",
        "Patrick Hines",
        "Guy Holt",
        "John Kopec",
        "Scott Lebeda",
        "Chris Malenfant",
        "Alexander Jay Nelson",
        "Todd England Nicodemus",
        "Stéphane Renard",
        "David C. Romano",
        "Dave Scranton"
    ],
    "casting department": [
        "Briana Frapart",
        "Julie Arvedon Knowlton",
        "Ashley Skomurski"
    ],
    "costume departmen": [
        "Wayne Allen",
        "Penelope Cariolo",
        "Caroline Errington",
        "Alyson MacInnis"
    ],
    "music department": [
        "Christopher Carmichael",
        "Aiko Fukushima",
        "Taisuke Kimura",
        "Ece Muniroglu",
        "Bill Newlin",
        "Marcus Sjowall",
        "Jeff Toyne"
    ],
    "script department": "Frankie Ferrari",
    "miscellaneous": [
        "Rosario Corso",
        "Sam DeBlois",
        "Cody Galante",
        "Adam Hart",
        "Tishna Lodi",
        "Tasha McCrory",
        "Scott Schaffer",
        "William Sears",
        "Anne Stimac",
        "Jared Vega",
        "William Weddleton"
    ],
    "thanks": [
        "Ellen Davis",
        "Flora Davis",
        "Frankie Davis",
        "Annie Mauro Greskoviak",
        "Cassidy Greskoviak",
        "Joe Greskoviak",
        "Joseph R. Greskoviak",
        "Michele Greskoviak"
    ],
    "akas": [
        "Black Friday! (United Kingdom)",
        "블랙 프라이데이 (South Korea)",
        "Чорна п'ятниця (Ukraine)",
        "Чёрная пятница (Russia)"
    ],
    "writer": "Andy Greskoviak",
    "director": "Casey Tebo",
    "production companies": [
        "MFW Manufacturing",
        "The Warner Davis Company"
    ],
    "distributors": [
        "Highland Film Group (HFG)",
        "Screen Media Films",
        "Three Lines Pictures"
    ],
    "other companies": [
        "Anarchy Post",
        "BHR Casting",
        "Cinema Mechanics"
    ],
    "plot": [
        "A group of toy store employees must protect each other from a horde of parasite infected shoppers.",
        "On Thanksgiving night, a group of disgruntled toy store employees begrudgingly arrive for work to open the store at midnight for the busiest shopping day of the year. Meanwhile, an alien parasite crashes to Earth in a meteor. This group of misfits led by store manager Jonathan and longtime employee Ken soon find themselves battling against hordes of holiday shoppers who have been turned into monstrous creatures hellbent on a murderous rampage on _Black Friday_ (qv).",
        "Several employees at a big-box toy store are infected by an alien substance while preparing for _Black Friday_ (qv). On the day of, and after customers are allowed inside, the remaining employees discover that the infected have turned into zombies. While some employees work on closing the doors and eliminating the infected, others defend themselves from a zombie in the bathroom. The group realizes that the infected are building something in the middle of the store. What can be more dangerous than zombies?::Frank Liesenborgs"
    ],
    "synopsis": "A parasitic organism attacks All-Mart employee Monty as he prepares the store for its Black Friday sale. Monty mutates into a monster and attacks two co-workers. Because he has to work on Thanksgiving, Ken Bates drops off his daughters Lyla and Gracie for dinner with their mother and her new husband Grant. Ken then picks up his co-worker Chris Godecki and drives to their late shift at We Love Toys. While anxious shoppers assemble outside, Ken and Chris join co-workers Marnie, Brian, Archie, Ruth, Emmett, Anita, and Bircher as they get ready to open the store for Black Friday. Bircher accidentally locks himself outside the building while smoking a cigarette. Possessed by a parasite, a rabid shopper mauls Bircher, causing him to transform into a creature too. Store manager Jonathan Wexler has his employees open the doors. Shoppers pour in, but they gradually turn violent as the parasitic mutation spreads. Everyone eventually realizes that the shoppers are transforming into murderous creatures as they are attacked and forced to fight back. Possessed by a parasite, Emmett emits a tentacle that kills Anita. Emmett turns into a creature before fleeing toward the store's Santa's Village display. Ruth holes up in the office while Archie leads Chris and Brian through a mutant horde to close an exit door before more shoppers get inside. Jonathan and Ken battle a creature in the bathroom. Marnie sneaks into Santa's Village and sees that transformed shoppers are being assimilated into a growing sac. Once the exit door is secured, Jonathan, Ken, Chris, Marnie, Brian, Archie, and Ruth regroup on the store floor. Driven by a possessed officer, a speeding police car crashes through the front window. The car runs over Ruth. Mutating shoppers begin pouring inside again. After he rescues Chris, one of the monsters kills Archie. Ken, Marnie, Chris, Brian, and Jonathan barricade themselves in the storeroom. While talking about their various tenures at the store, the co-workers bond over sliced turkey meat. However, the group conversation turns confrontational when Ken and Chris argue about their disappointing stations in life and Marnie calls out Ken for not having a real romance with her. A mutant breaches the storeroom. Ken gets bitten in the commotion. Presuming he is now infected and will soon transform, Ken stays behind while Chris, Marnie, Jonathan, and Brian go to the loading dock to obtain a truck for escaping. With Chris unable to start the truck, he and the others fight off another mutant before making their way to the roof. Meanwhile, the building catches fire as the main sac continues growing into a massive monster that soon fills the entire store. Jonathan sacrifices himself to a horde so Chris, Marnie, and Brian can escape back down to the ground. Brian confesses he bit Ken in the earlier commotion, so Ken is not actually infected. Having assimilated all of the mutated shoppers, the massive monster breaks through the store's roof. Brian tries to confront the creature, but it kills him. Ken re-joins Chris and Marnie outside. Ken acts as a distraction while Chris tricks the monster into swallowing a forklift, which causes the injured creature to collapse into the fire. Ken, Chris, and Marnie escape in Ken's car. However, more massive monsters are seen emerging from other stores in the distance."
}