{
    "id": "1176187",
    "localized title": "Gojiri",
    "cast": [
        "Sunil Barve",
        "Abhijeet Chavan",
        "Arun Nalawade",
        "Madhura Velankar"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "123",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "sound mix": "Stereo",
    "original air date": "2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTUxZTdjMGUtZTQ1Yy00YWUzLThkZjMtN2I3MWQ4ODcyMzYxXkEyXkFqcGdeQXVyMTgwMjgwMjM@._V1_SY150_CR7,0,101,150_.jpg",
    "imdbID": "1176187",
    "plot outline": "Widower Tatya lives a middle-class lifestyle in a small village off of the Konkon Coastline in Maharashtra, India, along with his daughters, Gojiri and mentally challenged Suha. On Suha's birthday, while picking mangoes, Gojiri falls down the tree, hurts her head, passes out, and is hospitalized. Tatya is told that she has damaged her temporal lobe beyond repair, as a result the contact between her short and long term memory has been lost, so she can only remember what occurred the day before, and will virtually re-live her life as 'groundhog' days. Since then Gojiri has been celebrating Suha's birthday every single day. Then Shikarerao comes to this village all the way from Nasikh city. He meets with and falls in love with Gojiri and would like to marry her. He finds Gojiri receptive and even proposes to her through Nanu, his real estate agent, who is attempting to sell Shikarerao's 'haunted' property. Nanu tells him the truth about Gojiri, but he is smitten and is unable to let go. Watch what happens when Shikarerao persists in wooing Gojiri, is beaten by angry youth, and then reprimanded by the village elders/Panchayat for insulting and molesting Gojiri, and the impact this will have on him, Tatya and Gojiri herself.",
    "languages": "Marathi",
    "title": "Gojiri",
    "kind": "movie",
    "directors": "Viju Mane",
    "writers": [
        "Viju Mane",
        "",
        "Viju Mane"
    ],
    "editors": "Satish Patil",
    "sound department": [
        "Alok De",
        "Girish Ramteke"
    ],
    "miscellaneous": "Ram Kondilkar",
    "akas": "Gojiri (India)",
    "writer": [
        "Viju Mane",
        "Viju Mane"
    ],
    "director": "Viju Mane",
    "production companies": "Tanvi Productions",
    "distributors": "Zee TV",
    "plot": [
        "Widower Tatya lives a middle-class lifestyle in a small village off of the Konkon Coastline in Maharashtra, India, along with his daughters, _Gojiri_ (qv) and mentally challenged Suha. On Suha's birthday, while picking mangoes, _Gojiri_ (qv) falls down the tree, hurts her head, passes out, and is hospitalized. Tatya is told that she has damaged her temporal lobe beyond repair, as a result the contact between her short and long term memory has been lost, so she can only remember what occurred the day before, and will virtually re-live her life as 'groundhog' days. Since then _Gojiri_ (qv) has been celebrating Suha's birthday every single day. Then Shikarerao comes to this village all the way from Nasikh city. He meets with and falls in love with _Gojiri_ (qv) and would like to marry her. He finds _Gojiri_ (qv) receptive and even proposes to her through Nanu, his real estate agent, who is attempting to sell Shikarerao's 'haunted' property. Nanu tells him the truth about _Gojiri_ (qv), but he is smitten and is unable to let go. Watch what happens when Shikarerao persists in wooing _Gojiri_ (qv), is beaten by angry youth, and then reprimanded by the village elders/Panchayat for insulting and molesting _Gojiri_ (qv), and the impact this will have on him, Tatya and _Gojiri_ (qv) herself.::rAjOo (gunwanti@hotmail.com)",
        "Arun Nalawade, lives a middle-class lifestyle in a small village off Konkan, Maharashtra, along with his daughters, _Gojiri_ (qv) (Madhura Velankar) and mentally challenged, Suha. On Suha's birthday, while picking mangoes from a tree, _Gojiri_ (qv) falls and hurts her head and has to be hospitalized. She damages her temporal lobe resulting in her losing her short and long term memory. Every night while she sleeps, the slate of her memory is wiped clean, and when she wakes up in the morning, she remembers everything that happened up to the moment of the accident, but nothing that happened afterward. One fine day, Shikarerao (Sunil Barve), arrives in the village and falls in love with _Gojiri_ (qv). He finds _Gojiri_ (qv) receptive and even proposes for marriage through Nanu (Abhijeet Chavan), his real estate agent, who is attempting to sell Shikare Rao's 'haunted' property. Nanu tells him the truth about _Gojiri_ (qv), but he is already smitten by her. Shikarerao persists in wooing _Gojiri_ (qv); he is beaten up by villagers, and then reprimanded by the village elders (Panchayat) for insulting and molesting _Gojiri_ (qv), and for the impact this will have on him, Tatya and _Gojiri_ (qv) herself?"
    ]
}