{
    "id": "1223134",
    "localized title": "Anasuya",
    "cast": [
        "Bhoomika Chawla",
        "Ravi Babu",
        "Abbas",
        "Ankita",
        "Chalapathi Rao",
        "Harshavardhan",
        "Melkote",
        "Revathi",
        "Sameer",
        "Nikita Thukral"
    ],
    "genres": [
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "139",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": "India:A",
    "original air date": "21 Dec 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2JkMzFlMzUtNjFiMS00NjhiLTkxOTEtNjVmODVlN2UxZDAwXkEyXkFqcGdeQXVyODA2ODM3NDQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "1223134",
    "plot outline": "Anasuya (Bhumika Chawla) is a young, passionate journalist who joins a local TV news channel as a reporter. She lives with her uncle Joseph (Shankar Melkote) in the city. On her very first assignment she had to go as an undercover, posing as a reporter from a women's magazine in to expose suspected child labor in a local politician's house. Anasuya successfully exposes the oppressive working condition of an orphan child called Lakshmi who is forced into menial work at the politician's house. The politician throws the child out of his house to escape arrest. Anasuya shelters the girl and takes her home. The expose becomes a sensation Anasuya becomes a household name. She also becomes an instant favourite of her boss much to the irritation of her senior colleagues. Around this time a series of murders were baffling the police department. The murderer was taking an internal organ from his victims and leaving a red rose behind. When the police get reluctant to give the press information Anasuya is given the task of be-friending task force officer, Anand (Abbas) who was involved with the investigation, and getting information out of him. Anasuya goes about her task diligently and even causes the arrest of Gvoind (Ravi Babu) as the serial murderer. But the cops let him go seeing that he was an invalid with polio stricken legs. Not convinced with police theory Anasuya goes after Govind herself. In a gritty outcome of successive events Anasuya is thrown out of her job, loses out on love and is arrested and thrown in jail in her mad pursuit of Govind. Once out of jail she tries to unravel the mystery of Govind and hunt him down only to realize that it was she who was being hunted by Govind for one final organ to take and one final rose to give.",
    "languages": "Telugu",
    "title": "Anasuya",
    "kind": "movie",
    "directors": "Ravi Babu",
    "writers": [
        "Ravi Babu",
        "",
        "Nivas",
        "",
        "Gopalakrishna Paruchuri",
        "",
        "Paruchuri Venkateswara Rao"
    ],
    "producers": "Ravi Babu",
    "composers": "Shekar Chandra",
    "cinematographers": "Sudhakarreddy",
    "editors": "Marthand K. Venkatesh",
    "editorial department": "Lova Prasad Gandepalli",
    "assistant directors": [
        "Saagar K Chandra",
        "Hanuman Mupparaju",
        "Shankar Nutheti",
        "Srinivas Vinjarapu"
    ],
    "visual effects": [
        "Arun Pawar",
        "Yugandhar Tammareddy"
    ],
    "miscellaneous": "Pulagam Chinnarayana",
    "writer": [
        "Ravi Babu",
        "Nivas",
        "Gopalakrishna Paruchuri"
    ],
    "director": "Ravi Babu",
    "production companies": [
        "Flying Frogs Production",
        "Suresh Productions"
    ],
    "distributors": "Suresh Productions",
    "plot": [
        "A spine-chilling suspense thriller about a cat and mouse game between a budding journalist and motivated serial killer.",
        "_Anasuya_ (qv) (Bhumika Chawla) is a young, passionate journalist who joins a local TV news channel as a reporter. She lives with her uncle Joseph (Shankar Melkote) in the city. On her very first assignment she had to go as an undercover, posing as a reporter from a women's magazine in to expose suspected child labor in a local politician's house. _Anasuya_ (qv) successfully exposes the oppressive working condition of an orphan child called Lakshmi who is forced into menial work at the politician's house. The politician throws the child out of his house to escape arrest. _Anasuya_ (qv) shelters the girl and takes her home. The expose becomes a sensation _Anasuya_ (qv) becomes a household name. She also becomes an instant favourite of her boss much to the irritation of her senior colleagues. Around this time a series of murders were baffling the police department. The murderer was taking an internal organ from his victims and leaving a red rose behind. When the police get reluctant to give the press information _Anasuya_ (qv) is given the task of be-friending task force officer, Anand (Abbas) who was involved with the investigation, and getting information out of him. _Anasuya_ (qv) goes about her task diligently and even causes the arrest of Gvoind (Ravi Babu) as the serial murderer. But the cops let him go seeing that he was an invalid with polio stricken legs. Not convinced with police theory _Anasuya_ (qv) goes after Govind herself. In a gritty outcome of successive events _Anasuya_ (qv) is thrown out of her job, loses out on love and is arrested and thrown in jail in her mad pursuit of Govind. Once out of jail she tries to unravel the mystery of Govind and hunt him down only to realize that it was she who was being hunted by Govind for one final organ to take and one final rose to give.::Deepak Alone"
    ]
}