{
    "id": "1246601",
    "localized title": "Thakarachenda",
    "cast": [
        "Sreenivasan",
        "Geethu Mohandas",
        "Seema G. Nair",
        "Kulappulli Leela",
        "Manikandan",
        "Murukan",
        "Sangeetha Sivan"
    ],
    "genres": "Drama",
    "runtimes": "90",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "08 Aug 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTYzMTkxZDEtYTRkYi00NWZmLWI2YjUtNTFhYzFlZjc1M2I1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "1246601",
    "plot outline": "The film is set in a slum in Ernakulam and focusses on a group of slum dwellers who are usually ignored in the ambitious blueprints of city developers. The protagonist of the film, Chakrapani (Sreenivasan), is a disabled beggar and also a small-time moneylender who lives in the slum. A drunkard, he spends most of the time quarrelling with his mother. He has an eye on Latha (Geethu Mohandas) who lives nearby with her two children, Siva and Malli, though she detests him. Latha, an asthmatic, works as a maid and dreams of a better future for her children. Another woman Vasanthi (Seema G. Nair) too lives in the slum with her two children and a drunkard of a husband (Manikandan) who is of no use to anybody and who keeps causing endless trouble to her and her children. Finally, desperation forces Chakrapani and Latha to unite and raise their voice in protest again the ignorance towards their slum. Chakrapani ends up as their leader. The story reaches its climax when the government takes steps to get rid of the slum in order to go on with developmental activities and the slum-dwellers find that they have nowhere to go. A JCB arrives on the scene and the local people protest as a union with Chakrapani in the forefront. But their pleas fall on deaf ears. Watch the full movie, Thakarachenda online, only on Eros Now.",
    "languages": "Malayalam",
    "title": "Thakarachenda",
    "kind": "movie",
    "directors": "Avira Rebecca",
    "writers": [
        "Avira Rebecca",
        "",
        "Avira Rebecca",
        "",
        "Walter"
    ],
    "producers": [
        "Xavi Mano Mathew",
        "Naushad"
    ],
    "composers": [
        "Siby Kuruvilla",
        "Chandran Veyattummal"
    ],
    "cinematographers": "M.J. Radhakrishnan",
    "editors": "Baiju Kurup",
    "art directors": "Kollam Suresh",
    "make up department": "Pattanam Rasheed",
    "production managers": "Anil Mathew",
    "assistant directors": "Jayarajan Ambady",
    "sound department": [
        "T. Krishnanunni",
        "Raj Marthandam"
    ],
    "costume departmen": "Kumar Edappal",
    "music department": [
        "Vijeesh Calicut",
        "Manjari",
        "Vineeth Sreenivasan"
    ],
    "thanks": [
        "C.N. Karunakaran",
        "Kusuman",
        "Mary William",
        "Zakaria"
    ],
    "akas": "Thakarachenda (India)",
    "writer": [
        "Avira Rebecca",
        "Avira Rebecca",
        "Walter"
    ],
    "director": "Avira Rebecca",
    "production companies": "NX Visual Entertainment",
    "distributors": "Johny Sagarika Film Company",
    "plot": "The film is set in a slum in Ernakulam and focusses on a group of slum dwellers who are usually ignored in the ambitious blueprints of city developers. The protagonist of the film, Chakrapani (Sreenivasan), is a disabled beggar and also a small-time moneylender who lives in the slum. A drunkard, he spends most of the time quarrelling with his mother. He has an eye on Latha (Geethu Mohandas) who lives nearby with her two children, Siva and Malli, though she detests him. Latha, an asthmatic, works as a maid and dreams of a better future for her children. Another woman Vasanthi (Seema G. Nair) too lives in the slum with her two children and a drunkard of a husband (Manikandan) who is of no use to anybody and who keeps causing endless trouble to her and her children. Finally, desperation forces Chakrapani and Latha to unite and raise their voice in protest again the ignorance towards their slum. Chakrapani ends up as their leader. The story reaches its climax when the government takes steps to get rid of the slum in order to go on with developmental activities and the slum-dwellers find that they have nowhere to go. A JCB arrives on the scene and the local people protest as a union with Chakrapani in the forefront. But their pleas fall on deaf ears. Watch the full movie, _Thakarachenda_ (qv) online, only on Eros Now."
}