{
    "id": "1320185",
    "localized title": "Chandrahas",
    "cast": [
        "Abbas",
        "Abhinayasri",
        "Sharat Babu",
        "Brahmanandam",
        "Puneet Issar",
        "Krishna",
        "Venu Madhav",
        "Harnath Policherla",
        "Ravi Prakash",
        "Satya Prakash",
        "Ravali",
        "Sana",
        "Astha Singhal",
        "Sujata",
        "Waheeda"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Drama",
        "Fantasy"
    ],
    "runtimes": "136",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "te",
        "hi"
    ],
    "color info": "Color",
    "sound mix": "Stereo",
    "certificates": "United States:Not Rated",
    "original air date": "22 Jun 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWI4OWNhMWMtNzllNi00NGUyLWJhMTctOWZiMTBlOTc1ZTdkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "1320185",
    "plot outline": "Archeologist Sivaji Bhonsle lives a wealthy lifestyle in India along with his dad, Sambaji, and mom. The Bhonsle family are friendly with their neighbors, the Khans, consisting of Ghaffar; his wife, Zarina; daughter, Hasina; and son, Feroz. During his childhood, Sivaji's mom had read him bedtime stories about the valor of Chatrapati Sivaji, how he stood up against tyrants, including Mughal Emperor Aurangzeb, and how Devi Maa Bhawani appeared before him, and granted him a magical sword named 'Chandrahas' so that he could continue to fight oppression. When Sivaji was being pursued, he left the sword with his close friend, Hyder Ali Gohri, who hid it in a secret location. Since their passing, no one knows where Chandrahas is hidden. Then Sivaji recruits a young Harvard graduate, Apsara, who assists him in locating Chandrahas. Sivaji's parents are pleased and place it near Devi Maa Bhawani's idol. The Bhonsles do not realize that soon their lives will be turned upside down when Sivaji will accuse Feroz, and the fiancé of Hasina, Sohail, of being traitors, the relation between Khans and Bhonsles will not only sour, but shortly thereafter Sivaji will be accused of killing Ghaffar Khan, while a terrorist, Liyaqat, who possesses the sword of Changez Khan, is determined to obtain Chandrahas at any and all costs.",
    "languages": [
        "Telugu",
        "Hindi"
    ],
    "title": "Chandrahas",
    "kind": "movie",
    "directors": "Shiva Shakti Datta",
    "writers": "Shiva Shakti Datta",
    "producers": [
        "Harnath Policherla",
        "Amanullah J. Sheriff"
    ],
    "composers": "M.M. Keeravani",
    "cinematographers": "R. Raja Ratnam",
    "editors": "L. Rama Rao",
    "assistant directors": "Kranthi Vadlamudi",
    "music department": [
        "Jaidev",
        "Jaylaxmi",
        "Prasanna",
        "Anu Ratha"
    ],
    "akas": "Chatrapathi Sivaji: The King (India, English title)",
    "writer": "Shiva Shakti Datta",
    "director": "Shiva Shakti Datta",
    "distributors": "Bollywood 4 U Television Network",
    "plot": "Archeologist Sivaji Bhonsle lives a wealthy lifestyle in India along with his dad, Sambaji, and mom. The Bhonsle family are friendly with their neighbors, the Khans, consisting of Ghaffar; his wife, Zarina; daughter, Hasina; and son, Feroz. During his childhood, Sivaji's mom had read him bedtime stories about the valor of Chatrapati Sivaji, how he stood up against tyrants, including Mughal Emperor Aurangzeb, and how Devi Maa Bhawani appeared before him, and granted him a magical sword named '_Chandrahas_ (qv)' so that he could continue to fight oppression. When Sivaji was being pursued, he left the sword with his close friend, Hyder Ali Gohri, who hid it in a secret location. Since their passing, no one knows where _Chandrahas_ (qv) is hidden. Then Sivaji recruits a young Harvard graduate, Apsara, who assists him in locating _Chandrahas_ (qv). Sivaji's parents are pleased and place it near Devi Maa Bhawani's idol. The Bhonsles do not realize that soon their lives will be turned upside down when Sivaji will accuse Feroz, and the fiancé of Hasina, Sohail, of being traitors, the relation between Khans and Bhonsles will not only sour, but shortly thereafter Sivaji will be accused of killing Ghaffar Khan, while a terrorist, Liyaqat, who possesses the sword of Changez Khan, is determined to obtain _Chandrahas_ (qv) at any and all costs.::rAjOo (gunwanti@hotmail.com)"
}