{
    "id": "13654642",
    "localized title": "Kanna",
    "cast": [
        "Sheela Kaur",
        "Prakash Raj",
        "Seetha"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "21 Dec 2007 (India)",
    "imdbID": "13654642",
    "plot outline": "The story is set in Coimbatore. Annapoorani (Sheela) is the daughter of Seetha and Raghunath (Prakashraj) MD of a software company. She has everything in life - loving family, friends and studies in a convent where she is a 10th standard student. The school organizes an educational tour to Ooty. Annapoorani goes to Ooty with her friends accompanied by her class teacher Ashirvadham (Livingston) and teacher (Sona Nair). In Ooty, they stay in a palace like guest house. Annapoorani meets Kanna (Raja) who is the group's tour guide. They are at loggerheads, but eventually get closer to each other and their acquaintance blossoms into love. This leads to a twist in the plot. Annapoorani returns to Coimbatore and is unable to forget Kanna. One day she hears her friend planning to meet her boyfriend and she gets an idea. She decides to meet her sweetheart with a gift. She borrows a two-wheeler and starts for Ooty. On the way, the vehicle breaks down. So she continues her journey on foot. In the meantime, her parents panic when they find that she has not returned from school and start searching for her.",
    "languages": "Tamil",
    "title": "Kanna",
    "kind": "movie",
    "directors": "Anand",
    "composers": "Ranjit Barot",
    "akas": "Kanna (India)",
    "director": "Anand",
    "production companies": "Kosmic Film Productions",
    "plot": "The story is set in Coimbatore. Annapoorani (Sheela) is the daughter of Seetha and Raghunath (Prakashraj) MD of a software company. She has everything in life - loving family, friends and studies in a convent where she is a 10th standard student. The school organizes an educational tour to Ooty. Annapoorani goes to Ooty with her friends accompanied by her class teacher Ashirvadham (Livingston) and teacher (Sona Nair). In Ooty, they stay in a palace like guest house. Annapoorani meets _Kanna_ (qv) (Raja) who is the group's tour guide. They are at loggerheads, but eventually get closer to each other and their acquaintance blossoms into love. This leads to a twist in the plot. Annapoorani returns to Coimbatore and is unable to forget _Kanna_ (qv). One day she hears her friend planning to meet her boyfriend and she gets an idea. She decides to meet her sweetheart with a gift. She borrows a two-wheeler and starts for Ooty. On the way, the vehicle breaks down. So she continues her journey on foot. In the meantime, her parents panic when they find that she has not returned from school and start searching for her."
}