{
    "id": "13667508",
    "localized title": "Dhandayuthapani",
    "cast": [
        "Manoj K. Jayan",
        "Shivani Sri",
        "Kadhal Sukumar"
    ],
    "genres": "Drama",
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "27 Apr 2007 (India)",
    "imdbID": "13667508",
    "plot outline": "Dhandayuthapani (S. Suresh Raja) is a carefree and jobless graduate who lives with his widowed mother and siblings in Madurai. One day, he falls in love at first sight with the college student Thenmozhi (Shivani Sri) in a temple. Dhandayuthapani then bumps into Thenmozhi in different situations, and they slowly fall in love with each other, but the lovers do not exchange a single word in all their interactions. Meanwhile, Thamizharasu (Manoj K. Jayan) and Yaanai Kumar (Bobby), two rival gangsters, are fighting over the lands belonging to the government. Later, Yaanai Kumar's henchmen plan to murder Thamizharasu. but before, they spy Thenmozhi taking a bath in her house. Dhandayuthapani, who notices it, starts to chase them and beats them up in front of Thamizharasu. Impressed by Dhandayuthapani's braveness, Thamizharasu offers him to join his gang, but Dhandayuthapani refuses. The cunning Thamizharasu then sends his henchmen, and they brutally attack Dhandayuthapani and lie to him that they are Yaanai Kumar's henchman. Left half-tonsured, naked, and wounded, Dhandayuthapani manages to survive the assault. His family and his friends, who fear for his life, advise him to leave the town. However, the incident leads to a drastic change in Dhandayuthapani's behaviour, and a vengeful Dhandayuthapani joins Thamizharasu's gang. Dhandayuthapani slowly becomes Thamizharasu's best henchman, and he shows his loyalty by killing Yaanai Kumar. Dhandayuthapani, who knew from the beginning that Thamizharasu was the culprit, kills him as well. The film ends with Thenmozhi marrying another man and a rowdy killing Dhandayuthapani.",
    "languages": "Tamil",
    "title": "Dhandayuthapani",
    "kind": "movie",
    "directors": "Saravana Sakthi",
    "writers": "Saravana Sakthi",
    "producers": "C.N. Rajadurai",
    "composers": "E.L. Indhrajith",
    "akas": "Dhandayuthapani (India)",
    "writer": "Saravana Sakthi",
    "director": "Saravana Sakthi",
    "production companies": "CNR Films",
    "plot": "_Dhandayuthapani_ (qv) (S. Suresh Raja) is a carefree and jobless graduate who lives with his widowed mother and siblings in Madurai. One day, he falls in love at first sight with the college student Thenmozhi (Shivani Sri) in a temple. _Dhandayuthapani_ (qv) then bumps into Thenmozhi in different situations, and they slowly fall in love with each other, but the lovers do not exchange a single word in all their interactions. Meanwhile, Thamizharasu (Manoj K. Jayan) and Yaanai Kumar (Bobby), two rival gangsters, are fighting over the lands belonging to the government. Later, Yaanai Kumar's henchmen plan to murder Thamizharasu. but before, they spy Thenmozhi taking a bath in her house. _Dhandayuthapani_ (qv), who notices it, starts to chase them and beats them up in front of Thamizharasu. Impressed by _Dhandayuthapani_ (qv)'s braveness, Thamizharasu offers him to join his gang, but _Dhandayuthapani_ (qv) refuses. The cunning Thamizharasu then sends his henchmen, and they brutally attack _Dhandayuthapani_ (qv) and lie to him that they are Yaanai Kumar's henchman. Left half-tonsured, naked, and wounded, _Dhandayuthapani_ (qv) manages to survive the assault. His family and his friends, who fear for his life, advise him to leave the town. However, the incident leads to a drastic change in _Dhandayuthapani_ (qv)'s behaviour, and a vengeful _Dhandayuthapani_ (qv) joins Thamizharasu's gang. _Dhandayuthapani_ (qv) slowly becomes Thamizharasu's best henchman, and he shows his loyalty by killing Yaanai Kumar. _Dhandayuthapani_ (qv), who knew from the beginning that Thamizharasu was the culprit, kills him as well. The film ends with Thenmozhi marrying another man and a rowdy killing _Dhandayuthapani_ (qv)."
}