{
    "id": "13667594",
    "localized title": "Muruga",
    "cast": [
        "Ashok Kumar Balakrishnan",
        "Ashok Kumar",
        "Shruti Sharma",
        "Vadivelu"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "07 Mar 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYmJkZTgwODAtMDhjNy00ZThmLWJmZDItODg0N2E5YWI4YjRiXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "13667594",
    "plot outline": "Murugan (Ashok) falls in love with his schoolmate Amudha (Shruti Sharma), a rich girl who does not love him in return. When the news of Murugan's love reaches her family, Amudha's uncle Selvam (Riyaz Khan) tries to kill him, ultimately banishing Murugan and his mother from the village. Saddened, Murugan goes to Chennai and ends up with a job as a delivery boy. Having given up all hope of ever seeing Amutha again, he bumps into her when making a delivery at a medical college. Forgetting the past and her family's issues, the two become good friends, and this friendship develops into love. After completing her studies, Amutha returns to the village, only to discover that wedding preparations are underway as her parents had arranged for her to marry Selvam. Finally, Murugan and Amudha succeed in getting married with Amudha's father's blessings.",
    "languages": "Tamil",
    "title": "Muruga",
    "kind": "movie",
    "directors": "R.T. Neason",
    "writers": "R.T. Neason",
    "producers": "Ram Senthil",
    "composers": "Karthik Raja",
    "akas": "Muruga (India)",
    "writer": "R.T. Neason",
    "director": "R.T. Neason",
    "production companies": "Cocktail Dream Productions",
    "plot": "_Muruga_ (qv)n (Ashok) falls in love with his schoolmate Amudha (Shruti Sharma), a rich girl who does not love him in return. When the news of _Muruga_ (qv)n's love reaches her family, Amudha's uncle Selvam (Riyaz Khan) tries to kill him, ultimately banishing _Muruga_ (qv)n and his mother from the village. Saddened, _Muruga_ (qv)n goes to Chennai and ends up with a job as a delivery boy. Having given up all hope of ever seeing Amutha again, he bumps into her when making a delivery at a medical college. Forgetting the past and her family's issues, the two become good friends, and this friendship develops into love. After completing her studies, Amutha returns to the village, only to discover that wedding preparations are underway as her parents had arranged for her to marry Selvam. Finally, _Muruga_ (qv)n and Amudha succeed in getting married with Amudha's father's blessings."
}