{
    "id": "6331730",
    "localized title": "Ballygunge Court",
    "cast": [
        "Sabyasachi Chakrabarty",
        "Mithu Chakraborty",
        "Bhaswar Chatterjee",
        "Biplab Chatterjee",
        "Soumitra Chatterjee",
        "Mamata Shankar"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjZlNGQ0ZTMtNzBkMS00Mzc5LTlkMTAtZWZjZjk2Mzc0ZDZlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTA2ODYzODM@._V1_SY150_CR83,0,101,150_.jpg",
    "imdbID": "6331730",
    "plot outline": "The film centres around an apartment Ballygunge Court, and deals with the lives of three middle aged couples and one elderly couple living there. Nearly all the children of the building have left to pursue a life of their own abroad, leaving their parents behind. Tragedy strikes on christmas when the elderly couple is murdered by robbers after they return from a party in another flat where all the members of the building had assembled. Their bodies are not discovered for a few days. The incident affects all the other members of the building as they try to come to terms with the deaths as well as their own solitude and loneliness. The film seeks to probe into the malady that prevails in our society, whereby the younger generation is obsessed with the thought of going abroad for a more lucrative career.",
    "languages": "Bangla",
    "title": "Ballygunge Court",
    "kind": "movie",
    "directors": "Pinaki Chaudhuri",
    "producers": [
        "Ganesh Bagaria",
        "Sandip Patel"
    ],
    "composers": "Chandan Raychowdhury",
    "director": "Pinaki Chaudhuri",
    "production companies": "Ganapati Production",
    "plot": "The film centres around an apartment _Ballygunge Court_ (qv), and deals with the lives of three middle aged couples and one elderly couple living there. Nearly all the children of the building have left to pursue a life of their own abroad, leaving their parents behind. Tragedy strikes on christmas when the elderly couple is murdered by robbers after they return from a party in another flat where all the members of the building had assembled. Their bodies are not discovered for a few days. The incident affects all the other members of the building as they try to come to terms with the deaths as well as their own solitude and loneliness. The film seeks to probe into the malady that prevails in our society, whereby the younger generation is obsessed with the thought of going abroad for a more lucrative career."
}