{
    "id": "8743080",
    "localized title": "Rameswaram",
    "cast": [
        "Bhavana",
        "Jiiva",
        "Karunas",
        "Lal",
        "Manivannan"
    ],
    "genres": "Drama",
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "30 Nov 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzY2YjlhMTYtZTM2Yi00ODRhLTlkOWQtMzQ0YjliMjE0NjdkXkEyXkFqcGdeQXVyOTA0NTIzNzU@._V1_SY150_CR10,0,101,150_.jpg",
    "imdbID": "8743080",
    "plot outline": "Vasanthi (Bhavana) is the daughter of the big man (Lal), who does a lot of help for the refugees. Bhavana instantly falls for Jeevan (Jiiva), a Tamil refugee, staying in the camp in Rameswaram. Jeevan, nurturing a dream to go back to his homeland, keeps on discouraging the girl, who is stubborn in her love. Jeevan's heart, influenced by the pure love of the girl, starts melting slowly. Enters Bose Venkat, Vasanthi's cousin, who is full of dreams on marrying his childhood sweetheart. He joins as an inspector in the local police station. The whole family is eagerly awaiting their marriage. Problem arises when the family comes to know about the love. The inspector and his uncle try to eliminate the boy. They keep on troubling him without much success. Meanwhile, the refugees get a chance to go back and Jeevan has to go with them. He promises Vasanthi that he would come back to marry her. The family is determined to stop him. Vasanthi decides to end her life if Jeevan doesn't turn up.",
    "languages": "Tamil",
    "title": "Rameswaram",
    "kind": "movie",
    "directors": "Selvam",
    "writers": "Selvam",
    "producers": "S.N. Raja",
    "composers": "Niru",
    "cinematographers": [
        "R.B. Gurudev",
        "Vetri Palanisamy"
    ],
    "editors": "Suresh Urs",
    "akas": "Rameswaram (India)",
    "writer": "Selvam",
    "director": "Selvam",
    "production companies": "ITA",
    "distributors": "ITA",
    "plot": [
        "Vasanthi, part of a well-off family, meets Jeevan, a Sri Lankan refugee yearning to return home. Their bond of friendship soon takes the form of love.",
        "Vasanthi (Bhavana) is the daughter of the big man (Lal), who does a lot of help for the refugees. Bhavana instantly falls for Jeevan (Jiiva), a Tamil refugee, staying in the camp in _Rameswaram_ (qv). Jeevan, nurturing a dream to go back to his homeland, keeps on discouraging the girl, who is stubborn in her love. Jeevan's heart, influenced by the pure love of the girl, starts melting slowly. Enters Bose Venkat, Vasanthi's cousin, who is full of dreams on marrying his childhood sweetheart. He joins as an inspector in the local police station. The whole family is eagerly awaiting their marriage. Problem arises when the family comes to know about the love. The inspector and his uncle try to eliminate the boy. They keep on troubling him without much success. Meanwhile, the refugees get a chance to go back and Jeevan has to go with them. He promises Vasanthi that he would come back to marry her. The family is determined to stop him. Vasanthi decides to end her life if Jeevan doesn't turn up."
    ]
}