{
    "id": "0432090",
    "localized title": "Bunny",
    "cast": [
        "Allu Arjun",
        "Raghu Babu",
        "Chalapathi Rao",
        "Rajan P. Dev",
        "Sarath Kumar",
        "Venu Madhav",
        "Gowri Munjal",
        "M.S. Narayana",
        "Aahuthi Prasad",
        "Prakash Raj",
        "Mukesh Rishi",
        "Sharat Saxena",
        "Chitram Seenu",
        "Seetha",
        "L.B. Sriram",
        "Sudha"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "139",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": [
        "India:U",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "06 Apr 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTc0Y2ZlMGEtM2E2MS00OTYyLThjN2QtNDEyMDNlNDRjMTI0XkEyXkFqcGdeQXVyNjE1OTQ0NjA@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0432090",
    "plot outline": "Somaraju (Prakash Raj ) is a leading business man in Visakhapatnam . Mysamma (Mukesh Rishi ) is a close member of Somaraju, who handles the deals of Somaraju in Hyderabad . Mahalaxmi (Gowri Munjal ) is the daughter of Somaraju. Somaraju dearly loves his daughter. Bunny (Allu Arjun) joins the same college as Mahalaxmi. He impresses Mahalaxmi on the first day itself. Slowly, she falls in love with him. Somaraju, though reluctant initially, agrees to the marriage. Now Bunny has a condition that Somaraju should give his entire property to Bunny as dowry. The rest of the story explains why Bunny asks for Somaraju's property. Bunny's real father is Mahalaxmi's mom's brother. He was a great man with lots of land and property, as well as lots of regard from the government and other people. When Mahalaxmi is born, Mahalxmi's mom asks him to perform the baby naming ceremony and such. On his way there, Somaraju attacks him with the help of a bunch of rowdies. They pretty much kill him and leave him to die in the forest. However, he manages to live and perform Mahalaxmi's ceremony, but he dies minutes after, without telling anyone what happened. Bunny comes to know of this when his so-called father explains to him that he is really his godfather and not his father. While trying to save him, his godfather and godmother give up their own son to keep him alive. To regain his rightful property, Bunny fights Somaraju and he wins his girl.",
    "languages": "Telugu",
    "title": "Bunny",
    "kind": "movie",
    "directors": "V.V. Vinayak",
    "writers": [
        "V.V. Vinayak",
        "",
        "V.V. Vinayak",
        "",
        "Rajendra Kumar"
    ],
    "producers": "Satyanarayana Reddy Mallidi",
    "composers": "Devi Sri Prasad",
    "cinematographers": "Chota K. Naidu",
    "editors": "Gautham Raju",
    "make up department": "Shrikant P. Desai",
    "production managers": "Raju G.G.K.",
    "assistant directors": [
        "G. Dhanunjay",
        "Prakash Pachala",
        "Koppineedi Pullarao",
        "Thota Ramakrishna",
        "Vikram Sirikonda",
        "P.L. Suresh",
        "Vasu Varma"
    ],
    "sound department": [
        "Dharanipathi",
        "J.R. Ethiraj"
    ],
    "stunts": [
        "Lakshman Chella",
        "Ram Chella",
        "Kanal Kannan"
    ],
    "camera department": [
        "Rambabu Aalla",
        "Bhaskar Bandi",
        "M.B. Bhushan",
        "Mujeer Malik"
    ],
    "music department": [
        "S.P. Balasubrahmanyam",
        "Karthik",
        "Malathi",
        "Srilekha Parthasarathy",
        "Sagar",
        "Tippu"
    ],
    "miscellaneous": "Lawrence Raghavendra",
    "akas": [
        "Sri Venkateswara Productions Pvt Ltd Production No. 1 (India, English title)",
        "Банни (Russia)"
    ],
    "writer": [
        "V.V. Vinayak",
        "V.V. Vinayak",
        "Rajendra Kumar"
    ],
    "director": "V.V. Vinayak",
    "distributors": [
        "Geeta Film Distributors",
        "CMV Laservision"
    ],
    "plot": [
        "Prior to his marriage, a young man asks for the property of his fiancee's father, a millionaire, to be written in his name.",
        "Somaraju (Prakash Raj ) is a leading business man in Visakhapatnam . Mysamma (Mukesh Rishi ) is a close member of Somaraju, who handles the deals of Somaraju in Hyderabad . Mahalaxmi (Gowri Munjal ) is the daughter of Somaraju. Somaraju dearly loves his daughter. _Bunny_ (qv) (Allu Arjun) joins the same college as Mahalaxmi. He impresses Mahalaxmi on the first day itself. Slowly, she falls in love with him. Somaraju, though reluctant initially, agrees to the marriage. Now _Bunny_ (qv) has a condition that Somaraju should give his entire property to _Bunny_ (qv) as dowry. The rest of the story explains why _Bunny_ (qv) asks for Somaraju's property. _Bunny_ (qv)'s real father is Mahalaxmi's mom's brother. He was a great man with lots of land and property, as well as lots of regard from the government and other people. When Mahalaxmi is born, Mahalxmi's mom asks him to perform the baby naming ceremony and such. On his way there, Somaraju attacks him with the help of a bunch of rowdies. They pretty much kill him and leave him to die in the forest. However, he manages to live and perform Mahalaxmi's ceremony, but he dies minutes after, without telling anyone what happened. _Bunny_ (qv) comes to know of this when his so-called father explains to him that he is really his godfather and not his father. While trying to save him, his godfather and godmother give up their own son to keep him alive. To regain his rightful property, _Bunny_ (qv) fights Somaraju and he wins his girl.::Prajwal Kamble"
    ]
}