{
    "id": "11357084",
    "localized title": "Alif",
    "cast": [
        "Hadi Bin Arshad",
        "Kubra Khan",
        "Hamza Ali Abbasi",
        "Sajjal Ali",
        "Sadaf Kanwal",
        "Sajal Ali"
    ],
    "genres": "Drama",
    "runtimes": "39",
    "countries": "Pakistan",
    "country codes": "pk",
    "language codes": "ur",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTRjZDEyZjYtZWQ0MS00NjY2LTg4N2MtM2RlNDUxMTBkZDVhXkEyXkFqcGdeQXVyNzE4NzE3NDg@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "11357084",
    "plot outline": "Alif is the journey of Momin and Momina, where Momin's journey is to rediscover his roots and Momina's journey is to maintain the livelihood of her family by fateful events their paths will join. In Momin's journey when everyone has left him alone, his grandfather and Momina help him to connect with who he really is. The negativity in his personality has put him on a path where success and glamour meet him but he drifts away from his purpose in life. On the other hand, Momina agrees to help him because she has recently lost her brother and struggled with emotional trauma, therefore, she understands the difficulties faced by Momin hence she and his grandfather plays the pivotal role to overcome his struggle with past and helps him make peace with memories of his mother.",
    "languages": "Urdu",
    "title": "Alif",
    "kind": "tv series",
    "series years": "2019-2020",
    "seasons": "1",
    "writer": "Umera Ahmed",
    "distributors": "Geo Entertainment",
    "plot": [
        "_Alif_ (qv) is the journey of Momin and Momina, where Momin's journey is to rediscover his roots and Momina's journey is to maintain the livelihood of her family by fateful events their paths will join.",
        "_Alif_ (qv) is the journey of Momin and Momina, where Momin's journey is to rediscover his roots and Momina's journey is to maintain the livelihood of her family by fateful events their paths will join. In Momin's journey when everyone has left him alone, his grandfather and Momina help him to connect with who he really is. The negativity in his personality has put him on a path where success and glamour meet him but he drifts away from his purpose in life. On the other hand, Momina agrees to help him because she has recently lost her brother and struggled with emotional trauma, therefore, she understands the difficulties faced by Momin hence she and his grandfather plays the pivotal role to overcome his struggle with past and helps him make peace with memories of his mother."
    ]
}