{
    "id": "13312978",
    "localized title": "Bai Go Bai",
    "cast": [
        "Purnima Ahire",
        "Dipak Alegaokar",
        "Jaiwant Bhalekar",
        "Nitin Bodhare",
        "Prashant Coudappa",
        "Vinod Gaikar",
        "Nayan Jadhav",
        "Sunil Jadhav",
        "Snehal Kamble",
        "Shashikant Kerkar",
        "Poonam Khair",
        "Sheetal Pathak",
        "Vijay Patkar",
        "Shalaka Pawar",
        "Pari Pimple",
        "Nirmiti Sawant",
        "Krutika Tulaskar"
    ],
    "genres": "Drama",
    "runtimes": "119",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "04 Dec 2015 (India)",
    "imdbID": "13312978",
    "plot outline": "This is the story of Baija, who has established her dominance over Nayakanchi Wadi. She has changed Nayakanchi Wadi to Baikanchi Wadi, as a result of which, women have taken over the village and the men have no importance. This village is running on Baijakka's rules, which dictate that men are to be treated miserably. In fact, no man is allowed to even grow a mustache, and neither can he run away from the village. Every man has to work at her villa and that's not even it. Ever since Baijakka has established power over the village, no child has been born. In short Baijakka is taking revenge against the men. But why. What could be the secret or the reason behind it? When will this whole picture change, and if it does, how? Who will change it? Watch Bai Go Bai to have all your questions answered.",
    "languages": "Marathi",
    "title": "Bai Go Bai",
    "kind": "movie",
    "directors": "Vijay Pagare",
    "writers": "Vijay Pagare",
    "producers": [
        "Mahesh Bharambe",
        "Naresh Thakur"
    ],
    "composers": "Vijay Gatlewar",
    "akas": "Bai Go Bai (India)",
    "writer": "Vijay Pagare",
    "director": "Vijay Pagare",
    "production companies": "R. S. Cine Vision",
    "plot": [
        "This is the story of Baija, who has established her dominance over Nayakanchi Wadi. She has changed Nayakanchi Wadi to Baikanchi Wadi, as a result of which, women have taken over the village and the men have no importance. This village is running on Baijakka's rules, which dictate that men are to be treated miserably. In fact, no man is allowed to even grow a mustache, and neither can he run away from the village. Every man has to work at her villa and that's not even it. Ever since Baijakka has established power over the village, no child has been born. In short Baijakka is taking revenge against the men. But why. What could be the secret or the reason behind it? When will this whole picture change, and if it does, how? Who will change it? Watch _Bai Go Bai_ (qv) to have all your questions answered.",
        "Baijakka terrorizes a village Nayakanchiwadi and has renamed it as Baikanchi Wadi where women have taken over the village and man have no respect.The village runs on rules of Baijakka and ill treats every men in the village and does not even allow them to grow a mustache the men have no way to escape and have to face the brunt.Since Baijakka as taken over the village no child has been born Shiva enters the village and falls in love with Shyamal daughter of Baijakka, he has plans to rule Baijakka' throne due to her arrogance.::alex.mjacko@gmail.com"
    ]
}