{
    "id": "2190820",
    "localized title": "Charlie Kay Chakkar Mein",
    "cast": [
        "Naseeruddin Shah",
        "Nishant Lal",
        "Disha Arora",
        "Amit Sial",
        "Manasi Rachh",
        "Auroshika Dey",
        "Sandeep Vasudevan",
        "Vikas Anand",
        "Subrat Dutta",
        "Elena Roxana Maria Fernandes",
        "Siraj Mustafa Khan",
        "Anchal Nandrajog",
        "Sanam Singh Talwar",
        "Sanamjit Singh Talwar",
        "Anand Tiwari"
    ],
    "genres": "Thriller",
    "runtimes": "102",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "Singapore:M18",
    "original air date": "06 Nov 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTU3NTFkZTktMWFmYy00NTlkLWJiODgtMDlhYWRjN2UzNDBkXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_SY150_CR8,0,101,150_.jpg",
    "imdbID": "2190820",
    "plot outline": "Our life revolves around perception of truth, in our lives we act only on our ability to judge the truth. Truth though is a fickle thing, paradoxically because it only occurs in absolution; rest is only our interpretation that allows us to live in a certain subjective truth. Addl. Commissioner of Police, Sanket Pujari and the rookie officer, Sameera sit across the television screen to decipher a rare case of multiple homicides caught on camera and this case is going to test their fundamental perception of truth.",
    "languages": "Hindi",
    "title": "Charlie Kay Chakkar Mein",
    "kind": "movie",
    "directors": "Manish Srivastav",
    "writers": [
        "Amit Sial",
        "",
        "Manish Srivastav"
    ],
    "producers": [
        "Karan Arora",
        "Amitabh Aurora",
        "Chintan A. Kapadia",
        "Amit Sial",
        "Manish Srivastav",
        "Mayur Srivastava",
        "Arun Tyagi"
    ],
    "composers": [
        "Harry Anand",
        "Rohit Kulkarni",
        "Vishal Mishra",
        "Gurinder Seagal",
        "Manish J. Tipu"
    ],
    "cinematographers": "S.V. Visheshwar",
    "editors": [
        "Ashmith Kunder",
        "Archit D Rastogi"
    ],
    "editorial department": [
        "Shaurya Chadha",
        "Prathvish Hegde",
        "Nishit Mistry",
        "Chinmaya Nath"
    ],
    "production managers": "Jahangir Khan",
    "assistant directors": [
        "Anand Mahant",
        "Kumar Neeraj",
        "Kumar Neeraj"
    ],
    "sound department": [
        "Bigyna Dahal",
        "Sinoy Joseph",
        "Boney M. Joy",
        "Sarath Mohan",
        "Sainathan",
        "Abhijeet V. Sapre",
        "Ravi Dev Singh"
    ],
    "visual effects": [
        "Deeptanshu Ghosh",
        "Sunil Kamath",
        "Santanu Pal",
        "Jayesh Shirke"
    ],
    "music department": [
        "Harry Anand",
        "Karan Arora",
        "Nayantara Bhatkal",
        "Abhiruchi Chand",
        "Neha Kakkar",
        "Nishant Lal",
        "Nisha Mascarenhas",
        "Vishal Mishra",
        "Sandeep Nath",
        "Nabajyoti Panda",
        "Abhijeet Sawant",
        "Amit Sial"
    ],
    "miscellaneous": "Kumar Neeraj",
    "akas": "Chasing Coke (World-wide, English title)",
    "writer": [
        "Amit Sial",
        "Manish Srivastav"
    ],
    "director": "Manish Srivastav",
    "production companies": [
        "Modern Times A & M",
        "Picture Thoughts Production"
    ],
    "distributors": [
        "Custard Apple Pictures",
        "High Ground Enterprise"
    ],
    "plot": [
        "ACP Sanket Pujari and the rookie officer, Sameera sit across the television screen to decipher a rare case of multiple homicides caught on camera and this case is going to test their fundamental perception of truth.",
        "Our life revolves around perception of truth, in our lives we act only on our ability to judge the truth. Truth though is a fickle thing, paradoxically because it only occurs in absolution; rest is only our interpretation that allows us to live in a certain subjective truth. Addl. Commissioner of Police, Sanket Pujari and the rookie officer, Sameera sit across the television screen to decipher a rare case of multiple homicides caught on camera and this case is going to test their fundamental perception of truth.::Manish Shrivastava"
    ],
    "synopsis": "Four Dead bodies in a derelict, deserted house and a hidden camera that contains footage from the crime scene; that is the enigma DCP Sanket Pujari is faced with as he sets about in company of a rookie cop Sameera Pavate and a forensic technician, Ravi Nambiar; to figure out why these seemingly harmless youngsters were killed so brutally.\nThe video footage shows the lives of the victims in past two weeks leading to the moment of their demise Sam, Patty, Nina & Jeeves, the victims and a friend of theirs Dips who seems to have gone missing, last day of their lives. Young, Urban, Yuppies caught in their own separate dilemmas and crisscrossing love lives, their life had taken a turn for worse when Sam had gotten into a scuffle with a stranger at a nightclub. This stranger had followed them from the nightclub and rammed his SUV into their car. In the resultant street brawl, stranger was killed by a passing car. In panic they had run away from the scene and after some gumption, at least tried to put it behind them.\nTwo days later they are approached by a girl, Hera, who claims to be girlfriend of the stranger they had a fight with. She tells them that the stranger, Rahil was estranged son of a mafia don, Azmat Khan and if they do not go along with her plan, she will let Azmat Khan know that they are responsible for Rahils death. Her plan is quiet diabolical too, she knows that Rahil was supposed to pick up a consignment of Cocaine in next two days and she wants them to pick it up instead of him.\nSam, Nina, Patty, Dips & Jeeves; they are completely out of their depths in the situation; but the lure of easy money as well as cockiness of Sam and how their inter-personal relationships are playing out with Hera, it all aligns them behind the plan. At this time they also briefly meet a character, Sohail; introduced by Hera, Sohail is their conduit once they have taken delivery of Cocaine, is responsible for selling it.\nTheir plan to pick up the cocaine goes smoothly enough but then things start turning south; through vague references in the footage Cops learn that a known associate of Azmat Khan, Jabbar has been calling Dips, Body of Rahil has been discovered by the cops and the friction between the friends leads them to repeated showdowns. Till the fateful day when they are shot dead by unknown assailants. All except Dips, he and Hera are nowhere to be found.\nThe only lead DCP Sanket Pujari has is Sohail, already in Police Custody as depicted in the footage. As they start interrogating Sohail, everything that he has to say corroborates with what they have already seen in footage but the truth of what really happened still eludes them. As they poke holes in the theory created by what Sohail has told them; DCP Pujari realizes that Sohail has created a façade to deceive them of the real truth but then what is the real truth. Is it just a simple story of stupidity and simple bravado of five youngsters caught in Charlie Kay Chakkar Mein or is there a much more sinister and diabolical plan behind it???\nWatch CHARLIE KAY CHAKKAR MEIN to know what really happened"
}