{
    "id": "2872050",
    "localized title": "Jai Jawaan Jai Kisaan",
    "cast": [
        "Rati Agnihotri",
        "Kanchan Awasthi",
        "Rishi Bhutani",
        "Prem Chopra",
        "Imran Hasnee",
        "Jatin Khurana",
        "Avinash Kumar",
        "Om Puri",
        "Aarti Tyagi"
    ],
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "runtimes": "100",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "06 Feb 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjk4Nzg4MjEyMV5BMl5BanBnXkFtZTgwNzAzMzAxNDE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "2872050",
    "plot outline": "Jai Jawaan Jai Kisaan is a journey about Lal Bahadur Shashtri's glorious life. The movie begins with the various freedom fights in the country during the pre-independence era. A time where two groups ( Garam Dal and Naram Dal) had waged a war against Britishers with different set of ideologies. It was under the leadership of Gandhi ji that Naram Dal took on the Britishers and led a peaceful march towards independence. Lal Bahadur Shastri was a prominent personality in this group and has a huge role to play in the history of India's independence. However this dynamic leader had his own story to deal with during the initial phase of his life. A low economic background, untimely death of his father and a mother to look after...these were just some of the problems that gave Lal Bahadur Shashtri a direction in life. After completing his studies in Banaras, Shashtri ji came to Allahabad and that's when he witnessed a revolution in the country. Inspired to take part in the freedom fight, Lal Bahadur Shashtri now became an active freedom fighter and was sent to jail several times. But Lal Bahadur Shashtri's fight didn't end with achieving freedom for his motherland, it got extended to his role as India's prime minister too. He is often credited for leading a ethical fight against Pakistan in the year 1965. And who can forget his ever green slogan of Jai Jawaan Jai Kisaan!.",
    "languages": "Hindi",
    "title": "Jai Jawaan Jai Kisaan",
    "kind": "movie",
    "directors": "Milann Ajmera",
    "writers": "Dhiraj Mishra",
    "producers": [
        "Seema Chakerverty",
        "Honey Chaudhary",
        "Pankaj Dua",
        "Madan Lal Khurana"
    ],
    "composers": [
        "Girish Saikia",
        "Rupesh Verma"
    ],
    "cinematographers": "Bimal Dave",
    "editors": "Pushpendr Singh",
    "editorial department": [
        "Sagar Bhatia",
        "Birendra Sharma"
    ],
    "production designers": "Bhupesh Salaskar",
    "production managers": "Ashutosh Agrawal",
    "assistant directors": [
        "Jai Chavan",
        "Sant Darshankumar",
        "Akash Nayak",
        "Vinay Niranjan",
        "Devender Kumar Pandey"
    ],
    "sound department": "Gaurav Shakya",
    "miscellaneous": "Ashwani Shukla",
    "akas": "Jai Jawaan Jai Kisaan (India)",
    "writer": "Dhiraj Mishra",
    "director": "Milann Ajmera",
    "production companies": "Victorious Enterprises",
    "plot": "_Jai Jawaan Jai Kisaan_ (qv) is a journey about Lal Bahadur Shashtri's glorious life. The movie begins with the various freedom fights in the country during the pre-independence era. A time where two groups ( Garam Dal and Naram Dal) had waged a war against Britishers with different set of ideologies. It was under the leadership of Gandhi ji that Naram Dal took on the Britishers and led a peaceful march towards independence. Lal Bahadur Shastri was a prominent personality in this group and has a huge role to play in the history of India's independence. However this dynamic leader had his own story to deal with during the initial phase of his life. A low economic background, untimely death of his father and a mother to look after...these were just some of the problems that gave Lal Bahadur Shashtri a direction in life. After completing his studies in Banaras, Shashtri ji came to Allahabad and that's when he witnessed a revolution in the country. Inspired to take part in the freedom fight, Lal Bahadur Shashtri now became an active freedom fighter and was sent to jail several times. But Lal Bahadur Shashtri's fight didn't end with achieving freedom for his motherland, it got extended to his role as India's prime minister too. He is often credited for leading a ethical fight against Pakistan in the year 1965. And who can forget his ever green slogan of _Jai Jawaan Jai Kisaan_ (qv)!.::Ashwani Shukla"
}