{
    "id": "3063904",
    "localized title": "Sasu Cha Swayamwar",
    "cast": [
        "Vijay Chavan",
        "Bhargavi Chirmuley",
        "Tejaa Deokar",
        "Pushkar Jog",
        "Sunil Pal",
        "Vishakha Subhedar",
        "Satish Tare",
        "Jaywant Wadkar"
    ],
    "genres": "Comedy",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "aspect ratio": "1.78 : 1",
    "sound mix": "Dolby Digital",
    "certificates": "India:U",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTZhOTg5ZTEtMWEwNy00ZGQwLTk2MzYtZWJlZjllODc4NDI0XkEyXkFqcGdeQXVyNDQ4OTEyMzg@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "3063904",
    "plot outline": "The frustrated Mohan Seeks a eligible groom for his interfering sasu. The sasu that he has inherited in his dowry.the unwanted dowry that takes his life through various levels of hell. So he arranges a swayamwar and story starts happening. To palm of his sasu he finds three bachelors.This story is all about how the sasu gets married and lead to an unexpected ending.",
    "languages": "Marathi",
    "title": "Sasu Cha Swayamwar",
    "kind": "movie",
    "directors": "Omkar Mane",
    "writers": [
        "Abhishek Kelkar",
        "",
        "Omkar Mane"
    ],
    "producers": [
        "Shweta Joshi",
        "Rohan Murkar",
        "Samir Parab",
        "Santosh Parab"
    ],
    "composers": [
        "Sai-Piyush",
        "Vivek-Nakool"
    ],
    "cinematographers": "Milind Phadnis",
    "editors": "Shrivallabh More",
    "miscellaneous": "Pradnya Sumati Shetty",
    "akas": "Sasu Cha Swayamwar (India)",
    "writer": [
        "Abhishek Kelkar",
        "Omkar Mane"
    ],
    "director": "Omkar Mane",
    "production companies": "Seven Seas Motion Pictures",
    "plot": [
        "A frustrated guy wants to marry off his mother-in-law so he can have some peace.",
        "The frustrated Mohan Seeks a eligible groom for his interfering sasu. The sasu that he has inherited in his dowry.the unwanted dowry that takes his life through various levels of hell. So he arranges a swayamwar and story starts happening. To palm of his sasu he finds three bachelors.This story is all about how the sasu gets married and lead to an unexpected ending.::Rohan Murkar",
        "Mohan gets married to Nandini but in dowry he inherits his mother in law Lalitabai this unwanted dowry makes his marriage life miserable Mohan and Nandini are unable to get space in the house frustrated with this he arranges her Swayamwar (self selection) and finds three bachelor's who could marry her.::alex.mjacko@gmail.com"
    ],
    "synopsis": "There is a famous English Quote that Twos a company and threes a crowd . Same like this quote some people are always there around us. These people are so irritating but they dont even think that because of their behavior how others lives are affecting. And if these irritating people are our relatives then we cant say anything to them. They come and live in our home like they are the owners.\nMohan Dekhane is a young man approximately 27-28 years old who is very simple, innocent but always in hurry and always do some and other mistake in his work. His wife is Nandini who is very beautiful, and innocent in short typical Maharashtrian wife. They both are very happy together. But this can not sustain for so long time because one atom bomb comes in their life and destroys their happy life specially Mohans life.\nAtom Bombs name is Lalita Devi who is Nandinis mom in other way Mohans Mother in Law (Sasu). She is very dominating, irritating by nature. She is divorcee. She comes to live with them because of her illness but actually its a lie. She wanted to come there and destroy Mohans life because she hate all men. She dont leave a single chance to stay Mohan and Nandini away from each other. Sasu stand like Great china wall between Mohan and Nandini.\nBecause of Sasus irritating behavior Mohan becomes frustrated Man. He can not concentrate on his work. And because of that his boss Vishwasrao Sartape who is very hot headed, peppery , angry man always slams Mohan at every chance. Vishwasrao Sartape is divorcee man. Who lives alone from many years and because of this he have become angry and hot headed man. He always slams everybody in office but specially Mohan. So after all this Mohan traps badly like in House His Sasu and in office his boss and he becomes more frustrating man.\nBut at this time one intelligent and brave man comes to help Mohan. This man is Baaji who is peon in Mohans office but he is very intelligent and always has so many ideas (solutions). Baaji takes him to one psychiatrist Dr. Da. Ba. Belapure who is very famous for his dirty mind specially on Sasu. Doctor have made himself free from his 5 sasu so he is quite experience in Sasu matters. Mohan tells him all his problems and after listening Dr. Belapure gives many ideas, solutions to Mohan but they all fails. Now Mohan is very upset because he can not find any way to get freedom from hell. But Dr. Belapure does not stop. He keeps thinking of new dirty ideas and suddenly he suggest Mohan one solution which can give Mohan permanent freedom from his sasu and that is Sasus Marriage. Mohan tells this Solution to his wife Nandini and somehow he manages to agree Nandini for her moms marriage. Then what Mohan, Nandini and Baaji start searching groom for Sasu. They go and see many grooms but no one is suitable to Mohans sasu. But suddenly one groom comes in Baajis mind who is Mohans great boss Vishwasrao Sartape and in between all this even Nandini finds one groom for her mom who is Nandinis neighbor Mr. chadda. Mr. Chadda is basically a flirty man but from start he really loves Lalita Devi. He have tried to propose Lalita Devi many times but he have failed all the times. Here Baaji and Mohan make ready Vishwasrao Sartape to marry Mohans sasu and there Nandini tells Mr. chadda to marry her mom. In this all Lalita Devi manages to save Dr. Belapure from one problem and even Dr. Belapure Starts loving Lalita Devi and he tells Mohan that he wants to marry wih his sasu and if he can not then he will do suicide and with this Mohan gets in another problem. He can not decide one groom for his Sasu but on this problem also Baaji comes with solid solution which is SASU CHA SWAYAMWAR."
}