{
    "id": "3148502",
    "localized title": "Tamasha",
    "cast": [
        "Deepika Padukone",
        "Ranbir Kapoor",
        "Piyush Mishra",
        "Sushma Seth",
        "Ishwak Singh",
        "Jawed Sheikh",
        "Vivek Mushran",
        "Jeeveshu Ahluwalia",
        "Sukhesh Arora",
        "Ishtiyak Khan",
        "Naila Grewal",
        "Arushi Sharma",
        "Nary Singh",
        "Svetlana Tulasi",
        "Teddy Maurya",
        "Saurabh Pal",
        "Nikhil Bhagat",
        "Kanwalpreet Singh",
        "Yash Sehgal",
        "Kshitij Sharma",
        "Samir Sharma",
        "Faraaz Servaia",
        "Shaji Dheeraj",
        "Ronak Harsh",
        "Punam Singh",
        "Aditya Prabhakar Jain",
        "Sohom Pramanick"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "139",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:PG",
        "Belgium:KT/EA",
        "Brazil:12",
        "Canada:PG::(British Columbia)",
        "Canada:G::(Quebec)",
        "France:Tous publics",
        "Germany:6",
        "Hong Kong:IIA",
        "India:UA",
        "Ireland:PG",
        "Malaysia:P13",
        "Netherlands:6",
        "New Zealand:M",
        "Norway:A",
        "Singapore:PG",
        "South Africa:7-9",
        "Switzerland:16",
        "Taiwan:PG-12",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "27 Nov 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjA1MTc0Mjc4Ml5BMl5BanBnXkFtZTgwNjU5Nzk4NjE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "3148502",
    "plot outline": "Tamasha is about the journey of someone who has lost his edge in trying to follow acceptable conventions of society. The film is based on the central theme of abrasion and loss of self that happens in an attempt to find oneself.",
    "languages": "Hindi",
    "title": "Tamasha",
    "kind": "movie",
    "directors": "Imtiaz Ali",
    "writers": "Imtiaz Ali",
    "producers": [
        "Jean-Patrick Costantini",
        "Sandeep Leyzell",
        "Rakesh Madhotra",
        "Naman Mehra",
        "Sajid Nadiadwala",
        "Sanu Roy",
        "Rajesh Sharma"
    ],
    "composers": "A.R. Rahman",
    "cinematographers": "Ravi Varman",
    "editors": "Aarti Bajaj",
    "editorial department": [
        "Salil Deshpande",
        "Ken Metzker",
        "Nitin Minz",
        "Prodip Paul",
        "Ranendu Ranjan"
    ],
    "casting directors": [
        "Mukesh Chhabra",
        "Sanu Roy",
        "Peretti Jean Simon"
    ],
    "production designers": [
        "Snigdha Basu",
        "Sumit Basu",
        "Rajnish Hedao"
    ],
    "art directors": [
        "Manini Mishra",
        "Manini Mishra",
        "Arnaud Putman"
    ],
    "costume designers": [
        "Aki Narula",
        "Anaita Shroff"
    ],
    "make up department": [
        "Gabriel Georgiou",
        "Rushikesh Prakash Lad"
    ],
    "production managers": [
        "Kushagra Kulshrestha",
        "Subhash Lakara",
        "Shah Naimish",
        "Ashok Reva Yadav",
        "Priyanshu Sharma"
    ],
    "assistant directors": [
        "Gautam Bhalla",
        "Qurran Jaiswal",
        "Sonal Joshi",
        "Salman Khan",
        "Vishal Mundra",
        "Tanmai Rastogi",
        "Claire-Oriane Vauchelle"
    ],
    "art department": [
        "Lisa Ashbrook",
        "Alexandre Cottin"
    ],
    "sound department": [
        "Curran Alphonso",
        "Sampath Alwar",
        "Cherag Cama",
        "Devabrot Chaliha",
        "Vishnu Das",
        "Yatrik Dave",
        "Alok De",
        "Justin Jose",
        "Pingal Kalita",
        "T.R. Krishnachetan",
        "Faisal Majeed",
        "Harish Nath",
        "Ajay Kumar P.B.",
        "Dipesh Patel",
        "Siddhesh Sardesai",
        "S. Sivakumar",
        "Dileep Subramaniam",
        "Aravind Vijayakumar"
    ],
    "visual effects": [
        "Gaurav Baghel",
        "Yatin Bhave",
        "Das Chinmay",
        "Mahesh Desai",
        "Vishal Dhavle",
        "Hiral Kawa",
        "Sandeep Mane",
        "Abhilash Nanda",
        "Sandeep Patel",
        "Ramesh Petwal",
        "Sarika Salian",
        "Chandrakant Shenoy",
        "Prasad Sutar",
        "Jitendra Yadav",
        "Dhanendra Sahu"
    ],
    "camera department": [
        "Aman Dhillon",
        "Frédéric Gibert",
        "Ganesh Hegde",
        "Ganesh s Hegde",
        "Nils Le Gall",
        "Vishnu Panicker",
        "Harish Sandhu",
        "Bobby Sanivarapu",
        "Rajesh Shukla",
        "B.K. Sivan",
        "Shivam Suvarna"
    ],
    "animation department": "Nitin Bhalla",
    "casting department": [
        "Saurabh Pal",
        "Jean Simon Peretti",
        "Balwinder Singh",
        "Ranjit Batra"
    ],
    "costume departmen": [
        "Emmanuelle Pastre",
        "Natasha Vohra",
        "Wanda Wellard"
    ],
    "music department": [
        "Lucky Ali",
        "Arjun Chandy",
        "Mohit Chauhan",
        "Ishaan Chhabra",
        "Hari Dafusia",
        "Kevin J. Doucette",
        "Alma Ferovic",
        "Arpita Gandhi",
        "Haricharan",
        "Haripriya",
        "Irshad Kamil",
        "R. Nitish Kumar",
        "Hentry Kuruvilla",
        "A.R. Rahman",
        "Arijit Singh",
        "K.J. Singh",
        "Mika Singh",
        "Shashwat Singh",
        "Sukhwinder Singh",
        "Vinay Sridhar",
        "Srinidhi Venkatesh",
        "Jerry Silvester Vincent",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Darshan Bhanushali",
        "Mohit Choudhary",
        "Shohini Dutta",
        "Caesar Gonsalves",
        "Somit Gope",
        "Chandan Kumar",
        "Ashley Lobo",
        "Khyati Madaan",
        "Bosco Martis",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Augustus Pereira",
        "Anil Sekhri",
        "Ankit Tripathi"
    ],
    "akas": [
        "The Spectacle (United States, English title)",
        "Der Zauber in dir - Tamasha (Germany)",
        "Спектакль (Russia)",
        "Imtiaz Ali's Next"
    ],
    "writer": "Imtiaz Ali",
    "director": "Imtiaz Ali",
    "production companies": [
        "Nadiadwala Grandson Entertainment",
        "iFilm France",
        "iFilm France"
    ],
    "distributors": [
        "UTV Motion Pictures",
        "Vandi Media",
        "Alive Vertrieb und Marketing",
        "Rapid Eye Movies"
    ],
    "special effects": "NY VFXWaala",
    "other companies": [
        "Acropolis",
        "Prime Focus",
        "Spice PR",
        "Spice",
        "T-Series",
        "Trigger Happy Entertainment",
        "Trigger Happy"
    ],
    "plot": [
        "_Tamasha_ (qv) is about the journey of someone who has lost his edge in trying to follow acceptable conventions of society. The film is based on the central theme of abrasion and loss of self that happens in an attempt to find oneself.::King Motwani",
        "All stories are same and yet one needs to find their own story. But before you start the journey of creating your own story, one must free oneself from being a character in stories created by other people. Ved (Ranbir Kapoor) is one such character displaying erratic behavior who realizes that the end to his suffering is to create his own story.",
        "Ved and Tara accidentally meet in Corsica, France and decide to spend the next 7 days together with secretly revealing their true identity or without any promise to meet later, ever. Tara eventually falls in love with Ved and goes to find Ved after 4 years, and helps him to find his true story where he belongs.::thesangramkakad"
    ],
    "synopsis": "The film opens with Ved (Ranbir Kapoor) and Tara's (Deepika Padukone) monotonous back stories as people in the corporate world. A flashback shows, as a child in Shimla, Ved is fascinated by the stories narrated by a road side story teller (Piyush Mishra) who keeps mixing up his characters.The film moves to real time where Tara meets adult Ved, while both are holidaying in Corsica. They come up with an amusing verbal pact to keep their real identities undisclosed. They explore the island together. They pretend to be \"Don\" and \"Mona Darling\" and talk in filmy dialogues. When she realizes she is falling in love with Ved, Tara decides to leave Corsica despite the romantic friendship with him. The story flashes back to young Ved who questions the story-teller about the reason for happy times ending quickly and notices each story has a sad episode in it.Tara returns to Kolkata, India. Tara's father (played by Nikhil Bhagat) hands over his tea business to Tara, she expands it by starting a line of tea boutiques, taking the company ahead. She is off to Delhi for work and four years have passed. One day, Tara surprisingly meets Ved, who is now a product manager. They reveal their original identities. They plan for a date at a Japanese restaurant. She expects him to talk like the days in Corsica but Ved talks about business. She calls Ved up home to be intimate. Ved leaves for his home and next morning Ved wakes up on time, completes the morning chores, wipes the car, ignores the transgender on the way, lets a female colleague into the lift-all this happens on his way to the office. He fixes a plan for meeting Tara again in the evening. Each morning to evening, similar incidents repeat monotonously. On Ved's birthday, he proposes to Tara but she is unhappy with the real-life Ved. She declines the proposal. Ved leaves for his home by an auto-rickshaw. The driver (played by Ishteyak Khan) narrates how his dreams of becoming a singer were crushed. Ved breaks down and his residual mental disorder is triggered.[5]An exacerbated Ved due to his Borderline personality ends up upsetting his boss with nonsensical presentation in a business meeting. Ved begs Tara to come back to his life. She indirectly informs him she is fixated in Ved's divergent personality from Corsica, not the matured Ved who lives by societal conventions. Later Tara expresses her realization of hurting him and apologizes. Frustrated Ved leaves. Next day, Ved continues his office routine with a change, gives a diamond ring to the transgender and he gets evicted from his workplace for his continuous mindless behaviors.Ved comes back to Shimla and reveals he was jobless and wandering for six months. After a tussle with his father, Ved gains introspection from a reflection in the mirror, he realizes that to complete his own story, he needs to meet the old story-teller. The old story-teller criticizes Ved's irrationality, and confronts him to complete his own story. This opens Ved's eyes. Ved narrates his life story to his family members. Moved by this, his father forgives him for leaving engineering and lets Ved pursue his life as he wishes.Ved returns to Delhi and takes the diamond ring returned to him by the affectionate transgender. Tara, after finishing a business meeting at Oracle in Tokyo, heads for refreshment where she finds a note titled \"Don Returns\". Perplexed about Ved's presence, she moves around the office campus and Ved draws her attention with the \"Don\" personality from Corsica. The film goes into a flashback and shows scenes from Shimla of a free spirited-young Ved, a college going Ved and an adult Ved. The film returns to present day (first scene of the film) where Ved and Tara complete the process of putting up an elaborated skit on stage (in continuation of the opening scene of the film) a spectacle which depicts of their own life story."
}