{
    "id": "3803860",
    "localized title": "Puli",
    "cast": [
        "Joseph Vijay",
        "Sridevi",
        "Sudeep",
        "Prabhu",
        "Shruti Haasan",
        "Hansika Motwani",
        "Nandita Shwetha",
        "Vijayakumar",
        "Robo Shankar",
        "Jasper",
        "Thambi Ramaiah",
        "Ajay Ratnam",
        "Sugunthan"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Fantasy"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A",
        "Canada:PG::(Alberta)",
        "Canada:14A::(British Columbia)",
        "Canada:G::(Quebec)",
        "France:Tous publics",
        "India:U",
        "Indonesia:13+",
        "Ireland:15A",
        "Malaysia:P13",
        "Norway:12::(cinema rating)",
        "Singapore:PG13",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "01 Oct 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmNkZGM4Y2UtMTZhOC00ZTMzLWI0ODYtZjQ3MDhjNWIzOWJiXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3803860",
    "plot outline": "Maru Dheeran is a meek child brought up in an enslaved village coming under the oppressive rule of the blue-eyed monstrous 'Vedalam' group who burden the people with enormous taxes and kill on whim. When his wife is kidnapped for sacrifice by the Vedalam Queen & her commander in-chief, Maru Dheeran takes a journey to their impenetrable fort in order to retrieve her and put an end to the tyranny.",
    "languages": "Tamil",
    "title": "Puli",
    "kind": "movie",
    "directors": "Chimbudeven",
    "writers": "Chimbudeven",
    "producers": [
        "Selvakumar",
        "Shibu Thameens"
    ],
    "composers": "Devi Sri Prasad",
    "cinematographers": "Nataraja Subramanian",
    "editors": "A. Sreekar Prasad",
    "editorial department": [
        "Raja Pandiyen",
        "Suresh"
    ],
    "art directors": "Muthuraj",
    "costume designers": "Deepali Noor",
    "production managers": "Shyam Prasad",
    "sound department": [
        "Vishnu Govind",
        "Sree Sankar",
        "G. Sreesan",
        "Vajjiravel Varun"
    ],
    "visual effects": [
        "Prafull Arora",
        "Bejoy Arputharaj",
        "Balakrishnan",
        "Fayaz",
        "Alex Filipov",
        "Daniel French",
        "Alexia Goldenblum",
        "Govind Krishna",
        "Viktor Lavrentyev",
        "Vitalii Musatov",
        "Aravind Naga",
        "Alexander Oplanchuk",
        "Padmapriya",
        "Sujith Suresh Pandalam",
        "Azhagu Raj Pandian",
        "Phantom-fx",
        "Praveenraj",
        "Silas Puls",
        "Kamalakannan R.C.",
        "Raju",
        "Vinoth Ramalingam",
        "Satya Reddy",
        "Kalaiarasi Sathappan",
        "Artem Seleznev",
        "Andrew Shibi",
        "Vyacheslav Simakov",
        "Mohinder Subramaniam",
        "Viacheslav Sych",
        "Aleksey Tarasenko",
        "Vitaliy Treboganov",
        "Aleksey Udaltsov",
        "Venkat Karunakar Uday",
        "Unifimedia",
        "Venkat Vadisetti",
        "Christopher Fernando"
    ],
    "stunts": "Dhilip Subbarayan",
    "camera department": [
        "Anand",
        "Nutakki Anoop",
        "Hayath Basha",
        "N. Bharathwaj",
        "P. Chelladurai",
        "P. Govindaraj",
        "Gautam Kumar Jayaseelan",
        "P. Karthick",
        "S. Karthick",
        "Vikram Kulkarni",
        "Satish Kumar",
        "Sudeep Kumar",
        "Umashankar M.",
        "K. Nirmal Venkatesh",
        "Pavithira Padmanathan",
        "Praveen Raghunath",
        "Swathik Raj",
        "Sagar Singh",
        "Kumaran Siva",
        "Sudhakar",
        "N.C. Sundar",
        "Venkatesan",
        "Tushar Vibhute",
        "Christye Xavier"
    ],
    "animation department": [
        "Nitin Bhalla",
        "Fayaz",
        "Alex Filipov"
    ],
    "music department": [
        "Javed Ali",
        "Mano",
        "Priyadarshini",
        "Joseph Vijay"
    ],
    "transportation department": "Praveen-Balaganesh",
    "miscellaneous": [
        "Lal Anlin",
        "Jishnu Laxman",
        "Chinni Nihalani",
        "Praveen-Balaganesh",
        "Pro Yuvraaj"
    ],
    "akas": [
        "Puli - Le tigre (France)",
        "The Tiger (Australia)"
    ],
    "writer": "Chimbudeven",
    "director": "Chimbudeven",
    "production companies": "SKT Studios",
    "distributors": [
        "Ayngaran International",
        "Ayngaran International",
        "MKS Retail Group",
        "Sun TV"
    ],
    "special effects": [
        "Phantom-FX",
        "Raketa Film",
        "Surpreeze"
    ],
    "other companies": [
        "Promoshop",
        "Sony Music India"
    ],
    "plot": [
        "A virtuous soldier tries to save people from an evil queen and a throne-seeking commander.",
        "Maru Dheeran is a meek child brought up in an enslaved village coming under the oppressive rule of the blue-eyed monstrous 'Vedalam' group who burden the people with enormous taxes and kill on whim. When his wife is kidnapped for sacrifice by the Vedalam Queen & her commander in-chief, Maru Dheeran takes a journey to their impenetrable fort in order to retrieve her and put an end to the tyranny.::PipingHotViews [http://pipinghotviews.com]",
        "Marudhiveeran a floating baby raised by a village Goodman falls in love with the village head's daughter. She gets kidnapped by Vedhalams evil warriors commanded by a cruel warlord and cruel king. On his quest to save his lady love he discovers his true father, fights to save the kingdom and his love.::Justin Arokiaraj"
    ],
    "synopsis": "Marudheeran (Vijay) is the adopted son of a tribal village chief Vembunathan (Prabhu). From a young age, he notices the atrocities regularly committed on the villagers by a group of people from the neighbouring kingdom of Vedalapuram called the Vedhalams, who have supernatural powers. When he becomes an adult, he starts to protect the villagers from the Vedhalams, because of which he is well respected by the villagers.Marudheeran falls in love with his childhood sweetheart Pavazhamalli (Shruti Haasan) and both soon decide to marry. One day, Pavazhamalli is kidnapped by a group of Vedhalams, who then ransack the village and also kill Vembunathan. Marudheeran, along with his close friends Kodangi (Thambi Ramaiah) and Sama (Sathyan), begin a journey to Vedhalapuram to rescue Pavazhamalli. In the first part of the journey, he and his friends enter a part of a forest where invisible people are rumoured to live. It is actually tiny people who lived there and used arrows to drug Marudheeran and capture Sama and Kodangi. After waking up, the king Newton, decides that the must die by the sting of a poisonous spider. His daughter, Kamalakshmi, tells her father to stop, as his eyes don't say that he is a Vedhalam. After ridding him of his gag, he tells them how Vedhalams took his wife and he journeys to get her and their village's freedom back. They are overjoyed to help, since the Vedhalams eat them like side dishes. Newton introduces his cheifs, Alpha and Beta, and his wife and daughter, Flemming and Kamalakshmi. The trio tell them that they are looking for an old wise person whom the Tiny King says is a good friend of his. Alpha and Beta are assigned to take them to the old wise person and Kama asks to go and he permits her. It is revealed that the old wise person was actually an old wise turtle. The turtle tells them a bunch of senseless sentences and goes back into his humongous shell. When Kodangi insults him, he spits on him and they continue. They come to a huge gap in the valley in front of them. Following a sentence from the Turtle, he rolls a big rock with a scorpion painted on it into a big hole. A bridge connected to the other side and they went to that side. They come to a pond and don't know what to do, so Alpha suggests that they check holy texts, which he has brought, when they find a different kind of leaf. It said they have to make a tube and blow from it and a green frog will show the way. Marudheeran blew and a frog came along. They checked it again and it said you will have to lick it's back. Kodangi was voted for it. He licked it and it showed the way to Vedhalapuram. When Marudheeran goes to retrieve his sword,he hears a girl's scream. Marudheeran rescues Manthagini (Hansika Motwani), the princess of Vedhalapuram, from a panther. This is noticed by Jalatharangan (Sudeep), the Commander-in-Chief of Vedhalapuram. Marudheeran seems to recognize his name \"Thalapathi\" as the man who cut his adopted father's arm. On the pretext of being medicine makers, Marudheeran, Kodangi, Sama, Alpha, Beta and Kama enter the Vedhalapuram palace, where they meet Queen Yavanarani (Sridevi), the cruel queen of Vedhalapuram who is also a sorceress. She allows them to stay at the palace and soon Marudheeran wins the support of the Queen and the love of Manthagini with his fighting prowess and resilience. Yavanarani announces the engagement of Marudheeran with Manthagini.Later, Marudheeran finds out that he himself is a Vedhalam. Marudheeran was the son of Pulivendhan (Vijay), the prince of Vedhalapuram and Queen Yavanarani's brother. When he stood up to Jalatharangan, who used to terrorise the villagers with the help of his men, Jalatharangan killed him and his wife Pushpa (Nanditha). Marudheeran also finds out that Yavanarani is actually a puppet Queen under the influence of evil magical power emanating from Jalatharangan's ring. Due to the evil magical influence, Yavanarani developed magical powers as well as her tyrannical behaviour. She performs yearly Kanya Puja to boost her magical powers. After Yavanarani performs the Kanya Puja for the eighteenth consecutive year (this time on Pavazhamalli), Jalatharangan has planned to eliminate her and take over the throne.Marudheeran fights Jalatharangan and kills him. But before he dies, Jalatharangan opens his ring, releasing all the evil magical power so that Yavanarani could continue to rule Vedhalapuram as a tyrantess without his control after his death. Marudheeran realises that the Queen can be returned to normal only if her staff, which is the source of her magical power, is destroyed. He and Manthagini find her performing the Kanya Puja on Pavazhamalli. After a bitter sword fight with the Queen, he manages to destroy the staff, thus restoring the Queen to her normal self. The Queen insists on dying for her actions, but Marudheeran saves her. In gratitude for releasing her from the evil magical influence, Yavanarani makes Marudheeran heir to the throne of Vedhalapuram. In a credits scene, Sama is shown to be miniaturized and married to Kama."
}