{
    "id": "4309284",
    "localized title": "The Silent Heroes",
    "cast": [
        "Mann Bagga",
        "Gurfareen Bano",
        "Maanuv Bharadwaj",
        "Tarun Bhargawa",
        "Aashish Chauhan",
        "Khwaish Gupta",
        "Simran Kaur",
        "Priyanka Panchal",
        "Priyanka Panchal",
        "Nirmal Pant",
        "Jaideep Rawat",
        "Sushil Yadav"
    ],
    "genres": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "runtimes": "115",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "D-Cinema 96kHz 5.1",
    "certificates": "India:U::(theatrical rating)",
    "original air date": "11 Dec 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjEwMmEyNGUtZDEzMS00YTE2LWI1NjctMmJhZGE1NmY3ZDA0XkEyXkFqcGdeQXVyNjU0MjQ5MjQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "4309284",
    "plot outline": "The film, Silent Heroes, is based on the story of 13 real deaf children who through mountaineering want to prove that they are different but not disabled. The Leader who never considered the deaf children as capable and equal and discouraged them all through the course gets badly injured in an accident. This might be an end to Children dreams of scaling Himalayan peaks and proving their worth in front of the outside world. Now it is for these deaf children to show their skills, presence of mind and courage to save their Leader and prove their worth.",
    "languages": "Hindi",
    "title": "The Silent Heroes",
    "kind": "movie",
    "directors": "Mahesh Bhatt",
    "writers": [
        "Mahesh Bhatt",
        "",
        "Mahesh Bhatt",
        "",
        "Rituraj Bhatt"
    ],
    "producers": [
        "Mahesh Bhatt",
        "Kamal Birani",
        "Piyoosh Rautela"
    ],
    "composers": "Rahul Mishra",
    "cinematographers": "Roopang Acharya",
    "editors": "Alok Singh",
    "editorial department": "Amit Kumar",
    "casting directors": "Shahid Hasan",
    "production designers": "Rituraj Bhatt",
    "art directors": [
        "Manish Kolte",
        "Rugved Ranade"
    ],
    "costume designers": "Neha Didwania",
    "production managers": "Dinesh Rajkumar",
    "assistant directors": "Abhishek Chauhan",
    "art department": [
        "Krishna Beha",
        "Mukesh Gupta",
        "Raju Khan",
        "Jayesh Shah",
        "Surendran"
    ],
    "sound department": [
        "Navneet Singh",
        "Narendra Sinha"
    ],
    "visual effects": "Amit Kumar",
    "stunts": [
        "Vipin Sharma",
        "Chain Singh",
        "Rajvindra Singh"
    ],
    "camera department": [
        "Nikhil Gulhane",
        "Manish Kumar",
        "Manoj Sati",
        "Rakesh Singh"
    ],
    "music department": "Ashish Jha",
    "miscellaneous": [
        "Amit Kumar Anshu",
        "Piyoosh Rautela",
        "Himanshu Tiwari"
    ],
    "writer": [
        "Mahesh Bhatt",
        "Mahesh Bhatt",
        "Rituraj Bhatt"
    ],
    "director": "Mahesh Bhatt",
    "production companies": "Hans Production",
    "distributors": [
        "A Mates Entertainment Release",
        "Ei Media",
        "Noble Thoughs",
        "Noble Thoughts"
    ],
    "special effects": "Nehru Institute of Mountaineering",
    "other companies": [
        "Abhishek Films",
        "Mint Design Productions",
        "Rudra Abhishek Films"
    ],
    "plot": [
        "The story of 13 Real deaf children and their heroism, passion and humanity.",
        "The film, Silent Heroes, is based on the story of 13 real deaf children who through mountaineering want to prove that they are different but not disabled. The Leader who never considered the deaf children as capable and equal and discouraged them all through the course gets badly injured in an accident. This might be an end to Children dreams of scaling Himalayan peaks and proving their worth in front of the outside world. Now it is for these deaf children to show their skills, presence of mind and courage to save their Leader and prove their worth."
    ],
    "synopsis": "In the environs of Uttarakhand amid the Himalayan peaks, Kapil Malhotra, an ex-army officer trains local kids in mountaineering, search and rescue. Gauri Singh, a school teacher in a deaf school, approaches him with an offer to train the children in her school for a mountaineering expedition; children who are considered handicapped by society due to their hearing and speech impairment.Kapil readily accepts the proposal. He selects 13 students from the deaf school and takes them to the Nehru Institute of Mountaineering (NIM), Uttarkashi, for advanced mountaineering training. This initiative is appreciated by the local and national media.The children meet their own set of challenges at NIM. Hima Singh, an accomplished Instructor, doubts the decision of Principal Col. Thapa to enroll these children in a mountaineering course. She firmly believes these children to be unfit for a course that is physically challenging and mentally demanding.Due to some unforeseen circumstances, Kapil gets injured in a freak accident. Unable to change the dates of the expedition, as the whole country is observing their progress, the Institute decides to send Hima with the children for their final expedition into theHimalayas; which they have to successfully complete to become certified mountaineers. Together, they begin their trek through the dangerous Himalayan mountains of Uttarakhand. A few days into the expedition, another accident badly injures Hima and her assistant, Rajendra, when they fall down a cliff. He is sent down to the base camp for treatment while Hima decides that she is fit to carry on the trek. However, as the time passes, her internal injuries surface but her attitude towards the children remains unfriendly.One morning, the children find Hima lying unconscious in her tent and decide to help her. She wakes up, and realizes that her leg is in immense pain and if not treated immediately, could be amputated. She tells the children that she has called for help and the new expedition team will be arriving soon. She decides to leave to a nearby medical base camp, but falls unconscious after a few steps.There is a media uproar on hearing about the expeditions accident. Col. Thapa tries to assure everyone as he believes that Hima is in charge. Gauri and Kapil also question their intention and wonder if the expedition was overambitious and if the children are safe.Meanwhile, the children decide to take Hima to the medical base camp themselves. They devise a plan to make a raft from their mattresses and water bottles to carry her downstream on the Ganges. Shovels and oars are used to maneuver the raft.Kapil, in the meantime, is distressed with the news of the expedition. He finds Kshitijs diary, from a previous search mission. He tries to read the diary to motivate himself, but Gauri walks in and finds out about the diary. She is upset at discovering that Kapil was the man who led the rescue team and blames him for the death of Kshitij. She also accuses him of having an ulterior motive to sending the children on the expedition, stating that he did it out of guilt and not as a noble intention. Kapil is distraught and packs his bags to leave and find the children himself, despite his injuries.In the meantime, the makeshift raft steadily heads downstream with the children frantically trying to stay on it. When they finally reach downstream, Gauri notices them but one of the rescue team workers finds out that there is a rapid down the river, which even professional rafters stay away from.Kapil runs towards the mountains, where he finds a child sitting on a rock, who informs him what has happened to the children and Hima. Gauri sees the children and shouts in panic, not realizing that they cannot hear her. She takes another raft and decides to rescue them but is unable to due to her inexperience in rafting. The makeshift raft moves fast towards the rapids and there is very little time to save them. Kapil comes to the rescue of the children and uses his military experience to save them just in time.Hima wakes up in a hospital and remembers how the children, whom she scorned, were ultimately responsible for saving her life. She finally feels remorse and is full of gratitude for the children.The children are honoured with the Presidents Gold Medal for Bravery and the media have a field day with stories of the childrens courage and determination. The country echoes with cheers and the children gain the title of The Silent Heroes."
}