{
    "id": "4333674",
    "localized title": "Hunterrr",
    "cast": [
        "Gulshan Devaiah",
        "Radhika Apte",
        "Sai Tamhankar",
        "Veera Saxena",
        "Rachel D'Souza",
        "Hansa Singh",
        "Divya Seth Shah",
        "Sagar Deshmukh",
        "Neena Kulkarni",
        "Vaibhav Tatwawadi",
        "Kiran Khoje",
        "Shalva Kinjawadekar",
        "Ayli Ghiya",
        "Kallirroi Tziafeta",
        "Jyoti Subhash",
        "Ravindra Mankani",
        "Farhina Parvez",
        "Rasghania Bharat",
        "Sandeep Dhabale",
        "Arvind Goswami",
        "Mandar Kulkarni",
        "Aishwarya Mokashi",
        "Dara Singh"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "141",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:A",
        "Netherlands:12",
        "Singapore:NC16",
        "South Korea:18"
    ],
    "original air date": "20 Mar 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDVlN2EyOTItMTY4MC00MzM3LWFkZWEtYWJhYWY0YzQzZDc3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "4333674",
    "plot outline": "Mandar Ponkshe is an ordinary guy, meaning there is hardly anything extraordinary about him. He is maybe 5'8\" or 5'9\". He dresses very un-dandily if there was such a term, wears a goatee to hide what could be considered a weak chin. Mandar does not attract attention because he wants to be seen as ordinary. But behind that facade is a story - of an interesting past life that has been led. His single-minded pursuit of girls, tall and short, stout or with a pout. He's funny unconventionally without meaning to be witty. His friends have lost all hope of him settling down, as they know that he doesn't plan to. And then suddenly he meets someone whom he starts liking... and falls in love with. What will happen now? Will she know about his past? Will he able to hide his Hunterrrr reputation? The story of a guy, who doesn't want to grow up!",
    "languages": "Hindi",
    "title": "Hunterrr",
    "kind": "movie",
    "directors": "Harshavardhan Kulkarni",
    "writers": [
        "Harshavardhan Kulkarni",
        "",
        "Vijay Maurya"
    ],
    "producers": [
        "Vikas Bahl",
        "Satyen Chandiramani",
        "Rohit Chugani",
        "Robin Dcruz",
        "Doris George",
        "Anurag Kashyap",
        "Madhu Mantena Varma",
        "Mansi Maroo",
        "Ketan Maru",
        "Alan McAlex",
        "Vikramaditya Motwane",
        "Kirti Nakhwa",
        "Rita Patel",
        "Amitabh Shukla",
        "Ranjan Singh",
        "Raja Tangudu"
    ],
    "composers": "Khamosh Shah",
    "cinematographers": "John Jacob Payyapalli",
    "editors": "Kirti Nakhwa",
    "editorial department": [
        "Satyajeet Bhosale",
        "Salil Deshpande",
        "Rajiv Manahalli",
        "Nitin Minz",
        "Premdan-Sahu",
        "Makarand Surte",
        "Divya Taneja"
    ],
    "casting directors": [
        "Sagar Deshmukh",
        "Ashhar Haque",
        "Harry Parmar"
    ],
    "production designers": "Sandeep Shelar",
    "art directors": "Sachin Bhoir",
    "costume designers": [
        "Taaneeya Oak",
        "Taaneeyaa Oak"
    ],
    "make up department": [
        "Vikram Gaikwad",
        "Shailesh Keskar"
    ],
    "production managers": [
        "Harvinder Singh",
        "Mangesh Upadhyay"
    ],
    "assistant directors": [
        "Varun Bhatnagar",
        "Sanjay Kumar Daryani",
        "Abhishek Singh",
        "Prateek Vats"
    ],
    "sound department": [
        "Ketaki Chakradeo",
        "Devabrot Chaliha",
        "Alok De",
        "Shijomon George",
        "Yogesh Gurav",
        "Mandar Kamalapurkar",
        "Kiran Nalwade",
        "Dusmanta Sahoo",
        "Subash Sahoo",
        "Dara Singh"
    ],
    "visual effects": [
        "Amey Gosavi",
        "Visakh Pr",
        "Saurabh Tripathi"
    ],
    "camera department": [
        "Charanpreet Chall",
        "Jagjit",
        "Parnil Vishwasrao"
    ],
    "casting department": "Mukesh Sharma",
    "music department": [
        "Nakash Aziz",
        "Azazul Haque",
        "Swanand Kirkire",
        "Bappi Lahiri",
        "Vaishali Made",
        "Vijay Maurya",
        "Pritesh Mehta",
        "Sona Mohapatra",
        "Sameer Nichani",
        "Altaf Raja",
        "Shadab Rayeen",
        "Khamosh Shah",
        "Anand Shinde",
        "Arijit Singh",
        "Hitesh Sonik",
        "Tanuj Tiku",
        "Amit Trivedi",
        "Abhijit Vaghani"
    ],
    "script department": "Bharati Bahrani",
    "miscellaneous": [
        "Raghavendra Kulkarni",
        "Chinni Nihalani",
        "Aditya Sehgal",
        "Vishal Srivastava",
        "Monish Thakore"
    ],
    "writer": [
        "Harshavardhan Kulkarni",
        "Vijay Maurya"
    ],
    "director": "Harshavardhan Kulkarni",
    "production companies": "Phantom Films",
    "other companies": [
        "Promoshop",
        "Spice PR"
    ],
    "plot": [
        "Mandar, an ordinary guy is obsessed with sex and chases girls until he meets Tripti and decides to settle down with her.",
        "Mandar Ponkshe is an ordinary guy, meaning there is hardly anything extraordinary about him. He is maybe 5'8\" or 5'9\". He dresses very un-dandily if there was such a term, wears a goatee to hide what could be considered a weak chin. Mandar does not attract attention because he wants to be seen as ordinary. But behind that facade is a story - of an interesting past life that has been led. His single-minded pursuit of girls, tall and short, stout or with a pout. He's funny unconventionally without meaning to be witty. His friends have lost all hope of him settling down, as they know that he doesn't plan to. And then suddenly he meets someone whom he starts liking... and falls in love with. What will happen now? Will she know about his past? Will he able to hide his _Hunterrr_ (qv)r reputation? The story of a guy, who doesn't want to grow up!"
    ],
    "synopsis": "Mandar Ponkshe (Gulshan Devaiah), is an atypical youth, a sex addict and a player. In his early 30s, he is only interested in 'scoring' one night stands while his friends are all married with kids. The movie opens with one such scene where his friends tell him to get married as he is too old to screw around. In turn, Mandar explains his philosophy about sex as a purely physical act, somewhat akin to the satisfaction of the 'perfect' bowel movement. 'Its a physical need' he philosophizes, whereas love is a different ball game and isn't necessary for sex.The narration now moves back several years to Mandar's early teenage years. The year is 1989, Mandar along with his cousin Dilip (nicknamed Yusuf as a tribute to the thespian) visits his village in Maharashtra where their cousin Kshitij is already waiting for them. 15 year old Kshitij is studying in a military school and is mature beyond his years in his views and aspects about marriage, love and sex. By the end of their vacation Mandar realizes that he is no longer a kid. His life becomes more exotic as he starts to woo girls, watching adult films and fantasizing about ladies.Later in the year 1995, Mandar is now grown up and is an engineering student in Pune. There also he is accompanied by his cousins Dilip and Kshitij; the latter is an army officer by now. Mandar stalks Parul (Veera Saxena) only for having sex with her. While making out in the hostel room, they are caught by the warden and Mandar gets expelled from the hostel, leading him to rent a small flat. There he meets a beautiful housewife Jyotsna (Sai Tamhankar) and sets his sights on her. The dapper Kshitij, in the meanwhile, beds a steady parade of stunning girls at Mandar's flat. In a side plot, one of Kshitij's many girlfriends has a friend Anju who is being sexually abused by her own father. Incensed on learning of this heinous act, Kshitij beats up the father and takes Anju and her kid brother away thus rescuing them. The ordinary looking Anju has a maturity and strength that gradually makes Kshitij fall in love with her. In an amusing scene, Mandar and Dilip talk about how Kshitij didn't fall for any of the pretty girls he was seeing, but fell in love with a dark complexioned plain girl. They both conclude with a racist joke that love is not only blind but color blind! Kshitij marries Anju and they eventually have a son.Getting back to Mandar's dalliance with Jyotsana, their casual flirting gradually reaches a point where they start an affair. Hers is a marriage that has petered into nothingness, given her husband has let himself go out of shape and humor. Jyotsna needing sexual fulfillment finds it in Mandar. Their furtive affair carries on for a while, Jyotsana visiting Mandar's flat from time to time, before Deepak finds out. Once again Mandar is forced to shift residences and finally ends up staying with Dilip. In 1996, Mandar meets Parul again in order to keep in touch with her and is left heartbroken when he finds her with another guy, Alok.After college, Mandar is shown working a full time job but is involved in a booty call arrangement with an older married woman who goes by the name Savita Bhabhi. After years of loveless one night stands, he takes Dilip's advise and decides to meet some girls through matrimonial sites. His strategy of being honest about his past affairs upsets most potential matches who are orthodox, conservative girls. When he finally meets Tripti Gokhale (Radhika Apte), he is so smitten by her that he decides not be honest, but instead projects a holier-than-thou image. This almost backfires, as Tripti turns out to be a very open-minded girl who has no hang-ups about her own past and admits to having been in relationships before. Now stuck in a lie, Mandar has to continue projecting himself as an orthodox, colorless man. All the same, the two continue to meet and start liking each other.In due course, Kshitij is killed in an encounter with insurgents in Kashmir. Mandar again is left heartbroken from losing his cousin and friend. This incident brings Tripti close to him as she comforts him. They eventually get engaged, but Mandar is having a tough time with the idea of monogamy. He has one last encounter with Savita Bhabhi. Worse still, while on an errand to pick up a distant relative (Rachel D'Souza) from the airport, Mandar assumes that the person hasn't turned up and instead tries to pick up an attractive woman who turns out to be the distant relative. Embarrassed and shamed, Mandar barely gets out of the situation by the skin of his teeth.At this point, Tripti's ex-boyfriend Chaxx (Suraj Jagan) enters the equation. Cool, suave and charming, Chaxx is all that Mandar is not. That, and Tripti's history with Chaxx trouble him no end and make him insecure to the point where he assumes that Tripti is leaving him for Chaxx. Mandar decides to confess the truth about his sex obsession to Tripti and does so. Tripti also reveals that she got pregnant when she was with Chaxx and there was nothing between them as they have broken up. Tripti makes it clear to Mandar that Chaxx abandoned her when she needed him the most and therefore she can never take him back. She also tells him that Mandar is her present and she wants a future with him.The film concludes with Mandar very happy as he is getting married to the girl he loves as he narrates the mishaps between Tripti and himself to his cousin Dilip."
}