{
    "id": "4378694",
    "localized title": "Nirbaak",
    "cast": [
        "Anjan Dutt",
        "Jishu Sengupta",
        "Ritwick Chakraborty",
        "Sushmita Sen",
        "Anindya Pulak Banerjee",
        "Biswajit Chakraborty"
    ],
    "genres": [
        "Fantasy",
        "Music",
        "Romance"
    ],
    "runtimes": "107",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "United States:Unrated",
    "original air date": "01 May 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNWVkODk3YzQtNjMxYS00NmViLTgwZTctYjc0YTExOWU0OGZjXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4378694",
    "plot outline": "When love cannot speak,it speaks the loudest. This tagline of Nirbaak explains it all. But Nirbaak is a film which does not come with a fixed set of instructions for its interpretation. A tribute to Dali in its truest sense Nirbaak is surreal tale of love. A narcissist, a dog, a nymphomaniac and a woman, the one string which hold these disparate lives together is Love. Srijit Mukherjee does it best when he doesn't follow the trend. In the film Nirbaak Mukherjee plays with symbolism and various unusual metaphors. Nirbaak is a bold step from it's makers part. It is unapologetically distinctive and surreal. The film shows the city of joy as a separate character, which, very few filmmaker has tried to do before. Nirbaak is an experimental film and the makers are to be given due credit for being bold enough to do something of the sort. The minimalist directing style is commendable. Anjan dutta as the self consumed narcissist is a show stealer, Susmita Sen is poignant and subtle with her expressions, Jisshu U Sengupta and Ritwick Chakrabarty has played their respective roles convincingly. Nirbaak with its high shock value is an approximation of unsaid love.",
    "languages": "Bangla",
    "title": "Nirbaak",
    "kind": "movie",
    "directors": "Srijit Mukherji",
    "writers": "Srijit Mukherji",
    "producers": [
        "Pritam Chowdhury",
        "Rahul Mohta",
        "Shrikant Mohta",
        "Vishnu Mohta",
        "Ravi Sharma",
        "Mahendra Soni"
    ],
    "cinematographers": "Soumik Haldar",
    "editors": [
        "Pronoy Dasgupta",
        "Rabiranjan Maitra"
    ],
    "editorial department": "Tushar Desai",
    "production designers": [
        "Mridul Baidya",
        "Saswati Karmarkar"
    ],
    "art directors": [
        "Mridul Baidya",
        "Saswati Karmarkar",
        "Arko Sen"
    ],
    "costume designers": [
        "Sabarni Das",
        "Neeta Lulla"
    ],
    "make up department": [
        "Shyamali Das",
        "Mehboob Mallik",
        "Moloy Mukherjee",
        "Vardaan Nayak"
    ],
    "production managers": "Rajib Biswas",
    "assistant directors": [
        "Monojit Kar",
        "Soumyabrata Rakhsit"
    ],
    "art department": [
        "Amar Sen",
        "Sabyasachi Sen"
    ],
    "sound department": [
        "Dipankar Chaki",
        "Uttam Naskar",
        "Anirban Sengupta"
    ],
    "visual effects": "Ripujit Singh",
    "music department": [
        "Neel Dutt",
        "Hasin Mahtab"
    ],
    "miscellaneous": [
        "Shreya Banerjee",
        "Arindam Biswas",
        "Ahana Kanjilal",
        "Shinal Surti"
    ],
    "akas": [
        "निर्बाक (India, Hindi title)",
        "Безмолвие (Russia)"
    ],
    "writer": "Srijit Mukherji",
    "director": "Srijit Mukherji",
    "production companies": "SVF Entertainment",
    "other companies": [
        "A Grinning Tree Production",
        "Editfx Studios"
    ],
    "plot": [
        "_Nirbaak_ (qv) is a medley of four tales of silent love, involving one woman (Sushmita), three men (Anjan, Jishu and Ritwick), a tree and a dog.",
        "When love cannot speak,it speaks the loudest. This tagline of _Nirbaak_ (qv) explains it all. But _Nirbaak_ (qv) is a film which does not come with a fixed set of instructions for its interpretation. A tribute to Dali in its truest sense _Nirbaak_ (qv) is surreal tale of love. A narcissist, a dog, a nymphomaniac and a woman, the one string which hold these disparate lives together is Love. Srijit Mukherjee does it best when he doesn't follow the trend. In the film _Nirbaak_ (qv) Mukherjee plays with symbolism and various unusual metaphors. _Nirbaak_ (qv) is a bold step from it's makers part. It is unapologetically distinctive and surreal. The film shows the city of joy as a separate character, which, very few filmmaker has tried to do before. _Nirbaak_ (qv) is an experimental film and the makers are to be given due credit for being bold enough to do something of the sort. The minimalist directing style is commendable. Anjan dutta as the self consumed narcissist is a show stealer, Susmita Sen is poignant and subtle with her expressions, Jisshu U Sengupta and Ritwick Chakrabarty has played their respective roles convincingly. _Nirbaak_ (qv) with its high shock value is an approximation of unsaid love."
    ]
}