{
    "id": "4384350",
    "localized title": "Picket 43",
    "cast": [
        "Prithviraj Sukumaran",
        "Jaaved Jaaferi",
        "Renji Panicker",
        "Sudheer Karamana",
        "Anusha",
        "Meghanadhan",
        "Gautam Kurup",
        "Anu Mohan",
        "Shobha Mohan",
        "Mohanlal",
        "Kannan Nair",
        "Hareesh Peradi",
        "Angana Roy"
    ],
    "genres": [
        "Drama",
        "Thriller"
    ],
    "runtimes": "104",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "sound mix": "Dolby Atmos",
    "certificates": [
        "Singapore:NC16",
        "United States:Unrated"
    ],
    "original air date": "23 Jan 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzc3YWUwZGItZDBiMC00YjUxLWIxOTAtMTUyMGNlYTUzMWViXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "4384350",
    "languages": "Malayalam",
    "title": "Picket 43",
    "kind": "movie",
    "directors": "Major Ravi",
    "writers": [
        "Geo Christi Eapen",
        "",
        "Major Ravi"
    ],
    "producers": [
        "O.G. Sunil",
        "Ogee Sunil"
    ],
    "composers": "Ratheesh Vega",
    "cinematographers": "Jomon T. John",
    "editors": "Ranjan Abraham",
    "editorial department": [
        "Don Max",
        "Madhes Waran S",
        "Antony Nikhil Varghese"
    ],
    "visual effects": "Pratheesh Chandran",
    "music department": [
        "Haricharan",
        "Murukan Kattakkada",
        "Vijay Yesudas"
    ],
    "akas": "43-я застава (Russia)",
    "writer": [
        "Geo Christi Eapen",
        "Major Ravi"
    ],
    "director": "Major Ravi",
    "production companies": "FILM Brewery",
    "distributors": "Murali Films",
    "special effects": "Panache Entertainment",
    "plot": "The film deals with the story of an Indian army officer guarding a picket alone in Kashmir, and his friendship with a Pakistani soldier.",
    "synopsis": "Hareendranath Nair (Prithviraj) is an Indian who is assigned to guard an Indian Picket ( i.e,Picket 43) in Kashmir. It was said to be a very dangerous place, and Hareendran had to be forced to take charge at the place, forsaking his sanctioned leave due to the forcefulness of his superior officer (Renji Panicker). Hareendran is forced to stay at the Picket with an extremely trained dog called Baccardi as his companion. He starts seeing the dog akin to someone with intelligence and treats him like a person, not even permitting anyone to call Baccardi a 'dog'. Hareendran confides in the dog his inner thoughts and emotions, which lifts his spirit slightly even at the most difficult times.It is slowly revealed that the reason Hareendran had applied for the above mentioned leave was to register marry the girl he loved, who happened to be his uncle's daughter. When Hareendran, along with his mother, proposed a marriage between him and his cousin to his uncle, he was forsaken by his uncle in favor of a guy from the very same village who had made a fortune in Dubai. Hareendran along with his friends concluded that the only way to marry his lover was a register marriage, and decides to do it the next time he comes to the village on leave. It was before the decided dated that his already sanctioned leave was canceled, telling us the reason to why he was so sad.For the first eight months of his stay at the picket, the Pakistani picket opposite his picket, across the L.O.C, was occupied by a very hostile Pakistani.It was then that a very peculiar Pakistani soldier named Mushraff (Javed Jaffrey) is introduced. Mushraff had come to replace the Pakistani who was hostile to Hareendran at the picket. They slowly relate to each other and despite hailing from different countries, they to understood each other better than anyone else. They eventually become close friends and started to enhance the morale of each other.However, their friendship raises suspicions among others. They even put into question the genuineness of their patriotism which break their heart. They find themselves in nether world and the story proceeds to tell the hardship they have to go through for their friendship.In the end, the viewer finds himself appreciating and realizing the sacrifices made by the army to protect our life."
}