{
    "id": "4415900",
    "localized title": "Mukhtiar Chadha",
    "cast": [
        "Diljit Dosanjh",
        "Oshin Sai",
        "Yashpal Sharma",
        "Abhi Rai",
        "Kiran Juneja",
        "Khayali Saharan",
        "Inder Pal Singh",
        "Dharmendra Singh",
        "Krishna Bansal",
        "Manoj Bakshi",
        "Rajat Bhalla",
        "Seema Pari",
        "Vikash Khyali",
        "Sima Pari",
        "Jaswant Rathor"
    ],
    "genres": "Comedy",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "pa",
    "color info": "Color",
    "certificates": [
        "Canada:PG::(British Columbia)",
        "Norway:9",
        "Singapore:PG",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "27 Nov 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMmVmODUyYWQtOWE4YS00ZDMyLWI2NDQtYWY0Y2E3YWQ0NzE3XkEyXkFqcGdeQXVyMzE2MzA5MzI@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "4415900",
    "plot outline": "Mukhtiar Chadha, is the story of a Sikh kid, who lost his father. He feels that the reason behind the demise of his father is their poverty only. During his growing up days, the only thing he has in his mind is to make money either by hook or by crook. He primarily makes money thru commissions in the deals that he gets done for others.Everyone loves Mukhtiar Chadha because of his lovely, funny, and unique manner to pursue people in business dealings. He loves his mother very much and wants that his mother should shut her small statue shop and enhance the business in some other way. He has three best friends, one wants to be a scientist, other to be a theatre artist and the last one wants to be a pop singer. While studying in college, Mukhtiar Chadha opens a new business of property dealing. The money that he earns from the property dealing business, is invested by him in the share market to grow exponentially.The girl, his college mate, is his neighbor. He also takes commission from her, because she fails in her examinations. He starts blackmailing her for money, but with the passage of time, falls in love with her. Meanwhile a Mafia group captures the property that once Mukhtiar sold to somebody else. Without knowing anything, Mukhtiar Chadha collides with the Mafia. His friends are with him during this.The mafia group destroys his mother's statue shop.This is when Mukhtiar Chadha takes revenge from the Mafia group, for all the miseries suffered by him and his mother. Watch the full movie Mukhtiar Chadha online, only on Eros Now.",
    "languages": "Punjabi",
    "title": "Mukhtiar Chadha",
    "kind": "movie",
    "directors": "Gifty",
    "writers": [
        "Diljit Dosanjh",
        "",
        "Gifty",
        "",
        "Raman K. Jangwal"
    ],
    "producers": [
        "Shubham Chandrachur",
        "Friends Distribution House",
        "B.M. Ohri",
        "Vivek Ohri",
        "Sukhbir Sandhar",
        "Mahesh Sharma",
        "Sizzlin",
        "Sachin Vaish"
    ],
    "cinematographers": "Vikcee",
    "editors": "Sanjay Singh",
    "editorial department": [
        "Vicky Chaudhary",
        "Robert Lang"
    ],
    "casting directors": [
        "Team D.S. Creations",
        "Dinesh Sudarshan Soi"
    ],
    "art directors": "Karam Singh Karma",
    "production managers": [
        "Kulbir Singh 43",
        "Islam Munna Shaikh",
        "Ravish Kumar Sharma",
        "Amritpal Singh"
    ],
    "assistant directors": [
        "Kamcee",
        "Amit Sharma"
    ],
    "sound department": [
        "Ravi Jasraj",
        "Pingal Kalita",
        "Ashik Katkar",
        "Kotte"
    ],
    "visual effects": [
        "Yogesh Chautel",
        "Halder Dipansu",
        "Robin Gaikwad",
        "Mahesh Kunder",
        "Aniket Mhatre",
        "Rohit Rane",
        "Rahul Saxena",
        "Uttam Shethia",
        "Brijesh Singh",
        "Vinay Thakur",
        "Sudhir Trivedi",
        "Issac Vethanayagam"
    ],
    "stunts": "Ganesh",
    "camera department": [
        "Gurdas",
        "Gurbinder Singh"
    ],
    "music department": [
        "Bachan Bedil",
        "Diljit Dosanjh",
        "Ravinder Grewal",
        "Harjit Harman",
        "Jsl Singh",
        "Nooran Sisters"
    ],
    "miscellaneous": [
        "Pappu Mallu",
        "Manpreet Singh",
        "Sonali Singh"
    ],
    "akas": "Mukhtiar Chadha (India)",
    "writer": [
        "Diljit Dosanjh",
        "Gifty",
        "Raman K. Jangwal"
    ],
    "director": "Gifty",
    "production companies": [
        "Ohri Productions pvt ltd",
        "Wahid-Sandhar Showbiz"
    ],
    "special effects": "After",
    "plot": "_Mukhtiar Chadha_ (qv), is the story of a Sikh kid, who lost his father. He feels that the reason behind the demise of his father is their poverty only. During his growing up days, the only thing he has in his mind is to make money either by hook or by crook. He primarily makes money thru commissions in the deals that he gets done for others.Everyone loves _Mukhtiar Chadha_ (qv) because of his lovely, funny, and unique manner to pursue people in business dealings. He loves his mother very much and wants that his mother should shut her small statue shop and enhance the business in some other way. He has three best friends, one wants to be a scientist, other to be a theatre artist and the last one wants to be a pop singer. While studying in college, _Mukhtiar Chadha_ (qv) opens a new business of property dealing. The money that he earns from the property dealing business, is invested by him in the share market to grow exponentially.The girl, his college mate, is his neighbor. He also takes commission from her, because she fails in her examinations. He starts blackmailing her for money, but with the passage of time, falls in love with her. Meanwhile a Mafia group captures the property that once Mukhtiar sold to somebody else. Without knowing anything, _Mukhtiar Chadha_ (qv) collides with the Mafia. His friends are with him during this.The mafia group destroys his mother's statue shop.This is when _Mukhtiar Chadha_ (qv) takes revenge from the Mafia group, for all the miseries suffered by him and his mother. Watch the full movie _Mukhtiar Chadha_ (qv) online, only on Eros Now."
}