{
    "id": "4515200",
    "localized title": "Raja Rajendra",
    "cast": [
        "Sharan",
        "Ishita Dutta",
        "P. Ravi Shankar",
        "Srinivasa Murthy",
        "Ramakrishna",
        "Suchendra Prasad",
        "Sadhu Kokila",
        "Tabla Nani",
        "Lakshmi Siddaiah",
        "Neenasam Ashwath",
        "Vimala Raman",
        "Rekha",
        "Nurse Jayalakshmi",
        "Muniraju",
        "Shankanada Anjanappa"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "144",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "06 Feb 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjhlMjkwMWItZmI1Zi00YzQ1LWFkNmMtY2I0MmVhMTE0MmE3XkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "4515200",
    "plot outline": "The story revolves around Bottle Mani (Sharan), a lame duck, who takes a supari to kill Neelakanta Raju (Ramakrishna), an elderly person from a royal family. He's been assigned the job by none other than the old man's three sons-in-law, who want to grab his property. Mani is assisted by his uncle (Tabla Nani) but he faces a lot of problems in the palace as the family is huge. He misses a couple of chances to kill Raju. There's a twist in the tale when the real Bottle Mani (Ravishankar) walks out of jail only to find that a fraud has usurped his identity and entered the palace. Henceforth, it's only chaos that reigns supreme.",
    "languages": "Kannada",
    "title": "Raja Rajendra",
    "kind": "movie",
    "directors": "Ponkumaran",
    "writers": "Ponkumaran",
    "producers": "Uday k Mehta",
    "composers": "Arjun Janya",
    "cinematographers": "Panner Selvam",
    "editors": "Jo Ni Harsha",
    "editorial department": "Suraj Ankolekar",
    "visual effects": "Unifimedia",
    "music department": "Manjula Gururaj",
    "akas": "Raja Rajendra (India)",
    "writer": "Ponkumaran",
    "director": "Ponkumaran",
    "production companies": "Sri Venkateshwara Krupa Entertainers",
    "plot": "The story revolves around Bottle Mani (Sharan), a lame duck, who takes a supari to kill Neelakanta Raju (Ramakrishna), an elderly person from a royal family. He's been assigned the job by none other than the old man's three sons-in-law, who want to grab his property. Mani is assisted by his uncle (Tabla Nani) but he faces a lot of problems in the palace as the family is huge. He misses a couple of chances to kill Raju. There's a twist in the tale when the real Bottle Mani (Ravishankar) walks out of jail only to find that a fraud has usurped his identity and entered the palace. Henceforth, it's only chaos that reigns supreme.",
    "synopsis": "Laden with laughs, this mythological drama follows the race and turns in the life of Mani (Sharan), who also is an imposter of a dreaded goon named Bottle Mani (P. Ravishankar). Due to this he earns the wrath of the original Bottle Mani. Alternatively, Neelakanta Raju (Ramakrishna) a member of Royal family is a old man with 3 daughters and a long last son. He hopes that his son and his grandson come to him one day, while his sons-in-law want the old man to die asap. To get the old man killed, three sons-in-law along with Shastri (Suchendra Prasad) go to city and contact a guy who promises him to send Bottle Mani to act like the grandson of Neelakanta Raju. Instead of original Bottle Mani he fixes up Mani so that Mani could use the contract money for his mother's medical expenses. Mani goes to the Palace and gains entry into the household, but a being tender heart he fails to kill the old man, instead he saves the old man's life and gains his confidence. He also falls in love with Shastri's daughter in due course. The trio and Shastri, find out that Mani is different from Bottle Mani and try to expel him out of house. However, the spirit of RajaRajendra who was father of Neelakanta Raju takes over Mani and teaches them lesson. Every night the spirit takes possession of Mani and starts expelling the enemies of family. This attracts the attention of police and Inspector Indrajith (SadhuKokila) comes to investigate the issue. The trio hire a black magician to seal the spirit of Rajarajendra in a bottle and become successful. The spirit gets released when Indrajith discards the bottle by mistake. Unknowingly, Shastri's daughter requests the magician to give the spirit of Rajarajendra, and he gets confused as the bottles do not have any labels. He brings along spirits of a bus conductor, kabaddi player, Independence activist and drama artists. In a hilarious sequence of events, all the spirits are freed to possess various people. How Mani resolves the matter successfully and defeatiss the enemies of the family forms the bulk of the climax."
}