{
    "id": "4522210",
    "localized title": "Mahabalipuram",
    "cast": [
        "Karunakaran",
        "Ramesh Thilak",
        "Karthik Sabesh",
        "Vinayak",
        "Vetri",
        "Angana Roy",
        "Vithika Sheru"
    ],
    "genres": "Drama",
    "runtimes": "110",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "13 Mar 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTg4ODQ5ODA5MF5BMl5BanBnXkFtZTgwNjgyMDc5ODE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "4522210",
    "plot outline": "Sammy (Karthik), Sathish (Vetri), Kuppan(RJ Ramesh) and Karunakaran are Vinayak (Panja)'s close friends and they grew up in the tourist spot of Mahabalipuram. At one point of time, Sathish gets married to his long time girlfriend Sangeetha (Angana), life goes happily until all the boozed friends see a scandal video of Angana with a stranger which causes the death of the couple. Now such situation comes again and turns Panja's life upside down, does he finds the culprit behind the brutal sex crime ?",
    "languages": "Tamil",
    "title": "Mahabalipuram",
    "kind": "movie",
    "directors": "Don Sandy",
    "writers": "Don Sandy",
    "producers": [
        "Ankit Mehta",
        "Vinayak"
    ],
    "composers": "K Krishna Kumar",
    "cinematographers": "Chandran Pattuswamy",
    "editors": "Kim Aam",
    "visual effects": "Bhuvaneswaran",
    "music department": [
        "O.G. Dass",
        "Shakthisree Gopalan",
        "Haricharan",
        "D. Imman",
        "K Krishna Kumar",
        "Aalap Raju",
        "Velmurugan",
        "Yugabharathi"
    ],
    "akas": "Mahabalipuram (India)",
    "writer": "Don Sandy",
    "director": "Don Sandy",
    "production companies": [
        "Clapboard Movies",
        "Studio 9 Productions"
    ],
    "plot": [
        "A porn film shatters the lives of a group of friends.",
        "Sammy (Karthik), Sathish (Vetri), Kuppan(RJ Ramesh) and Karunakaran are Vinayak (Panja)'s close friends and they grew up in the tourist spot of _Mahabalipuram_ (qv). At one point of time, Sathish gets married to his long time girlfriend Sangeetha (Angana), life goes happily until all the boozed friends see a scandal video of Angana with a stranger which causes the death of the couple. Now such situation comes again and turns Panja's life upside down, does he finds the culprit behind the brutal sex crime ?::Divya",
        "Panja, Kuppan,Kumar and Saamy help their friend Sathish to marry his girlfriend Sangeetha amidst opposition from the families of the groom and the bride and continue to live normal lives in the tourist town of _Mahabalipuram_ (qv). With Panja too eventually falling in love with Maha, life seems just perfect for this gang of friends until the untimely death of the newlywed that throws out all the joy. Pure bad luck and coincidence breaks up the gang and how the events unfold in time for a final twist in the tale is what we get to see in _Mahabalipuram_ (qv).::PipingHotViews"
    ]
}