{
    "id": "4541748",
    "localized title": "Kallappadam",
    "cast": [
        "Lakshmi Priyaa Chandramouli",
        "Gaugin",
        "Jishnu",
        "Damodharan K.",
        "K Krishna Kumar",
        "Aadukalam Naren",
        "S. Srirama Santhosh",
        "Senthil",
        "Singampuli",
        "J. Vadivel"
    ],
    "genres": [
        "Drama",
        "Thriller"
    ],
    "runtimes": "133",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "20 Mar 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzA1ODIzOWMtY2FjZC00YTMyLTk1ZWItNTkzZGYwZTc5ZjQwXkEyXkFqcGdeQXVyMzYxOTQ3MDg@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4541748",
    "plot outline": "Vadivel and his friends specialize in different aspects of film making and decided to make their first movie as one team. Vadivel wants his first film to be his story based on Tamil folklore that is also close to his heart since his father was a performer of the dying rural art form -'Koothu'. But every producer he meets, reject his story on grounds of absence of elements that would make it commercially viable and deem it too risky an option for a debut. Driven to the limits of desperation and not wanting to jeopardize the careers of his friends, he puts forth a plan to fund the movie by executing a heist. The turn of events once the team agrees to the plan is detailed to form the rest of the movie.",
    "languages": "Tamil",
    "title": "Kallappadam",
    "kind": "movie",
    "directors": "J. Vadivel",
    "writers": "J. Vadivel",
    "producers": "Anand Ponniraivan",
    "composers": "K Krishna Kumar",
    "cinematographers": "S. Srirama Santhosh",
    "editors": "Gaugin",
    "art directors": "Balasubramanian",
    "akas": "Kallappadam: Fake Movie",
    "writer": "J. Vadivel",
    "director": "J. Vadivel",
    "production companies": "Iraivan Films",
    "plot": [
        "Vadivel and his friends specialize in different aspects of film making and decided to make their first movie as one team. Vadivel wants his first film to be his story based on Tamil folklore that is also close to his heart since his father was a performer of the dying rural art form -'Koothu'. But every producer he meets, reject his story on grounds of absence of elements that would make it commercially viable and deem it too risky an option for a debut. Driven to the limits of desperation and not wanting to jeopardize the careers of his friends, he puts forth a plan to fund the movie by executing a heist. The turn of events once the team agrees to the plan is detailed to form the rest of the movie.::PipingHotViews",
        "'_Kallappadam_ (qv)' is all about spontaneity and passion for cinema. Produced by Anand Ponniraivan under the banner Iraivan films, our main focus is to deliver quality low budget films with a message presented in the conventional cinema format. There are a lot of people who are passionate about film-making, but not many get to live the dream. we decided to independently produce this film and have successfully delivered it on time. After conceiving the plot and the story line we came up with the novel idea of casting the Director,Cinematographer, Editor and the Music director in the movie. they play roles as themselves. this has never been tried before. Ironically, the film portrays the struggles of film-making and succeeding in the industry. we wanted to present a message to the audience, especially the next generation. In _Kallappadam_ (qv), we have chosen the ancient folk art 'Koothu' as the core element and told a story in a commercial and entertaining manner not compromising on the quality. the film has been produced by two friends and the technical crew and cast are a bunch of friends and together we all had passion for cinema as the common language."
    ]
}