{
    "id": "4581722",
    "localized title": "Ishq Ke Parindey",
    "cast": [
        "Rishi Verma",
        "Priyanka Mehta",
        "Manjul Azad",
        "Abid Yunus Khan",
        "Siddhant Ghegadmal",
        "Yasir Khan",
        "Yasir"
    ],
    "genres": [
        "Music",
        "Romance"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "24 Apr 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDE4YTliZWItZjQ0OC00MTQ3LTljOWUtYmEwNWIzZjlmODhmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4581722",
    "plot outline": "Saare Jahan Se Achchha Hindustan Hamara Hum Bulbule Hain Iski Ye Gulsitan Hamara When Allama Iqbal wrote the above couplet he never knew that the seeds sown by the British would lead to the creation of India and Pakistan. The land nurtured by the romantic poetry of Ghalib became a battleground. Friends for generations were separated forever in the name of partition. Humanity was buried under hatred. Sheen, the love bird from Pakistan flies down to Lucknow, the city of Nawabs. Faiz, the poet at heart, is mesmerised by the angelic beauty from heaven. Across rooftops and in the by lanes of Lucknow blossoms the innocent love of Sheen and Faiz. Bloodshed in the name of supremacy is a common phenomenon in India and Pakistan. Sheen's entire family was engulfed in gang wars in Pakistan. The violence she hated and thought she left behind in Pakistan accidentally creeps into her love life. Sheen and Faiz would face any thunderstorm to protect the flame of love. Thus begins the soulful journey of the love birds... Ishq Ke Parindey.",
    "languages": "Hindi",
    "title": "Ishq Ke Parindey",
    "kind": "movie",
    "directors": "Shakir Khan",
    "writers": [
        "Rajeev Arora",
        "",
        "Shakir Khan",
        "",
        "Riturraj Tripathii"
    ],
    "producers": "Pawan Goyal",
    "composers": [
        "Sajjad Ali",
        "Rashid Khan",
        "Vijay Verma"
    ],
    "cinematographers": "Najeeb Khan",
    "editors": "Tapos Ghosh",
    "editorial department": "Vikash Singh",
    "costume designers": "Swati Patel",
    "assistant directors": [
        "Saheem Jah",
        "Mohit Kapoor",
        "Abhinav Singh",
        "Robin Kumar Singh"
    ],
    "sound department": [
        "Devabrot Chaliha",
        "Alok De",
        "Anish Poduval"
    ],
    "camera department": "Azeez Siddiqui",
    "music department": [
        "Shakeel Azmi",
        "Anamik Chauhan",
        "Tanveer Ghazi",
        "Keka Ghoshal",
        "Rashid Khan",
        "Aamir Shaikh"
    ],
    "miscellaneous": [
        "Nitin Dwivedi",
        "Ashwani Shukla"
    ],
    "writer": [
        "Rajeev Arora",
        "Shakir Khan",
        "Riturraj Tripathii"
    ],
    "director": "Shakir Khan",
    "production companies": "Shyam Motion Pictures",
    "plot": "Saare Jahan Se Achchha Hindustan Hamara Hum Bulbule Hain Iski Ye Gulsitan Hamara When Allama Iqbal wrote the above couplet he never knew that the seeds sown by the British would lead to the creation of India and Pakistan. The land nurtured by the romantic poetry of Ghalib became a battleground. Friends for generations were separated forever in the name of partition. Humanity was buried under hatred. Sheen, the love bird from Pakistan flies down to Lucknow, the city of Nawabs. Faiz, the poet at heart, is mesmerised by the angelic beauty from heaven. Across rooftops and in the by lanes of Lucknow blossoms the innocent love of Sheen and Faiz. Bloodshed in the name of supremacy is a common phenomenon in India and Pakistan. Sheen's entire family was engulfed in gang wars in Pakistan. The violence she hated and thought she left behind in Pakistan accidentally creeps into her love life. Sheen and Faiz would face any thunderstorm to protect the flame of love. Thus begins the soulful journey of the love birds... _Ishq Ke Parindey_ (qv).::Ashwani Shukla (Publicist)"
}