{
    "id": "4652096",
    "localized title": "Aga Bai Arechyaa 2",
    "cast": [
        "Sonali Kulkarni",
        "Bharat Jadhav",
        "Siddarth Jadhav",
        "Milind Pathak",
        "Rajesh Bhosle",
        "Maadhav Deochake",
        "Milind Fatak",
        "Dharam Gohil",
        "Gauri Joshi",
        "Swapnil Munot",
        "Vidya Patwardhan",
        "Uma Sardeshmukh",
        "Varun Upadhye",
        "Shivraj Vaychal",
        "Shivraj Waichal"
    ],
    "genres": "Comedy",
    "runtimes": "131",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "sound mix": "Dolby Digital::(RCA Sound Recording)",
    "certificates": "India:U",
    "original air date": "22 May 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTdmZmU2ZWQtODc2OC00ZjVjLWFlNDAtZTNhMDYyNTVjMDMyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "4652096",
    "plot outline": "Shubhangi has a curse that does not let her touch the man she loves.Vikram and author comes to interview her where Shubhangi tells him about her past three lovers who met with accident after she touched them. By the end of her story Vikram falls in love with her and wants to get married, Shubhangi to starts to like him but is afraid that he might also face similar fate like others.Vikram and Shubhangi get married on a impossible condition that they shouldn't have any physical touch in their relationship.",
    "languages": "Marathi",
    "title": "Aga Bai Arechyaa 2",
    "kind": "movie",
    "directors": "Kedar Shinde",
    "writers": "Omkar Mangesh Datt",
    "producers": [
        "Narendra Firodiya",
        "Ratnakant Jagtap",
        "Sunil Lulla"
    ],
    "composers": "Sai-Piyush",
    "cinematographers": "Suresh Deshmane",
    "editorial department": [
        "Pranab Manna",
        "Pranab Manna"
    ],
    "production designers": "Ratnakant Jagtap",
    "art directors": "Mahesh Kudalkar",
    "costume designers": "Omkar Mangesh Datt",
    "make up department": "Santosh Gayke",
    "production managers": [
        "Anand Gaikwad",
        "Amol Mane",
        "Siddhi Satish",
        "Milind Shingte",
        "Rahul Tulaskar"
    ],
    "assistant directors": [
        "Yohan Samel",
        "Naresh Sindal"
    ],
    "art department": "Ganesh Dhepe",
    "sound department": [
        "Bashab Bhattacharjee",
        "Suresh Sharma"
    ],
    "music department": [
        "Bashab Bhattacharjee",
        "Omkar Mangesh Datt",
        "Nishad"
    ],
    "miscellaneous": "Sachin Suresh Gurav",
    "writer": "Omkar Mangesh Datt",
    "director": "Kedar Shinde",
    "production companies": "Eros Worldwide",
    "plot": "Shubhangi has a curse that does not let her touch the man she loves.Vikram and author comes to interview her where Shubhangi tells him about her past three lovers who met with accident after she touched them. By the end of her story Vikram falls in love with her and wants to get married, Shubhangi to starts to like him but is afraid that he might also face similar fate like others.Vikram and Shubhangi get married on a impossible condition that they shouldn't have any physical touch in their relationship.::alex.mjacko@gmail.com",
    "synopsis": "Touch, one of the 5 important senses a human being is blessed with. Without the sense of t ouch, nothing can be experienced completely. To express ones feelings, sometimes a touch can help more effectively than words. But what if such touch is a curse for someone?\nA middle aged woman named shubhangi kudalkar aka shubha leads a mysterious life of her own and to know more about it an author named vikram meets her. After listening to her, he is thoroughly shocked. For she tells him that if at all she touches the person with whom she has fallen in love with, then that person suffers a serious accident and such is the curse of her life.. Although there isnt any particular reason nor any logic known to her as to why such a thing should keep occurring with her. For all she knows from her past experiences is that it just always happens. So shuba begins sharing her love experiences with umesh and at this point an interesting chapter about the three lovers of her past starts unfolding before vikram.\nAt the age of thirteen to fourteen a boy named pralhaad came in her life, rahul who during her college years had fallen in love with her and when shoba was all grown up to get married narendra was the groom selected by shobhas parents.\nThe ways in which all the three extroverts meet shubha in different phases of her life. The fun moments, some precious moments which ultimately lead to being in love with shubha and finally some really very painful but hilariously funny accidents which they suffer along the way.\nWhile listening to the comical tale about how the three boys after their respective accident take an exit from shubhas life separating away from her vikram slowly and steadily begins to fall in love with shubha.\nThe day she finishes telling her story vikram has completely fallen for her and proposes her to marry him. Even shubha has started liking him but she cannot marry him f or she is scared that if at all she touches him he too shall suffer from a dangerous accident just like her previous lovers and just to avoid all this from happening she does not wish to marry vikram. But vikram on the other hand comes up with a solution that shobha should get married yet after marriage they both should simply avoid touching one another.\nShubha disagrees with vikram. Because after marriage a husband and his wife no matter what even for the smallest of reasons are bound to come in contact and touch each other. But finally vikram convinces her and the most unique type of a marriage takes place, a marriage where the bride and the bridegroom are not suppose to touch each other, not even by mistake. (Nearly) an impossible thing to do. But vikram and shubha accept the challenge, a challenge that takes us on a wonderful joyous ride where many fun things start happening amongst the husband-wife duo. This eventually ends up connecting them emotionally even though there is no physical touch.\nWhile travelling through their story; we, at many funny times, exclaim aga bai and also we surprisingly exclaim areccha when their story goes through twists. With all these beautiful twists and turns, we unknowingly fall in love with vikram and shubhangis love story!!"
}