{
    "id": "4679210",
    "localized title": "Premam",
    "cast": [
        "Nivin Pauly",
        "Sai Pallavi",
        "Madonna Sebastian",
        "S.V. Krishna Shankar",
        "Shabareesh Varma",
        "Anupama Parameswaran",
        "Vinay Forrt",
        "Soubin Shahir",
        "Siju Wilson",
        "Ananth Nag",
        "Sharafudheen",
        "Dinesh Prabhakar",
        "Jude Anthany Joseph",
        "Franko Davis",
        "Justin John",
        "Jayashankar",
        "Rinsa Jacob",
        "Vimal Kumar",
        "George Kora",
        "Alwin Antony",
        "Faisal C.M.",
        "Jayesh",
        "Manek Jose",
        "Shiyas K.A.",
        "Vinod Kovoor",
        "Anju Kurian",
        "Antony Thomas Mangaly",
        "Maju Mathew",
        "Deepak Nathan",
        "Renji Panicker",
        "Hormis Paulachan",
        "Eva Prakash",
        "Alphonse Puthren",
        "Aishwarya Raghavan",
        "Shinos Rahman",
        "Maniyanpilla Raju",
        "George P. Roy",
        "Zuhair Sait",
        "Althaf Salim",
        "Samarth",
        "Sooraj K. Sathyan",
        "Vijai Suresh",
        "Sibu Thankachan",
        "Sandeep Varma",
        "Odukkathil Viswajith"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "156",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "Germany:6",
        "India:U",
        "Ireland:12A",
        "New Zealand:PG",
        "Singapore:PG",
        "United Kingdom:12A"
    ],
    "original air date": "22 May 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzJhNjMyOGMtYjhiYy00ZTAwLThmZWUtZmE5NzI3OTk4Y2M4XkEyXkFqcGdeQXVyMzQ5Njc3NzU@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "4679210",
    "plot outline": "George, a teenager, loves the idea of being in love. This dream seems to be within reach during his school days, then, for a second time during his college days and yet it fails to materialize. This slow metamorphosis of his love, his attempt to woo his lovers, the abrupt failures hardens him but he finally is able to settle down for life with someone much younger, whom he have met during childhood. The film transcends its viewers on perspectives and boundaries of love.",
    "languages": "Malayalam",
    "title": "Premam",
    "kind": "movie",
    "directors": "Alphonse Puthren",
    "writers": "Alphonse Puthren",
    "producers": "Anwar Rasheed",
    "composers": "Rajesh Murugesan",
    "cinematographers": "Anend C. Chandran",
    "editors": "Alphonse Puthren",
    "art directors": "Sunil Babu",
    "production managers": "Alex E. Kurian",
    "art department": "Ashwini Kale",
    "sound department": [
        "Ramachandran Anand",
        "Vishnu Govind",
        "Harish",
        "Rajakrishnan M.R.",
        "Sree Sankar",
        "Justin E. Thomas",
        "Vajjiravel Varun"
    ],
    "visual effects": [
        "Coconut Bunch",
        "Bani Chand",
        "Midhun",
        "Vinoj Vasanthakumar"
    ],
    "camera department": [
        "Ajesh P.H",
        "Vishnu Thandasseery"
    ],
    "music department": [
        "Murali Gopy",
        "Ranjith Govind",
        "Haricharan",
        "Rajesh Murugesan",
        "Pradeep Palarr",
        "Aalap Raju",
        "Anirudh Ravichander",
        "Vineeth Sreenivasan",
        "Shabareesh Varma",
        "Vijay Yesudas"
    ],
    "miscellaneous": "Revath Venugopal",
    "thanks": "Mukesh Muraleedharan",
    "akas": "Моя любовь (Russia)",
    "writer": "Alphonse Puthren",
    "director": "Alphonse Puthren",
    "production companies": "Anwar Rasheed Entertainment",
    "distributors": "Tricolours Entertainment",
    "plot": [
        "A young man has three opportunities to find love. Will the third time be the charm?",
        "George, a teenager, loves the idea of being in love. This dream seems to be within reach during his school days, then, for a second time during his college days and yet it fails to materialize. This slow metamorphosis of his love, his attempt to woo his lovers, the abrupt failures hardens him but he finally is able to settle down for life with someone much younger, whom he have met during childhood. The film transcends its viewers on perspectives and boundaries of love.",
        "Story of George in his three tests of love starting from schooldays and up to his youth period. He encounters three charming women once in schooldays and another in college days and yet again in his late twenties. He is heartbroken for first two love affairs and accidentally falls for final love of his life.",
        "George David (Nivin Pauly) is pre-degree student. He is in love with girl named Mary (Anupama Parameswaran) George is aided in his love by his friends Koya (Krishna Shankar) and Shambu (Shabareesh Varma). He follows Mary and her younger sister Celine (Eva Prakash) everyday but fails to propose to Mary. Finally, he decides to propose to her one day, but he then realizes that Mary is already in love with another guy. George is then left heartbroken and begins to be an antisocial. Three years later, George and his friends are shown as senior year bachelor students who wrecks havoc in college. While ragging newcomers, George meets Malar (Sai Pallavi), a new teacher in their college who is a Tamilian. He instantly falls in love with her. Through a continuum of events, Slightly sociopathic George and his friends becomes friends with the outgoing & lively Malar. This friendship paves roads to George's infatuation and love. Malar and George frolic's as butterflies in the boundaries of a teacher-student relationship and develops a silent casual love. One day, after college annual day functions, Malar goes to visit her home with her cousin. Later George hears the news that Malar and her cousin met with an accident and in the shock she lost her memory. In a haste, George with his friends goes to visit her, at her home but is left heartbroken when she doesn't recognize him. Eventually, Malar marries her cousin. A few years later, George is now an adult and runs a cafe with his old friend Jojo (Wilson Joseph). One day, a girl (Madonna Sebastian) comes to their shop for buying a birthday cake. She later reveals to George that she is Celine, Mary's little companion during school days. A despondent George feels hope and gets confused with the friendliness between them as a spark and decides to propose her, despite the age difference. But he is once again left heartbroken when she reveals that she is engaged to a guy named Roney (Alphonse Putharen). But their engagement is called off when Roney continuously insults Celine after heavy substance abuse. George who is already in an irritable mood goes out with his friends to Roney's place and beat him up for insulting her. Later, George marries Celine. During their wedding reception, they are visited by Malar and her husband. She shows signs of regained memory. But she does not reveal it to George as he is happy with Celine.",
        "_Premam_ (qv) is a romance story that explores infatuation and love of a George from schooldays and up to his youth period. The life of a person going through various erotomania phases is the premise of the story. The person is able to ascend from immature stages to getting equal and opposite confirmations to his love seeking behavior. But misses out chances by fate and circumstances. He is heartbroken from his first two love affairs and falls in love successfully with a younger person who knows his life inside out.::PipingHotViews",
        "The story of George David and the three romantic stages of his life; the naive adolescent desperately in need of the high school belle's attention, the college bully who hits on his lady professor, and finally the family man who finds true happiness.::Abijit Radhakrishna"
    ]
}