{
    "id": "4684028",
    "localized title": "Guddu Rangeela",
    "cast": [
        "Arshad Warsi",
        "Amit Sadh",
        "Ronit Roy",
        "Aditi Rao Hydari",
        "Shriswara",
        "Dibyendu Bhattacharya",
        "Amit Sial",
        "Brijendra Kala",
        "Rajiv Gupta",
        "Devender Chaudhry",
        "Sandeep Goyat",
        "Dawood Khan",
        "Vishal Om Prakash",
        "Virendra Saxena"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "124",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "Singapore:PG13",
        "United States:Not Rated"
    ],
    "original air date": "03 Jul 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTY4ODE4ZjctZjg1Ny00MGY4LTgwZDEtNDJjMjhhNjQ4YzllXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "4684028",
    "plot outline": "Based in the dusty plains of North India, Guddu Rangeela is a story about two cousins trying to make ends meet in the crime infested surroundings. Orchestra singers by day and informants by night, acquiring measly pay offs from the information provided to local gangsters about the richest families in town, has fetched them an easy and safe way to subsist without getting their hands dirty in the bargain. Although cousins by blood, both are very much unlike each other. The love hate rapport of the two comes to be seen through the many dangerously funny circumstances that they are met with and their impromptu methods of saving their skin each time. Having suffered a tragic past at the hands of the gang lord turned politician Billo; the antagonist of the tale; both are discreetly entangled in a 10 year old legal battle against him through Gupta, an honest advocate fighting on their behalf. While the unorthodox and impulsive Guddu aspires to grow out of their hand to mouth way of life by executing the loot themselves, the comparatively self-righteous and mature Rangeela despises the idea of getting onto the dark side of the city's law. Like money, women too are Guddu's poison, who is time and again seen flirting and effortlessly pulling off one night stands. Rangeela on the contrary hasn't moved on from the tragedy that consumed his only love Babli years back. Rangeela's prime motto has always been to overthrow his nemesis Billo, thus undoing the injustice and cruelty that transpired years back. Lucky enough, one such opportunity comes knocking, which he immediately snags and in the process finds himself confronting the vicious and tyrannical Billo. What follows is a chaotic tale of redemption and payback. An ambition, a plan, a kidnapping and a to and fro tale of victory and defeat leading up to a dramatic climax.",
    "languages": "Hindi",
    "title": "Guddu Rangeela",
    "kind": "movie",
    "directors": "Subhash Kapoor",
    "writers": "Subhash Kapoor",
    "producers": [
        "Krish Ahir",
        "Sangeetha Ahir",
        "Ashish Gupta",
        "Naren Kumar",
        "Navmeet Singh"
    ],
    "composers": [
        "Hitesh Sonik",
        "Amit Trivedi"
    ],
    "cinematographers": "Jamie Fowlds",
    "editors": "Arindam Ghatak",
    "editorial department": [
        "Rohit Mhatre",
        "Anil Rodhan",
        "Swapnita Roychaudhuri"
    ],
    "production designers": "Suman Roy Mahapatra",
    "costume designers": "Veera Kapur Ee",
    "make up department": [
        "Nishi",
        "Nishi Singh",
        "Nishi Singh"
    ],
    "production managers": [
        "Hemant Kumar Dixit",
        "Abhijeet Gauri",
        "Abhishek Sharma",
        "Ravish Kumar Sharma",
        "Mukesh Srivastava"
    ],
    "assistant directors": [
        "Avalokita Dutt",
        "Sumdima Rai",
        "Aneel Rana",
        "Abhishek Vaidya"
    ],
    "art department": [
        "Pallavi Bagga",
        "Vijay Dulguch"
    ],
    "sound department": [
        "Anup Dev",
        "Kunal Dhabade",
        "Shijomon George",
        "Hengul Medhi",
        "Kiran Nalwade",
        "Pranit Purao",
        "Dara Singh"
    ],
    "visual effects": [
        "Swapnil Ambre",
        "Sarvesh Amre",
        "Vaibhav Bajaj",
        "Praveen Bareria",
        "Piyush Dugad",
        "Tarun Gupta",
        "Aziz Merchant",
        "Govind Mohan",
        "Rupam Roychoudhury",
        "Sandeepchoudhary",
        "Satyendra Sharma",
        "Nilesh Uttarwar"
    ],
    "stunts": [
        "Pradyuman Kumar",
        "Pradyumna Kumar Swain"
    ],
    "camera department": [
        "Dadaso Ainapure",
        "Shiraz Chand",
        "Prithvi Singh Gill",
        "Yashoda Latkar",
        "Jayesh Sen"
    ],
    "music department": [
        "Irshad Kamil",
        "Divya Kumar",
        "Shahid Mallya",
        "Ashish Narula",
        "Sameer Nichani",
        "Gajender Phogat",
        "Shadab Rayeen",
        "Arijit Singh",
        "Chinmayee Sripada",
        "Tanuj Tiku",
        "Amit Trivedi"
    ],
    "miscellaneous": [
        "Zahid Fayyaz",
        "Jimmy Gidderbaha",
        "Sachin Suresh Gurav",
        "Binny Padda",
        "Ravi Padda",
        "Siddharth Pande",
        "Makarand Tike"
    ],
    "akas": [
        "Гудду и Рангила (Russia)",
        "Muzicantii (Romania)"
    ],
    "writer": "Subhash Kapoor",
    "director": "Subhash Kapoor",
    "production companies": "Mangal Murti Films",
    "distributors": "Fox STAR Studios",
    "other companies": [
        "24 Eightyone",
        "Zee Music"
    ],
    "plot": [
        "Two small-town musicians kidnap a young woman in order to make a quick buck, but earn the wrath of a powerful politician in the bargain.",
        "Based in the dusty plains of North India, _Guddu Rangeela_ (qv) is a story about two cousins trying to make ends meet in the crime infested surroundings. Orchestra singers by day and informants by night, acquiring measly pay offs from the information provided to local gangsters about the richest families in town, has fetched them an easy and safe way to subsist without getting their hands dirty in the bargain. Although cousins by blood, both are very much unlike each other. The love hate rapport of the two comes to be seen through the many dangerously funny circumstances that they are met with and their impromptu methods of saving their skin each time. Having suffered a tragic past at the hands of the gang lord turned politician Billo; the antagonist of the tale; both are discreetly entangled in a 10 year old legal battle against him through Gupta, an honest advocate fighting on their behalf. While the unorthodox and impulsive Guddu aspires to grow out of their hand to mouth way of life by executing the loot themselves, the comparatively self-righteous and mature Rangeela despises the idea of getting onto the dark side of the city's law. Like money, women too are Guddu's poison, who is time and again seen flirting and effortlessly pulling off one night stands. Rangeela on the contrary hasn't moved on from the tragedy that consumed his only love Babli years back. Rangeela's prime motto has always been to overthrow his nemesis Billo, thus undoing the injustice and cruelty that transpired years back. Lucky enough, one such opportunity comes knocking, which he immediately snags and in the process finds himself confronting the vicious and tyrannical Billo. What follows is a chaotic tale of redemption and payback. An ambition, a plan, a kidnapping and a to and fro tale of victory and defeat leading up to a dramatic climax.::Anonymous"
    ]
}