{
    "id": "4718762",
    "localized title": "Pandaga Chesko",
    "cast": [
        "Ram Pothineni",
        "Rakul Preet Singh",
        "Sai Kumar",
        "Brahmanandam",
        "Adithya Menon",
        "Rao Ramesh",
        "Pavitra Lokesh",
        "Tejaswi Madivada",
        "Sonal Chauhan",
        "Abhimanyu Singh",
        "Sampath Raj",
        "Harish Uthaman",
        "Raghu Babu",
        "Mamilla Shailaja Priya",
        "M.S. Narayana",
        "Jayaprakash Reddy",
        "Vennela Kishore",
        "Ananth",
        "Neelya Bhavani",
        "Brahmaji",
        "Rengarajan Jaiprakash",
        "Raghu Kumar Karumanchi",
        "Prudhviraj",
        "Satyam Rajesh",
        "Rajitha",
        "Ramachandra",
        "Raja Ravindra",
        "Shakalaka Shankar",
        "Sravan",
        "Prabhas Sreenu",
        "Gundu Sudharshan",
        "Surekha Vani",
        "Meena Vasu",
        "Fish Venkat"
    ],
    "genres": [
        "Action",
        "Drama",
        "Family"
    ],
    "runtimes": "162",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "sound mix": "DTS",
    "certificates": "India:UA",
    "original air date": "29 May 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMWEzNTRiN2UtYmRkYS00NDI3LTlkODAtMGQ0OWZhZWQzMDM3XkEyXkFqcGdeQXVyNjQ3ODkxMjE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "4718762",
    "plot outline": "The movie starts with Karthik (Ram) who runs a multimillion-dollar company in Portugal living with his family. Karthik (Ram) runs the company where he has employed his own father, brother, sister and keeps them on their toes to leave no stone unturned to take his company to greater heights. Meanwhile, he meets another multimillion- dollar women Anushka (Sonal Chauhan) for a business deal. Then she decides to propose Karthik (Ram) for marriage as a calculated move for their business also she (Sonal Chauhan) has to tie the knot with the right guy if she has to inherit her father's wealth. They both got engaged but karthik's family was disappointed of this proposal. After some days, one of the companies of Karthik (Ram) gets in to trouble due to a case registered by Green Army headed by Divya (Rakul Preet)against his factory and he heads to India to sort out the issue. He tries hard to convince Divya (Rakul Preet) but all goes in vain. Despite being engaged to Anushka (Sonal Chauhan), Karthik (Ram) goes to an extent to impress Divya (Rakul Preet) in an attempt of convincing her to withdraw the case. However Karthik (Ram) reveals his actual purpose of coming to India later as he is the son of Bhupathi's (Sampath Raj) sister, who has been staying away from family for twenty five years. Divya's father (Sampath) and his 3 brothers abandon their respective wives and send them back to their house to live with their own brother Sai Kumar. All this, because Sai Kumar refuses to marry Sampath's only sister. But again, that is a sacrifice by Sai Kumar because Sampath's sister herself confesses that she is in love with someone else. Sampath's sister turns out to be Ram's mother. After seeing the fight of Karthik (Ram) in attempt to save Divya (Rakul Preet) from brawlers, Bhupati (Sampath Raj) meets karthik(Ram) for marriage proposal with Divya (Rakul Preet). Karthik then goes to her village to reunite the family against all odds and marry Divya (Rakul Preet). Eventually,karthik (Ram) reunites the family which were separated for 25 years and marries to Divya (Rakul Preet) bringing Pandaga(Festival) for the family.",
    "languages": "Telugu",
    "title": "Pandaga Chesko",
    "kind": "movie",
    "directors": "Gopichand Malineni",
    "writers": [
        "Veligonda Srinivas",
        "",
        "Kona Venkat",
        "Gopichand Malineni",
        "",
        "Kona Venkat"
    ],
    "producers": [
        "Rengarajan Jaiprakash",
        "Paruchuri Kireeti"
    ],
    "composers": "S. Thaman",
    "cinematographers": "Sameer Reddy",
    "editors": "Gautham Raju",
    "art directors": "A.S. Prakash",
    "costume designers": "Srinu Tadala",
    "assistant directors": [
        "Mandava Charan",
        "Prasad Rishi"
    ],
    "visual effects": [
        "Raghu Puduri",
        "Shiva krishna Sadhanala"
    ],
    "stunts": [
        "Lakshman Chella",
        "Ram Chella",
        "Stun Shiva"
    ],
    "music department": "Singer Megha",
    "script department": "Anil Ravipudi",
    "miscellaneous": [
        "Jani",
        "V.J. Sekhar",
        "Eluru Sreenu"
    ],
    "akas": "Vacha Kuri Thappaathu (India, Tamil title)",
    "writer": [
        "Veligonda Srinivas",
        "Kona Venkat",
        "Gopichand Malineni"
    ],
    "director": "Gopichand Malineni",
    "production companies": "United Movies",
    "plot": [
        "Karthik, a money minded businessman, gets engaged to another money-minded girl Anushka. When his factory gets shut down by an environment activist Divya, he goes back to India only to fall in love with her.",
        "The movie starts with Karthik (Ram) who runs a multimillion-dollar company in Portugal living with his family. Karthik (Ram) runs the company where he has employed his own father, brother, sister and keeps them on their toes to leave no stone unturned to take his company to greater heights. Meanwhile, he meets another multimillion- dollar women Anushka (Sonal Chauhan) for a business deal. Then she decides to propose Karthik (Ram) for marriage as a calculated move for their business also she (Sonal Chauhan) has to tie the knot with the right guy if she has to inherit her father's wealth. They both got engaged but karthik's family was disappointed of this proposal. After some days, one of the companies of Karthik (Ram) gets in to trouble due to a case registered by Green Army headed by Divya (Rakul Preet)against his factory and he heads to India to sort out the issue. He tries hard to convince Divya (Rakul Preet) but all goes in vain. Despite being engaged to Anushka (Sonal Chauhan), Karthik (Ram) goes to an extent to impress Divya (Rakul Preet) in an attempt of convincing her to withdraw the case. However Karthik (Ram) reveals his actual purpose of coming to India later as he is the son of Bhupathi's (Sampath Raj) sister, who has been staying away from family for twenty five years. Divya's father (Sampath) and his 3 brothers abandon their respective wives and send them back to their house to live with their own brother Sai Kumar. All this, because Sai Kumar refuses to marry Sampath's only sister. But again, that is a sacrifice by Sai Kumar because Sampath's sister herself confesses that she is in love with someone else. Sampath's sister turns out to be Ram's mother. After seeing the fight of Karthik (Ram) in attempt to save Divya (Rakul Preet) from brawlers, Bhupati (Sampath Raj) meets karthik(Ram) for marriage proposal with Divya (Rakul Preet). Karthik then goes to her village to reunite the family against all odds and marry Divya (Rakul Preet). Eventually,karthik (Ram) reunites the family which were separated for 25 years and marries to Divya (Rakul Preet) bringing Pandaga(Festival) for the family.::Vaibhav"
    ],
    "synopsis": "Karthik who runs a multi-million-dollar company in Portugal living with his mother, father , brother in law and sister. Karthik runs the company where he has employed his own family, keeping them on their toes to leave no stone unturned to take his company to greater heights. Karthik with help of Weekend Venkat Rao meets another millionaire, Anushka, for a business deal. Venkat Rao is the manager of Anuskha. She decides to propose Karthik for marriage as a calculated move for their business. She also has to tie the knot with the right guy if she is to inherit her father's wealth. They get engaged, however Karthik's family is disappointed by the proposal.One of Karthik's companies gets into legal trouble due to a case registered by The Green Army, headed by Divya, against his factory, so he heads to India to sort out the issue. He tries hard to convince Divya to withdraw her case, but in vain. Despite being engaged to Anushka, Karthik goes to great extent of trying to impress Divya, including teasing and flirting. However, Karthik later reveals his actual purpose of coming to India, as he is the son of Bhupathi's sister, who has been staying away from her family for the past twenty-five years. Divya's father and his three brothers abandoned their respective wives and sent them back to their house to live with their own brother Sai Reddy , because he refused to marry Bhupathi's sister. However, this was a sacrifice by Sai Reddy because Bhupathi's sister herself confessed that she was in love with someone else, Karthik's father. As it turns out, Bhupathi's sister is none other than Karthik's mother. After seeing the fight of Karthik in an attempt to save Divya from brawlers, Bhupati meets Karthik for a marriage proposal with Divya. Karthik then goes to her village.Karthik succeeds in impressing Divya and fooling everybody by reuniting his aunts, without knowing that he is Saraswati's son. Surprisingly, Anushka too arrives and thinks that it is her marriage. She irritates Divya and her family. Karthik makes Weekend Venkat Rao think that Anushka will marry him if he marries Divya. Before the marriage day, a gangster who was in love with Divya, sends men to kidnap her. But Karthik takes up the chance and fools them to believe that Anushka is the bride. The kidnap Anushka and Venkat Rao. In anger that the time for the property is up, she forces the gangster to tie the knot and living Venkat Rao escape. Meanwhile, Bhupati's rival gang kidnap Divya in temple. There Karthik beats them up. Saraswati tells that she was pregnant with Karthik and Sai Reddy helped her with marriage and travel to a Portugal. Saraswati convinces everybody to reunite with his mother and her family and marries Divya, bringing Pandaga (festival) for the family. Karthik and Divya call Anushka who in a money minded manner says she married the gangster for property but was actually fooled by Karthik and Divya."
}