{
    "id": "4760750",
    "localized title": "Bezubaan Ishq",
    "cast": [
        "Mugdha Godse",
        "Sneha Ullal",
        "Nishant Malkani",
        "Darshan Jariwala",
        "Farida Jalal",
        "Sachin Khedekar",
        "Muni Jha",
        "Smita Jaykar",
        "Alex Ashman",
        "Jitu Pandya",
        "Soniya Mehta",
        "Rittesh Mobh",
        "Akshita Sethi",
        "Aru Krishansh Verma",
        "Devendra Pandit",
        "Sanjay Patel",
        "Rakesh Pujara",
        "Abhijeet",
        "Saloni",
        "Ajay Sharma",
        "Hitesh Rawal",
        "Yasmine Deliken",
        "Naresh Patel",
        "Rahul Sharma",
        "Gautam Shrivastav",
        "Yasemin Delikan"
    ],
    "genres": [
        "Musical",
        "Romance"
    ],
    "runtimes": "128",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(HD)",
    "certificates": [
        "India:U::(CBFC)",
        "United States:Not Rated"
    ],
    "original air date": "03 Jul 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDc2MDU3NjAtMzFmZi00YzhkLTg3OTQtYjVjNGZiZDdhYzQ3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "4760750",
    "plot outline": "The film has been shot in various parts of India like Jaipur, Jaisalmer and Mumbai. The film is set in a modern milieu with traditional Indian backdrop and values. It revolves around three friends and their families. Mansukh Patel is an NRI business tycoon residing with his British wife, Lisa and daughter Rumzum in London, UK. The Patels live in the United Kingdom but haven't forgotten their Indian tradition and values. Mansukh's younger brother, Rashmikant lives in Mumbai with his daughter, Suhani. Having lost his wife Rekha early in life, Rashmikant is a protective father and pampers Suhani with all her demands, and so does his mother, Savitri. Rashmikant's childhood friend, Vipul is also his business partner. He lives with his wife, Laxmi and son, Swagat. Suhani and Swagat have been childhood sweethearts. Suhani is a open-hearted girl while Swagat is more subdued in nature. He also plays an important role in Suhani's life. Swagat is bowled over by Rumzum's simplicity, pure innocence, beauty and her nature. Whereas, Suhani is madly in love with Swagat. Will Swagat marry Suhani and live happily ever after or will he find true love in Rumzum? Jashwant Gangani's Bezubaan Ishq unravels the beautiful story of unspoken love and sacrifice with pure characters from real life.",
    "languages": "Hindi",
    "title": "Bezubaan Ishq",
    "kind": "movie",
    "directors": "Jaswant Gangani",
    "writers": "Jaswant Gangani",
    "producers": [
        "Alex Anthony Fernandes",
        "Cj Gadara",
        "Dinesh Likhiya"
    ],
    "composers": [
        "Babli Haque",
        "Rupesh Verma"
    ],
    "cinematographers": "Bhagat s Kuumar",
    "editors": "Paresh Y. Manjrekar",
    "art directors": "Ashim Haldar",
    "costume designers": "Kamaal h Khan",
    "make up department": "Ramesh Panda",
    "production managers": "Vijay Singh",
    "assistant directors": [
        "Swati Bhat",
        "Utkarsh Kakaria",
        "Harnosh Suraliwala"
    ],
    "sound department": [
        "Santosh Gupta",
        "Rhitwik Raj Pathak",
        "Sameer Patra",
        "Aravind Vijayakumar"
    ],
    "camera department": [
        "Shakti Indoria",
        "Barot Vishal"
    ],
    "costume departmen": "Vastukalpa",
    "music department": [
        "Javed Ali",
        "Anita Bhatt",
        "Meghdeep Bose",
        "Arpita Chakraborty",
        "Mohit Chauhan",
        "Altamash Faridi",
        "Jaswant Gangani",
        "Shreya Ghoshal",
        "Prashant Ingole",
        "Shalmali Kholgade",
        "Osman Mir",
        "Parineeta",
        "Tochi Raina"
    ],
    "miscellaneous": [
        "Swati Bhat",
        "Sahil Sai",
        "Salim Shaikh",
        "Harnosh Suraliwala",
        "Swati Bhat"
    ],
    "akas": "Viata este frumoasa (Romania)",
    "writer": "Jaswant Gangani",
    "director": "Jaswant Gangani",
    "production companies": "Gangani Motion Pictures",
    "plot": [
        "The film has been shot in various parts of India like Jaipur, Jaisalmer and Mumbai. The film is set in a modern milieu with traditional Indian backdrop and values. It revolves around three friends and their families. Mansukh Patel is an NRI business tycoon residing with his British wife, Lisa and daughter Rumzum in London, UK. The Patels live in the United Kingdom but haven't forgotten their Indian tradition and values. Mansukh's younger brother, Rashmikant lives in Mumbai with his daughter, Suhani. Having lost his wife Rekha early in life, Rashmikant is a protective father and pampers Suhani with all her demands, and so does his mother, Savitri. Rashmikant's childhood friend, Vipul is also his business partner. He lives with his wife, Laxmi and son, Swagat. Suhani and Swagat have been childhood sweethearts. Suhani is a open-hearted girl while Swagat is more subdued in nature. He also plays an important role in Suhani's life. Swagat is bowled over by Rumzum's simplicity, pure innocence, beauty and her nature. Whereas, Suhani is madly in love with Swagat. Will Swagat marry Suhani and live happily ever after or will he find true love in Rumzum? Jashwant Gangani's _Bezubaan Ishq_ (qv) unravels the beautiful story of unspoken love and sacrifice with pure characters from real life.",
        "_Bezubaan Ishq_ (qv) is an upcoming 2015 Bollywood romantic film directed by Jashwant Gangani and produced by C.J. Gadara and Dinesh Likhiya. The film stars Mugdha Godse, Sneha Ullal and Nishant in leads roles. The film is slated for a release on 26th June, 2015."
    ]
}