{
    "id": "4768812",
    "localized title": "Vajrakaya",
    "cast": [
        "Shivarajkumar",
        "Nabha Natesh",
        "Karunya Ram",
        "Shubra Aaiyappa",
        "Sadhu Kokila",
        "Avinash",
        "Madhu Guruswamy",
        "Ravi Kale",
        "Jayasudha",
        "Suman",
        "Manjunath Gowda",
        "Ravi Teja",
        "Dileep",
        "Sivakarthikeyan",
        "Arjun Janya",
        "Harsha",
        "Lekha Chandra",
        "Chikkanna",
        "C.R. Gopi",
        "Kuri Prathap",
        "Padmaja Rao",
        "Thanuja"
    ],
    "genres": [
        "Action",
        "Drama",
        "Family"
    ],
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "12 Jun 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjU3ZDNlNjctNGRmZC00ZGY3LThmYjUtNThkM2I0NmRiYTMyXkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SY150_CR8,0,101,150_.jpg",
    "imdbID": "4768812",
    "plot outline": "Vajrakaya is the heart touching story of a young man Viraj (Shivarajkumar) who goes in search of his mother. Viraj leads a normal life, and one fine day he learns that he was adopted. This makes him restless and he starts the search for his parents. The first half of the story becomes essential as it depicts Viraj and his parents' flash back story. Whether Viraj's search fo his parents becomes successful and unite his family is the second-half. Cast Performance: The main highlight of the movie is Shivarajkumar's performance. The Badshah of Sandalwood has shared oscreen space with Jayasudha, she plays his mother in the movie. Shivarajkumar's all three heroines perform well, Karunya Ram and Nabha Natesh steal the show. Shubra Aiyappa's character is more or less a cameo role.",
    "languages": "Kannada",
    "title": "Vajrakaya",
    "kind": "movie",
    "directors": "Harsha",
    "writers": [
        "Yoganandh Muddhan",
        "",
        "Srikanth"
    ],
    "producers": [
        "C.R. Gopi",
        "C.R. Manohar"
    ],
    "composers": "Arjun Janya",
    "cinematographers": "Swamy. J.",
    "editors": "Deepu Kumar",
    "editorial department": "Niranjan Devaramane",
    "visual effects": "Raghuraman",
    "animation department": "J. Sirajudeen",
    "writer": [
        "Yoganandh Muddhan",
        "Srikanth"
    ],
    "director": "Harsha",
    "plot": "_Vajrakaya_ (qv) is the heart touching story of a young man Viraj (Shivarajkumar) who goes in search of his mother. Viraj leads a normal life, and one fine day he learns that he was adopted. This makes him restless and he starts the search for his parents. The first half of the story becomes essential as it depicts Viraj and his parents' flash back story. Whether Viraj's search fo his parents becomes successful and unite his family is the second-half. Cast Performance: The main highlight of the movie is Shivarajkumar's performance. The Badshah of Sandalwood has shared oscreen space with Jayasudha, she plays his mother in the movie. Shivarajkumar's all three heroines perform well, Karunya Ram and Nabha Natesh steal the show. Shubra Aiyappa's character is more or less a cameo role."
}