{
    "id": "4805880",
    "localized title": "Sesh Anka",
    "cast": [
        "Mir Afsar Ali",
        "Sanjeeb Banerjee",
        "Tathagata Banerjee",
        "Shankar Chakraborty",
        "Prantik Chatterjee",
        "Haroprashad Chattopadhyay",
        "Dipankar Dey",
        "Debolina Dutta",
        "Samadarshi Dutta",
        "Shataf Figar",
        "Kausik Ghosh",
        "Rini Ghosh",
        "Debarghya Goswami",
        "Deboprasad Halder",
        "June Malia",
        "Parno Mittra",
        "Shubhodip Mukherjee",
        "Subrata Guha Roy",
        "Arindam Sil"
    ],
    "genres": "Mystery",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color::(HD)",
    "sound mix": "Dolby Digital::(Western Electric Recording)",
    "certificates": [
        "India:A",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGI4ODE4ZTctY2U5Zi00YjM0LTg2MzgtMTVhZGQxYzlkY2U5XkEyXkFqcGdeQXVyNjA3OTI5MjA@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "4805880",
    "plot outline": "This is the story of the embittered and stoned Raina caught in a mysterious murder case and the efforts of the illustrious retired criminal lawyer Pranoy Dasgupta to save her. The story also involves the maneuvers of a hardened cop who hates criminals and will leave no stone unturned to punish the evil doers and a mysterious character who pops in with game changing information every now and then. What is Raina's real story, Why is she in such a miserable state, Whom did she harm to call such troubles upon herself and Will she be eventually found guilty is what Sesh Anko aims to present with an engaging tale of murder, mystery, betrayal and a dramatic court room sequence.",
    "languages": "Bangla",
    "title": "Sesh Anka",
    "kind": "movie",
    "directors": "Tathagata Banerjee",
    "writers": "Sanjeeb Banerjee",
    "producers": [
        "Pradip Churiwal",
        "Lubna Mahmood",
        "Saikat Mitra"
    ],
    "composers": "Savvy Gupta",
    "cinematographers": "Supriyo Dutta",
    "editors": "Sujay Datta Ray",
    "assistant directors": [
        "Dipa Bhattacharjee",
        "Abhik Kabir Datta",
        "Shubhodip Mukherjee"
    ],
    "miscellaneous": "Sanjib Banerji",
    "akas": "Sesh Anka (India)",
    "writer": "Sanjeeb Banerjee",
    "director": "Tathagata Banerjee",
    "production companies": "Macneill Media Pvtltd",
    "distributors": "Macneill Media Pvtltd",
    "plot": [
        "A murder A convict A honest headstrong Cop And then steps in an old horse who is too good at the game! Now wait for 'The Last Act\"",
        "This is the story of the embittered and stoned Raina caught in a mysterious murder case and the efforts of the illustrious retired criminal lawyer Pranoy Dasgupta to save her. The story also involves the maneuvers of a hardened cop who hates criminals and will leave no stone unturned to punish the evil doers and a mysterious character who pops in with game changing information every now and then. What is Raina's real story, Why is she in such a miserable state, Whom did she harm to call such troubles upon herself and Will she be eventually found guilty is what Sesh Anko aims to present with an engaging tale of murder, mystery, betrayal and a dramatic court room sequence.::Sanjib Banerji"
    ],
    "synopsis": "Synopsis of Sesh Anka (2015 Bengali Movie)Raina Roy Choudhury (Parno Mittra), the only daughter of business tycoon Ritobrata Roy Chudhary (Shankar Chakraborty), gets framed in the murder case of Venkat Krishnaswamy, her first client as an escort, when she goes to spend a night with him in the East Palace Hotel of Mondarmoni.Raina, a neglected child, who has a sour relationship with her father, has been forced to get into escort service to meet the soaring expense of her drug addiction. Ritobrata Roy Choudhury, whose wife had committed suicide when Raina was very young,and who has an illicit relationship with his employee Minakshi, Bhattacharya (Debolina Dutta) publicly disowns Raina after she is arrested by the police from Mondarmoni.Amrita Banerjee (June Maliah), an ex-laywer, is the wife of Alokesh Banerjee (Arindam Sil), who in turn is a childhood friend of Ritobrata, and CEO of a private news channel. Amrita and Alokeshs late daughter, Payel, (Rini Ghosh) was best friend to Raina and after Payels untimely death, Raina has become like a daughter to Amrita and Alokesh. Amrita, who is like a mother to Raina, is determined to help Raina in her hour of need and so goes seeking professional help from her old friend and famous criminal lawyer on a self-imposed exile, Pronoy Dasgupta (Deepankar De).Pronoy Dasgupta, in his late fifties, is a flamboyant and sharp witted personality. He is filthy rich and\nlives a stylish yet secluded life in his palatial bungalow.. Pronoy first refuses to take up the apparently\nopen and shut case but later after meeting Raina in the police custody and doing some background\ncheck, he agrees to fight as her defense lawyer. Pronoy seeks help from a private detective named John Breganza (Mir Afsar Ali), who gathers varied secret information about Raina, and the people in her periphery, namely Ritobrata, Minakshi, Rainas friends and Rajib Mitra (Shataf Figar), the arch business rival of Ritobrata and his opponent as the Presidential candidate of City Chamber of Commerce.ACP Prithwiraj Sen (Samadarshi Dutta), recently transferred from Delhi to Kolkata is an arrogant yet honest and workaholic police officer who treats his convicts as criminals. He is the investigating officer of Venkat Krishnaswamy murder case and believes that Raina is the culprit. Because of this he initially gets into a tussle with Pronoy Dasgupta but later when he realizes that Raina has been trapped he begins cooperating with the\ndefense lawyer to solve the mystery. During the trial, we come to know about Anthony De Costa, a mysterious Frenchman and an internationally wanted criminal, who used to work as a freelance crook and operate under various names and disguises in the subcontinent. He is the one who had suggested escort services as a financial option to Raina and had sent her toMondarmoni on the fateful night.Pronoy Dasgupta, an efficient and sharp witted lawyer, sieves through an array of suspects namely\nMinakshi, Rajib Mitra, Anthony De Costa and others to arrive at a shocking climax where through a tight\ngripping court room drama Pronoy Dasgupta unmasks the real murderer, who until the climax had\nsuccessfully stayed out of the boundaries of suspicion. Pronoy thus successfully bails out Raina and\nbrings to law the real culprit."
}