{
    "id": "4873138",
    "localized title": "Gurukul",
    "cast": [
        "Umesh Bolke",
        "Swapnil Joshi",
        "Neha Khan",
        "Neha Khan",
        "Pradeep Kuwar",
        "Reenna Liman",
        "Prashant Mohite",
        "Jaypal More",
        "Asit Redij",
        "Sonali Shewale"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "07 Aug 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTZkMTI4YjMtYTAwZi00YTUxLWJkNzQtNTkwYmQwZDlhZjZlXkEyXkFqcGdeQXVyNjU0OTg3MTk@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "4873138",
    "plot outline": "Gurukul is a story of an upright educationalist Nansaheb Vishwanath Gokhale, fondly called as Guruji (played by Nagesh Bhosle) who is the founder and head of Gurukul University. As a teacher Guruji is different from others and deals with the students in a gentle and tolerant manner. He believes along with professional education, students should put emphasis on moral and social values of life. Reflecting the politicisation of education institutions in India, Gurukul is fraudulently grabbed by a local politician Girish Bhao Velangekar (played by Vidyadhar Joshi), saddened by which Guruji leaves for unknown destination. The story shows the quest of the 6 former students who are now married couple to search, fight and restore the glory of Gurukul's former head Guruji, where in the end climax his moral greatness is reflected",
    "languages": "Marathi",
    "title": "Gurukul",
    "kind": "movie",
    "directors": "Rommel Rodrigues",
    "writers": "Rommel Rodrigues",
    "producers": [
        "Rajendra Dinesh Ramkrishna Sawant",
        "Anil Kabra",
        "Rommel Rodrigues"
    ],
    "composers": "Sanjayraj Gaurinandan",
    "editorial department": [
        "Jitender Prajapati",
        "Shibu Ts"
    ],
    "sound department": "Nitish Sharma",
    "visual effects": "Sandeep Kumar Jayasawal",
    "camera department": "Nimesh Chaudhary",
    "miscellaneous": [
        "Sooraj Khanna",
        "Pradnya Sumati Shetty",
        "Gopal Singh"
    ],
    "writer": "Rommel Rodrigues",
    "director": "Rommel Rodrigues",
    "production companies": [
        "Accor Movie & Media Pvt Ltd & Nuts N Bolts Production",
        "Sankalan Media"
    ],
    "plot": [
        "_Gurukul_ (qv) is a story of an upright educationalist Nansaheb Vishwanath Gokhale played by renowned actor Nagesh Bhosle.",
        "_Gurukul_ (qv) is a story of an upright educationalist Nansaheb Vishwanath Gokhale, fondly called as Guruji (played by Nagesh Bhosle) who is the founder and head of _Gurukul_ (qv) University. As a teacher Guruji is different from others and deals with the students in a gentle and tolerant manner. He believes along with professional education, students should put emphasis on moral and social values of life. Reflecting the politicisation of education institutions in India, _Gurukul_ (qv) is fraudulently grabbed by a local politician Girish Bhao Velangekar (played by Vidyadhar Joshi), saddened by which Guruji leaves for unknown destination. The story shows the quest of the 6 former students who are now married couple to search, fight and restore the glory of _Gurukul_ (qv)'s former head Guruji, where in the end climax his moral greatness is reflected"
    ]
}