{
    "id": "4903314",
    "localized title": "Lodde",
    "cast": [
        "Ashalatha",
        "Avinash",
        "Gopinath Bhat",
        "Komal Kumar",
        "Heena Panchal",
        "Akanksha Puri",
        "Sayaji Shinde"
    ],
    "genres": "Drama",
    "runtimes": "142",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "31 Jul 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODZjN2M1NDItNDBmMi00NjM5LWFjOGQtYWUxZGZkOWFlM2NmXkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4903314",
    "plot outline": "The story revolves around control freak grandfathers Dharmaraj (Sayaji Shinde) and Rudrappa (Avinash) who were close friends living in Malnad for years until an incident made them part ways. That's when Lodde aka Narasimha (Komal Kumar), grandson of Dharmaraj arrives from the US after completing his studies and tries a reconciliation. He meets Akanksha, the granddaughter of Rudrappa and falls in love. Their love brings the two friends back together, however the friendship is short lived as Narasimha cancels the engagement as the film nears the interval. The second half explores the reason behind it and how Narasimha tries to bring the two families together.",
    "languages": "Kannada",
    "title": "Lodde",
    "kind": "movie",
    "directors": "S.V. Suresh Raj",
    "writers": "Srinath",
    "producers": "Manjunath",
    "composers": "Chinni Charan",
    "cinematographers": "Bhuvan Gowda",
    "akas": "Lodde (India)",
    "writer": "Srinath",
    "director": "S.V. Suresh Raj",
    "plot": [
        "Dharmegowda and Rudrappa, former best friends, are two warring honchos in a village. Narasimha and Akanksha, their grandchildren, fall in love and want to reunite the friends. Will they succeed?",
        "The story revolves around control freak grandfathers Dharmaraj (Sayaji Shinde) and Rudrappa (Avinash) who were close friends living in Malnad for years until an incident made them part ways. That's when _Lodde_ (qv) aka Narasimha (Komal Kumar), grandson of Dharmaraj arrives from the US after completing his studies and tries a reconciliation. He meets Akanksha, the granddaughter of Rudrappa and falls in love. Their love brings the two friends back together, however the friendship is short lived as Narasimha cancels the engagement as the film nears the interval. The second half explores the reason behind it and how Narasimha tries to bring the two families together."
    ]
}