{
    "id": "5090220",
    "localized title": "Kirumi",
    "cast": [
        "Charlie",
        "David Solomon Raja",
        "Marimuthu",
        "Tamilselvi",
        "Yogi Babu",
        "Kathir",
        "G. Marimuthu",
        "Reshmi Menon"
    ],
    "genres": "Crime",
    "runtimes": "104",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "24 Sep 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjUyZDkyOTAtYzYzZi00NGY3LWJmYjgtNGU2MWY4Njc0N2I3XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR114,0,101,150_.jpg",
    "imdbID": "5090220",
    "plot outline": "Kathir is a selfish youth in search of a job. Despite being married and having a child, he is waiting for a job offer that he feels meets his standards. Meanwhile, his wife Anitha is the breadwinner of the family. Prabhakar, a friendly neighbour who acts as his father figure, gets him a job as an informant with the less than honest local police inspector. Kathir uses this opportunity to take revenge against the violent bar owner who humiliated him in front of his friends, despite Prabhakar's advice. With his tip-off, the police raids the bar and arrests the owner for running an illegal gambling den as a side business. One night, Prabhakar is murdered by a group of thugs while a scared Kathir runs for his life. Suspecting that Prabhakar was murdered because he too was an informant, Kathir starts becoming paranoid. Eventually, he comes to realize that the inspector he is working for is now in cohorts with the bar owner after being promised a large sum of money as commission in return for permission to run their illegal businesses. Since Kathir is the only witness for most of the inspector's corrupt activities, the inspector has the bar owner send his thugs to kill Kathir too. However, the inspector eventually feels sorry for Kathir and allows him to live as long as he stays silent about all the underground operations being carried out by the local police station. In the end, Kathir takes up a low-paying but proper job at his wife's garment factory and earns an honest living.",
    "languages": "Tamil",
    "title": "Kirumi",
    "kind": "movie",
    "directors": "Anucharan Murugaiyan",
    "writers": [
        "M. Manikandan",
        "",
        "Anucharan Murugaiyan"
    ],
    "producers": [
        "K. Jayaram",
        "M. Jayaraman",
        "L. Prithiviraj",
        "S. Rajendran"
    ],
    "cinematographers": "Arul Vincent",
    "editors": "Anucharan Murugaiyan",
    "sound department": [
        "Arun S. Mani",
        "Raj Mohan",
        "Dhanush Nayanar",
        "Amrith Shankar",
        "P.C. Vishnu"
    ],
    "music department": "K Krishna Kumar",
    "akas": "Kirumi (India)",
    "writer": [
        "M. Manikandan",
        "Anucharan Murugaiyan"
    ],
    "director": "Anucharan Murugaiyan",
    "production companies": "JPR Films",
    "distributors": [
        "Escape Artists Motion Pictures",
        "Zee Tamil",
        "Zee5"
    ],
    "other companies": "Think Music",
    "plot": [
        "Kathir is a selfish youth in search of a job. Despite being married and having a child, he is waiting for a job offer that he feels meets his standards. Meanwhile, his wife Anitha is the breadwinner of the family. Prabhakar, a friendly neighbour who acts as his father figure, gets him a job as an informant with the less than honest local police inspector. Kathir uses this opportunity to take revenge against the violent bar owner who humiliated him in front of his friends, despite Prabhakar's advice. With his tip-off, the police raids the bar and arrests the owner for running an illegal gambling den as a side business. One night, Prabhakar is murdered by a group of thugs while a scared Kathir runs for his life. Suspecting that Prabhakar was murdered because he too was an informant, Kathir starts becoming paranoid. Eventually, he comes to realize that the inspector he is working for is now in cohorts with the bar owner after being promised a large sum of money as commission in return for permission to run their illegal businesses. Since Kathir is the only witness for most of the inspector's corrupt activities, the inspector has the bar owner send his thugs to kill Kathir too. However, the inspector eventually feels sorry for Kathir and allows him to live as long as he stays silent about all the underground operations being carried out by the local police station. In the end, Kathir takes up a low-paying but proper job at his wife's garment factory and earns an honest living.",
        "Kathir is a selfish youth in search of a job. Despite being married and having a child, he is waiting for a job offer that he feels meets his standards. Meanwhile, his wife Anitha is the breadwinner of the family. Prabhakar, a friendly neighbor who acts as his father figure, gets him a job as an informant with the less than honest local police inspector. Kathir uses this opportunity to take revenge against the violent bar owner who humiliated him in front of his friends, despite Prabhakar's advice. With his tip-off, the police raids the bar and arrests the owner for running an illegal gambling den as a side business. One night, Prabhakar is murdered by a group of thugs while a scared Kathir runs for his life. Suspecting that Prabhakar was murdered because he too was an informant, Kathir starts becoming paranoid. Eventually, he comes to realize that the inspector he is working for is now in cohorts with the bar owner after being promised a large sum of money as commission in return for permission to run their illegal businesses. Since Kathir is the only witness for most of the inspector's corrupt activities, the inspector has the bar owner send his thugs to kill Kathir too. However, the inspector eventually feels sorry for Kathir and allows him to live as long as he stays silent about all the underground operations being carried out by the local police station. In the end, Kathir takes up a low-paying but proper job at his wife's garment factory and earns an honest living.",
        "A jobless father of a kid is desperate in seeking a career he can feel settled at. When it comes in the form of an unofficial informant-cum-assist to a Police station through his mentor neighbour, he holds on to it sternly. In a work-related act of his, the mentor gets killed and he finds policemen from two stations are involved. When he tries to unearth the men behind it, they work on getting his life into a turmoil.::PipingHotViews"
    ]
}