{
    "id": "5178278",
    "localized title": "Vedalam",
    "cast": [
        "Ajith Kumar",
        "Shruti Haasan",
        "Lakshmi Menon",
        "Soori",
        "Thambi Ramaiah",
        "Ashwin Kakumanu",
        "Kabir Duhan Singh",
        "Rahul Dev",
        "Aniket Chouhan",
        "Vidyullekha Raman",
        "Bala Saravanan",
        "Swaminathan",
        "Motta Rajendran",
        "Mayilsamy",
        "Appukutty",
        "Kovai Sarala",
        "Meera Krishnan",
        "Yogi Babu",
        "Kamaljii",
        "Sudha",
        "Ramesh Thilak",
        "Andy Barreca",
        "Jasper",
        "Rob Peck",
        "Sharmila Thapa",
        "Amit Tiwari"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "148",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "India:U",
        "Indonesia:17+",
        "Ireland:15A",
        "New Zealand:M",
        "Norway:15::(cinema rating)",
        "Singapore:NC16",
        "Singapore:PG13",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "10 Nov 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzE0MjhjOTgtZTUzOS00ZmU0LThkNjEtMDc1MGMwMDAwZmE1XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "5178278",
    "plot outline": "Ganesh, a taxi driver and his sister try to settle down in Kolkata where she has enrolled for a course to hone her artistic skills. Unknown to his sister, Ganesh's hidden past and that of his sister comes to light when he goes up against an international human trafficking syndicate. The syndicate discovers that its not just a mere co incidence.",
    "languages": "Tamil",
    "title": "Vedalam",
    "kind": "movie",
    "directors": "Siva",
    "writers": [
        "Siva",
        "G. Adi Narayana",
        "",
        "Md Parvez Hossain"
    ],
    "producers": [
        "Aishwarya",
        "Ivano Fucci",
        "Jyothi Krishna"
    ],
    "composers": "Anirudh Ravichander",
    "cinematographers": "Vetri Palanisamy",
    "editors": "Antony L. Ruben",
    "production managers": "Michele Saragoni",
    "assistant directors": [
        "G. Adi Narayana",
        "Hemachandra Prabhu",
        "Rajasekar"
    ],
    "sound department": [
        "Jaison Jose",
        "Renjith Venugopal"
    ],
    "visual effects": "Balakrishnan Alagarsamy",
    "stunts": "Stunt Silva",
    "camera department": [
        "Anand",
        "Nutakki Anoop",
        "Hayath Basha",
        "N. Bharathwaj",
        "Charlestead",
        "P. Govindaraj",
        "Gautam Kumar Jayaseelan",
        "Parvaez K.",
        "Vishnu Kanth",
        "P. Karthick",
        "S. Karthick",
        "Uday Kiran",
        "E. Krishnasamy",
        "Satish Kumar",
        "Sudeep Kumar",
        "Padmanathan M.",
        "Umashankar M.",
        "K. Nirmal Venkatesh",
        "Prashanth",
        "Swathik Raj",
        "Kumaran Siva",
        "Sudhakar",
        "Venkatesan",
        "Christye Xavier"
    ],
    "music department": [
        "Aadi Arora",
        "Baadshah",
        "Vishal Dadlani",
        "Shakthisree Gopalan",
        "Shruti Haasan",
        "Madhan Karky",
        "Harish Ram L.H.",
        "Anirudh Ravichander",
        "Ravishankar",
        "Rokesh",
        "Siva",
        "Vinay Sridhar",
        "Viveka"
    ],
    "akas": [
        "Aavesham (India, Telugu title)",
        "Vedhalam (Australia)"
    ],
    "writer": [
        "Siva",
        "G. Adi Narayana",
        "Md Parvez Hossain"
    ],
    "director": "Siva",
    "production companies": [
        "ODU Movies",
        "Shri Saai Ram Creations"
    ],
    "distributors": [
        "Ayngaran International",
        "Ayngaran International",
        "MKS Retail Group",
        "Parasakthi Films",
        "Dhinchaak",
        "Jaya TV"
    ],
    "other companies": "Sony Music India",
    "plot": [
        "A doting brother who works as a cab driver tries to hunt down three notorious criminals in Kolkata who had harmed his sister.",
        "Ganesh, a taxi driver and his sister try to settle down in Kolkata where she has enrolled for a course to hone her artistic skills. Unknown to his sister, Ganesh's hidden past and that of his sister comes to light when he goes up against an international human trafficking syndicate. The syndicate discovers that its not just a mere co incidence.::PipingHotViews"
    ],
    "synopsis": "A team of soldiers attack an international criminal syndicate leader named Rahul and surround him in his private jet. But Rahul reveals that his younger brothers, Abhinay and Aniket have taken the soldier's families hostage, forcing them to turn on their leader. Before the leading soldier is executed, he declares that a good man will rise to take Rahul down. Rahul states that only a man as ruthless and evil as him will stand a chance of doing that, and orders the soldier to be murdered.Not long after, a man named Ganesh and his sister Tamizh move into Kolkata and meet Kolkata Kali, a rowdy thug and hitman whose instantly reformed by Ganesh's kindness which he's never experienced. Kali shows the two around the city before taking them to their new household where they befriend the neighbors. Ganesh enrolls Tamizh in an arts college for her passion in painting and sketching, and finds work at a taxi company with his new boss Laxmi Das. Ganesh's first customer is a phoney lawyer named Swetha. Swetha whose in a rush fails to pay the fine for the ride and Ganesh goes after her. Swetha needs a witness for her new case so she hires Ganesh in exchange for the money she owes, and has Ganesh pretend that he's mute since he doesn't know the native language. Ganesh calls Tamizh as the case nearly ends, blowing Swetha's cover and getting her fired. Ganesh has his second customer Arjun while he picks up Tamizh. Arjun later has feelings for Tamizh in admiration for her artwork and is revealed to be Swetha's brother.One night Ganesh heads to the temple with Laxmi Das and he's stopped by Swetha and her two junior recruits, who attempt to comedically attack him but they're stopped by Laxmi Das who threatens to report them to Police Comissioner Yashpal. Ganesh offers to pay Laxmi Das back, so Laxmi has Ganesh cover up for him and tell his wife and mother in law that he's at a temple function when he's actually at a pub. When Laxmi's wife shows Ganesh respect he betrays Laxmi and tells his wife and her mother where he really is, leading to Laxmi getting beaten up. Ganesh later accepts proposal of marriage by Arjun for his sister Tamizh, around the same time Swetha and Laxmi team up to prank Ganesh for ruining them. Swetha calls Ganesh saying that Tamizh is injured. When Ganesh finds out she lied he understands why she did and asks her not to repeat it since he cares about Tamizh so much, leading to Swetha admiring him.The taxi and auto rickshaw drivers of the city are called into a meeting by Yashpol who tells them about the criminal syndicate run by Rahul and their smuggling and trafficking operations in the city. He tells them to inform the police of any activities by the syndicate. Not long after, Ganesh finds one of Aniket's men, Amit, and his troops smuggling weapons. He reports this to Yashpol who arrests everyone except Amit who escapes. Aniket is angered and orders Amit to track the informer down and bring him to his yacht. After leaving a Church, Ganesh is abducted by Amit and taken hostage. But Ganesh escapes and kills Amit, then one by one he brutally murders each of Aniket's men and hangs Aniket from his boat. Abhinay finds this the next day and deduces that the culprit is not organized nor from the law, and that he must be a heavily experienced criminal himself. Abhinay tracks Ganesh using a technical team and finds his location in his own building. Ganesh breaks in and slaughters each and every one of Abhinay's men and calls up Rahul telling him that he'll be next. Swetha enters the building under suspicion and is terrified to find Ganesh killing people and swears to end the marriage. Ganesh reveals that Tamizh isn't actually his blood sister.A flashback shows that a year prior, Ganesh was actually one of the most feared thugs and mercenaries for hire in his town. He escapes police custody after helping them fend off an attack of rival thugs after they pay him, as he only cares about money and his self interests. One day Ganesh is walking when a group of his enemies knock him out and stab him. A concerened Tamizh stops by and helps Ganesh to the hospital. The doctors are hesitant to treat him because of his dangerous reputation but Tamizh claims that Ganesh is her brother and has him admitted, even donating blood to save him. The next morning Ganesh leaves money behind for Tamizh and departs, which she gives to the hospital. Tamizh has blind parents and their household is threatened by company owners who wish to demolish it. Although refusing the family is threatened to be evicted by thugs instead. Tamizh and her friend Ester consult Ganesh to help them but Ganesh betrays them saying that the company owners payed him more money earlier. He demands that they leave before he gets involved without caring how much the household means to them. The family arrives at his household and begin to occupy it, but Ganesh finds himself unable to kick them out since they have been so nice to him over the stay. He sends his friends to kill them instead but they all reform after the family feeds them and Tamizh draws them portraits. Days later, the criminal syndicate run by the brothers traffic several young girls and Tamizh ends up being abducted by them. Ganesh wanted to threaten Tamizh but since the kidnappers damaged his bike, he asks for money and leaves. However he stays behind and fights them just to get an image, freeing the girls. The next day he's thoroughly confused with all the gratitude given by the girl's families.Tamizh has also caught the brothers on video and reports them to the police, but the corrupt police giver her away and that night Tamizh and her parents are attacked and wounded by the brothers after deciding to accept eviction when Ganesh saved Tamizh. Tamizh's mother is dead by the time Ganesh arrives and her father pays Ganesh to save Tamizh before dying in his arms. Ganesh feels empathy for the first time and lets go of the money, and his memory of being hospitilized comes back to him when he admits Tamizh. Because of the attack, Tamizh had suffered amnesia and couldn't remember anything about her family. Ganesh has since raised her claiming to be her sibling, at the same time tracking down members of the syndicate and killing them. After hearing the story Swetha accepts Ganesh's intentions and allows the marriage to procede. For Tamizh's sake she can't know about her past or who Ganesh really is. Rahul arrives in the city the next day to investigate his brother's murders, and finds that one victim of the attacks survived and is on the verge of death. One of Rahul's friends consults Tamizh to draw a forensic sketch of the killer and she sketches Ganesh just before the patient dies. She begins to get scared and believes she accidentally drew Ganesh since he called earlier. When Ganesh comes to the hospital Rahul's men point their weapons but one of Rahul's men hold him at gunpoint to let Ganesh and Tamizh go. Ganesh had taken the man's son hostage earlier in preperation so Rahul sets them free.That night, Tamizh is kidnapped by Rahul's men at a mall and Ganesh pursues them. But it turns out that Rahul's men simply hid a bound Tamizh in the trunk of Ganesh's taxi. Rahul tells him she'll be sold to an international sex trade and that Ganesh will never see her again all because of him, and that he'll die knowing this. Ganesh chases down the car Tamizh is in and tracks it to the harbor. Rahul intercepts Ganesh and pins him down, who watches helplessly as Tamizh is transported towards the coast. Just before the car can cross over to the port it's interrupted by a parade, a sign in regard to the good wishes given by the families whose daughter's Ganesh saved a year earlier. Ganesh fights Rahul and helps Tamizh escape without revealing his violent identity. When Tamizh has her eyes closed in fear, Ganesh guns Rahul down stating that he'd kill for money and without a doubt he will for family. Ganesh rescues Tamizh and they live peacefully afterwards."
}