{
    "id": "5346932",
    "localized title": "My God",
    "cast": [
        "Suresh Gopi",
        "Honey Rose",
        "Adarsh Nair",
        "Sreenivasan",
        "Lena",
        "Kalabhavan Haneef",
        "Indrans",
        "Joy Mathew",
        "Chali Pala",
        "Sreejith Ravi",
        "Rekha"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "original air date": "04 Dec 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjFhY2E3YjItMWZkNy00NDJmLTliMzMtOWQwNjJlOWE2NTEzXkEyXkFqcGdeQXVyNjQ5NTA2ODE@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "5346932",
    "languages": "Malayalam",
    "title": "My God",
    "kind": "movie",
    "directors": "M. Mohanan",
    "writers": [
        "Nijo Kuttikadu",
        "",
        "Geo Mathew",
        "",
        "M. Mohanan"
    ],
    "producers": [
        "Raveendran Gokulam",
        "Shyna K.V.",
        "Mahi Puthussery"
    ],
    "composers": "Bijibal",
    "cinematographers": "Jithu Damodar Palakkad",
    "editors": "Ranjan Abraham",
    "assistant directors": "Renith Elamadu",
    "sound department": "Nikhil Sebastian",
    "visual effects": [
        "Vishakh Babu",
        "Andrew Jacob Dcrus",
        "Jerry",
        "Arunlal S. Pillai"
    ],
    "music department": [
        "Rafeeq Ahammed",
        "Chitra Arun",
        "Jayachandran",
        "Ramesh Kavil",
        "Uday Ramachandran"
    ],
    "writer": [
        "Nijo Kuttikadu",
        "Geo Mathew",
        "M. Mohanan"
    ],
    "director": "M. Mohanan",
    "production companies": "Karunya VR Creations",
    "plot": "Sam Thottunkal, the younger son of Thomas Scaria and Zareena is a teenager, is an introvert. It is when Sam's life becomes more and more complicated, he gets acquainted with Adiraja. Movie narrates the resulting events in the life of Sam.",
    "synopsis": "My God\n(Malayalam Movie)Director : M. MohananStarring : Suresh Gopi, Honey Rose, Sreenivasan, Joy Mathew, Lena, Rekha,\nManoj Guinness, Master Adarsh, Abhi Madhav, Indrans, Sreejith\nRavi, Sreejith Ravi, Praveen Prem, Kalabhavan Haneef.Produced by : Mahi Puthusseri, Shyna VScreenplay by : M Mohanan, Geo Mathew, Nijo Kuttikad.Music by : BijibalCinematography : Jithu DamodarEdited by : Ranjan AbrahamDistributed by : Anto Joseph ReleaseRelease date : 4 December 2015The film begins with an incident in which Sam is arrested by the police for killing his own Father. Later he was sent to a juvenile home and he was unable to prove that it was accidental while pushing his father while breaking his laptop to betray his anger. In the Juvenile home he shows signs of abnormal mental health and even tried for suicide. The central character 15 year old boy Sam Thottungal is the third child of an upper middle class family of Mr. Thomas Skariya. Eldest child Sareena is M.Tech qualified and she is preparing to join her husband working abroad. Second child Savio an I T professional is working in Bangalore. He is unmarried.Being 12 year younger to his right elder brother Sam thinks his BIRTH IS A MISTAKE of fact and a strong feeling that he is an unsolicited and thus unwanted child in the family.\nBeing very backward in academics Sam was looked down upon by all especially by his father. The impact of this situation was that he also began to believe that he is retarded and the cause is the failed attempts for aborting the pregnancy by his mother under the compulsion of his father. His belief has spilt out at times as words.Sam likes spending more time in friends' houses and with his parish priest and he uses the time for working on computers. This helps him keep the worry of unsolicited birth out of mind for some time. His ambition is to get a laptop.While passing the computer showroom inauguration venue announcing quiz competition Sam participates in the contest and wins a laptop the promotional gift by the computer company and he returns home.The drastic change of his life begins that night as he is arrested on charges of murdering his father. Now, Sam is the accused in a premeditated murder case and a psychiatric patient.\nBeing an adolescent Sam is remanded to the custody of a special home where paediatric psychologist Dr. Aarathi a voluntary social worker, begins her psychological treatment for him.Progressively the story sustains emotional situations, incidents and suspense quite logic and justified with the involvement of Dr. Aarathi and her husband Mr. Aadiraja Bhattathirippadu who is the CEO of an I T corporate in the U S. There are scenes that will keep the spectators spellbound and the movie comes to a pleasant end as the prognosis of Sam's treatment reaches a perfect cure with an amazing achievement of Sam the 15 year old student.\nDirector Shri. M. Mohanan : A popular Director. Other movies directed are Katha Parayumbol, 916, Manikyakallu, Aravindante Adhithikal.Awards won : State Award 2007, Asia Net Film Award, Film Fair Award, Film Critics Award, U A E AMMA Award and selected for Indian Panorama.\nRemade in Tamil (Rajanikanth) and Hindi (Sharuq Khan)\n'MANIKKYA KALLU\" Casting Prithviraj, Salim Kumar, Jagathi Sree Kumar, Samvrutha etcAwards won : State Award\nThis movie is screened as guide for all teachers in-service training\nprogram in Kerala State\"916\" Casting Asif Ali, Anoop MenonAravindante Adhithikal Recent movie : The film was a commercial success at box office. The film completed its 100-day run in theatres . The film won the Kerala State Film Award for Best Choreography at the 49th Kerala State Film Awards. Aravindante Athidhikal went on to win four awards at the Kerala Kaumudi Flash Movies Awards, including Most Popular Film, Most Popular Actress for Nikhila Vimal, Most Popular Supporting Actor for Aju Varghese and Second Most Popular Director. Vineeth Sreenivasan and Nikhila Vimal won the Best Star Pair Award at the Vanitha Film Awards 2019.Suresh Gopi (Mr. Aadiraja Bhattathirippadu in My God) : National Film Award and Kerala State Film Award winner : is an Indian film actor, politician, and television presenter. He works predominantly in Malayalam cinema and has also appeared in few Tamil, Telugu, Kannada and Bollywood films. Suresh has acted in more than 200 films. He currently serves as a Member of Parliament (MP) in Rajya Sabha.Honey Rose (Dr. Arathi Bhattathiripadu ) : is an Indian film actress, who predominantly appears in Malayalam films. She also appeared in Tamil, Kannada and Telugu films.Sreenivasan ( Parish priest ) : Leading film actor, screenwriter, director and producer who predominantly works in Malayalam cinema. Sreenivasan has starred in over 200 films.Joy Mathew : is best known for playing the lead role in John Abraham's 1986 film Amma Ariyan which was voted one of the Top 10 Indian films by British Film Institute. Joy is an Indian film and theatre actor, director, playwright, and screenwriter. He predominantly works in Malayalam cinema.Master Adarsh (Sam Thottungal ) : Dancer, Singer, youngest black belt holder in Karate winner of several state, national and international dance and music competitions and stage performer and acted for Malayalam, Hindi, Tamil, Telugu, Kannada movies.Lena : has acted in over 100 films in Malayalam cinema along with a few films in Tamil, Telugu and Hindi languages.Sumathi Josephine. stage Name : Rekha. (Mother of Sam) : has acted in hit movies like Ramji Rao Speaking, and Aey Auto in Malayalam and, Punnagai Mannan, En Bommukutty Ammavukku and Kadalora Kavithaigal in Tamil."
}