{
    "id": "5361436",
    "localized title": "Karie",
    "cast": "Rammohan",
    "genres": [
        "Comedy",
        "Drama",
        "Family"
    ],
    "runtimes": "103",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "original air date": "11 Dec 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTU1NTE2ZGUtYjhhNi00YTRiLWEyZjEtZmNiYmNiNzhjZGViXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR22,0,101,150_.jpg",
    "imdbID": "5361436",
    "plot outline": "Karie means Black. While there are tonal variations in culture across the southern multicultural, multi-religious Indian state called Kerala, one thing that remains unchanged is the caste system. Caste is the dangerous villain that creates irreparable damage to the social fabric and ostracizes individuals based on their skin tone. Karie explores the intricacies and power equations in the grim caste system in the form of the dialects and subtle language nuances influenced by caste. The film travels through the village with two men whose mission is to conduct a ritual on behalf of their colleague who works abroad.",
    "languages": "Malayalam",
    "title": "Karie",
    "kind": "movie",
    "directors": "Naranipuzha Shanavas",
    "writers": [
        "Naranipuzha Shanavas",
        "",
        "Naranipuzha Shanavas"
    ],
    "producers": "Naranipuzha Shanavas",
    "composers": "Sudeep Palanad",
    "editors": "Naranipuzha Shanavas",
    "music department": "Sudeep Palanad",
    "writer": [
        "Naranipuzha Shanavas",
        "Naranipuzha Shanavas"
    ],
    "director": "Naranipuzha Shanavas",
    "plot": "_Karie_ (qv) means Black. While there are tonal variations in culture across the southern multicultural, multi-religious Indian state called Kerala, one thing that remains unchanged is the caste system. Caste is the dangerous villain that creates irreparable damage to the social fabric and ostracizes individuals based on their skin tone. _Karie_ (qv) explores the intricacies and power equations in the grim caste system in the form of the dialects and subtle language nuances influenced by caste. The film travels through the village with two men whose mission is to conduct a ritual on behalf of their colleague who works abroad."
}