{
    "id": "5457570",
    "localized title": "Raju Gari Gadhi",
    "cast": [
        "Ashwin Babu",
        "Dhanya Balakrishna",
        "Chethan Cheenu",
        "Dhanraj",
        "Shamna Kasim",
        "Krishna Murali Posani",
        "Sapthagiri",
        "Shakalaka Shankar"
    ],
    "genres": "Horror",
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "22 Oct 2015 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzg2MzkzNjgtMzQwMC00ZDIzLWJjNTQtOTRjYzc5ZDdkZjY5XkEyXkFqcGdeQXVyMjM5NTM5NjM@._V1_SY150_CR99,0,101,150_.jpg",
    "imdbID": "5457570",
    "plot outline": "There is a haunted house in Nandigama. Dead bodies of 34 people resurface in house's well over a period of time. A TV channel plans to host a reality show in that haunted house. Group of seven individuals Ashwin Ashwin Babu, Nandu Chethan Cheenu, Barbie (Eshanya), Su Dhanya Balakrishna, Shivudu Dhanraj, M Y Danam (Shankar) and Bujjimma (Vidyulekka) are selected for a Television reality show \"Dhayyam tho 7 rojulu, Pattukunte 3 kottulu\" (Those who spends 7 days in this haunted Nandigama palace and survive will get Rs. 3 crores). Program head Pakoddi (Prabhas Seenu) and Chekodi (Raghu Babu) have arranged all kinds of scares for the contestants, but the ghosts of the palace Bommali (Poorna) and Bommali Raja Posani Krishna Murali put on their own show. Rest of the story is all about the mystery behind Raju Gari Gadhi.",
    "languages": "Telugu",
    "title": "Raju Gari Gadhi",
    "kind": "movie",
    "directors": "Omkar",
    "writers": "Omkar",
    "composers": "Sai Karthik",
    "cinematographers": "Gnanam",
    "editors": "Nagaraj",
    "art directors": "Sahi Suresh",
    "visual effects": [
        "Praveen Ghanta",
        "Shameem Hussain K.",
        "Naresh Sattenapalli"
    ],
    "writer": "Omkar",
    "director": "Omkar",
    "production companies": [
        "A.K. Entertainments India",
        "AK Entertainments",
        "Oak Entertainments",
        "Vaarahi Chalana Chitram"
    ],
    "distributors": "Hotstar",
    "other companies": "Mango Music",
    "plot": [
        "There is a haunted house in Nandigama. Dead bodies of 34 people resurface in house's well over a period of time. A TV channel plans to host a reality show in that haunted house.",
        "There is a haunted house in Nandigama. Dead bodies of 34 people resurface in house's well over a period of time. A TV channel plans to host a reality show in that haunted house. Group of seven individuals Ashwin Ashwin Babu, Nandu Chethan Cheenu, Barbie (Eshanya), Su Dhanya Balakrishna, Shivudu Dhanraj, M Y Danam (Shankar) and Bujjimma (Vidyulekka) are selected for a Television reality show \"Dhayyam tho 7 rojulu, Pattukunte 3 kottulu\" (Those who spends 7 days in this haunted Nandigama palace and survive will get Rs. 3 crores). Program head Pakoddi (Prabhas Seenu) and Chekodi (Raghu Babu) have arranged all kinds of scares for the contestants, but the ghosts of the palace Bommali (Poorna) and Bommali Raja Posani Krishna Murali put on their own show. Rest of the story is all about the mystery behind _Raju Gari Gadhi_ (qv).::Suchindra Palem"
    ]
}