{
    "id": "5496754",
    "localized title": "Nilkanth Master",
    "cast": [
        "Vikram Gokhale",
        "Kishore Kadam",
        "Addinath Kothare",
        "Neha Mahajan",
        "Pooja Sawant"
    ],
    "genres": "Drama",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color::(35 mm version)",
    "aspect ratio": "2.35 : 1 (original ratio)",
    "sound mix": "D-Cinema 48kHz 5.1",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWE5OTQ0MWItNjJjMC00ZmZjLTlkZWItNmNhYzI5MDNjZTQ0XkEyXkFqcGdeQXVyNjYzMDc3Mjk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5496754",
    "plot outline": "Nilkanth Master is based in the pre-independence era in Maharashtra. Vishwanath (Omkar Govardhan) joins a revolutionary group after earning the trust of the leader, Vyenkatesh (Adinath Kothare). But during the first secret operation after his joining, Vyenkatesh gets killed while fighting the British and their mission fails. Indu (Pooja Sawant) is Vishwanath's childhood love.To hide from the eyes of the British, Vishwanath is made to stay with the senior-most member of the group (Vikram Gokhale). He is given a pseudo identity of the school teacher, Nilkanth. Hence, he is now called Nilkanth Master. His first task is to break the news of Vyenkatesh's death to his lover, Yashoda (Neha Mahajan).",
    "languages": "Marathi",
    "title": "Nilkanth Master",
    "kind": "movie",
    "directors": "Gajendra Ahire",
    "writers": "Gajendra Ahire",
    "producers": "Meghamala Pathare",
    "composers": "Chaitanya Adkar",
    "cinematographers": "Krishna Soren",
    "editors": "Ballu Saluja",
    "editorial department": [
        "Vicky Chaudhary",
        "Ram Singh Yadav",
        "Jespal Nadar"
    ],
    "assistant directors": "Amit Koli",
    "sound department": [
        "Nikunj Arora",
        "Vijay Bhope",
        "Pranam Pansare",
        "Kapil Rege",
        "Siddhesh Sardesai"
    ],
    "visual effects": "Sairaj Ghag",
    "miscellaneous": "Kartikee Yadav",
    "writer": "Gajendra Ahire",
    "director": "Gajendra Ahire",
    "production companies": "Akshar Films",
    "distributors": "Akshar Films",
    "plot": [
        "Vishwanath is a youth driven by an obsession to participate in the freedom struggle of India. He abandons his home and his beloved to join a band of revolutionaries.",
        "_Nilkanth Master_ (qv) is based in the pre-independence era in Maharashtra. Vishwanath (Omkar Govardhan) joins a revolutionary group after earning the trust of the leader, Vyenkatesh (Adinath Kothare). But during the first secret operation after his joining, Vyenkatesh gets killed while fighting the British and their mission fails. Indu (Pooja Sawant) is Vishwanath's childhood love.To hide from the eyes of the British, Vishwanath is made to stay with the senior-most member of the group (Vikram Gokhale). He is given a pseudo identity of the school teacher, Nilkanth. Hence, he is now called _Nilkanth Master_ (qv). His first task is to break the news of Vyenkatesh's death to his lover, Yashoda (Neha Mahajan).::_Nilkanth Master_ (qv)"
    ]
}