{
    "id": "7504546",
    "localized title": "Mr. X",
    "cast": [
        "Ian Cranston",
        "Macc Dundee",
        "Ethan Michaels",
        "Kenny Loggins",
        "Von Vandervien",
        "Biz Nolastname",
        "Jonathan Shepherd"
    ],
    "genres": [
        "Short",
        "Adventure",
        "Sci-Fi"
    ],
    "runtimes": "25",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "original air date": "15 Oct 2018 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjRjZGJkMGMtNjc1OS00NWM3LTkyMGQtZjA5NTFmNTU2MzkyXkEyXkFqcGdeQXVyMjQxNTQ0NDU@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "7504546",
    "languages": "English",
    "title": "Mr. X",
    "kind": "video movie",
    "directors": [
        "Ian Cranston",
        "Ethan Michaels"
    ],
    "writers": "Ian Cranston",
    "cinematographers": "Ethan Michaels",
    "editors": [
        "Ian Cranston",
        "Icizzle Dizzle"
    ],
    "casting directors": "Von Vandervien",
    "set decorators": "Albino Black",
    "make up department": "Larry Browkaw",
    "writer": "Ian Cranston",
    "director": [
        "Ian Cranston",
        "Ethan Michaels"
    ],
    "production companies": [
        "ICIZZLE Productions",
        "iCizzle Visuals"
    ],
    "distributors": "Dundeal Entertainment",
    "plot": "7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio. With winning Lotto numbers.",
    "synopsis": "SFX GUNSHOTS - dies and comes backBIG WHITE TITLE on Black: DAY 1\n7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio. With winning Lotto numbers.Radio DJ\nTodays winning numbers are: 4, 7, 27, 47, 74 if this is your ticket you've just won $200,000 million dollars.Mr. X\n(V/O)\nWhat the fuck? I'm alive.. is this what happens when we die?Gets phone call. It's a sort ok person named Ned from the past. He's calling because he'd like to sell him life insurance.Mr. X - Hello this is Mr. X(Mr. X seems annoyed)\nI don't remember you. how would i remember you?Ned\nI use to sit next to you in music class. I payed the trombone like you.Mr. X\nStill nothing.Ned\nNed the neddy? you don't remember miss sampsonnite?Mr. X\nSort of, What are you up now days Ned?Ned\nWell, believe it or not I sell life insurance.Mr. X\nLook Ned I'm kinda in a hurry right now. Let me call you back.CUT TO\nPutting shirt on and looking in mirror.Mr. X Phone RingsHello Mr. X, my name is James and I've been sent here by God. Your not a nice person Mr. X. God doesn't want you and neither does the devil. We're concerned about your after life Mr. X.God is gonna give you 7 days to learn your lesson. You can do whatever you want but warned that after 7 days.. Your time is up.You have been given the gift of life Mr. X, what you choose to do with it is up to you. and remember, after the 7 days, God will judge your heart.CUT TO\nDriving in car. 27 different angles. Multiple camera setup.Mr. X\n(V/O)\nThis is some crazy shit. I can't tell anyone this. They'll think I'm crazy. Maybe it was just a dream.Quick cuts of Mr. X driving around town.Mr. X\nTonight I do have a $100,000 drug deal. The only problem is I don't have all the money needed to complete the deal. I've got about $50,000 but I still need another $50,000 by tonight. The deal would give me enough drugs to move to get a Lambo. I've always wanted a Lambo.Quick cuts of Mr. X driving around town.Mr. X\nI guess you could say I've never been interested in the married with children role in life. I do have a kid but I haven't talked to him in years thanks to my crazy baby momma. That's why I stay Single 4 life.The court system tends to not be nice to single fathers.Quick cuts of Mr. X driving around town.Mr. X\nI can't say I'm the most moral man but who is really?Quick cuts of Mr. X driving around town.Mr. X\nI hit a lick for $40,000 at a bank once. They thought I was Jonathan Smith from California for a bank withdrawal. It was getting too easy, the money was coming to fast. I'm still trying to figure out why they did P.J. like that. RIP homie. Just as fast as they here now they gone.Quick cuts of Mr. X driving around town. Drives around corner and gets out of car. walks to house back area.Mr. X\nAn associate of mine tipped me off to a $50,000 gold plated engagement ring snatch up. All I had to do was act like I was breaking into the house and grab the ring located in the bathroom. Easy enough right? Yeah, it would be a stolen fully insured ring that my associate would collect the insurance money and I could pawn the ring off for $60,000.CUT TO PAWNSHOP COUNTER:PawnShop Guy\nI'll give you $25,000 for the ring.Mr. X\nIt's worth well over $60,000.PawnShop Guy\nNo, I'll give you $25,000 for the ring.Mr. X\n(Mr. X looks at watch)\nWill you do $30,000?PawnShop Guy\nThat's a Dundeal!CUT TO:\nMr. X in Car driving with briefcase or something similar. Driving car to deal house to make the deal.Mr. X\n(V/O)\nI couldn't figure out how to get all the money. I still needed $20,000.Mr. X pulls up to house, knocks on door, Door opens and Mr. X is greeted by a quick pat down.Mr. X\nIt's all there. tries to bluff dealand ends up getting shot dead.BIG WHITE TITLE on Black: DAY 2\n7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio. With winning Lotto numbers.Radio DJ\nTodays winning numbers are: 4, 7, 27, 47, 74 if this is your ticket you've just won $200,000 million dollars.Wakes up. I feel like it's Deja vu all over again. the same radio show, the same winning lotto numbers. maybe it's just a repeat episode.Gets phone call. It's a sort ok person named Ned from the past. He's calling because he'd like to sell him life insurance.Mr. X - Hello this is Mr. X(Mr. X seems annoyed)\nI don't remember you. how would i remember you?Ned\nI use to sit next to you in music class. I payed the trombone like you.Mr. X\nStill nothing.Ned\nNed the neddy? you don't remember miss sampsonnite?Mr. X\nSort of, What are you up now days Ned?Ned\nWell, believe it or not I sell life insurance.Mr. X\nLook Ned I'm kinda in a hurry right now. Let me call you back.CUT TO\nPutting shirt on and looking in mirror.Drives around corner and gets out of car. walks to house back area.Mr. X\nAn associate of mine tipped me off to a $50,000 gold plated engagement ring snatch up. All I had to do was act like I was breaking into the house and grab the ring located in the bathroom. Easy enough right? Yeah, it would be a stolen fully insured ring that my associate would collect the insurance money and I could pawn the ring off for $60,000.CUT TO PAWNSHOP COUNTER:PawnShop Guy\nI'll give you $25,000 for the ring.Mr. X\nIt's worth well over $60,000.PawnShop Guy\nNo, I'll give you $25,000 for the ring.Mr. X\n(Mr. X looks at watch)\nWill you do $30,000?PawnShop Guy\nThat's a Dundeal!CUT TO:\nMr. X in Car driving with briefcase or something similar. Driving car to deal house to make the deal.Mr. X\n(V/O)\nI couldn't figure out how to get all the money. I still needed $20,000.Mr. X pulls up to house, knocks on door, Door opens and Mr. X is greeted by a quick pat down. Mr. X hands brief case over with money in it.Mr. X\nIt's all there.You're short $20,000. tries to bluff deal.count it again.You're still short $20,000. Clearly you don't remember our agreement. No money. no deal. somethings not right about you. I don't trust you. It feels like your trying to snake me. You think I'm gullible? Well, guess what. Pulls gun out and points it at Mr. X. May God have mercy on your soul.Mr. X gets shot dead.Cut toBIG WHITE TITLE on Black: DAY 3\n7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio. With winning Lotto numbers.Wakes up. Gets phone call. It's a sort ok person named Ned from the past. He's calling because he'd like to sell him life insurance.Mr. X - Hello this is Mr. X, How are you doing today Ned?Ned\nThis is Ned, I mean how'd you know it would be me?(Mr. X seems happy to talk to ned)\nDidn't we use to play the trombone together in music class?Ned\nHow'd you remember that? I haven't talked to you for years.Mr. X\nThe old days huh Ned neddy?Ned\nYeahMr. X\nremember miss sampsonniteNed\nYeah, Well, believe it or not I sell life insurance.Mr. X\nLook Ned I'm gonna need $20,000 in Life insurance. Where do I sign up?CUT TO\nPutting shirt on and looking in mirror.Mr. X\nV/O\nI need money!Mr. X\nPut the money in the bag bitch. stop screaming!Gun shotsMr. X\n(V/O)\nThe gun shots well that wasn't me die-ing again.Cut to\nand that's how you rob a bank. Out runs the cops in car chase. Free like OJ all day.Cut to\nJail door closingWhat am I gonna do now? shit.CUT TO:BIG WHITE TITLE on Black: DAY 4\n7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio.Wakes up. Gets phone call.Ned\nIt's a sort ok person named Ned from the past. He's calling because he'd like to sell him life insurance.Mr. X - Hello this is Mr. X, Look Ned I'm gonna need $20,000 in Life insurance. Where do I sign up?CUT TO\nPutting shirt on and looking in mirror.Mr. X\n(V/O)\nWhat am I doing? I could just win the lotto. writes numbers down and memorizes winning ticket. Alright Tomorrow I will win. but first...CUT TO\nOutside shot of the strip club.CUT TO\nExt. Bedroom - Sex noises in the room. Woman moaning. Mr. X walks out of room with his head held high.Mr. X\n(V/O)\nThat's what I'm talking about no rubbers or nothing. Raw Dog.Off screen, door gets kicked in and husbands stripper comes home. Gun shots are heard off cameraCUT TOBIG WHITE TITLE on Black: DAY 5\n7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio.Mr X Wakes Up. Gets phone call. Let's it ring and go to voice mail.Calls baby mama to talk to son. Doesn't go as planned. He looses his cool and hangs up on her.Mr. X\nBitchCut to Driving to gold ring, steals it, leaves in car\nCUT TO PAWNSHOP COUNTER:Cut to\nIn car drivingCUT TO:\nMr. X in Car driving with briefcase or something similar.\nDriving car to deal house to make the deal.Mr. X\n(V/O)\nI couldn't figure out how to get all the money. I still needed $20,000.Mr. X pulls up to house, knocks on door,\nDoor opens and Mr. X is greeted by a quick pat down.\nMr. X hands brief case over with money in it.\nMr. X\nIt's all there.You're short $20,000.tries to bluff deal. count it again.You're still short $20,000. Clearly you don't remember our agreement.No money. no deal.somethings not right about you. I don't trust you.It feels like your trying to snake me.You think I'm gullible?Well, guess what. Pulls gun out and points it at Mr. X.May God have mercy on your soul.Mr. X gets shot dead.Cut toBIG WHITE TITLE on Black: DAY 6\n7:47 every morning the alarm goes off to same song. Radio show on the northwest mecca radio.Mr. X Wakes up. Gets phone call. Answers it.Mr. X\nNed I gotta take care of a few things. Put me down for $50,000 in Life insurance. Good to talk to you today Ned.Hangs up.Calls baby mama to talk to son. Apologetic let's find a way to work it out. for the sake of the kid who is 11. She agrees and Mr. X talks to his son for first time in 7 years.Mr. X\nWhen I get back in town let's get together and figure this out. I love you son.In car driving:Mr. X\n(V/O)\nI gotta walk away from this street life. I gotta make a change and not do that shit no more. What am I telling my son about how to live life?Car pulls up to cross (federal way area)\nGets on his knees and cries for God's help and forgiveness.Cut To\nGoes up to house and knocks on door. Asks people in the beginning that shot him for forgiveness. I don't have the money so I can't do the deal. The people still shoot Mr. X dead.BIG WHITE TITLE on Black: DAY 7\nHe wakes up on the 7th day at 7:47 same music plays but something is different. Radio show on the northwest mecca radio.Mr. X checks his phone to find a message from God.God text number 747\nAll is forgiven Mr. X, you learned your lessonMr X is Sitting on Bed shaking head.V/O (Final Message)One thing I've learned in life...God can put us through some major life trials. hmmm, We have to find a better way to solve our problems with each other. we gotta start loving ourselves, before God can.We gotta put the guns down and gloves up. we have to find a way to talk about our problems. But most important... Buy a power ball ticket today."
}