{
    "id": "7614404",
    "localized title": "89",
    "cast": [
        "Lee Dixon",
        "Paul Merson",
        "Ian Wright"
    ],
    "genres": [
        "Documentary",
        "Sport"
    ],
    "runtimes": "91",
    "countries": "United Kingdom",
    "country codes": "gb",
    "language codes": "en",
    "color info": "Color::(HD)",
    "aspect ratio": "16:9 HD (high definition)",
    "certificates": [
        "Germany:Not Rated",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDFkZWRlZTEtY2M1NC00YzVjLThhNDEtYzdjNjliODVhYmVhXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "7614404",
    "plot outline": "89 tells the incredible story of one of football's greatest triumphs: when against all odds Arsenal snatched the Championship title from Liverpool at Anfield in the last minute of the last game of the 1988/89 season. It's a universal tale of a band of brothers who, led by a charismatic and deeply respected manager, came together to defy the odds and create history. Mixing archive and previously unseen footage with revealing interviews, insights and memories from the original squad, game officials, famous fans and the people who were there on the night this is the definitive account of a watershed moment in football and a must-watch for any sports fan.",
    "languages": "English",
    "title": "89",
    "kind": "movie",
    "directors": "Dave Stewart",
    "cinematographers": "Neil Harvey",
    "editors": "Sam Billinge",
    "sound department": "Nathan Kendall",
    "camera department": "Ariel Grandoli",
    "miscellaneous": "Michelle Antoniades",
    "director": "Dave Stewart",
    "production companies": "Universal Pictures UK",
    "distributors": [
        "Universal Pictures UK",
        "Sky Documentaries"
    ],
    "plot": [
        "The true story of a sporting miracle, when Arsenal went to Anfield on the last day of the 1988/_89_ (qv) season needing to beat the best team in England by two clear goals to snatch the title.",
        "_89_ (qv) tells the incredible story of one of football's greatest triumphs: when against all odds Arsenal snatched the Championship title from Liverpool at Anfield in the last minute of the last game of the 1988/_89_ (qv) season. It's a universal tale of a band of brothers who, led by a charismatic and deeply respected manager, came together to defy the odds and create history. Mixing archive and previously unseen footage with revealing interviews, insights and memories from the original squad, game officials, famous fans and the people who were there on the night this is the definitive account of a watershed moment in football and a must-watch for any sports fan."
    ]
}