{
    "id": "0449994",
    "localized title": "Jodhaa Akbar",
    "cast": [
        "Hrithik Roshan",
        "Aishwarya Rai Bachchan",
        "Sonu Sood",
        "Poonam Sinha",
        "Suhasini Mulay",
        "Ila Arun",
        "Raza Murad",
        "Kulbhushan Kharbanda",
        "Surendra Pal",
        "Rajesh Vivek",
        "Pramod Moutho",
        "V.M. Badola",
        "Manava Naik",
        "Disha Vakani",
        "Dilnaz Irani",
        "Yuri Suri",
        "Shaji Chaudhary",
        "Sayed Badrul Hasan",
        "Pramatesh Mehta",
        "Pradeep Sharma",
        "Digvijay Purohit",
        "Amin Hajee",
        "Nikitin Dheer",
        "Aman Dhaliwal",
        "Indrajit Sarkar",
        "Tejpal Singh Rawat",
        "Abeer Abrar",
        "Shehzor Ali",
        "Kavi Kumar Azad",
        "Amitabh Bachchan",
        "Balraj",
        "Ulhas Barve",
        "Chan",
        "Parag Choudhary",
        "Prayas Choudhary",
        "Chetana Das",
        "Parth Dave",
        "Farida",
        "Karim Hajee",
        "Sudhanshu Hakku",
        "Lahiru Jay",
        "Bharat Kumar",
        "Tanveer Singh Maan",
        "Raju Pandit",
        "Omar Khayyam Saharanpuri",
        "Rajiv Sehgal",
        "Gurmeet Singh",
        "Gurmmeet Singh",
        "Jassi Singh",
        "Ranbir Singh",
        "Rucha Vaidya",
        "Bheem Vakani",
        "Abir Abrar"
    ],
    "genres": [
        "Action",
        "Drama",
        "History",
        "Romance",
        "War"
    ],
    "runtimes": "213",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "ur"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "DTS",
        "Dolby Digital"
    ],
    "certificates": [
        "Australia:M",
        "France:Tous publics",
        "India:UA",
        "Ireland:12A",
        "Italy:T",
        "Malaysia:U",
        "Netherlands:12",
        "New Zealand:M",
        "Singapore:PG",
        "South Africa:10",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated",
        "United States:TV-14::(Netflix)"
    ],
    "original air date": "15 Feb 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzFhNjI3YjgtZmNhNC00NzEyLTk2MTctMmNjZDgzYTNjYjViXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0449994",
    "plot outline": "Jodhaa Akbar is a sixteenth century love story about a marriage of alliance that gave birth to true love between a great Mughal Emperor, Akbar and a Rajput princess, Jodhaa. Politically, success knew no bounds for Emperor Akbar, After having secured the Hindu Kush, he furthered his realm by conquest until his empire extended from Afghanistan to the Bay of Bengal, and from the Himalayas to the Godhavari River. Through a shrewd blend of tolerance, generosity and force, Akbar won the allegiance of the Rajputs, the most belligerent Hindus. But little did Akbar know that when he married Jodhaa, a fiery Rajput princess, in order to further strengthen his relations with the Rajputs, he would in turn be embarking upon a new journey - the journey of true love. The daughter of King Bharmal of Amer, Jodhaa resented being reduced to a mere political pawn in this marriage of alliance, and Akbar's biggest challenge now did not merely lie in winning battles, but in winning the love of Jodhaa - a love hidden deep below resentment and extreme prejudice. Jodhaa Akbar is their untold love story.",
    "languages": [
        "Hindi",
        "Urdu"
    ],
    "title": "Jodhaa Akbar",
    "kind": "movie",
    "directors": "Ashutosh Gowariker",
    "writers": [
        "Haidar Ali",
        "",
        "Haidar Ali",
        "Ashutosh Gowariker",
        "",
        "K.P. Saxena",
        "",
        "Rajshri Sudhakar"
    ],
    "producers": [
        "Lawrence D'Souza",
        "Ashutosh Gowariker",
        "Sunita Gowariker",
        "Siddharth Roy Kapur",
        "Ronnie Screwvala"
    ],
    "composers": "A.R. Rahman",
    "cinematographers": "Kiran Deohans",
    "editors": "Ballu Saluja",
    "editorial department": [
        "Dilip Deo",
        "Rohan Desai",
        "Ballu Saluja"
    ],
    "production designers": "Nitin Chandrakant Desai",
    "art directors": "Prashant Vichare",
    "costume designers": "Neeta Lulla",
    "make up department": [
        "Madhav Kadam",
        "Ramesh Mohanty",
        "Sanjay Mohanty"
    ],
    "production managers": [
        "Inder Singh Bariya",
        "Abul Syed 'Hassan' Ehsan",
        "S.A. Ehsan",
        "Ranjit Indori",
        "Datta Jamkhande",
        "Sudesh Nanu"
    ],
    "assistant directors": [
        "Suvahhdan Angre",
        "Rajkumar Bhagavant",
        "Puneet Khanna",
        "Karan Malhotra",
        "Ridhima Pandey",
        "Ekta Pathak Malhotra",
        "Prateek Sapra",
        "Gurmeet Singh",
        "Gurmmeet Singh",
        "Abhishek Varman"
    ],
    "art department": [
        "Kanchan Bandawane",
        "Hemant Bhatkar",
        "Sunil Gujar",
        "Ramakant Kanojia",
        "Sanjay Karole",
        "Mitali Mahajan",
        "Dhananjay Thorat",
        "Prashant Vichare"
    ],
    "sound department": [
        "Sayed Aslam",
        "Tarun Bhandari",
        "Vipin Bhati",
        "Ramesh Birajdar",
        "Debajit Changmai",
        "Sajjan Choudhary",
        "Royston D'Lima",
        "Abhijit Deo",
        "Hitendra Ghosh",
        "Stephen Gomes",
        "Yogesh Gurav",
        "Lochan Kanvinde",
        "Mohammed Irfan Khan",
        "Yadav Manoj",
        "Krishnanunni N.R.",
        "Kiran Nalwade",
        "Mohammad Iqbal Paratwada",
        "Kartik Sharma V",
        "Sudesh Sidhu",
        "Sreejesh"
    ],
    "special effects": "Pankaj Khandpur",
    "visual effects": [
        "Vishal Anand",
        "Abhilash Baby",
        "Vijay Bharadwaj",
        "Sameer Bhoyar",
        "Beneesh Bose",
        "Balasaheb Bothe",
        "Prince Chaurasia",
        "Das Chinmay",
        "Vinay Singh Chuphal",
        "Soumen Das",
        "Shaiju Ep",
        "Rahul Galwankar",
        "Ranjit Gosavi",
        "Bhaskar Joyoti Goswami",
        "Kaushik Goswami",
        "Aanand Jadhav",
        "T. Kannan",
        "Samapika Karmakar",
        "Suhel Khan",
        "Swapnil Khandagle",
        "Zarvan Kotwal",
        "N. Balamurali Krishna",
        "Dhananjay Kumar",
        "Pranab Lahkar",
        "Somasundaram Lakshmanan",
        "Ketan V. Mehta",
        "Payankulath Nandakumar",
        "Parag Patel",
        "Paresh Patil",
        "Murali Ramachari",
        "Kunal Rasal",
        "Shaikh Rizwan",
        "Shreedhar Sammohinivis",
        "Rohit Sardesai",
        "Vishwas Savanur",
        "Ravi Shekhar",
        "Sampat Shetty",
        "Bhanu Partap Singh",
        "Yatin Tamhane",
        "Abu Thahir",
        "Prashant Thakur",
        "Merchant Zahid"
    ],
    "stunts": [
        "Deepaksharmastunt",
        "Ravi Dewan"
    ],
    "camera department": [
        "Stephen Asirvatham",
        "Simon Bathula",
        "Navin Gadkari",
        "Mukund Gupta",
        "Titu Kumar Jena",
        "Aditya Kelgaonkar",
        "Fazal Khan",
        "Amiya Mahapatra",
        "Biswa Prakash Mishra",
        "B.V. Ravi Kiran",
        "Lalit Sahoo",
        "Arvind Singh",
        "C. Muthuraman"
    ],
    "animation department": [
        "Prashant Pawar",
        "Sandesh D. Pawar",
        "Rohit Pednekar",
        "Ajay Prakash"
    ],
    "casting department": "Shree Rammy Pandey",
    "costume departmen": "Prachi Sawant",
    "music department": [
        "Pallikonda Adrushta Deepak",
        "Javed Akhtar",
        "Javed Ali",
        "Mohammad Aslam",
        "Kazimir Boyle",
        "Bonnie Chakraborty",
        "Tony Joy",
        "Kashif",
        "T.R. Krishnachetan",
        "Madhushree",
        "Sonu Nigam",
        "A.R. Rahman",
        "Shadab Rayeen",
        "Bela Shende",
        "S. Sivakumar",
        "Rajshri Sudhakar"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Vishal Bajaj",
        "Sanjeev Bansal",
        "Kanishka Ingle",
        "Nusrat Jafri",
        "Girish Johar",
        "Nasreen Munni Kabir",
        "Shikha Kapur",
        "Raju Khan",
        "Alnoor Merchant",
        "Tanvi Modi",
        "Pranati Nagarsheth",
        "Jay Oza",
        "Chinni Prakash",
        "Rekha Prakash",
        "Archana Sadanand",
        "Mihir Shah",
        "Srikanth",
        "Vishal Tyagi"
    ],
    "thanks": [
        "Amitabh Bachchan",
        "Lahiru Jay",
        "Shatrughan Sinha"
    ],
    "akas": [
        "Jodhaa Akbar - Die Macht der Liebe (Germany)",
        "Джодха и Акбар (Russia)",
        "帝國玫瑰 (Taiwan)",
        "Iubirea printesei Jodhaa (Romania)",
        "Księżniczka i cesarz (Poland)"
    ],
    "writer": [
        "Haidar Ali",
        "Haidar Ali",
        "Ashutosh Gowariker"
    ],
    "director": "Ashutosh Gowariker",
    "production companies": [
        "Ashutosh Gowariker Productions",
        "UTV Motion Pictures"
    ],
    "distributors": [
        "Bharat Entertainment International",
        "Bodega Films",
        "Bharat Entertainment International"
    ],
    "other companies": "SonicFields",
    "plot": [
        "A sixteenth century love story about a marriage of alliance that gave birth to true love between a great Mughal emperor, Akbar, and a Rajput princess, Jodha.",
        "_Jodhaa Akbar_ (qv) is a sixteenth century love story about a marriage of alliance that gave birth to true love between a great Mughal Emperor, Akbar and a Rajput princess, Jodhaa. Politically, success knew no bounds for Emperor Akbar, After having secured the Hindu Kush, he furthered his realm by conquest until his empire extended from Afghanistan to the Bay of Bengal, and from the Himalayas to the Godhavari River. Through a shrewd blend of tolerance, generosity and force, Akbar won the allegiance of the Rajputs, the most belligerent Hindus. But little did Akbar know that when he married Jodhaa, a fiery Rajput princess, in order to further strengthen his relations with the Rajputs, he would in turn be embarking upon a new journey - the journey of true love. The daughter of King Bharmal of Amer, Jodhaa resented being reduced to a mere political pawn in this marriage of alliance, and Akbar's biggest challenge now did not merely lie in winning battles, but in winning the love of Jodhaa - a love hidden deep below resentment and extreme prejudice. _Jodhaa Akbar_ (qv) is their untold love story.::hEmRaJ (gavin_coolhgr@hotmail.com)",
        "Jodha daughter of Raja Bharmal from Amer is to be married to Raja Ratan Singh who will heritage the crown of her father after their marriage. her cousin Sujamal is upset over losing the throne and joins their rebels.When Mogul Emperor is about to attack Amer Raja Bharmal in order to make peace puts a proposal of Jodha to marry Akbar to which he agreed as it would bring strong alliance between Mughals and Rajput. In order to avoid marriage, Jodha proposes to Akbar that she won't change her religion and wants temple to be built for her.Akbar has no hesitation in this. After their marriage, Akbar's nanny conspires against Jodha when Sujamal comes to meet her in private. Jodha leaves his kingdom after Akbar doubts her character after the truth is out Akbar goes to take Jodha who tells him that first, he should have a change of relation in his kingdom.::alex.mjacko@gmail.com",
        "_Jodhaa Akbar_ (qv) is the story of the greatest Mughal emperor that ruled Hindustan (now India), Jalaluddin Mohammad Akbar, and the fiery young Rajput princess, Jodhaa. Set in the sixteenth century, this epic romance begins as a marriage of alliance between two cultures and religions, for political gain, with the Hindu King Bharmal of Amer giving his daughter's hand to a Muslim Emperor, Akbar. When Akbar accepts the marriage proposal, little does he know that in his efforts to strengthen his relations with the Rajputs, he would in turn be embarking on a new journey - the journey of true love. From the battlefield where the young Jalaluddin was crowned, through the conquests that won him the title of Akbar the Great ('Akbar' in Arabic means great), to winning the love of the beautiful Jodhaa, _Jodhaa Akbar_ (qv) traces the impressive graph of the mighty emperor and his romance with the defiant princess.::AGPPL",
        "Afer the Raja of Amer passes away, his brother, Veer Bharmal, crowns himself king, and looks after his nephew, Sujamal. After he and his wife, Padmavati, give birth to a girl, Jodhaa, they arrange her marriage with Ajabgarh's Rajkumar Rattan Singh. Years later, Veer decides to hand over Amer's reigns to Bhagwandas, instead of Sujamal, resulting in the later approaching Shahenshah Jalaluddin's brother-in-law, Sharifuddin Hussain for assistance. Fearing an attack on his kingdom, Veer approaches the Shahenshah himself, pledges alliance to him, and even offers his daughter's hand in marriage. Jalaluddin, whose life was always controlled by others, decides to marry a rather reluctant Jodhaa, who agrees to marry him on two conditions: that she will retain her Hindu Dharam, and will worship Bhagwan Shri Kishan in the Mughal palace, which he accepts. The marriage takes place, and Jodhaa places yet another condition on him: that she will only get intimate with him after she is ready, which he also accepts. Then Jalaluddin's faith in Jodhaa is shattered when he learns that she has been meeting secretly with a male unknown to him; while Sujamal gets ready to attack Amer; disgruntled and oppressed Hindus, who are forced to pay a toll to their Mughal rulers for their Tirath Yatra, lose hope and faith; while his very own brother-in-law prepares to assassinate him and become the next Shahenshah of Hindustan.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Jodhaa Akbar is a sixteenth century love story about a marriage of alliance that gave birth to true love between a great Mughal emperor, Akbar, and a Rajput princess, Jodhaa. Political success knew no bounds for Emperor Akbar (Hrithik Roshan). After having secured the Hindu Kush, he furthered his realm by conquest until his empire extended from Afghanistan to the Bay of Bengal, and from the Himalayas to the Godavari River. Through a shrewd blend of tolerance, generosity, and force, Akbar won the allegiance of the Rajputs, the most belligerent Hindus. But little did Akbar know that when he married Jodhaa (Aishwarya), a fiery Rajput princess, in order to further strengthen his relations with the Rajputs, he would in turn be embarking upon a new journey the journey of true love.The daughter of King Bharmal of Amer, Jodhaa resented being reduced to a mere political pawn in this marriage of alliance, and Akbars biggest challenge now did not merely lie in winning battles, but in winning the love of Jodhaa a love hidden deep below resentment and extreme prejudice. Jodhaa-Akbar is their untold love story."
}