{
    "id": "0479651",
    "localized title": "Dasavatharam",
    "cast": [
        "Kamal Haasan",
        "Asin Thottumkal",
        "Jaya Prada",
        "Mallika Sherawat",
        "Napolean",
        "P. Vasu",
        "Nagesh",
        "K.R. Vijaya",
        "M.S. Bhaskar",
        "Santhana Bharathi",
        "Akash",
        "R. Sundarajan",
        "Chakri Toleti",
        "Ramesh Khanna",
        "Chitti Babu",
        "Srihari",
        "Chara",
        "Rekha",
        "Vaiyapuri",
        "Kantharaj Kasthuri",
        "S.V.S. Kumar",
        "Radha Mehta",
        "Raghuram",
        "Rajesh",
        "Ken Baranda",
        "Chris Cavallaro",
        "Dustin Dyson",
        "Richard Andrew Evans",
        "Brian Jennings",
        "Kylie Koscoe",
        "Nathena Lewis",
        "Randy Molnar",
        "Tony Morales",
        "Michael Mosher",
        "Tom Myers",
        "Randy Robinson",
        "David W. Scott",
        "Steven Shaver",
        "Jason Tripp",
        "Brewier Welch"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Sci-Fi",
        "Thriller"
    ],
    "runtimes": "188",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "Canada:13+::(Quebec)",
        "India:U",
        "New Zealand:M",
        "Singapore:NC16",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "13 Jun 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTIwYWFlYjItMWM4Yy00ZjlmLWIyODQtYmFmMTYyZTc3MjRkXkEyXkFqcGdeQXVyODEzOTQwNTY@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0479651",
    "plot outline": "U.S.-based Bio-technologist, Govind K. Somaiyya, narrates from a stadium a tale of religious conflict in India - even before the appearance of Jesus and Allah. This conflict was between worshipers of Bhagwan Shri Shiv and Bhagwan Shri Vishnu - with devotees of the latter being put to death. Now in post-9/11 era President George W. Bush invests heavily in biological research but things get out of control when a vial containing a deadly chemical is inadvertently dispatched via courier to Tamil Nadu, India. In order to retrieve it, Govind must face heavy odds, including a deadly CIA Agent, Chris Fletcher; a killer named Jasmine; RAW Officer Pranab Kundu, as well as a martial-arts artist from Tokyo.",
    "languages": "Tamil",
    "title": "Dasavatharam",
    "kind": "movie",
    "directors": "K.S. Ravikumar",
    "writers": [
        "Kamal Haasan",
        "",
        "Kamal Haasan",
        "",
        "Madhiyalagan Subbiah",
        "",
        "Atul Tiwari"
    ],
    "producers": [
        "D. Ramesh Babu",
        "Viswanathan Ravichandran"
    ],
    "composers": "Himesh Reshammiya",
    "cinematographers": "Ravi Varman",
    "editors": [
        "Ashmith Kunder",
        "K. Thanigachalam"
    ],
    "editorial department": [
        "Rohan Desai",
        "Karthik",
        "Rajasekaran.Ks"
    ],
    "casting directors": "Jessica Lewis",
    "art directors": [
        "Samir Chanda",
        "M. Prabhaharan",
        "Thotta Tharani",
        "Nitin Wable"
    ],
    "costume designers": "Gautami",
    "make up department": [
        "Pravin Banker",
        "Ralis Kahn",
        "Michael Mosher",
        "Michael Westmore"
    ],
    "production managers": "Jamie Smith",
    "art department": [
        "Dan Buckley",
        "Choudhari Nilesh",
        "Anuradha Genrich"
    ],
    "special effects": [
        "Andrew Scott Dixon",
        "Senthilkumar"
    ],
    "visual effects": [
        "Kauser Ahmed",
        "Alagumuthu",
        "Riyas Akbar Ali",
        "Rajmohan Anthony",
        "Bejoy Arputharaj",
        "Veerayuth Au",
        "Jatuporn Suriyakul ' Jay' Na Ayudhya",
        "Mythili Babu",
        "Rv Balaji",
        "Sathienpong Beaver",
        "Bimal Bose",
        "Brynley Cadman",
        "Ashok Kumar Chandrakumar",
        "Anoop Chandran",
        "Barish Chandran",
        "Rupesh Chetri",
        "Ivan DeWolf",
        "Gorragoat Downroung",
        "Chutiwat Eiem-sum-ang",
        "Chow Emrich",
        "Kaywood Foos",
        "Ganesh Shankar G",
        "Srinivasan Gopal",
        "Lakshmipathy Gopalakrishnan",
        "Ramu Gopalakrishnan",
        "Sakthivel Ilangovan",
        "Dharmendra Jayaraman",
        "Brian Jennings",
        "Tawat Joe",
        "Josephnixon",
        "Rajesh Kumar K.V.",
        "Rekha Kalra",
        "Raphael Karikalan",
        "Ramesh Karthikeyan",
        "Aslam Khader Hayath",
        "Rajasekar Kn",
        "Ashok Kumar Kodavaali",
        "Thirumurugan Krishnan",
        "Chandran Lakshmanan",
        "Prakash Maharajan",
        "Alagarsamy Mayan",
        "Sidharth Meer",
        "Eugenius Meril",
        "Mishari Muqbil",
        "Vijayakumar Murugan",
        "Vijayakrishna Murugesan",
        "Abhilash Nanda",
        "Nandhakishore",
        "Murugavel Palani",
        "Anupan Pengpetch",
        "Manikanda Perumal",
        "Perungappian",
        "Nes Pinsuwan",
        "Rajasekar Prince",
        "Srinivasan Punniyakrishnan",
        "Purushothaman",
        "Iyyanar Radhakrishnan",
        "Raghavan",
        "Singara Raj",
        "Raju",
        "Thulasi Ram",
        "Karthic Ramesh",
        "Satheesh Rangasamy",
        "Gopinath Rathinasamy",
        "Kanoksin Rattanamarn",
        "Sven Rauhe",
        "Kesavan S.",
        "Sajeev Sadanandan",
        "Sakthidharan",
        "Saravanan Sala",
        "Mohan Sangeeth",
        "Stalin Saravanan",
        "Tilak Saravanan",
        "Yuvaraj Saravanan",
        "Sajith Sethumadhavan",
        "Andrew Shibi",
        "Sridharan",
        "Narasimhan Srinivasan",
        "Mohinder Subramaniam",
        "Jithin Syam",
        "Krissachai Tanlongkachon",
        "Theajodharan",
        "Sathishkumar Vadivelu",
        "Anu Velayudhan",
        "Palani Venkatachalam",
        "Udayaraj Venugopal",
        "Raja Vijayaraman",
        "Chainarong Wanachaisong",
        "Owen E. Williams",
        "Piyaphan Yutisri"
    ],
    "stunts": [
        "Amrin Abubakker",
        "Grady Allen Bishop",
        "Gail Bowen",
        "David Anthony Buglione",
        "Amy Tomberlin Cheek",
        "James Cheek",
        "Andrew Scott Dixon",
        "Kanal Kannan",
        "Joop Katana",
        "Antony Matos",
        "Niko Nedyalkov",
        "Cord Newman",
        "Trent Staten"
    ],
    "camera department": [
        "Anbusathiyanr",
        "Bhaskar",
        "Edward Ryan Funk",
        "Kangasabai",
        "Jeganatha Reddy",
        "Carlos Velasquez"
    ],
    "location management": "Randy Molnar",
    "music department": [
        "Kamal Haasan",
        "Hariharan",
        "Mahalakshmi Iyer",
        "Devi Sri Prasad",
        "Sadhana Sargam",
        "Aamir Shaikh",
        "Shalini Singh",
        "Vaali",
        "Vairamuthu",
        "Vinit"
    ],
    "miscellaneous": "Joshua Martin",
    "thanks": [
        "Idbi Bank",
        "Parithi Ilamvazhuthi",
        "Southern Railways India",
        "Jayalalitha J",
        "M. Veera Shekar"
    ],
    "akas": [
        "Dashavatar (India, Hindi title)",
        "Dashavtar (India, Hindi title)",
        "Dasavathaaram (India, Tamil title)",
        "Dhasavatharam (India, Tamil title)",
        "The Ten Avatars (World-wide, English title)"
    ],
    "writer": [
        "Kamal Haasan",
        "Kamal Haasan",
        "Madhiyalagan Subbiah"
    ],
    "director": "K.S. Ravikumar",
    "production companies": "Aascar Film P.",
    "distributors": [
        "Aascar Film P.",
        "Ayngaran International",
        "Narmada Pictures",
        "Walt Disney Pictures",
        "Ayngaran Video",
        "Kalaignar Tv"
    ],
    "special effects companies": [
        "Oysterr",
        "Prime Focus",
        "SatyamBPO"
    ],
    "other companies": [
        "BINC BKK VFX",
        "Sony BMG"
    ],
    "plot": [
        "After realizing the danger of a bio-weapon, a scientist wants to protect it from being misused. The vial accidentally reaches India, and he must race against time to prevent a potential disaster.",
        "U.S.-based Bio-technologist, Govind K. Somaiyya, narrates from a stadium a tale of religious conflict in India - even before the appearance of Jesus and Allah. This conflict was between worshipers of Bhagwan Shri Shiv and Bhagwan Shri Vishnu - with devotees of the latter being put to death. Now in post-9/11 era President George W. Bush invests heavily in biological research but things get out of control when a vial containing a deadly chemical is inadvertently dispatched via courier to Tamil Nadu, India. In order to retrieve it, Govind must face heavy odds, including a deadly CIA Agent, Chris Fletcher; a killer named Jasmine; RAW Officer Pranab Kundu, as well as a martial-arts artist from Tokyo.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "In the South Indian town of Chidambaram during the 12th century, the cruel emperor Kulothunga Chola the 2nd is a worshiper of the deity Shiva and persecutes followers of the deity Vishnu. His men prepare to destroy a large idol of Vishnu but are stopped by his childhood friend, the priest Rangarajan Nambi. He offers to spare Nambi for his interference if he adheres to Shiva's command, but Nambi refuses and is ordered to be executed. After hooking, chaining, stoning, and flogging him Chola restrains him to the idol and drowns him in the middle of the ocean.Centuries later, in December 2004 we are introduced to bio-scientist Govindarajan Ramaswamy(alias Govind) whose team is preparing a powerful viral bioweapon under sponsership of the American government by President Bush himself. However, the lab's monkey Hanu mistakes the prototype virus container for chocolate and eats it when he breaks out of his cage. Govind and his colleagues watch helplessly as he suffers a seizure and the virus spreads in the lab. Govind seals the room and the fail safe floods the room with a salt solution to sterilize the virus. A heartbroken Govind refuses to cell the virus at a governmental council to prevent any misusage and destruction, much disappointment from his boss Dr. Sethu. Sethu tries to convince him otherwise but Govind still refuses, leading him to becoming suspicious. Govind calls his colleague Suresh and asks to stay over at his place with him and his wife Yuki, who happens to be a martial arts student under her brother Shingan Narahazi. Govind stays behind after closing hours and catches Sethu making a deal with a buyer named Mr. Q from a terrorist organization. Govind steals the virus vial and makes a run for it, pursued by security guards as well as Q and Sethu.He escapes and makes it to Suresh's apartment to inform him of Sethu's betrayal. When states that the virus has to be in stable temperature and puts it in the fridge. While Govind talks to Yuki, Suresh is called by Sethu and told to distract him till his man can retrieve the vial. Govind hears to conversation and is disgusted that his own friend would betray him as well for money. Before they can argue a helicopter flies to the apartment windows and is broken into by mercenary and former CIA agent Christian Fletcher. Govind takes the vial and escapes from the bathroom window ledge while Fletcher kills Suresh. Yuki fights him but Fletcher cuts her throat. He tosses a grenade to destroy the apartment and pursues Govind. Govind meets up with his friend Sairam(alias Ram) and despite his confusion in the event, he helps Govind escape. He stops by at a post office to deliver packages to India, but he accidentally switches one of his packages with Govind's vial. Govind steals Ram's car and heads to the airport, leaving Ram behind angry. Fletcher confronts Ram and takes him hostage.Govind tries to inform the airport staff but he's forced to depart when Fletcher catches up. He falls off a ledge into a freight container and knocks himself out. He's stowed away in the cargo plane and transported to India. Fletcher murders Ram and is introduced to an assassin named Jasmine, a friend of Q. He recruits Jasmine, who kills Sethu under Fletcher's orders and marries him. President Bush is informed of Fletcher's activities and believes Govind is working with him. He sends word to Manmohan Singh about the virus. Balram Naidu, a member of the Research and Analysis Wing interrogates Govind, who was caught in the plane and arrested. He gives Govind a hard time and completely refuses to listen to anything he has to say. Naidu leaves when his right hand man Appa Rao informs him of two FBI agents visiting to look for Fletcher. Police inspector Bharat informs the guards in Govind's room that a visitor for Naidu, who turns out to be Fletcher. Fletcher, accompanied by Jasmine kill the guards and disarm Bharat. Govind tells them about the mixed up delivery so Fletcher and Jasmine escort Bharat and Govind out of the airport at gunpoint, where the famous singer Avatar Singh arrives. Avatar suffers from throat cancer and begins to throw up blood and the group escapes when police are distracted.When the group makes it to the highway, they contact Q who sends an escort named Kumar. Bharat attempts to attack Fletcher, causing an acccident. Bharat is injured and Govind makes it clear that he won't tell them where the vial is unless they give Bharat help. They come across a lorry driver who takes Bharat to the hospital. Bharat cuffs Jasmine to the truck as they leave, giving Govind time to escape when Fletcher sets her free. Govind escapes and heads to Chidambaram, where the vial has been delivered to an elderly lady Krishnaveni. Her granddaughter Andal invites Govind in as Krishnaveni grieves the loss of her long deceased son Aravudan, whom she believes is still alive. Govind is unsuccessful in convincing Krishnaveni into giving up the vial. Krishnaveni walks outside to the temple parade and puts the vial inside a small opening of the golden Vishnu idol. Fletcher, Jasmine, and Kumar arrive(after killing Naidu's lookout Ekambharam) simultaneously with Naidu and Appa Rao, who have traced Fletcher after he stole a delivery list and destroy the department it came from. Naidu demands Govind to surrender himself, before anything can be done Fletcher shoots at a temple elephant that goes on a rampage. Govind grabs the idol and fights Jasmine, with a heavily spiritual believer in god like Andal trying to take it for herself when Govind shows it disrespect. Jasmine is grabbed by the elephant and impaled in a roof structure. Fletcher mercy shoots her and chases Govind and Andal who have escaped using a fruit cart. Govind and a terrified Andal escape by train and land near the ruins of Chola's kingdom where Nambi's wife commited suicide after her husband's execution.Govind and Andal continue fighting over the idol but they agree to work together after they encounter Jaara and a gang of illegal sand miners attempt to assault them. When Andal plees for help they're interrupted by activist Vincent Poovarangan who argues about the sacred ruins and their history. Govind and Andal escape in one of Jaara's lorries and have another arguement about where to take the idol, leading to another accident with a Muslim family traveling in a van. Kumar and Fletcher intercept Jaara and learn of Govind's whereabouts. Govind and Andal meet Khalafula, the eldest son of the family who has gigantism. They have a run in with Fletcher and Kumar but the family spares them but Govind fails to catch Naidu's attention. His mother faints from the accident so they make way to a hospital where Govind offers to donate blood. He also finds a cooler to store the idol in. Govind and Andal keep their task a secret from Khalafula. Avatar is a patient and is informed that he can cure his cancer with surgery but never be able to sing again. He decides not to have the surgery and live his last moments with his passion. When Avatar leaves, Govind switches the idol for the medicine Avatar is provided. Andal has not been properly acquainted with Fletcher and meets him, but she and Khalafula are taken hostage. Govind brings Avatar's cooler to Khalafula's family's house but it turns out to be a trap as Govind drew Naidu to him. Narahazi accompanies Naidu on the mission beliving Govind killed his sister.Fletcher and Kumar escort Govind, Andal, and Khalafula's brother Salim out at gunpoint so Khalafula distracts the police. When Naidu discovers this he accuses Khalafula of being a terrorist simply for his Islamic background. Khalafula explains their family's contribution to their village as their father funded construction of a huge mosque. Naidu is convinced that the entire village needs to be questioned and has them all move to the mosque for interrogation. Govind, Andal, and Salim are taken to Avatar's concert where he sings one last time upon realizing his medicine was swapped, thinking it's a sign from god. Govind trades him the medicine but Fletcher attacks them. He shoots Avatar and his wife pushes him out the window. Fletcher chases Govind and Andal but the two escape and Avatar is sent to a hospital.The next day, Bush is told by Dr. Singh about neutrilizing the virus with NaCl. Govind and Andal make way to the coast after acquiring the virus from the idol. Narahazi arrives and helps Govind fight Fletcher. Fletcher is defeated but he consumes the virus, which begins to spread. At that moment a tsunami rises from the sea and destroys the town as well as the virus. Pooverangan, who is in conflict with Jaara and the miners sacrafices himself to save their children and dies. In the aftermath of the tsunami, Avatar recovers in the hospital and has his cancer cured by the bullet wound, and that he can sing once again. Andal believes it's an act of god to save humanity from the virus while Govind is unconvinced. He still believes an overseeing god would be nice to believe in and falls for Andal.Years later they are married and tell the story in front of a crowd pondering the existence of the almighty guiding our day to day lives. The main characters party in the aftermath of the tale."
}