{
    "id": "1039995",
    "localized title": "U Me Aur Hum",
    "cast": [
        "Ajay Devgn",
        "Kajol",
        "Sumeet Raghavan",
        "Divya Dutta",
        "Isha Sharvani",
        "Karan Khanna",
        "Aditya Rajput",
        "Anita Wahi",
        "Hazel Croney",
        "Aumckar",
        "Shyam Adhatrao",
        "Ramu Bashyal",
        "Adhir Bhat",
        "Robin Bhatt",
        "Richa Bhattacharya",
        "Mrunal Despande",
        "Vishesh Didwani",
        "R.N. Jagtap",
        "Sachin Khedekar",
        "Meghna Kulkarni",
        "Pramatesh Mehta",
        "Milind Pathak",
        "Suhas Sawarkar",
        "Sarika Thakur",
        "D.A. Virkar"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "156",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Ireland:12A",
        "New Zealand:M",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "11 Apr 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWU4N2ZiMDEtNWJlOS00YzA3LWI3MDEtNjFjNDQwZWNiNDI3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1039995",
    "plot outline": "The first time Ajay saw Pia, she served him drinks. She affected him more than the alcohol, and he found true love. He was a leading psychiatrist, but she messed up his mind. The first time Pia saw Ajay, he had too much to drink. She watched him make a fool of himself, and was relieved when he passed out. She was a woman who followed her heart, but despite his claims of true love, she had made up her mind. Thus began the story of Ajay and Pia. A love story, that begins at sea. Ajay and Pia develop a strong and special bond. In each other, they find an anchor. They rush into marriage, despite the advice and failing relationships of their friends. But no marriages can be complete without problems, and Ajay and Pia have also have to face hurdles, some of which seem insurmountable.",
    "languages": "Hindi",
    "title": "U Me Aur Hum",
    "kind": "movie",
    "directors": "Ajay Devgn",
    "writers": [
        "Robin Bhatt",
        "",
        "Ajay Devgn",
        "",
        "Ashwani Dhir",
        "",
        "Sutanu Gupta",
        "",
        "Akarsh Khurana"
    ],
    "producers": [
        "Ashwani Chopra",
        "Ajay Devgn",
        "Kumar Mangat Pathak",
        "Vikrant Sharma"
    ],
    "composers": "Vishal Bhardwaj",
    "cinematographers": "Aseem Bajaj",
    "editors": "Dharmendra Sharma",
    "editorial department": [
        "Paul A. Byrne",
        "Shakti Hasija",
        "S.N.V. Ramana",
        "Vijay Sethia",
        "Joginder Singh Varna",
        "Jespal Nadar"
    ],
    "production designers": "Samir Chanda",
    "costume designers": [
        "Anil Cherian",
        "Manish Malhotra",
        "Anna Singh"
    ],
    "production managers": [
        "Manoj Chouhan",
        "Mangesh Daphale",
        "Sanjay Inamdar"
    ],
    "assistant directors": [
        "Aumckar",
        "Raju Kafley",
        "Vijayeta Kumar",
        "Fazal Mehmood",
        "Dharmendra Sharma",
        "Iesh Thapar",
        "Harish Wadhone"
    ],
    "art department": [
        "Manish Baba",
        "Choudhari Nilesh"
    ],
    "sound department": [
        "Sajjan Choudhary",
        "Leslie Fernandes",
        "Vijay Kumar",
        "Koteswara Rao S.V.",
        "Karnail Singh"
    ],
    "special effects": "Agnelo D'Souza",
    "visual effects": [
        "Abhijith",
        "Shruti Banta",
        "Sudeepto Bose",
        "Ritu Chaurasia",
        "Jayesh Chavan",
        "Sarang Deshpande",
        "Chetan Gaur",
        "Himanshu Gohil",
        "Manoj Gohil",
        "Indraneel Guha",
        "Avinash Gupta",
        "Ilamuruguselvan",
        "Pankaj Kalbende",
        "Tushar Kewlani",
        "Shashi Kiran",
        "Anup Kumar",
        "Kumaran",
        "Vinod Mannem",
        "Arun Mendon",
        "Sunil Mohapatra",
        "Ranen Nongmaithem",
        "Kunjan Oza",
        "Pavan",
        "Uppu Pavanrajesh",
        "Ranadheer Reddy",
        "Abhinav Sah",
        "Subhasish Saha",
        "Dange Sangram",
        "Sayantan Sanyal",
        "Nirakar Sethy",
        "Anuj Sharma",
        "Naveen Shukla",
        "Ashwin Singh",
        "Gaurvendra Singh",
        "Dinesh Solanki",
        "C. Soumyadip",
        "Balakrishna P. Subaiah",
        "Viral Thakkar",
        "Ashok Uchil",
        "Shivaji Waikhom"
    ],
    "stunts": "Jai Singh",
    "camera department": [
        "Shahnawaz Alam",
        "Rajeev Ranjan Bhardwaj",
        "Asit Biswas",
        "Navin Gadkari",
        "Nath Gupta",
        "Anant Kathe",
        "Ahmed Khan",
        "Shakeel Khan",
        "B. Durga Kishore Kumar",
        "Anirudh Nakhare",
        "Prashant Pednekar",
        "Mahendra Samanta",
        "B.K. Sivan",
        "Shakeel 'Tiger' Sultan Beg",
        "Clive Teare",
        "Anshumaan Singh Thakur",
        "Jitendra Tripathi"
    ],
    "music department": [
        "Vishal Bhardwaj",
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Adnan Sami"
    ],
    "miscellaneous": [
        "Nazar Abbas",
        "Vinod Bhalla",
        "Yashika Dhillon",
        "Shohini Dutta",
        "Vikas Kadam",
        "Ashley Lobo",
        "Salim Merchant",
        "Dharmendra Sharma"
    ],
    "akas": [
        "U, Me Aur Hum - Für immer wir (Germany)",
        "Ты, я и мы (Russia)"
    ],
    "writer": [
        "Robin Bhatt",
        "Ajay Devgn",
        "Ashwani Dhir"
    ],
    "director": "Ajay Devgn",
    "production companies": "Devgan Films",
    "distributors": "Eros Worldwide",
    "other companies": "Pixion",
    "plot": [
        "Ajay's life turns upside down when he learns that his wife Piya has Alzheimer and he has no option, but to leave his wife in a mental hospital.",
        "The first time Ajay saw Pia, she served him drinks. She affected him more than the alcohol, and he found true love. He was a leading psychiatrist, but she messed up his mind. The first time Pia saw Ajay, he had too much to drink. She watched him make a fool of himself, and was relieved when he passed out. She was a woman who followed her heart, but despite his claims of true love, she had made up her mind. Thus began the story of Ajay and Pia. A love story, that begins at sea. Ajay and Pia develop a strong and special bond. In each other, they find an anchor. They rush into marriage, despite the advice and failing relationships of their friends. But no marriages can be complete without problems, and Ajay and Pia have also have to face hurdles, some of which seem insurmountable.::Ajay Devgan",
        "Mumbai-based Dr. Ajay Mehra fools New Jersey-based Piya into believing that they have a lot in common on board a cruise, but eventually relents and confesses. After the cruise, he and Piya connect, and decide to get married. They soon settle down to a fairly harmonious lifestyle, and soon Piya becomes pregnant. Their happiness is shattered when Piya is diagnosed with Alzheimer's disease, and soon both will be presented with a choice - go ahead with the pregnancy and subsequent birth - or endanger Piya's life.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "A film by Ajay Devgan\"Oh, how we danced on the night we were wed\nWe vowed our true love though a word wasn't said\nThe world was in bloom, there were stars in the skies\nExcept for the few that were there in your eyes.\nThe night seemed to fade into blossoming dawn\nThe sun shone anew but the dance lingered on\nCould we but relive that sweet moment sublime\nWe'd find that our love is unaltered by time.\"-\tlyrics to \"The Anniversary Waltz,\" composed by Dublin/FranklThe first time Ajay saw Pia, she served him drinks. She affected him more than the alcohol, and he found true love. He was a leading psychiatrist, but she messed up his mind.The first time Pia saw Ajay, he had too much to drink. She watched him make a fool of himself, and was relieved when he passed out. She was a woman who followed her heart, but despite his claims of true love, she had made up her mind.Thus began the story of Ajay and Pia.A love story, that begins at sea. Ajay is on a cruise with his friends Nikhil and Reena, unhappily married, and Vicky and Natasha, happily unmarried. Ajay is having a wonderful time dealing with martial strife, lots of bad language and huge hangovers, when he finds Pia, and time stands still.After a disastrous first meeting, Ajay tries everything to woo her. He wants her, by hook, crook or even her little private notebook. She's not an easy catch at all, but finally, by sheer perseverance, he dances his way into her heart.Ajay and Pia develop a strong and special bond. In each other, they find an anchor. But the tide goes against them. Weighted down by lies and deceit, their boat is rocked, and their relationship drowns.But even oceans cannot keep true love apart. Against better sense, Ajay waits for Pia. In Pia's case, better case prevails, and she comes back to him. With no doubt in their minds about the way they feel for each other, they rush into marriage, despite the advice and failing relationships of their friends.Happy marriages begin when we marry the ones we love, and they blossom when we love the ones we marry. And Ajay Pia, love each other dearly, and their marriage flourishes, setting an example for their friends.But no marriages can be complete without problems, and Ajay and Pia have also have to face hurdles, some of which seem insurmountable. We are taught in school how to do sums, how to read and write, and how to conduct scientific experiments, but what do we really know about the greatest social experiment of all, namely our ability to keep the love alive in our marriage, especially in the face of crises?But even as things get much worse, and sometimes unsolvable, Ajay and Pia don't give up. They realize that marriage is not a ritual or an end. It is a long, intricate, intimate dance together and nothing matters more than your own sense of balance and your choice of partner. And Ajay and Pia are used to dancing together.So they battle all odds, and dance, and sometimes they fall. But every time they fall, they fall in love. And that's what a successful marriage requires. Falling in love many times, always with the same person.This is the special love story of Ajay and Pia. There may be no monuments dedicated to them and perhaps their names will soon be forgotten. But in one respect they succeed as gloriously as anyone who's ever lived: They've loved each other with all their heart and soul; and in life and marriage, this has always been enough."
}