{
    "id": "1241195",
    "localized title": "Aamir",
    "cast": [
        "Rajeev Khandelwal",
        "Aishwarya",
        "Vasan Bala",
        "Chinkal",
        "Rohitash Gaud",
        "Shashanka Ghosh",
        "Jhilmil Hazrika",
        "Junaid",
        "Amar Kaushik",
        "Abhas Khan",
        "Allauddin Khan",
        "Prasoon Narayan",
        "Gajraj Rao",
        "Uday Sabnis",
        "Sneha",
        "Jaywant Wadkar",
        "Rajeev Yadav"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "99",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "Singapore:M18",
        "United Kingdom:12",
        "United States:Not Rated"
    ],
    "original air date": "06 Jun 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGE3MzQ4YzYtNjU4My00ZjYxLTg2ZmYtMTg5OTU0N2QwYTc0XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1241195",
    "plot outline": "Aamir Ali lives a middle-classed lifestyle in Mumbai along with his dad, Rashid; mom, Taranum; three sisters: Nargis, Shabana, and Falak; and a brother, Jameel. After his dad passes away, Aamir re-locates to Britain, studies, obtains a medical degree, and returns home. Upon arrival at Mumbai Airport, he is hassled by the Customs Officer and his baggage is searched several times. Finally, he is permitted to leave. Outside the airport he is approached by two men on a motorbike, and one of them hands him a cellphone. Aamir accepts the cellphone and thus begins his nightmare that will propel him all the way to Dongri, then to Bhendi Bazar, where he will be given a red suitcase containing cash. He will be told that he must deliver this suitcase at another location within a specified time or else his family will all be killed. Aamir agrees to do so but before he could even arrive at the location, the suitcase gets stolen. The question remains: will Aamir be able to locate it and deliver it within the stipulated time?",
    "languages": "Hindi",
    "title": "Aamir",
    "kind": "movie",
    "directors": "Raj Kumar Gupta",
    "writers": "Raj Kumar Gupta",
    "producers": [
        "Supavitra Babul",
        "Vikas Bahl",
        "Ashwani Chopra",
        "Maitreyee Dasgupta",
        "Siddharth Roy Kapur",
        "Anurag Kashyap",
        "Rohit Khaitan",
        "Deven Khote",
        "Zarina Mehta",
        "Ram Mirchandani",
        "Alpana Mishra",
        "Rucha Pathak",
        "Ronnie Screwvala"
    ],
    "composers": "Amit Trivedi",
    "cinematographers": "Alphonse Roy",
    "editors": "Aarti Bajaj",
    "editorial department": [
        "Rohan Desai",
        "Ranendu Ranjan"
    ],
    "casting directors": "Gautam Kishanchandani",
    "production designers": "Wasiq Khan",
    "art directors": "Dipankar Mondal",
    "costume designers": "Shubhra Gupta",
    "production managers": [
        "Yogesh Yashwant Chavan",
        "Shrishti Gupta",
        "Sanket Kunde",
        "Sameer Mahabale",
        "Nagesh Pujari"
    ],
    "assistant directors": [
        "Anmol Ahuja",
        "Nitin Chainpuri",
        "Neel Guha",
        "Anurag Kashyap",
        "Amar Kaushik",
        "Ajay Singh"
    ],
    "art department": [
        "Sunil Gujar",
        "Ramakant Kanojia"
    ],
    "sound department": [
        "Shantanu Akerkar",
        "Zahir Bandukwala",
        "Alok De",
        "Faisal Majeed",
        "Santosh Sahoo"
    ],
    "camera department": [
        "Debal Banerjee",
        "Archana Borhade",
        "Soumyajit Nandy",
        "Pranav Raval",
        "Arjun Venkatesh"
    ],
    "music department": [
        "Amitabh",
        "Amitabh Bhattacharya",
        "Murtuza Khan",
        "Qadir Khan",
        "Ashish Manchanda",
        "Murtuza-Qadir",
        "Neuman Pinto",
        "Shilpa Rao",
        "Amit Trivedi"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Sanjeev Bansal",
        "Alnoor Merchant",
        "Tanvi Modi",
        "Prakash Nathan"
    ],
    "thanks": "Ritesh Shah",
    "akas": "Амир (Russia)",
    "writer": "Raj Kumar Gupta",
    "director": "Raj Kumar Gupta",
    "production companies": "UTV Spotboy Motion Pictures",
    "other companies": "Spice PR",
    "plot": [
        "A doctor of Indian origin returning to Mumbai from London is forced to participate in a terrorist plot.",
        "_Aamir_ (qv) Ali lives a middle-classed lifestyle in Mumbai along with his dad, Rashid; mom, Taranum; three sisters: Nargis, Shabana, and Falak; and a brother, Jameel. After his dad passes away, _Aamir_ (qv) re-locates to Britain, studies, obtains a medical degree, and returns home. Upon arrival at Mumbai Airport, he is hassled by the Customs Officer and his baggage is searched several times. Finally, he is permitted to leave. Outside the airport he is approached by two men on a motorbike, and one of them hands him a cellphone. _Aamir_ (qv) accepts the cellphone and thus begins his nightmare that will propel him all the way to Dongri, then to Bhendi Bazar, where he will be given a red suitcase containing cash. He will be told that he must deliver this suitcase at another location within a specified time or else his family will all be killed. _Aamir_ (qv) agrees to do so but before he could even arrive at the location, the suitcase gets stolen. The question remains: will _Aamir_ (qv) be able to locate it and deliver it within the stipulated time?::rAjOo (gunwanti@hotmail.com)",
        "_Aamir_ (qv) is a perfect movie depicting the story of _Aamir_ (qv) who currently arrives in India after spending three years in London, studying medicine. He is made to dance with the help of various hints laid down by terrorists with the help of a mobile phone via which terrorist communicate. He cannot contact police or other officials, as his family is taken control of by terrorists. Unfortunately he is made to deliver a red suitcase. Later it is confirmed to him, to place the bag in the bus he is traveling. It is also confirmed to him that bag carries bomb which will explode in 3 minutes. He with a lot of complex mind and in lot of turbulence carries the bag towards a road construction site away from people and gets killed himself but saving others.::muvi-fan-73",
        "London based doctor _Aamir_ (qv) Ali comes for vacation in Mumbai upon his arrival he is handed over a phone at the airport and asked to follow instructions of mysterious caller._Aamir_ (qv) at first refuses but sees a video on the phone that his family is held hostage and agrees to follow instructions of the caller.The caller asks _Aamir_ (qv) to do something for his religion rather then working and living in another country._Aamir_ (qv) receives a briefcase as per instructions of the caller then on his life will go for toss.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Dr Aamir Ali (Rajeev Khandelwal) a London based NRI is returning to India. On his arrival at Mumbai airport, he finds that he is not being attended by his family but by Trouble.. The trouble comes in the form of a mobile phone he is forced to accept by two unknown bikers. After a series of forced conversations with an unknown face, he comes to know that his family is in captivity of the callers and he has been the \"chosen one\" by the fundamentalists to plant a bomb in a bus. He has five hours to save his family. Aamir (the name means \"Commander\") is reduced to be a puppet in the hands of terrorists.. Next five hours, minute after minute, instructions after instructions, Aamir comes to terms with life and signifies the meaning of \"Aamir\""
}