{
    "id": "13569918",
    "localized title": "Azhagu Nilayam",
    "cast": [
        "Riyaz Khan",
        "Swarnamalya",
        "Vindhya"
    ],
    "genres": "Drama",
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "28 Mar 2008 (India)",
    "imdbID": "13569918",
    "plot outline": "Lakshmi (Lavanya) is raped and killed by her brother-in-law Balaji. The corrupt police officer Mohankumar accepts the bribe from her in-laws to cover it up. Mohankumar finds out that Lakshmi had written a letter about the torture she had endured to her mother Indrani so Mohankumar arrests her innocent mother and brother. After the failed suicide attempt of Indrani, a woman association comes to her help and Bharathi (Vindhya) forces Balaji to confess his crime to the police. In the meantime, the politician Vanamamalai (Ponnambalam) orders his henchman and boxing champion Bhaskar (Riyaz Khan) to kill an IAS officer and his family who tried to expose the corruption of many politicians. Bhaskar is then arrested by the police but in a short time, he is cleared of all charges by the court. After a boxing match, Vindhya seduces Bhaskar and Vindhya goes to his house with him, she then shoots him dead at the right time. The inspector-general of police (Thyagu) pressures the police inspectors to find the culprit of the two murders and the inspector of police S. P. Rajakumari (Swarnamalya) starts investigating these murders. Rajakumari finds out that Bharathi is the murderer, her real name was Azhageshwari and she was her collegemate. In the past, Azhageshwari and Sathya fell in love with each other. Sathya's father Gounder (Rajeev) was against their love and they decided to secretly get married, therefore, Gounder disowned Sathya. The couple moved to a different village, they bought a house called \"Azhagu Nilayam\" and they had a boy named Saravanan. One day, for his election campaign, Vanamamalai came to their village and he fell under the spell of Azhageshwari. The night, Vanamamalai, Bhaskar and Mohankumar entered their house. They beat up her son and her husband, they brutally raped Azhageshwari, and they set on fire Sathya and their house. Azhageshwari and her son managed to escape. Her son became mentally ill and is living in a mental asylum while Azhageshwari changed her name to Bharathi and became a club dancer to support her son. After killing the boxer Bhaskar and the police officer Mohankumar, Azhageshwari eventually kills Vanamamalai during a function and S. P. Rajakumari shoots Azhageshwari dead but before dying, she begs S. P. Rajakumari to take care of her son.",
    "languages": "Tamil",
    "title": "Azhagu Nilayam",
    "kind": "movie",
    "directors": "Rajaji",
    "writers": "Rajaji",
    "producers": "B. Kiran Bhandari",
    "composers": "Sabesh-Murali",
    "akas": "Azhagu Nilayam (India)",
    "writer": "Rajaji",
    "director": "Rajaji",
    "production companies": "AKR Studios",
    "plot": "Lakshmi (Lavanya) is raped and killed by her brother-in-law Balaji. The corrupt police officer Mohankumar accepts the bribe from her in-laws to cover it up. Mohankumar finds out that Lakshmi had written a letter about the torture she had endured to her mother Indrani so Mohankumar arrests her innocent mother and brother. After the failed suicide attempt of Indrani, a woman association comes to her help and Bharathi (Vindhya) forces Balaji to confess his crime to the police. In the meantime, the politician Vanamamalai (Ponnambalam) orders his henchman and boxing champion Bhaskar (Riyaz Khan) to kill an IAS officer and his family who tried to expose the corruption of many politicians. Bhaskar is then arrested by the police but in a short time, he is cleared of all charges by the court. After a boxing match, Vindhya seduces Bhaskar and Vindhya goes to his house with him, she then shoots him dead at the right time. The inspector-general of police (Thyagu) pressures the police inspectors to find the culprit of the two murders and the inspector of police S. P. Rajakumari (Swarnamalya) starts investigating these murders. Rajakumari finds out that Bharathi is the murderer, her real name was Azhageshwari and she was her collegemate. In the past, Azhageshwari and Sathya fell in love with each other. Sathya's father Gounder (Rajeev) was against their love and they decided to secretly get married, therefore, Gounder disowned Sathya. The couple moved to a different village, they bought a house called \"_Azhagu Nilayam_ (qv)\" and they had a boy named Saravanan. One day, for his election campaign, Vanamamalai came to their village and he fell under the spell of Azhageshwari. The night, Vanamamalai, Bhaskar and Mohankumar entered their house. They beat up her son and her husband, they brutally raped Azhageshwari, and they set on fire Sathya and their house. Azhageshwari and her son managed to escape. Her son became mentally ill and is living in a mental asylum while Azhageshwari changed her name to Bharathi and became a club dancer to support her son. After killing the boxer Bhaskar and the police officer Mohankumar, Azhageshwari eventually kills Vanamamalai during a function and S. P. Rajakumari shoots Azhageshwari dead but before dying, she begs S. P. Rajakumari to take care of her son."
}