{
    "id": "13576814",
    "localized title": "Pandi",
    "cast": [
        "Namitha",
        "Lawrence Raghavendra",
        "Sneha"
    ],
    "genres": "Drama",
    "runtimes": "146",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "23 May 2008 (India)",
    "imdbID": "13576814",
    "plot outline": "Pandi (Raghava Lawrence) does menial jobs in Dubai and saves every penny he earns and sends it to his family in Usilampatti. A flashback reveals that he was a carefree youth who was often chided by his father Sundarapandi (Nassar). His elder brother Rajapandi (Sriman) is the blue-eyed boy of his father. However, Pandi's mother Sivagami (Saranya Ponvannan) showers all her love and affection on him. His mother has a dream of building her own house in her land. Rajapandi asks Pandi to go to a marriage ceremony. While on the train, he met Bhuvana (Sneha), a cop's daughter in the other village, and after a sequence of events, romance blossoms between them. One afternoon, Bhuvana gives all the money she has on her person to Pandi and convinces him to take her out to lunch at a restaurant. After eating his lunch, he went outside to wash his hands and saw his sister and her boyfriend having a conversation. Pandi chases the motorbike on an auto, leaving Bhuvana stuck with the bill and no money, having given it all to Pandi. When Pandi eventually catches up with the boyfriend, the boyfriend tells him that they are seriously in love, and he is going to be coming over to their place with his parents to ask for her hand in marriage. Everything was going well until a couple days later, Sundarapandi wanted the money to buy the jewelry. Pandi's family receives a shock as Sivagami cannot find the money that they have saved up to pay for the wedding. Since Pandi is already a known troublemaker and has been to jail already, Sundarapandi blames Pandi and kicks him out of the house. This happens in front of Bhuvana, who has come to see where he has been the last few days and why he ran away at the restaurant. This incident with Sundarapandi accusing Pandi of taking the money has convinced her that he took her money the other day and ran and also just using her. In the end, it turns out that Rajapandi has run away from the house with his lover and with the money. Sundarapandi is consoled by Pandi, who borrows money from a private money lender and completes the wedding. Meanwhile, Pandi tries to make amends with Bhuvana, but she will not hear any of it. Sundarapandi, seeing the argument, went over and told Bhuvana the truth and how he misjudged his son and that is was not him that took the money. The following day, Sundarapandi went to Bhuvana's house to ask her father Periyamaayan (Ilavarasu) to fix a marriage between Pandi and Bhuvana. Periyamaayan, upon hearing this, gets furious. He is the local police inspector and knows all about Pandi's past. He refuses to marry his daughter to a criminal. Periyamaayan arranges a marriage for Bhuvana, but she went to Sundarapandi to say that she will die before marrying another person than Pandi. Pandi snatched Bhuvana from her house, takes her to the police station, and asks her father to approve of their marriage. Periyamaayan gets angry and says that Bhuvana is not his daughter anymore and that he will think his daughter eloped and lost. Pandi marries Bhuvana and as police protection, Periyamaayan watches her getting married. Determined to pay back the loan and help his family overcome their financial constraint, Pandi decides to go abroad and work as a conservancy staff. He manages to stabilize his family with his earnings. However, on his return, he is shocked to find his mother dead. Coming to know that it was no natural death, he decides to avenge the killers. He finds that Sundarapandi's colleague hired a killer to kill him, and his mother died, as a result. He beats him up and when Pandi take a knife to kill him, he then refused knowing his duty towards his family and decides to leave it in hands of law.",
    "languages": "Tamil",
    "title": "Pandi",
    "kind": "movie",
    "directors": "Rasu Madhuravan",
    "writers": "Rasu Madhuravan",
    "producers": "Hitesh Jhabak",
    "composers": "Srikanth Deva",
    "akas": "Pandi (India)",
    "writer": "Rasu Madhuravan",
    "director": "Rasu Madhuravan",
    "production companies": "Nemichand Jhabak",
    "plot": "_Pandi_ (qv) (Raghava Lawrence) does menial jobs in Dubai and saves every penny he earns and sends it to his family in Usilampatti. A flashback reveals that he was a carefree youth who was often chided by his father Sundarapandi (Nassar). His elder brother Rajapandi (Sriman) is the blue-eyed boy of his father. However, _Pandi_ (qv)'s mother Sivagami (Saranya Ponvannan) showers all her love and affection on him. His mother has a dream of building her own house in her land. Rajapandi asks _Pandi_ (qv) to go to a marriage ceremony. While on the train, he met Bhuvana (Sneha), a cop's daughter in the other village, and after a sequence of events, romance blossoms between them. One afternoon, Bhuvana gives all the money she has on her person to _Pandi_ (qv) and convinces him to take her out to lunch at a restaurant. After eating his lunch, he went outside to wash his hands and saw his sister and her boyfriend having a conversation. _Pandi_ (qv) chases the motorbike on an auto, leaving Bhuvana stuck with the bill and no money, having given it all to _Pandi_ (qv). When _Pandi_ (qv) eventually catches up with the boyfriend, the boyfriend tells him that they are seriously in love, and he is going to be coming over to their place with his parents to ask for her hand in marriage. Everything was going well until a couple days later, Sundarapandi wanted the money to buy the jewelry. _Pandi_ (qv)'s family receives a shock as Sivagami cannot find the money that they have saved up to pay for the wedding. Since _Pandi_ (qv) is already a known troublemaker and has been to jail already, Sundarapandi blames _Pandi_ (qv) and kicks him out of the house. This happens in front of Bhuvana, who has come to see where he has been the last few days and why he ran away at the restaurant. This incident with Sundarapandi accusing _Pandi_ (qv) of taking the money has convinced her that he took her money the other day and ran and also just using her. In the end, it turns out that Rajapandi has run away from the house with his lover and with the money. Sundarapandi is consoled by _Pandi_ (qv), who borrows money from a private money lender and completes the wedding. Meanwhile, _Pandi_ (qv) tries to make amends with Bhuvana, but she will not hear any of it. Sundarapandi, seeing the argument, went over and told Bhuvana the truth and how he misjudged his son and that is was not him that took the money. The following day, Sundarapandi went to Bhuvana's house to ask her father Periyamaayan (Ilavarasu) to fix a marriage between _Pandi_ (qv) and Bhuvana. Periyamaayan, upon hearing this, gets furious. He is the local police inspector and knows all about _Pandi_ (qv)'s past. He refuses to marry his daughter to a criminal. Periyamaayan arranges a marriage for Bhuvana, but she went to Sundarapandi to say that she will die before marrying another person than _Pandi_ (qv). _Pandi_ (qv) snatched Bhuvana from her house, takes her to the police station, and asks her father to approve of their marriage. Periyamaayan gets angry and says that Bhuvana is not his daughter anymore and that he will think his daughter eloped and lost. _Pandi_ (qv) marries Bhuvana and as police protection, Periyamaayan watches her getting married. Determined to pay back the loan and help his family overcome their financial constraint, _Pandi_ (qv) decides to go abroad and work as a conservancy staff. He manages to stabilize his family with his earnings. However, on his return, he is shocked to find his mother dead. Coming to know that it was no natural death, he decides to avenge the killers. He finds that Sundarapandi's colleague hired a killer to kill him, and his mother died, as a result. He beats him up and when _Pandi_ (qv) take a knife to kill him, he then refused knowing his duty towards his family and decides to leave it in hands of law."
}