{
    "id": "1446055",
    "localized title": "Don Muthu Swami",
    "cast": [
        "Mithun Chakraborty",
        "Ali Asgar",
        "Arun Bakshi",
        "Rakesh Bedi",
        "Hrishitaa Bhatt",
        "Birbal",
        "Yusuf Hussain",
        "Dilip Joshi",
        "Shakti Kapoor",
        "Sonia Kapoor",
        "Ashwin Kaushal",
        "Viju Khote",
        "Vishal Kotian",
        "Meghna Malik",
        "Dolly Minhas",
        "Mithalesh",
        "Achyut Potdar",
        "Mohit Raina",
        "Ali Razak",
        "Rohit Roy",
        "Anusmriti Sarkar",
        "Upasna Singh"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "112",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "original air date": "23 May 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2EzZmQwMmEtOTdjNy00ZjBmLTljMWEtYWM5ODNiNjYyMzRiXkEyXkFqcGdeQXVyNzc5NzAzNDI@._V1_SY150_CR49,0,101,150_.jpg",
    "imdbID": "1446055",
    "plot outline": "Don Muthu Swami is one of Bombay's most fearsome gangsters. On his deathbed, his father forces him to make a promise: that from now on he will lead a decent life. From that moment onwards, the don has a new purpose in life: to become Sir Muthu Swami instead. On of his new goals is to become fluent in Urdu, for which purpose he hires the young Jaikishan as a teacher. Don Muthu Swami has a beautiful daughter, Sanjana, whom he wants to get married to Pradhan, the son of his close friend. However, the don's right hand man, Preetam, asks for her hand as well. To impress Don Muthu Swami, he claims to be very rich by stealing millions from his employer. Sanjana herself, on the other hand, is desperate to get married to Jaikishan, and to scare off Pradhan, she fakes to be pregnant. The Don believe Preetam must be the culprit, but as it turns out, the girl Preetam loves is not Sanjana, but another girl who claims to be Don Muthu Swami's daughter, Ranjana.",
    "languages": "Hindi",
    "title": "Don Muthu Swami",
    "kind": "movie",
    "directors": "Ashim S. Samanta",
    "writers": [
        "Saleem Agha",
        "",
        "Rahat Indori",
        "",
        "Amitabh Verma"
    ],
    "producers": [
        "Ashim S. Samanta",
        "Shakti Samanta"
    ],
    "composers": "Anu Malik",
    "cinematographers": "Harish Joshi",
    "editors": "Shree Narayan Singh",
    "editorial department": [
        "Subhash Jaiswal",
        "Sandeep Sethy"
    ],
    "sound department": [
        "Vikram Biswas",
        "Prakash Gupta",
        "Vijay Kumar"
    ],
    "camera department": "Vishal Joshi",
    "music department": [
        "Bhavesh Bhatt",
        "Emon Chatterjee",
        "Deepali",
        "Mahalakshmi Iyer",
        "Anu Malik",
        "Shaan"
    ],
    "akas": "Don Muthu Swami (India)",
    "writer": [
        "Saleem Agha",
        "Rahat Indori",
        "Amitabh Verma"
    ],
    "director": "Ashim S. Samanta",
    "production companies": "Samanta Movies",
    "plot": [
        "_Don Muthu Swami_ (qv) is one of Bombay's most fearsome gangsters. On his deathbed, his father forces him to make a promise: that from now on he will lead a decent life. From that moment onwards, the don has a new purpose in life: to become Sir Muthu Swami instead. On of his new goals is to become fluent in Urdu, for which purpose he hires the young Jaikishan as a teacher. _Don Muthu Swami_ (qv) has a beautiful daughter, Sanjana, whom he wants to get married to Pradhan, the son of his close friend. However, the don's right hand man, Preetam, asks for her hand as well. To impress _Don Muthu Swami_ (qv), he claims to be very rich by stealing millions from his employer. Sanjana herself, on the other hand, is desperate to get married to Jaikishan, and to scare off Pradhan, she fakes to be pregnant. The Don believe Preetam must be the culprit, but as it turns out, the girl Preetam loves is not Sanjana, but another girl who claims to be _Don Muthu Swami_ (qv)'s daughter, Ranjana.::Jan van Steenbergen",
        "Circa 1970s Bombay's criminal _Don Muthu Swami_ (qv) promises his dying father, Ishwar, that he will go straight - not realizing that he is still under police surveillance, and his every moment is being watched. While he himself will face nothing but hilarious chaos as he and his goons attempt to fit into a honest lifestyle; deal with his rebellious daughter, Sanjana, who claims to have become pregnant by their chauffeur, Rehman; learn sophistication and Urdu from Jaikishan Shastri, who has an eye on Sanjana; his two-timing Accountant, Pritam Chopra, who has not only embezzled money but also wants to force him to wed his daughter; his wife, Lata, questions him about his fidelity - amidst even more chaos and confusion about a bag that mysteriously keeps on appearing and disappearing.::rAjOo (gunwanti@hotmail.com)"
    ]
}