{
    "id": "1568887",
    "localized title": "Thavalam",
    "cast": [
        "Suresh Gopi",
        "Bijukuttan",
        "Meena Ganesh",
        "Kanakalatha",
        "Salim Kumar",
        "Manka Mahesh",
        "Mahima",
        "Manraj",
        "Sindhu Menon",
        "Ambika Mohan",
        "Rathya",
        "Sreejith Ravi",
        "T.G. Ravi",
        "Jagathi Sreekumar",
        "Nedumudi Venu"
    ],
    "genres": "Drama",
    "runtimes": "107",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:U",
    "imdbID": "1568887",
    "plot outline": "Thavalam movie is a real life story of Muthu who lived around the Ernakulam bus stand. Sivan (Suresh Gopi) is a member of the gypsy group who roams around the cities to make a living. Sivan lives with his only daughter Meenakshi (Baby Diya) in a village named mayilpetty. Dasan Menon and his wife Usha are regular visitors to the temple of the village. According to the local sayings, they also believe that if they come over to this temple three times in a month, they will be blessed with a child. In one of the visits, some of their money gets stolen and the blame falls on Meenakshi kutty who passes around the temple. Both Sivan and his daughter are arrested for the robbery but in little time local teashop owner, Panikkar, arrives at the station with the actual culprit. Sivan and his little daughter are set free but the family finds an excessive interest in the father and his daughter and starts asking them about their life.",
    "languages": "Malayalam",
    "title": "Thavalam",
    "kind": "movie",
    "directors": "Baiju",
    "writers": [
        "Kaloor Dominic",
        "",
        "Socrates K. Valeth",
        "",
        "Socrates K. Valeth"
    ],
    "producers": "Jagadeesh Chandran",
    "composers": "Natesh Shankar",
    "cinematographers": "Anandakuttan",
    "editors": "P.C. Mohanan",
    "editorial department": [
        "R.A. Kannadasan",
        "K. Sasi Kumar",
        "Sasi Kumar",
        "K.G. Vijayan"
    ],
    "sound department": [
        "Ajith Abraham George",
        "Jeo Pious"
    ],
    "music department": [
        "Madhu Balakrishnan",
        "Franco",
        "Renjini Jose",
        "Natesh Shankar",
        "M.G. Sreekumar",
        "Vayalar Sarathchandra Varma"
    ],
    "akas": "Thavalam (India)",
    "writer": [
        "Kaloor Dominic",
        "Socrates K. Valeth",
        "Socrates K. Valeth"
    ],
    "director": "Baiju",
    "distributors": "Kichu Films Release",
    "plot": "_Thavalam_ (qv) movie is a real life story of Muthu who lived around the Ernakulam bus stand. Sivan (Suresh Gopi) is a member of the gypsy group who roams around the cities to make a living. Sivan lives with his only daughter Meenakshi (Baby Diya) in a village named mayilpetty. Dasan Menon and his wife Usha are regular visitors to the temple of the village. According to the local sayings, they also believe that if they come over to this temple three times in a month, they will be blessed with a child. In one of the visits, some of their money gets stolen and the blame falls on Meenakshi kutty who passes around the temple. Both Sivan and his daughter are arrested for the robbery but in little time local teashop owner, Panikkar, arrives at the station with the actual culprit. Sivan and his little daughter are set free but the family finds an excessive interest in the father and his daughter and starts asking them about their life."
}