{
    "id": "1612039",
    "localized title": "Souryam",
    "cast": [
        "Gopichand",
        "Anushka Shetty",
        "Poonam Kaur",
        "Ajay",
        "Mohammad Ali",
        "Annie",
        "Raghu Babu",
        "Krishna Bhagavan",
        "Tanikella Bharani",
        "Manoj K. Jayan",
        "M.S. Narayana",
        "Dharmavarapu Subramanyam",
        "Sudha",
        "Fish Venkat"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "151",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "te",
        "hi"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "25 Sep 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzhiMGVlMmUtMzBlOC00YTI0LTgzOTgtNjA4YWQzYzdkNGUxXkEyXkFqcGdeQXVyMTMwOTYxNTUw._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1612039",
    "plot outline": "Souryam is a 2008 Telugu action film produced by V. Anand Prasad on Bhavya Creations banner, directed by Siva cinematographer, who makes his directorial debut. Starring Gopichand, Anushka Shetty in the lead roles and music composed by Mani Sharma.ijay (Gopichand) comes to Kolkata in search of his lost sister. In a series of events, he ends up getting caught in a brawl with some goons .",
    "languages": [
        "Telugu",
        "Hindi"
    ],
    "title": "Souryam",
    "kind": "movie",
    "directors": "Siva",
    "writers": [
        "M. Rathnam",
        "",
        "Siva",
        "",
        "Siva"
    ],
    "producers": [
        "Liaquat Gola",
        "Narravula Gopi Krishna",
        "Anne Ravi",
        "Anand Prasad V."
    ],
    "composers": "Mani Sharma",
    "cinematographers": [
        "Vetri Palanisamy",
        "Vatri"
    ],
    "editors": "Marthand K. Venkatesh",
    "art directors": "A.M. Vivek",
    "assistant directors": [
        "G. Adi Narayana",
        "Anil Ravipudi"
    ],
    "sound department": "Madhusudhan Reddy",
    "visual effects": [
        "Asif Bhushan",
        "Satish Dayapule",
        "Bujji Gandi",
        "Surya Kambhampati"
    ],
    "stunts": [
        "Lakshman Chella",
        "Ram Chella",
        "Stunt Silva",
        "Vijay"
    ],
    "camera department": "Mukesh Muraleedharan",
    "music department": [
        "Ravi Kumar Bhaskarabhatla",
        "Karthik",
        "Malavika",
        "Rahul Nambiar",
        "Priya",
        "Rita",
        "Ramajogayya Sastry",
        "Anantha Sriram",
        "Tippu",
        "Hemachandra Vedala"
    ],
    "miscellaneous": [
        "Pulagam Chinnarayana",
        "S. Krishna",
        "Shobi Paulraj"
    ],
    "akas": "Meri Shapath",
    "writer": [
        "M. Rathnam",
        "Siva",
        "Siva"
    ],
    "director": "Siva",
    "production companies": [
        "Bhavya Creations",
        "Dimension Pictures"
    ],
    "distributors": "Dimension Pictures",
    "special effects": "Prime Focus",
    "other companies": "Aditya Music",
    "plot": [
        "Searching for his long-separated sister, a man arrives in Kolkata and gets into a brawl with the local goons.",
        "_Souryam_ (qv) is a 2008 Telugu action film produced by V. Anand Prasad on Bhavya Creations banner, directed by Siva cinematographer, who makes his directorial debut. Starring Gopichand, Anushka Shetty in the lead roles and music composed by Mani Sharma.ijay (Gopichand) comes to Kolkata in search of his lost sister. In a series of events, he ends up getting caught in a brawl with some goons .",
        "Fast-paced and fiery, this action-drama revolves around Vijay, a fearless young man who travels to Kolkata in search of his lost sister. A fateful set of events lead him into a violent brawl, during which he is forced to chop off a man's arm in self defense. Vijay decides to stay in Kolkata and applies for a job in a local college. He also falls in love with a vivacious student at the college. However, when the son of the man whose arm Vijay severed becomes aware of his whereabouts, he promises to exact revenge. Will Vijay succeed in defeating his enemies? Will he be able to find his lost sister? How will his future unfold?"
    ],
    "synopsis": "Vijay (Gopichand) comes to Kolkata in search of his lost sister. In a series of events, he ends up getting caught in a brawl with some goons and in self-defense chops a man's arm off. Later Vijay approaches a college in Kolkata to apply for a job and he is asked to get a signature in the sports quota. He later meets Gymson (Ali) and finds out he is the strongest teacher in the college. He meets a bubbly college girl Swetha (Anushka Shetty) and soon, they fall in love. One day, the gangster's son named Ajay (Ajay) finds out that Vijay is alive and he swears to avenge his father's insult and arrest.At a party, Ajay finds and meets Swetha and asks if she wants to sleep with him and cuts her blouse down. Swetha was disrespected and embarrassed, then later, Ajay follows her and Divya (Poonam Kaur), and cornering the girls with his men. After his father sent him a picture of the person he needs to abduct, Ajay found out that Divya is the key and abducted her by force. Divya was able to escape from the goons then she finds a man who comes to rescue her, who was apparently Vijay, and fights them in vain and also kills Ajay. Its aftermath resulted to an injured Divya as she was taken by Vijay to the hospital. At the hospital, Vijay revealed to Swetha that he was looking for Divya, his long lost separated sister who hated him for ignoring her when they were kids. But unbeknownst by Divya, he was forced to ignore her sister because of his dream for her to have a better life than to live in the streets with him. He hides his identity from her and grew up with the influence of a police officer until he is ready to find her in the present day to meet her. But when gangsters chase Swetha and Vijay at the hospital, Vijay was forced to fight and kill some of Ajay's goons in front of Swetha which made her scared of him on the way he fights ruthlessly and grimly.Vijay reveals his past life as a police officer to Swetha.The police officer who raised Vijay was made to die by Sivarama Goud,a gangster.Vijay then finally decided to end the problem. He finally faced Sivarama Goud (Manoj K. Jayan), Ajay's gangster father and the ruthless mastermind who also terrorized an innocent village. He created a clever plan to make Sivarama and his men to be punished in all of their crimes from the village and to other people making them end behind bars.After narrating,Divya is taken by Vijay to safety.She then pleads Vijay to accept Swetha which he reciprocates.After a while, Vijay, who decided to check on Divya, finds out that she was abducted again. Vijay is shocked to see Sivarama out of jail again and takes Divya as bait. Divya, still innocent of Vijay's true relation to her, pleads on Vijay not to fight for her anymore because they are not related. But because Sivarama made her realize that his long lost brother will die in front of her, she emotionally forgives him for the past as she, full of grief, watches Vijay being beaten up by Sivarama's goons.Vijay had the strength to finish the job successfully when he felt his sister finally acknowledging him as her brother. After a while, it was seen that Vijay and Divya are leaving to start a new life again as siblings and the two invited Swetha to come along with them."
}