{
    "id": "5508936",
    "localized title": "Vamshi",
    "cast": [
        "Puneeth Rajkumar",
        "Nikita Thukral",
        "Lakshmi",
        "Avinash",
        "Komal Kumar",
        "Ravi Kale",
        "Sundar Raj"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "139",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "02 Oct 2008 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGZiY2MzYmYtNmY0MS00YTFhLWE1NTEtMTdjNDk5OWM0MTRkXkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "5508936",
    "plot outline": "A tale with a twist, the story begins with Vamshi (Puneeth) who happens to be the son of the noted underworld don Kotnal Ramachandra who is no more. Vamshi grows up with his mother (Lakshmi) and his only aim in his life is to fulfill every wish of his mother. In this process, he aims to become a cop and when he gets to the final stage, he is shunned just because he is the son of a rowdy sheeter. Vamshi's bad habit of extreme anger leads him to fury and then he decides to go the wrong way. He ends up becoming the most dreaded don in the underworld and this causes sleepless nights to his rival Reddy (Rajendra Karanth). Meanwhile, Vamshi has a love interest in the form of Sharada (Nikita) who stands by him at all times and gives him strength. Now, Vamshi gets powerful but one day he overhears the dreadful past of his mother and realizes that it was due to him that his mother has reached to that stage. He immediately decides to give himself up to the cops but then his mother gets to know that the authorities and the bad guys have different plans for him, so she decides to end Vamshi's life by giving him poison. Vamshi gleefully accepts it. What happens after that forms the rest of the story.",
    "languages": "Kannada",
    "title": "Vamshi",
    "kind": "movie",
    "directors": "Prakash",
    "writers": "Prakash",
    "producers": "Parvathamma Rajkumar",
    "composers": "R.P. Patnayak",
    "cinematographers": "K. Krishnakumar",
    "editors": "Deepu Kumar",
    "music department": [
        "Paul Praveen Kumar",
        "Rajkumar"
    ],
    "akas": "Vamshi (India)",
    "writer": "Prakash",
    "director": "Prakash",
    "plot": [
        "_Vamshi_ (qv), under the eye of his mother is living in an ordinary house is given all care to become a police man. The rejected mother the dejected son wants to carve a fresh life because a big rowdy.",
        "A tale with a twist, the story begins with _Vamshi_ (qv) (Puneeth) who happens to be the son of the noted underworld don Kotnal Ramachandra who is no more. _Vamshi_ (qv) grows up with his mother (Lakshmi) and his only aim in his life is to fulfill every wish of his mother. In this process, he aims to become a cop and when he gets to the final stage, he is shunned just because he is the son of a rowdy sheeter. _Vamshi_ (qv)'s bad habit of extreme anger leads him to fury and then he decides to go the wrong way. He ends up becoming the most dreaded don in the underworld and this causes sleepless nights to his rival Reddy (Rajendra Karanth). Meanwhile, _Vamshi_ (qv) has a love interest in the form of Sharada (Nikita) who stands by him at all times and gives him strength. Now, _Vamshi_ (qv) gets powerful but one day he overhears the dreadful past of his mother and realizes that it was due to him that his mother has reached to that stage. He immediately decides to give himself up to the cops but then his mother gets to know that the authorities and the bad guys have different plans for him, so she decides to end _Vamshi_ (qv)'s life by giving him poison. _Vamshi_ (qv) gleefully accepts it. What happens after that forms the rest of the story."
    ]
}