{
    "localized title": "Shiddat",
    "cast": [
        "Sunny Kaushal",
        "Radhika Madan",
        "Mohit Raina",
        "Diana Penty",
        "Vidhatri Bandi",
        "Gaurav Amlani",
        "Gandharv Dewan",
        "Chirag Malhotra",
        "Humayoon Shams Khan",
        "Babrak Akbari",
        "Atul Kumar",
        "Nazneen Madan",
        "Rajendra Shisatkar",
        "Diljohn Singh",
        "Floriane Andersen",
        "Arjun Singh",
        "Alina Tamara",
        "Eric Mallett",
        "Lyell Walker",
        "Patrice Maktav",
        "Avinash Soni",
        "Harish Jee",
        "Rashmi",
        "Rajesh Kambhoj",
        "Iftikhar Hussain",
        "Saksham Raj",
        "Zarin",
        "Ram Giridhar",
        "Sunil Shroff",
        "Reynu Verma",
        "Aditya Pednekar",
        "Kavita Mishra",
        "Nitish Kapoor",
        "Milind Gautam",
        "Sharad",
        "Pulkit Kumar",
        "Harish Lalwani",
        "Craig Anderson",
        "Ben Bradley",
        "Saulius Cajauskas",
        "Usman Chauhan",
        "Guru Haryani",
        "Victoria Malinjod",
        "Soni Marwah",
        "Bharat Mistri",
        "Richa Prakash",
        "Karl-Martin Rantapelkonen",
        "Matt Rolls",
        "Atul Sharma",
        "David Sullivan",
        "Alfredo Tavares",
        "Ruel Dausan Varandani",
        "Chris Wilson"
    ],
    "genres": [
        "Romance"
    ],
    "runtimes": [
        "146"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "hi"
    ],
    "color info": [
        "Color"
    ],
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:UA 13+",
        "Singapore:NC16::(self-applied)"
    ],
    "original air date": "01 Oct 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2U2NzcyYWQtYWRkNi00NWE2LWFlN2UtMjY0MzJkMWQzZDI2XkEyXkFqcGdeQXVyMTI1NDEyNTM5._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "11314148",
    "languages": [
        "Hindi"
    ],
    "title": "Shiddat",
    "kind": "movie",
    "directors": [
        "Kunal Deshmukh"
    ],
    "writers": [
        "Shridhar Raghavan",
        "Dheeraj Rattan",
        "",
        "Dheeraj Rattan",
        "Pooja Ladha Surti",
        "Shridhar Raghavan",
        "",
        "Sara Bodinar"
    ],
    "producers": [
        "Shiv Chanana",
        "Ashish Chauhan",
        "Sharada Karki",
        "Firuzi Khan",
        "Bhushan Kumar",
        "Ashish Nikam",
        "Cyrus Patel",
        "Poonam Shivdasani",
        "Dinesh Vijan"
    ],
    "composers": [
        "Manan Bhardwaj",
        "Gourov Dasgupta",
        "Sachin Sanghvi",
        "Jigar Saraiya"
    ],
    "cinematographers": [
        "Amalendu Chaudhary"
    ],
    "editors": [
        "A. Sreekar Prasad"
    ],
    "editorial department": [
        "Justin Belly",
        "Devanshi Desai",
        "Nitin Minz",
        "Madhubrata Mohanty",
        "Raghavendra Thirun"
    ],
    "casting directors": [
        "Rachita Kapoor",
        "Vaibhav Vishant"
    ],
    "production designers": [
        "Shiuli Thukral"
    ],
    "art directors": [
        "Mayur Ghag",
        "Subhash Jadhav"
    ],
    "costume designers": [
        "Sukriti Grover",
        "Ayushi Jain"
    ],
    "make up department": [
        "Marianna Coletta",
        "Viralsneha Hindustani",
        "Ritika Vats"
    ],
    "production managers": [
        "Lubna Ali",
        "Nidhi Kullu",
        "Sarwar Mohammad",
        "Priyanshu Sharma"
    ],
    "assistant directors": [
        "Mariya Doma",
        "Adrian Fernandes",
        "Krishna Keshav",
        "Mayank Madan",
        "Dhruv Pathak",
        "Sonali Rattan"
    ],
    "art department": [
        "Shaharyar Ansari",
        "Ian Bruce",
        "Aaryan Prajapati",
        "Vedika Trivedi"
    ],
    "sound department": [
        "Ender Akay",
        "Aleksander Berezhnyi",
        "Devabrot Chaliha",
        "Krzysiek Chodkiewicz",
        "Alok De",
        "Shajith Koyeri",
        "Sanjay Kurian",
        "Natalia Lubowiecka",
        "Kohinoor Mukherjee",
        "Savitha Nambrath",
        "Filip Stefanowski",
        "Jacek Wisniewski"
    ],
    "visual effects": [
        "Sanchit Anant",
        "Sam Bhattacharjee",
        "Akash Chavan",
        "Girish Sadashiv Chougule",
        "Piyush Dodia",
        "Sagar Kawade",
        "Pranab Lahkar",
        "Krutesh Meher",
        "Sara Mijangos Garcia",
        "Navneet Pathak",
        "Pritom Saikia",
        "Such s Seksaria",
        "Amarjeet Singh",
        "Raghvendra Singh",
        "Shreyas Lahu Telgade",
        "Shubham Verma"
    ],
    "stunts": [
        "Ejaz Gulab",
        "Miroslav Sekula"
    ],
    "camera department": [
        "Liam Anderstrem",
        "Jim Edgar",
        "Yohan Fernandes",
        "Pradeep Kharwar",
        "Alex Macaulay"
    ],
    "animation department": [
        "Mohammad Aqib"
    ],
    "casting department": [
        "David John Jeffery",
        "Rachita Kapoor",
        "Amaan Osman",
        "Lovesh Piplani",
        "Rishi Sharma"
    ],
    "costume departmen": [
        "Brijal Balakrishnan"
    ],
    "location management": [
        "Hamish Menzies",
        "Derek Yeaman"
    ],
    "music department": [
        "Manan Bhardwaj",
        "Gourov Dasgupta",
        "Hrishikesh Gangan",
        "Kunwar Juneja",
        "Kohinoor Mukherjee",
        "Kausar Munir",
        "Sachin Sanghvi",
        "Jigar Saraiya",
        "Priya Saraiya",
        "Abhishek Singh",
        "Sachet Tandon",
        "Divyanshu Tejwani",
        "Parampara Thakur"
    ],
    "script department": [
        "Ajinkya Bhavsar"
    ],
    "transportation department": [
        "Bruce Patel",
        "Rajesh Rajilal"
    ],
    "miscellaneous": [
        "Tina Chandorkar",
        "Vijay Ganguly",
        "Morwenna Hull",
        "Sneha Kapoor",
        "Kamlesh Mayuri",
        "Tanay Nagarkar",
        "Rohan Shah",
        "Mike Toddington",
        "Ruel Dausan Varandani",
        "Prem Vijan"
    ],
    "akas": [
        "Shiddat: Journey Beyond Love (India, English title)"
    ],
    "writer": [
        "Shridhar Raghavan",
        "Dheeraj Rattan",
        "Dheeraj Rattan"
    ],
    "director": [
        "Kunal Deshmukh"
    ],
    "production companies": [
        "Maddock Films",
        "T-Series"
    ],
    "distributors": [
        "Disney+ Hotstar"
    ],
    "other companies": [
        "Rachita Kapoor Casting"
    ],
    "plot": [
        "A passionate love story involving two couples which highlights the contrast between a regular, mature yet egoistic husband and a unique, happy go lucky, enamored, overzealous boy chasing after the love of his life."
    ],
    "synopsis": [
        "The film starts with the marriage of Gautam, an Indian Foreign Services officer, and Ira, a spirited social worker. Jaggi, a rank guest at the wedding, creates a scene and gets caught with his friends for gatecrashing the party. Jaggi later crosses the border illegally, intending to reach London but gets caught and taken back to the embassy where Gautam works. Jaggi explains to him that he has to reach London before Monday to his love, being inspired by Gautam's speech. The film flashes back to three months ago.Jaggi, a hockey player, meets Kartika, a swimmer, and though the two get off to a rocky start, they start spending time together, teaching each other their sport. After a party, they have sex. Jaggi later learns that Kartika is getting married and asks why she didn't tell him. She replies that she was betrothed before meeting him and is sorry. He tells her that he truly loves her and she tells him that if his feelings are true, he should come to London after three months, in which case she will cancel the wedding. He tries to apply for a visa but fails to get one, and thus tries to go illegally.After listening to Jaggi's story, Gautam admits that his philosophy was just a reception speech. Ira and Gautam are currently separated as Gautam had exposed to the government that a young boy selling food on the street was a refugee staying illegally. Ira, who felt sympathy for the boy, argued with Gautam over this and left him.Jaggi has to be deported to India. He tries to escape, but gets caught when he suffers injuries while saving his fellow traveler Bilal. Due to some problem in documentation, Jaggi's flight is missed. Gautam has to keep Jaggi with him for 2 days till the next flight on Monday morning. On the way back home, Jaggi sees the other side of the English Channel and asks Gautam what lies on the other side. Listening to Gautam's reply, Jaggi gets excited and laughs that he can swim and cross the sea. Both spend some time enjoying, and on the way, Jaggi sees a dress and wishes to buy it for Kartika. For the first time in 3 months, ultimately, he finally calls Kartika to enquire about her dress size. She is shocked to hear Jaggi's voice. He says that he is in France and will try to reach there before Monday. She doesn't believe him and thinks he is joking, but her phone battery drains out before they can speak further. The next day, Jaggi persuades Gautam to make a step to his relationship and calls Ira, who wishes to talk it out. At the restaurant, Ira instead asks for divorce and tells Gautam to sign the papers. He angrily signs the papers and leaves. On the way home, Jaggi sees a swimsuit and desires to swim the English Channel wearing that swimsuit. Angry, Gautam takes Jaggi to a swimming pool and makes him swim continuously, believing that as the English Channel is 20 miles long it would be nearly suicidal to cover the entire length by swimming.The next day, Gautam is surprised to find Ira at his doorstep, and realizes that Jaggi, who has gone missing, is responsible for having made the call to her. Jaggi leaves behind a letter, stating that he will try to reunite with Kartika, no matter what. He then enters the sea in order to reach the other side of the United Kingdom. Here, Gautam and Ira try to find him out but they fail. Kartika is also concerned for him because Jaggi called her from a P.C.O. and claimed that he is coming for her through the channel.Jaggi swims long as he can go, but starts losing energy by the middle of the sea, and faints. He is saved by some strangers. Gautam informs Kartika that Jaggi is safe and that he tried to cross English Channel in order to reach her. He asks her if she would have really broken off her marriage in the event that Jaggi would have crossed the sea, but she is confused and doesn't have an answer. Seeing Jaggi's intense love for her, she falls in love with him. She confesses her feelings to Jaggi on phone and demands that he pick her up fast.Seeing the love between the two, Gautam helps Jaggi get a passport with a United Kingdom visa illegally. When Ira asks Gautam why he is risking his career for Jaggi, he admits that he felt guilty since Jaggi was willing to go to unimaginable lengths to reunite with his love but he himself wasn't. For the last time, Jaggi goes to meet Bilal and tells him everything.At the last moment when Gautam and Jaggi are about to board the plane, Bilal betrays Jaggi to the cops in return for a job, a house and legal citizenship. Seeing the police in search of him, Jaggi hides at the bottom of the plane.At the end, it is shown that Gautam and Ira reunited back and Gautam was telling Jaggi's love story to his friends as they were remembering him, as he concludes saying that everyone has a story of love, and the only common factor binding them is the intensity of that love."
    ]
}