{
    "localized title": "Machaan",
    "cast": [
        "Richa Kalra",
        "Prateek Goyal",
        "Mahmood Hashmi",
        "Prem Sagar Singh",
        "Mishti Singh",
        "Gyan Prakash Nagar",
        "Lajjawati Mishra",
        "Anita Sahgal",
        "Viccky Baidyanath",
        "Abhishek Sengar",
        "Sonu Bhardwaj",
        "Mahesh Singh",
        "Ahaan Jha",
        "Janvi Mishra",
        "Shubham Srivastav",
        "Vishal Tiwari",
        "Abhishek Singh",
        "Muntazir Ahmad"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": [
        "124"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "hi"
    ],
    "color info": [
        "Color"
    ],
    "sound mix": [
        "DTS::(RCA Sound Recording)"
    ],
    "original air date": "22 Jan 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTc0MjdjZjYtMzBmZC00MDI3LWE0ZTEtY2FkNzkwYWFiNDk2XkEyXkFqcGdeQXVyNjA4NTk0NjU@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "12724920",
    "languages": [
        "Hindi"
    ],
    "title": "Machaan",
    "kind": "movie",
    "directors": [
        "Nitesh Tiwari"
    ],
    "writers": [
        "Prem Sagar Singh"
    ],
    "producers": [
        "Prince Madhup",
        "Ankit Singh",
        "Nilesh Tiwari"
    ],
    "composers": [
        "Nitesh Tiwari"
    ],
    "cinematographers": [
        "Aftab Beg",
        "Rajan Jaiswal"
    ],
    "editors": [
        "Manik Lal Yadav"
    ],
    "editorial department": [
        "Prakash Pandey"
    ],
    "production managers": [
        "Nilesh Tiwari"
    ],
    "sound department": [
        "Meraj Rayeen"
    ],
    "visual effects": [
        "Gurdeep Singh"
    ],
    "casting department": [
        "Ishan Tiwari",
        "Nilesh Tiwari"
    ],
    "location management": [
        "Mahesh Singh"
    ],
    "music department": [
        "Harman Nazim k Ali",
        "Pamela Jain",
        "Shahid Mallya",
        "Aditi Singh",
        "Rishabh Singh"
    ],
    "miscellaneous": [
        "Nadeem Ahmad",
        "Akkash Bharadwaj",
        "Chotu Lohar",
        "Kavita Shetty",
        "Sanjiv Trigunayat"
    ],
    "writer": [
        "Prem Sagar Singh"
    ],
    "director": [
        "Nitesh Tiwari"
    ],
    "production companies": [
        "Anshi Films",
        "Catfish Media"
    ],
    "plot": [
        "All villagers started driving off Bhola with fire, lathis, lanterns, etc. To throw him out of village. Bhola pleaded that he would never enter the village, but villagers started pelting stones over him, and soon Bhola stopped breathing."
    ],
    "synopsis": [
        "The story revolves around a person named Bholashankar, as simple as his name means, living in a quite small backward village named Sabalpur. He was always involved helping all the villagers in their work as their own family members. Bholashankar's father had fixed his marriage with one of his friend Lallan's daughter Kajri, during their childhood. Bholashankar was the only child of his parents, always used to roam with his best friend Birju, and whoever needs any help Bhola and Birju are always there to help, and thus, they were adorable to all.\nThere is one another group of people, practicing for Dangal fight championship between Sabalpur and Jadopur. Madhav was training for Dangal. He sometimes feels so unusual with Bholashankar because of his helping nature. On the day of Dangal fight championship, every member of Madhav team was incapable to stand in front of Jadopur. Since, everyone knees down, Birju suddenly jumped into the circle and he also fell soon. This really hurts Bhola and he jumped into the floor and somehow he wins the championship. This made the villagers to cheer for Bhola's win, that is, Sabalpur's win. In result, Madhav felt his insult and left for the day.\nOne dark morning, Madhav and his friends caught harassing a girl. Bhola beats them but somehow they escape trying to hide their identities. Next day, he exposes them in front of villagers. Since, Panchayat left them because of lack of any clear evidence against them. This all incident made Bhola's father Keshav tensed as he clearly knew that Madhav won't leave any single chance taking revenge from Bhola. This creates clashes between Keshav and Bhola and Bhola left his home to earn his living in a town.\nBhola finds a good friend Anand in the town who helped him getting a job, and they were soon very close friends. One day, Bhola fell sick and diagnosed with AIDS in medical test. So, he finally decided to leave for his village and he would love dying in his own village amongst his own villagers. Anand tried a lot to make him feel comfortable that they would go for the best treatment, but Bhola always\ndenied and came back to his village. The news about his illness soon get spread amongst the villagers and Madhav took advantages of this disease which was completely unknown to all villagers. He convinced the Panchayat that AIDS is not curable, in fact its communicable, occurs only to characterless people and all like the same, and asked to take Bhola out of village and let him live in a Machaan far away from the village all alone.\nOne night, Bhola entered into village to see his parents and Madhav gets informed about it. He called an emergency meeting with the Panchayat and assured that Bhola needs to be killed so as to keep the entire village safe. All villagers started driving off Bhola with fire, lathis, lanterns, etc. to throw him out of village. Soon, Bhola reached the Machaan and pleaded that he would never enter the village, but villagers started pelting stones over him, and soon Bhola stopped breathing.\nA few days later, Anand visits Sabalpur looking for Bhola along with a letter. As he reaches, he came to know all what villagers did with Bhola. He just faded away for a while, but sooner he called a meeting with entire villagers. He finally opened the letter that was a letter of apology from the Hospital Authority, saying that the report of Bholashankar was misplaced with the report of another Bholashankar. The entire village was ashamed for what they did to a person, who was always having a smiling face and a helping hand. They were just left with the tears in their soul.\nSummary\nWith this, we just want to aware the society about AIDS and its misbeliefs. A sick person requires more love and care, ignorance kills faster.\nWe have also focused on the social causes like hygiene maintenance, women empowerment, education, etc. to contribute a little for a better society."
    ]
}