{
    "localized title": "Mr & Miss",
    "cast": [
        "Aravind",
        "Guntaka Subhash Chandu",
        "Naveen Kumar Damarla",
        "Vijay Dhintakurthi",
        "Hariprasad Gantyala",
        "Nag Gogulamudi",
        "Praveen Gollu",
        "Varun Gonela",
        "Chinni Gunaganti",
        "Macharla Jagadeesh",
        "Madanapalli Jayasimha",
        "Gnaneswari Kandregula",
        "Kotte Siva Kartheek",
        "Srikanth Kethaboina",
        "Vadlamudi Ravi Kiran",
        "Pavan Kumar",
        "Gajji Lakshmaiah",
        "Laxman",
        "Sandeep Reddy Lvrs",
        "Lakshmi Kumari Mandava",
        "Chiranjeevi Mareddy",
        "Mohan Rao Meela",
        "Narsimha Reddy Mekala",
        "Srilakshmi Mekala",
        "Veeraraghava Mekala",
        "Ranga Reddy Mekapothula",
        "Kolasani Nagaiah",
        "Nagashekar",
        "Daya Nandhan",
        "Praveen Pothukunta",
        "Raghavayya",
        "Nnvm Rajashekar",
        "Vadlalundi Jaya Rajesh",
        "Pawon Ramesh",
        "Durga Rani",
        "Avija Sandeep Reddy",
        "Bhimireddy Rajeev Reddy",
        "Bommareddy Narsimha Reddy",
        "Krishna Reddy",
        "Musku Vishal Reddy",
        "Swami Reddy",
        "Tatiparthi Srinivas Reddy",
        "Sadwik",
        "Praveen Sagi",
        "Sankar",
        "Sravan",
        "Sailesh Sunny",
        "Master Audvik Tavva",
        "Ravi Teja",
        "Dinthakurthi Vijay",
        "Boorgam Vani Yadav"
    ],
    "genres": [
        "Romance"
    ],
    "runtimes": [
        "126"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "te"
    ],
    "color info": [
        "Color"
    ],
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:A"
    ],
    "original air date": "29 Jan 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTY2ZmJlMzUtYzBmMS00NmNmLTk3ZmMtZGY5NWQ1NTI3OGZjXkEyXkFqcGdeQXVyNjU3NDMyNTc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "13618240",
    "languages": [
        "Telugu"
    ],
    "title": "Mr & Miss",
    "kind": "movie",
    "directors": [
        "T. Ashok Kumar Reddy"
    ],
    "writers": [
        "Sudheer Varma P.",
        "",
        "Sudheer Varma P."
    ],
    "cinematographers": [
        "Siddam Manohar"
    ],
    "editors": [
        "Carthic Cuts"
    ],
    "production designers": [
        "Yalamanchili Karish"
    ],
    "camera department": [
        "Siddam Naresh"
    ],
    "miscellaneous": [
        "Sudheer Telaprolu"
    ],
    "writer": [
        "Sudheer Varma P.",
        "Sudheer Varma P."
    ],
    "director": [
        "T. Ashok Kumar Reddy"
    ],
    "production companies": [
        "Reading Lamp Creations"
    ],
    "synopsis": [
        "Shashi works as a HR in a company and has been looking for a transfer to Hyderabad and finally, she gets transferred. She reaches Hyderabad happily, thinking that she can live with her boyfriend happily. After reaching Hyderabad, she sees her boyfriend in a compromising situation with another girl and gets hurt. Her boyfriend talks in such a way that her ego gets hurt. She goes to a pub from there and kisses Shiva who was sitting alone and leaves from there. Shiva gets into a state of shock. Shiva is a BTech graduate from Amalapuram. Upon his father 's pressure he tries to get a job by paying money through backdoor. But, he gets cheated there. Shashi comes as a HR for the same company. Shashi gets impressed by the innocence of Shiva and says that she can give the job if he learns English in 15 days. From then, friendship blossoms between them while Shiva learns English with the help of Shashi.Soon, their friendship turns to love. And they get into live in relationship and lives happily. After sometime, Shiva gets expelled from the office because of his fake certificates. From then on, he stays at home and takes good care of Shashi. Slowly, he gets used to live idle without any job and life goals and drinks a lot and doesn't take good care of Shashi. Shashi gets frustrated with this kind of behaviour and says break up to him and while leaving, she says that she has deleted all his memories and asks him to delete all her memories from his phone in front of her. Then Shiva realises that his phone is missing. When he calls his number, they cut the call and switches it off. They are very afraid as they have their romantic video in that phone. At the same, time they hear a news stating that a similar video is leaked in Bangalore. They are more afraid. They both go to each and every place he visited the day before. Unable to find the phone, they give a police complaint and even searches in second hand phone market also.At one stage, she even suspects on Shiva also. At last, she gets really frightened and she thinks of committing suicide. Shiva consoles her by saying that they both have to fight it together. But, she decides to fight alone and leaves the house. Later, they memorise all their beautiful moments and feels very emotional and they meet up again. When they meet, they come to know that a neighbourhood boy took his phone to play. They both forgive each other and thinks not to repeat the same kind of mistakes again and enters the house."
    ]
}