{
    "localized title": "Sarcas Circa 2020",
    "cast": [
        "Abhija Sivakala"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "ml"
    ],
    "color info": [
        "Color"
    ],
    "original air date": "01 Apr 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzI2NmEzODItOTFmMi00NDY2LWEzMWMtMzA5NWExMTkyNDA5XkEyXkFqcGdeQXVyODg0OTg4NjY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "13829208",
    "plot outline": "After facing failure in almost every venture, Mr. F and Mr. J, two friends from a small town in Kerala embark on an adventurous journey to a nearby city. Mr. F receive a call from a stranger who persuades them to take up and finish a task. The stranger promises upon the completion of the task they will make a fortune putting an end to their drag ordinary lives. Continuous failures in Mr. F's life has allowed him to arrive at his own philosophy and insists that we are living in peculiar times surrounded by samasya (riddles). Those who offer help/work/money, in short, people with power have choices and those who receive have none. Ironically, Mr. F in his personal relationship with Mr. J seems to have forgotten his own philosophy. Leaving no space for agency or autonomy Mr. F drags his innocent and obedient friend (Mr. J) into a huge mess from which three is no going back. Sarcas Circa 2020 is a subjective take on how people with power lay out their connection with the ordinary people in the society and its manifestation in the lives of ordinary people we encounter in streets. Sarcas Circa 2020 captures and explores the experiences of the ordinary people and the uncertainties through which they oscillate between the known and the unknown.",
    "languages": [
        "Malayalam"
    ],
    "title": "Sarcas Circa 2020",
    "kind": "movie",
    "directors": [
        "Vinu Kolichal"
    ],
    "producers": [
        "Joseph Abraham",
        "Raveendran Chettathode"
    ],
    "composers": [
        "Seljuk Rustum"
    ],
    "cinematographers": [
        "Ram Raghav"
    ],
    "editors": [
        "Azif Ismail"
    ],
    "music department": [
        "Jofy Chirayath",
        "Darshana Rajendran"
    ],
    "miscellaneous": [
        "Nirmal Baby Varghese"
    ],
    "director": [
        "Vinu Kolichal"
    ],
    "plot": [
        "After facing failure in almost every venture, Mr. F and Mr. J, two friends from a small town in Kerala embark on an adventurous journey to a nearby city. Mr. F receive a call from a stranger who persuades them to take up and finish a task. The stranger promises upon the completion of the task they will make a fortune putting an end to their drag ordinary lives. Continuous failures in Mr. F's life has allowed him to arrive at his own philosophy and insists that we are living in peculiar times surrounded by samasya (riddles). Those who offer help/work/money, in short, people with power have choices and those who receive have none. Ironically, Mr. F in his personal relationship with Mr. J seems to have forgotten his own philosophy. Leaving no space for agency or autonomy Mr. F drags his innocent and obedient friend (Mr. J) into a huge mess from which three is no going back. _Sarcas Circa 2020_ (qv) is a subjective take on how people with power lay out their connection with the ordinary people in the society and its manifestation in the lives of ordinary people we encounter in streets. _Sarcas Circa 2020_ (qv) captures and explores the experiences of the ordinary people and the uncertainties through which they oscillate between the known and the unknown.::Unknown"
    ]
}