{
    "localized title": "Domestic Dialogues",
    "cast": [
        "Akash",
        "Amith Chandra",
        "Kavya Prakash",
        "Susha"
    ],
    "genres": [
        "Drama"
    ],
    "runtimes": [
        "75"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "ml"
    ],
    "color info": [
        "Color"
    ],
    "aspect ratio": "16 : 9",
    "sound mix": [
        "Stereo"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjVkOTNlZWEtMDUwZS00ZDY1LTgxZDMtNjFlNTQyNjc4ZDE0XkEyXkFqcGdeQXVyMTMwMTI1NTYw._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "14169630",
    "plot outline": "Domestic Dialogues is a realistic visual representation of a day-to-day happenings of a typical Kerala household. The narration is in a non- linear mode and contains social criticism and black humor. The dialogues happen between the central character Anoop, his family and a close friend, in a day's span. The story progresses through the conversation of four characters and pinpoints the the patriarchal and hypocritical attitude of the males in Kerala. Anoop is newly married and he never hesitates to follow the same old stereotypical behavioral patterns of his father, by and large, the pretentious society. The movie depicts the transformation of the characters when they move from public to private space and when they address different persons on the same day. Anoop is a typical representative of the ostentatious Kerala males and when the camera moves from the veranda to the living room, kitchen, bedroom and finally to the bathroom, the egoistic and faulty inner self of a person is revealed, which is a slice of the contemporary society in Kerala.",
    "languages": [
        "Malayalam"
    ],
    "title": "Domestic Dialogues",
    "kind": "movie",
    "directors": [
        "Gokul Raj Vaishnav"
    ],
    "writers": [
        "Gokul",
        "",
        "Vaishnav"
    ],
    "cinematographers": [
        "Binu"
    ],
    "editors": [
        "Binu"
    ],
    "writer": [
        "Gokul",
        "Vaishnav"
    ],
    "director": [
        "Gokul Raj Vaishnav"
    ],
    "plot": [
        "The film revolves around a middle class Indian Family . Central character Anoop talks with 4 characters in 4 different area in a house. Through these conversations ,the current political condition of the country is revealed",
        "_Domestic Dialogues_ (qv) is a realistic visual representation of a day-to-day happenings of a typical Kerala household. The narration is in a non- linear mode and contains social criticism and black humor. The dialogues happen between the central character Anoop, his family and a close friend, in a day's span. The story progresses through the conversation of four characters and pinpoints the the patriarchal and hypocritical attitude of the males in Kerala. Anoop is newly married and he never hesitates to follow the same old stereotypical behavioral patterns of his father, by and large, the pretentious society. The movie depicts the transformation of the characters when they move from public to private space and when they address different persons on the same day. Anoop is a typical representative of the ostentatious Kerala males and when the camera moves from the veranda to the living room, kitchen, bedroom and finally to the bathroom, the egoistic and faulty inner self of a person is revealed, which is a slice of the contemporary society in Kerala."
    ]
}