{
    "localized title": "1997",
    "cast": [
        "Benerji",
        "Naveen Chandra",
        "Shrikanth Iyyanngar",
        "Koti",
        "Mohan",
        "Ravi Prakash",
        "Ramaraju"
    ],
    "genres": [
        "Adventure"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "te"
    ],
    "color info": [
        "Color"
    ],
    "original air date": "26 Nov 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmM5ZTk5NTctN2JkYi00NmVkLWE5MGMtODJkMDgxOGRjMTQ5XkEyXkFqcGdeQXVyMTE1MzAyMDE4._V1_SY150_CR74,0,101,150_.jpg",
    "imdbID": "15417090",
    "languages": [
        "Telugu"
    ],
    "title": "1997",
    "kind": "movie",
    "directors": [
        "Mohan"
    ],
    "producers": [
        "Meenakshi Ramavath"
    ],
    "composers": [
        "Koti"
    ],
    "cinematographers": [
        "K. Chitti Babu"
    ],
    "editors": [
        "Nandhamuri Hari"
    ],
    "miscellaneous": [
        "Umamaheshwar Pusala"
    ],
    "director": [
        "Mohan"
    ],
    "production companies": [
        "Eswar Parvathi Movies"
    ],
    "plot": [
        "Vikram Rathod(Dr. Mohan) is a sincere police officer who is transferred to the Nizampeta village to control the atrocities that are happening there."
    ],
    "synopsis": [
        "This is a story of a remote village in 1997 where the villages were ruled by DORA (Rama Raju) where lower castes people were treated as untouchables. Circle Inspector (Srikanth Iyengar) is very loyalty to Dora.\nThe story begins with a poor family will come to the Police station to file a complaint about their missing children, Ganga and Manga of young girls belongs to lower castes were missing. Circle Inspector Chary ignores him and will push them out. Vikram Rathod (Dr.Mohan) is a sincere police officer who got transferred to the Nizampeta village to control the atrocities that are happening there. After he takes charge as ASP he finds that a suppressed section is being looked down on and punished by the village Dora, Ganga's body is found at the shore of the river. Manga is still missing. In his investigation he comes to know that Ganga has been rapped and then murdered. To his surprise everyone in the village knows that DORA has rapped and murdered Ganga except ASP. All are silent because they are afraid that DORA would kill them. ASP want to get Justice, he started investigating the case. In his Investigation he got to know that DORA has not rapped nor Killed the Ganga. He got to know that Ganga has been rapped by 3 people.\nNow the twist and turn that Who the three people rapped & murdered Ganga, What happened to missing Manga, How did the suppressed section people take Revenge, how Vikram Rathod takes things in control and brings peace to the village is the rest of the story.6"
    ]
}