{
    "localized title": "Shrimad Rajchandra",
    "cast": [
        "Amar Babaria",
        "Subhav Kher"
    ],
    "genres": [
        "Animation",
        "Biography",
        "Family"
    ],
    "runtimes": [
        "100"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "gu",
        "hi",
        "en"
    ],
    "color info": [
        "Color::(Full HD)"
    ],
    "aspect ratio": "16:9 HD (HD 1080p)",
    "certificates": [
        "India:U"
    ],
    "original air date": "19 Nov 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmNkODM0OGUtYTA0ZC00Mzc3LWE3NTctMmMyNjgyYWZkZGU5XkEyXkFqcGdeQXVyODQyMTQ0ODI@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "15719658",
    "plot outline": "Born in 1867 was a boy named Laxminandan in Vavania village of Saurashtra in Gujarat (India). He was a very curious child whose questions were overwhelming sometimes and at times, eye-opening. His understanding and maturity were beyond his age. He was special and blessed with extraordinary powers that earned him the title, Shrimad Rajchandra. Age 7 was his turning point when he recollected memories of his several past lives (Jati Smaran Gnan). At 19 years, he was able to perform Shatavadhans (performing 100 tasks simultaneously). He was an established businessman at the age of 21. He had unbelievable memory, exceptional intellect and could see the future. He was an excellent orator, poet, philosopher and scholar but most importantly, he was a great human being. Kindness, compassion, fearlessness and detachment were his super powers. Despite such accomplishments, he led a simple life worth admiring and emulating. Amongst millions, he inspired the two legendary leaders of India - Mahatma Gandhi and Jamsetji Tata.",
    "languages": [
        "Gujarati",
        "Hindi",
        "English"
    ],
    "title": "Shrimad Rajchandra",
    "kind": "movie",
    "directors": [
        "Bhairav Kothari",
        "Bharat Kothari"
    ],
    "producers": [
        "Bhairav Kothari"
    ],
    "composers": [
        "Dharam Bhatt"
    ],
    "cinematographers": [
        "Shreedhar Kakade"
    ],
    "editorial department": [
        "Vicky Chaudhary"
    ],
    "sound department": [
        "S.k Agarwal",
        "Kunal Dhabade",
        "Manjil Talukdar"
    ],
    "special effects": [
        "Vikram Biswas"
    ],
    "animation department": [
        "Shreedhar Kakade"
    ],
    "music department": [
        "Dharam Bhatt",
        "Rupmatii Jolly",
        "Prashant Muzumdar"
    ],
    "script department": [
        "Sachitra Jeevan Darshan Book"
    ],
    "director": [
        "Bhairav Kothari",
        "Bharat Kothari"
    ],
    "production companies": [
        "Aatmarth Productions",
        "Bhakti Trust"
    ],
    "distributors": [
        "Panorama Studios Distribution"
    ],
    "plot": [
        "The life journey of a boy with extraordinary powers who grows up to become a man ahead of his times. From humble beginnings as Laxminandan to path-breaking influence as _Shrimad Rajchandra_ (qv) over the lives of millions including Mahatma Gandhi",
        "Born in 1867 was a boy named Laxminandan in Vavania village of Saurashtra in Gujarat (India). He was a very curious child whose questions were overwhelming sometimes and at times, eye-opening. His understanding and maturity were beyond his age. He was special and blessed with extraordinary powers that earned him the title, _Shrimad Rajchandra_ (qv). Age 7 was his turning point when he recollected memories of his several past lives (Jati Smaran Gnan). At 19 years, he was able to perform Shatavadhans (performing 100 tasks simultaneously). He was an established businessman at the age of 21. He had unbelievable memory, exceptional intellect and could see the future. He was an excellent orator, poet, philosopher and scholar but most importantly, he was a great human being. Kindness, compassion, fearlessness and detachment were his super powers. Despite such accomplishments, he led a simple life worth admiring and emulating. Amongst millions, he inspired the two legendary leaders of India - Mahatma Gandhi and Jamsetji Tata."
    ]
}