{
    "localized title": "Pandu",
    "cast": [
        "Kushal Badrike",
        "Anand Ingle",
        "Bhau Kadam",
        "Hemangi Kavi",
        "Shahbaaz Khan",
        "Sonalee Kulkarni",
        "Prajakta Mali",
        "Savita Malpekar",
        "Uday Sabnis",
        "Pravin Tarde"
    ],
    "genres": [
        "Comedy"
    ],
    "runtimes": [
        "126"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "mr"
    ],
    "color info": [
        "Color"
    ],
    "certificates": [
        "India:U"
    ],
    "original air date": "03 Dec 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGYwOGJlMWItNzRjMC00MjVkLWE1ZjctMTllMDQ0YjAyNjQ4XkEyXkFqcGdeQXVyMjQ2MDI5ODE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "15819074",
    "plot outline": "Pandu and Mhadu are small time stand up comedians in small village of Maharashtra who catch the eye of powerful politician Babasaheb Pathare who has always been the target of rival parties.Babasaheb gets inspired by Pandu and Mhadu's performance as they are in need of job he offers them job in Mumbai police force after their parts as cops in the skit.The police force isn't happy with them joining the force directly but asks them to take proper training.They both clear their training and join the police force as Pandu Hawaldar and Mhadu Hawaldar where Mhadu becomes a corrupt cop taking bribes from people.But Pandu is an honest cop and gets famous after he arrests back to back criminals.Pandu meets Usha Keliwali a beautiful women and both get married with blessings of their family and Babasaheb.But things don't seem to be how it looks as whatever is happening in Pandu's life has been Pre planned by someone who wants to eliminate Babasaheb by making Pandu a scapegoat as he is his trusted aide.",
    "languages": [
        "Marathi"
    ],
    "title": "Pandu",
    "kind": "movie",
    "directors": [
        "Viju Mane"
    ],
    "writers": [
        "Viju Mane"
    ],
    "cinematographers": [
        "Shabbir Naik"
    ],
    "editorial department": [
        "Yash Bangar"
    ],
    "assistant directors": [
        "Mandar Deshpande"
    ],
    "sound department": [
        "Utsav Mistry",
        "Rohit Pradhan"
    ],
    "visual effects": [
        "Yogesh Dixit Colorist"
    ],
    "camera department": [
        "Prathamesh prakash Avasare",
        "Parth Chavan"
    ],
    "miscellaneous": [
        "Yogesh Dixit Colorist"
    ],
    "akas": [
        "पांडू (India, Hindi title)"
    ],
    "writer": [
        "Viju Mane"
    ],
    "director": [
        "Viju Mane"
    ],
    "production companies": [
        "Zee Studios"
    ],
    "distributors": [
        "Zee5"
    ],
    "plot": [
        "_Pandu_ (qv) and Mhadu are small time stand up comedians in small village of Maharashtra who catch the eye of powerful politician Babasaheb Pathare who has always been the target of rival parties.Babasaheb gets inspired by _Pandu_ (qv) and Mhadu's performance as they are in need of job he offers them job in Mumbai police force after their parts as cops in the skit.The police force isn't happy with them joining the force directly but asks them to take proper training.They both clear their training and join the police force as _Pandu_ (qv) Hawaldar and Mhadu Hawaldar where Mhadu becomes a corrupt cop taking bribes from people.But _Pandu_ (qv) is an honest cop and gets famous after he arrests back to back criminals._Pandu_ (qv) meets Usha Keliwali a beautiful women and both get married with blessings of their family and Babasaheb.But things don't seem to be how it looks as whatever is happening in _Pandu_ (qv)'s life has been Pre planned by someone who wants to eliminate Babasaheb by making _Pandu_ (qv) a scapegoat as he is his trusted aide.::alex.mjacko@gmail.com",
        "Two common men _Pandu_ (qv) and Mahadu accidentally become cops on the recommendation of powerful politician Babasaheb Pathare. _Pandu_ (qv) is an honest cop but Mahadu is not. _Pandu_ (qv) stumbles upon cases and solves them, and in the process finds love in Usha. Things go well till they stumble upon a plot to kill Babasaheb. Will they be able to save his life?::Promita Mukherjee"
    ]
}