{
    "localized title": "IKK",
    "cast": [
        "Guru Somasundaram",
        "Anicka Vikhraman",
        "Yogesh"
    ],
    "genres": [
        "Thriller"
    ],
    "runtimes": [
        "109"
    ],
    "countries": [
        "India"
    ],
    "country codes": [
        "in"
    ],
    "language codes": [
        "ta"
    ],
    "color info": [
        "Color"
    ],
    "certificates": [
        "India:UA"
    ],
    "original air date": "10 Dec 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWM0ZmE2OTYtNGIwYy00NWY0LWE3NmYtYmMyM2I5NTczNGYzXkEyXkFqcGdeQXVyMTM3Nzc4Njg2._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "16378018",
    "plot outline": "Vasanth Chandrasekar is a rich young man who is a Tamilnadu team football player. His father Chandrasekar resides in Germany. Vasanth gets married to Dhanya. After his marriage Vasanth undergoes some psychological disturbance, which leads to an injury during the match. In the Hospital Vasanth is taken care of by a caretaker Gnanaprakasam who was sent by his father. In a particular night when he is alone Vasanth accidentally sees a murder through a window from the hospital which again psychologically disturbs him.But Vasanth gets confused whether the murder which he saw is actually real or illusion. After getting discharged from Hospital when he is alone at Home Vasanth begins to speak with an illusionary character who he has never met.Why Vasanth undergoes these strange happenings in his life and What Gnanaprakasam tries do with Vasanth's life forms the crux of the story with many twists and turns.",
    "languages": [
        "Tamil"
    ],
    "title": "IKK",
    "kind": "movie",
    "directors": [
        "Babu Tamizh"
    ],
    "writers": [
        "Babu Tamizh"
    ],
    "producers": [
        "Prabhu Nadar",
        "Naveen Sharma"
    ],
    "composers": [
        "Gavaskar Avinash"
    ],
    "cinematographers": [
        "Radhakrishnan"
    ],
    "editors": [
        "Manikumaran Sankara"
    ],
    "akas": [
        "Ikk (Singapore, English title)"
    ],
    "writer": [
        "Babu Tamizh"
    ],
    "director": [
        "Babu Tamizh"
    ],
    "production companies": [
        "Dharmraj Films"
    ],
    "distributors": [
        "Dharmraj Films"
    ],
    "plot": [
        "How a Post-Traumatic Stress Disorder (PTSD) can affect one person's life and how he uses this weakness as his strength to face the challenges of life.",
        "Vasanth Chandrasekar is a rich young man who is a Tamilnadu team football player. His father Chandrasekar resides in Germany. Vasanth gets married to Dhanya. After his marriage Vasanth undergoes some psychological disturbance, which leads to an injury during the match. In the Hospital Vasanth is taken care of by a caretaker Gnanaprakasam who was sent by his father. In a particular night when he is alone Vasanth accidentally sees a murder through a window from the hospital which again psychologically disturbs him.But Vasanth gets confused whether the murder which he saw is actually real or illusion. After getting discharged from Hospital when he is alone at Home Vasanth begins to speak with an illusionary character who he has never met.Why Vasanth undergoes these strange happenings in his life and What Gnanaprakasam tries do with Vasanth's life forms the crux of the story with many twists and turns.::Dharmaraj Films"
    ],
    "synopsis": [
        "Vasanth Chandrasekar is a rich young man who is a Tamil Nadu Team football Player. His father Chandrasekar resides in Germany. Vasanth gets married to Dhanya. When all going well Vasanth start to face some psychological disturbance while he kills the pigeon by kicking the football. After some days again he caught into a psychological struck when a player escort girl Diya who refuses to leave Vasanth hand at stasrt of play. Relevant disturbances leads to an injury during the match. Vasanth admitted in hospital with some blow in head and leg. Dhanya asks Gnanaprakasam to take care Vasanth before she leaves to a marriage function. In a particular Night Vasanth goes near a window which added psychological disturbance to him by saw a murder. When Kanagavelraj starts to investigate about murder Vasanth gets irritated by his questions. Vasanth discharged from hospital and realize his arrogant attitude that he show to Diya mother and Kanagavel was wrong through Gnanaprakasam words. Then he asks sorry to them through phone call also. When Dhanya tooks Vasanth to temple for he feels good he saw a pigeon try to scares him. That moment added up psychological issue more and make him sleepless. Next day morning psychiatrist doctor enquire vasanth about his disturbances and try to solve it through some key points. When he arrives to point No. 4 both vasanth and psychiartic heared calling bell sound. Dhanya arrives and saw disturbed Vasanth because the psychiartic he talks before Dhanya came was an illusionary thing. Vasanth tries to solve the problem with help of Gnanaprakasm advice but Dhanya not interested in it. At a point Dhanya felt Gnanaprakasam triggering Vasanth move and so sacked him from driver job. Dhanya took Vasanth to foreign for relieve his stress but Vasanth not recovered from his psychological state. Why these psychological issues happens in Vasanth life? Is he solve the problem with the help of Gnanaprakasam and who is that illusionary psychiatrist that Vasanth sees forms the remaining crux of the story"
    ]
}