{
    "id": "0084324",
    "localized title": "Meri Jung",
    "cast": [
        "Anil Kapoor",
        "Girish Karnad",
        "Nutan Samarth",
        "Amrish Puri",
        "Meenakshi Sheshadri",
        "Kushboo",
        "Beena Banerjee",
        "Rajan Haksar",
        "A.K. Hangal",
        "Iftekhar",
        "Jaaved Jaaferi",
        "Kamal Kapoor",
        "Huma Khan",
        "Viju Khote",
        "Parikshit Sahni",
        "Sudhir",
        "Rabia Amin",
        "Subhash Ghai",
        "Avtar Singh Gullu",
        "Katy Irani",
        "Surendra Rahi",
        "Kedarnath Saigal",
        "Pradeep Singh Rawat"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "164",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "11 Aug 1985 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTc4MGYwMDQtYTQxMy00NDc4LTlmNzctOGI0MWMxOWNlNjUyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "0084324",
    "plot outline": "Deepak Verma is framed for a Murder by GD Thakral even thou he is innocent his wife Aarti pleads to Thakral but it goes unanswered and Deepak is hanged till death,Aarti disappears after the incident her children Arun and Komal believe she is dead they both become homeless,Arun starts doing odd jobs and becomes a famous lawyer in the city and someday wants to fight a case opposite Thakral while Komal is still at college,Geeta comes to Arun to ask him to fight case of her sister Dr Asha ,Arun rejects at first but later risks his life and gives justice to Asha as he finds Asha was framed,Arun and Geeta start meeting and fall in love Komal be friend's Vicky,Vicky whose a spoil brat of Thakral,Asha 's husband Dinesh notices photo of Arun 's mother in his house and recollects that she is still alive and living in and asylum and suffering from mental disorder,Arun gets his mother home feeling she might get back to normal he enters a function which has Thakral has chief guest and insults him,Vicky now decides to take revenge of this insult and comforts Komal to get married to him this angers Arun, Geeta takes Komal to stay with her in Asha and Dinesh 's house,Vicky calls Komal and asks her to elope with him but Vicky's former girlfriend Indu reaches and tells Komal that Vicky is cheating her in a tiff Vicky kills Indu which is noticed by Dinesh and Asha meanwhile Arun reaches the spot to share good news that his mother is alright and he is shocked to see Indu being murdered, Vicky is arrested the same night and at Indu's funeral Arun notices that she is the daughter of Gupta who had tried hard to prove his father innocent and decides to give justice to Indu,Arun's long wait is now over as he wanted to battle opposite Thakral he tells him that he is son of Deepak whom he falsely acquitted now Thakral and Vicky will pay for their crimes after a lot of courtroom drama Arun proves that Vicky is guilty for Indu's murder and judge orders him to be hanged,Thakral being biggest lawyer in the city can't take this that he couldn't save his son and looses his mental balance and is put in asylum, Aarti now lives happily with her children.",
    "languages": "Hindi",
    "title": "Meri Jung",
    "kind": "movie",
    "directors": "Subhash Ghai",
    "writers": "Javed Akhtar",
    "producers": [
        "Shabuddin Choudhary",
        "N.N. Sippy",
        "Pravesh Sippy"
    ],
    "composers": [
        "Laxmikant Shantaram Kudalkar",
        "Pyarelal Ramprasad Sharma"
    ],
    "production managers": "Prem Pillai",
    "assistant directors": "Shyam Gupta",
    "sound department": "Akki Hemchandra",
    "music department": [
        "Anand Bakshi",
        "Jaaved Jaaferi",
        "Laxmikant Shantaram Kudalkar",
        "Kishore Kumar",
        "Shabbir Kumar",
        "Lata Mangeshkar",
        "Nitin Mukesh",
        "Anuradha Paudwal"
    ],
    "akas": [
        "मेरी जंग (India, Hindi title)",
        "My Battle (World-wide, English title)",
        "Невинная жертва (Soviet Union, Russian title)"
    ],
    "writer": "Javed Akhtar",
    "director": "Subhash Ghai",
    "plot": [
        "Two top lawyers battle against each other while the whole city witnesses the battle.",
        "Deepak Verma is framed for a Murder by GD Thakral even thou he is innocent his wife Aarti pleads to Thakral but it goes unanswered and Deepak is hanged till death,Aarti disappears after the incident her children Arun and Komal believe she is dead they both become homeless,Arun starts doing odd jobs and becomes a famous lawyer in the city and someday wants to fight a case opposite Thakral while Komal is still at college,Geeta comes to Arun to ask him to fight case of her sister Dr Asha ,Arun rejects at first but later risks his life and gives justice to Asha as he finds Asha was framed,Arun and Geeta start meeting and fall in love Komal be friend's Vicky,Vicky whose a spoil brat of Thakral,Asha 's husband Dinesh notices photo of Arun 's mother in his house and recollects that she is still alive and living in and asylum and suffering from mental disorder,Arun gets his mother home feeling she might get back to normal he enters a function which has Thakral has chief guest and insults him,Vicky now decides to take revenge of this insult and comforts Komal to get married to him this angers Arun, Geeta takes Komal to stay with her in Asha and Dinesh 's house,Vicky calls Komal and asks her to elope with him but Vicky's former girlfriend Indu reaches and tells Komal that Vicky is cheating her in a tiff Vicky kills Indu which is noticed by Dinesh and Asha meanwhile Arun reaches the spot to share good news that his mother is alright and he is shocked to see Indu being murdered, Vicky is arrested the same night and at Indu's funeral Arun notices that she is the daughter of Gupta who had tried hard to prove his father innocent and decides to give justice to Indu,Arun's long wait is now over as he wanted to battle opposite Thakral he tells him that he is son of Deepak whom he falsely acquitted now Thakral and Vicky will pay for their crimes after a lot of courtroom drama Arun proves that Vicky is guilty for Indu's murder and judge orders him to be hanged,Thakral being biggest lawyer in the city can't take this that he couldn't save his son and looses his mental balance and is put in asylum, Aarti now lives happily with her children.::alex.mjacko@gmail.com",
        "Honest and diligent Deepak Varma is framed for murder, he claims he did not commit. The Public Prosecutor, G.D. Thakral, while aware of his innocence, does nothing, and Deepak is hanged. His widowed wife goes to G.D. Thakral for assistance, but is instead humiliated, in the presence of her child, Arun. She runs away, and subsequently loses her mind, and no one knows about her whereabouts. Years later, Arun has grown up, studied law, and is now practicing law, and assisting people who cannot afford a lawyer. When he is approached by Geeta Mathur, to represent her brother, Dinesh Mathur, he initially refuses, but then reconsiders and is successful in this case. He then meets with G.D. Thakral, and memories which have haunted him for years, return, and Arun decides to wage war against Thakral, not knowing that in so doing, he may himself be entrapped as his father was.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "The story begins with a happy lower-middle-class family Arun Verma (Anil Kapoor) an 8-year-old boy, his sister Komal Verma (Khushboo) a 5-year-old girl, his mother (Nutan) and his father (Girish Karnad) living a peaceful life. Arun's parents teach their children through the famous title song \"Zindagi Har Kadam Ek Nayi Jung Hai, Jeet Jayenge Hum, Jeet Jayenge Hum Tu Agar Sang Hai\" which means that life is full of problems at every step and still we will overcome all these if we are together.Arun's father is trapped in a murder case. A famous criminal lawyer G.D. Thakral (Amrish Puri) proves him guilty, and he is sentenced to be hanged by the court. Pleas by Arun's mother fail to convince Thakral to be truthful and spare her husband. Thakral asks her to give evidence for his innocence, to which she sadly quotes \"Jiske paas koi sabut, koi gavanh nahi hote kya we begunah nahin hote\" (\"one who does not have any proof or witness of innocence, are they not innocent?\"). Thakral was adamant to let her husband be hanged. He was hanged as per court's decision. His mother becomes mentally unstable from shock and is sent to a mental institution. Later Advocate Gupta (A.K. Hangal), the lawyer who defended Arun's father, finds out that Thakral had known all along that he was innocent, but only wanted him to be hanged. Arun finds out that Thakral abused the law.Arun's house and all his property is auctioned off by the court. Arun and his sister are not offered help. He grows up with the seeds of revenge in his heart. He becomes a successful defense lawyer and keenly follows every case of Thakral so that some day he can stand up in court against the unbeaten Thakral and beat him.One day Geeta Srivatsav (Meenakshi) comes to him and asks him to fight the case of her sister, Dr. Asha Mathur (Bina) who is accused of killing a patient on duty with her medicine, which she gave from her purse. Arun refuses saying that if she can produce even an iota of evidence of her sister being innocent he will fight for her. Geeta replies coincidentally the same sentence \"Jiske paas koi sabut, koi gavanh nahi hote kya we begunah nahin hote.\" Arun is instantly reminded of his mothers pleadings before Thakral. Geeta storms out of his office, but Arun is convinced to take the case. He meets Asha Mathur in police custody. He learns from her that on that fateful night she got a call from her ward assistant that her patient is in the ICU and needs her. She stops on the way (due to a traffic jam), and she impatiently moves out of car her to ask the reason. Meanwhile somebody replaces the medicine bottle with the look-alike bottle of poison from her purse. On arrival in the hospital, she gives the liquid from that bottle to stabilize the patient. This resulted in the patient's death.It is shown that Asha Mathur's husband, Dr. Dinesh Mathur (Parikshat Sahni), had gone to meet Thakral and had asked him to fight his wife's case. Thakral says no claiming he is very busy at the moment but later tells his assistant that there is no way that this case could be won. Arun meets Dinesh Mathur and informs him that he will fight the case. He asked him about the nature of poison and for how long a person can sustain the poison; he learns that poison if might result in death within 2 to 15 minutes depending on the body resistance.The case begins with the prosecution lawyer recounting the events of that fateful day and telling that the medicine given to the patient was actually poison. Arun defends the case says that the patient did not die of this medicine. To prove himself right he drinks the medicine in court and refutes the claim. The court declares Geeta's sister not guilty. Just after the judgement Dr. Mathur rushes Arun to hospital. It is revealed that the medicine contained poison, and Arun is saved in the nick of time.Geeta calls him on a beach to appreciate his efforts and kindness at the canteen. They fall in love. Thakral's son Vikram Thakral (Javed Jaffrey), a spoilt brat, not knowing anything about Arun, passes bad comments at the couple and teases Geeta, which irritates the couple. Soon things take an ugly turn. He beats Vikram and his friends.Dr. Mathur wants to appreciate and compensate Arun for the risky effort he took to save his wife. He calls him for a get-together in his mansion. Dr. Mathur gives Arun a blank cheque. Arun rejects the offers politely and says he did for his self-satisfaction. He then finds the same piano with the sticker of Bhagwat Geeta of Krishna which his father used to play and was auctioned. His memories are refreshed again and with the emotional request he tells Dr. Mathur that this piano is very significant to him and asks for it. Dr. Mathur very happily gives the piano and asks him the reason for accepting this small fees. He tells the Mathur family his tragic story. He says that his mother was never seen after his fathers death, and he assumes that she is dead.Vikram plans to trap Arun's sister Komal and learns she studies in the same college. He tries to impress her by his charms, dancing skills, and ways of flattering people. The plan works. Komal falls for him and he convinces her to run away with him (so that he can publicly defame Arun by leaving his sister). At the planned moment, when one of Vikram's ex-girlfriends shows up and tells Komal of Vikram's evil intentions. In the ensuing argument, Vikram murders his girlfriend which is witnessed by the Dr. Mathur's family.The Mathurs arrive at Arun's house to narrate the incident. Mrs. Mathur sees a photo of his mother hanging in the wall. She immediately recognizes the face with the patient she is handling for mental disorders. Arun and his sister request them to take to her. In the mental hospital they see their mother. Her memories had stopped on the day of the incident; she feels that their children are eight and five, staying with father. Arun brings her mother to his house and tries to make her come back to normal; she resumes her memory on hearing the song \"Zingadi Har Kadam...\"Arun had been waiting for this moment to take revenge on Thakral. He steps in as the prosecutor against Thakral who is defending his son. The case moves to and fro and, in the end, Arun has the upper hand. Thakral kidnaps Arun's mother and attempts to blackmail him. Arun goes to save his mother and is beaten up by Thakral's goons. Even though injured, Arun fights back. In an attempt to shoot Arun, Thakral shoots his friend's son and is jailed. He is unsuccessful in saving his son, who is given the death penalty. Thakral becomes a mentally unstable person.Arun and his family are happy again and sing the famous \"Zindagi Har Kadam Ek Nayi Jung Hai\" song."
}