{
    "id": "0376127",
    "localized title": "Anniyan",
    "cast": [
        "Vikram",
        "Sada",
        "Prakash Raj",
        "Vivek",
        "Nedumudi Venu",
        "Nassar",
        "Kalabhavan Mani",
        "Cochin Hanifa",
        "Saurabh Shukla",
        "Charlie",
        "Sriranjani",
        "Mohan Vaidya",
        "Manobala",
        "Shanmugha Rajan",
        "Amarasigamani",
        "Shanthi Williams",
        "Suryakanth",
        "Viraj",
        "Yana Gupta",
        "Raju Sundaram",
        "Joy Badlani",
        "Jasper"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "181",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "1.85 : 1 (DVD)",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:M",
        "India:U",
        "Malaysia:P13",
        "New Zealand:M",
        "Singapore:PG",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "17 Jun 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGZkYmQ4OGQtNDliYi00NDY5LWE2YzAtODMyMGEyMDhhM2I3XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "0376127",
    "plot outline": "Ambi is a meek lawyer, who wishes to change the society. But, because of his oft-repeated concern, people don't take him seriously. Besides, Nandini, the girl whom he loves, also rejects her because of this. This makes Ambi shattered, not before he encounters a website Aparichit.com, visiting which creates an alter ego inside Ambi's mind. For the girl he loves, he becomes a supermodel named Remo, and for the entire nation, to reform it, he becomes a vigilante named Aparichit, who not only teaches people the importance of following the rules, but also punishes them if they don't follow.",
    "languages": "Tamil",
    "title": "Anniyan",
    "kind": "movie",
    "directors": "S. Shankar",
    "writers": [
        "Gopal Ram",
        "",
        "S. Shankar",
        "",
        "S. Shankar",
        "",
        "S. Shankar",
        "",
        "Sujatha"
    ],
    "producers": [
        "D. Ramesh Babu",
        "Viswanathan Ravichandran"
    ],
    "composers": "Harris Jayaraj",
    "cinematographers": [
        "Manikandan",
        "Ravi Varman"
    ],
    "editors": "V.T. Vijayan",
    "editorial department": "S. Raghunath Varma",
    "art directors": "Sabu Cyril",
    "production managers": "S. Moorthy",
    "assistant directors": [
        "Raj Acharya",
        "Mohmmad Yunus Ismail",
        "Karthik"
    ],
    "art department": "Sreeroop Menon",
    "sound department": [
        "A.S. Laxmi Narayanan",
        "M. Ravi",
        "Smith Thampan"
    ],
    "special effects": "Shareen Yeyam",
    "visual effects": [
        "Satish Dayapule",
        "Shyam Gurumoorthy",
        "Zameer Hussain",
        "Vee Jay",
        "Ramesh Karthikeyan",
        "Thirumurugan Krishnan",
        "Manicn",
        "Ken Metzker",
        "P. Mohan",
        "Srinivas Mohan",
        "Kunjan Oza",
        "Pavan Kumar Potluri",
        "Radkrish",
        "Raju",
        "Shreeharsha Rao",
        "Ravichandran",
        "Srirengaraj",
        "Mohinder Subramaniam",
        "Shailendra Swarnkar",
        "Yugandhar Tammareddy",
        "Venkat Karunakar Uday",
        "Jitendra Vaghani",
        "Shareen Yeyam"
    ],
    "stunts": "Peter Hein",
    "camera department": "Vinayak Radhakrishnan",
    "music department": [
        "Sanjay Chandrasekhar",
        "Chennai Chorale",
        "Vasundhara Das",
        "Shreya Ghoshal",
        "Jassie Gift",
        "Hariharan",
        "Harini",
        "Andrea Jeremiah",
        "Kabilan",
        "G.V. Prakash Kumar",
        "Krishnakumar Kunnath",
        "Leslie Lewis",
        "Shankar Mahadevan",
        "Mehboob",
        "Melwyn",
        "Na. Muthukumar",
        "Nakhul",
        "Saindhavi",
        "Sunitha Sarathy",
        "Smith Thampan",
        "Vairamuthu"
    ],
    "miscellaneous": [
        "Kalyan",
        "Ahmed Khan",
        "Raju Sundaram"
    ],
    "akas": [
        "Aparichit - The Stranger (India, Hindi title)",
        "Aparichitudu (India, Telugu title)",
        "Aparichit (India, Hindi title)",
        "The Stranger (United States, English title)",
        "Незнайомець (Ukraine)"
    ],
    "writer": [
        "Gopal Ram",
        "S. Shankar",
        "S. Shankar"
    ],
    "director": "S. Shankar",
    "production companies": [
        "Oscar Films International",
        "Oscar Films"
    ],
    "distributors": [
        "Shringar Distributors",
        "Eagle Video",
        "Aascar Films",
        "Columbia TriStar Films",
        "First & Forward Entertainment",
        "Mega Films",
        "Paramount Pictures",
        "Thameens",
        "Ayngaran International",
        "Sun TV"
    ],
    "special effects companies": [
        "Big Freeze Time Slice",
        "Firefly Creative Studio",
        "Indian Artists Computer Graphics",
        "Indian Artists",
        "Prasad EFX",
        "Tata Elxsi Visual Computing Lab"
    ],
    "other companies": [
        "An Ak Audio",
        "Ayngaran Music",
        "Hit Musics",
        "Star Music India"
    ],
    "plot": [
        "Ramanujam, who suffers from multiple personality disorder, works as a lawyer by day and a vigilante at night. He uses tips from the 'Garuda Purana' as his tools to expose various antisocial elements.",
        "Ambi is a meek lawyer, who wishes to change the society. But, because of his oft-repeated concern, people don't take him seriously. Besides, Nandini, the girl whom he loves, also rejects her because of this. This makes Ambi shattered, not before he encounters a website Aparichit.com, visiting which creates an alter ego inside Ambi's mind. For the girl he loves, he becomes a supermodel named Remo, and for the entire nation, to reform it, he becomes a vigilante named Aparichit, who not only teaches people the importance of following the rules, but also punishes them if they don't follow.::Prashast Singh",
        "Ambi a simple man works as a consumer protection advocate he expects everyone to follow the law and punishes violators.Due to lack of evidence and corruption the violators are always set free.Ambi is frustrated with things around him as he cant develop changes and develops multiple personality disorder an turns Aparichit who kills the law breakers by using Geeta Puranam.Ambi secretly loves Nandini but can't express his feelings when he does so she rejects him due to is lifestyle.Ambi is almost to commit suicide but develops another personality in him as Remo Of young smarty guy.::alex.mjacko@gmail.com",
        "A devout and meek Iyengar and lawyer by the day and an undertaker by night who goes all out against the bad elements of the society with his gruesome murders , Ramanujam makes every kill a very gruesome and artistic one and is inspired by the Garuda Puranam. His idea is that such a murder will reverberate with shock and awe in society.::Rob Chester"
    ],
    "synopsis": "Ramanujam Iyengar alias Ambi is an orthodox Brahmin and a straightforward consumer protection advocate living in Triplicane, Chennai. He expects everyone to follow the law and prosecutes those who violate it. However, his efforts fail as circumstantial evidence always seems to favor the accused. He also fails to raise civic awareness due to pervasive corruption and a general lack of seriousness. Frustrated at his inability to bring about a change in society, his suppressed anger manifests itself in an alter-ego named Anniyan, a grim reaper-themed serial killer who punishes corrupt and indifferent people. Anniyan creates a website, compiles a list of wrongdoers from his site, and kills them using punishments described in the Garuda Puranam, one of the ancient Hindu scriptures.Ambi is secretly in love with his neighbor Nandini, an aspiring carnatic singer, but never expresses his love due to his fear of rejection. When he proposes to her during the annual Tyagaraja Aradhana at Thiruvaiyaru, she rejects him as she cannot bear his strict adherence to rules. Distraught, Ambi attempts suicide, almost drowning himself before having second thoughts. Subsequently, he develops another personality named Remo, a fashion model. Nandini is smitten by Remo and falls in love with him. Their marriage is eventually fixed.While purchasing a plot of land for her dowry, Nandini decides to undervalue the property to evade stamp duty. Ambi, who accompanies her as she registered the property, refuses to help her. Later, when Nandini and Remo are on a date, Remo transforms into Anniyan and attempts to punish her for her corrupt act. As he is about to kill her, Nandini calls out for Ambi. Anniyan then reverts to Ambi, who collapses and loses consciousness. Nandini takes Ambi to NIMHANS where he is diagnosed with multiple personality disorder. Through recovered-memory therapy, Vijaykumar, the chief psychiatrist of the hospital uncovers Ambi's past. It is revealed that, when Ambi was fourteen years old, he witnessed the accidental death of his younger sister Vidya due to civic apathy. The incident left a deep emotional scar, which is the reason for his lofty ideals. It is also discovered that while Anniyan and Remo are aware of Ambi as a separate person, Ambi is oblivious to their existence within him. Vijaykumar declares that Remo will cease to exist if Nandini accepts Ambi's love, but Anniyan will cease to exist only when the society reforms. Nandini accepts Ambi's love and Remo disappears.Meanwhile, DCP Prabhakar and Sub-inspector Chari, who is Ambi's friend, investigate the murders committed by Anniyan. In disguises, they discover clues left behind by Anniyan, which are the names of the punishments he meted out to his victims. Prabhakar is determined to bring Anniyan to justice as one of Anniyan's victims, Chockalingam, an errant catering contractor with the Indian Railways, was his elder brother. In a dramatic publicity stunt, Anniyan admits to the murders he committed when he appears amidst the public and the press at the Nehru Stadium. He explains the rationale behind them and says that only when every Indian is responsible and sincere will the country prosper on a par with developed nations. His methods draw both praise and criticism. Prabhakar tries to catch Anniyan, but he escapes.On investigating the recorded footage, Prabhakar discovers that Anniyan is Ambi and arrests him. Ambi is brutally interrogated and almost killed, triggering Anniyan's reappearance. Ambi's personality alternates between Ambi and Anniyan, resulting in ambiguity. He subdues Prabhakar as Anniyan, but begs for mercy as Ambi. Using CCTV, Chari secretly records the interrogation and uses it as evidence of Ambi's condition during his trial. Ambi is sentenced to psychotherapy in a mental hospital and will be eligible for release when cured.When Ambi is released two years later, his rigid adherence to protocol has diminished. He marries Nandini. While travelling on a train during their honeymoon, he notices a man (an electrician who was indirectly responsible for his sister's death several years ago) drinking amidst fellow passengers. Suffering a relapse, he transforms into Anniyan and throws the man off the train, killing him. However, he hides the incident from Nandini, indicating that he has successfully blended his personalities into one instead of eradicating them."
}