{
    "id": "0418880",
    "localized title": "Mere Jeevan Saathi",
    "cast": [
        "Akshay Kumar",
        "Karisma Kapoor",
        "Ameesha Patel",
        "Gulshan Grover",
        "Ashish Vidyarthi",
        "Maya Alagh",
        "Alok Nath",
        "Rakesh Bedi",
        "Arun Bali",
        "Gajendra Chauhan",
        "Razak Khan",
        "Asha Patel",
        "Kamal Chopra",
        "Jaani Karan",
        "Prithvi Zutshi"
    ],
    "genres": [
        "Drama",
        "Music",
        "Romance"
    ],
    "runtimes": "129",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Malaysia:U",
        "New Zealand:M",
        "South Africa:10",
        "South Africa:PG::(DVD rating)",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "03 Feb 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzlmNmYyNTctNGEwYS00NGE4LTgwMmYtMDQxYzEzOWJmMDhkXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0418880",
    "plot outline": "Back in college, Natasha was obsessed with Vicky, who has become a successful rock star. Nothing ever happened between them, however. At the time, Vicky was in love with Anjali, who one fateful night suffered a great loss because of him. Now Natasha is the owner of a music label and has the power to make Vicky a global phenomenon. While Vicky, who is still with Anjali, wants to keep things professional, Natasha isn't about to take no for an answer.",
    "languages": "Hindi",
    "title": "Mere Jeevan Saathi",
    "kind": "movie",
    "directors": "Suneel Darshan",
    "writers": [
        "Suneel Darshan",
        "",
        "Robin Bhatt",
        "",
        "K.K. Singh",
        "",
        "Ravi Shankar Jaiswal"
    ],
    "producers": [
        "Suraj Prakash",
        "Ravi Sarin",
        "Rajesh Shah"
    ],
    "composers": [
        "Salim Merchant",
        "Shravan Rathod",
        "Nadeem Saifi"
    ],
    "cinematographers": "W.B. Rao",
    "editors": "Sanjay Sankla",
    "costume designers": "Manish Malhotra",
    "make up department": "Nanne Khan",
    "production managers": "M. Riaz",
    "assistant directors": [
        "Ankit Jain",
        "Susheel Rankawat"
    ],
    "sound department": [
        "Ameet Ahire",
        "Nikhil v Pathare",
        "M. Riaz"
    ],
    "stunts": "Abbas Ali Moghul",
    "camera department": "Piyush Acharya",
    "casting department": "Ravi Sarin",
    "music department": [
        "Abhijeet",
        "Amin Akhtar",
        "Alisha Chinai",
        "Udit Narayan",
        "Sonu Nigam",
        "Sameer",
        "Kumar Sanu",
        "Sadhana Sargam",
        "Shaan",
        "Tabun Sutradhar",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Mehul Gadani",
        "Raju Khan",
        "Siddharth Pande"
    ],
    "akas": [
        "Suneel Darshan's Mere Jeevan Saathi (India, Hindi title)",
        "My Life Partner (World-wide, English title)",
        "Размолвка (Russia)"
    ],
    "writer": [
        "Suneel Darshan",
        "Robin Bhatt",
        "K.K. Singh"
    ],
    "director": "Suneel Darshan",
    "production companies": [
        "NH Studioz",
        "Narendra Hirawat & Co"
    ],
    "distributors": [
        "NH Studioz",
        "Narendra Hirawat & Co"
    ],
    "plot": [
        "Back in college, Natasha was obsessed with Vicky, who has become a successful rock star. Nothing ever happened between them, however. At the time, Vicky was in love with Anjali, who one fateful night suffered a great loss because of him. Now Natasha is the owner of a music label and has the power to make Vicky a global phenomenon. While Vicky, who is still with Anjali, wants to keep things professional, Natasha isn't about to take no for an answer.",
        "Vicky, Natasha, and Anjali used to study in the same college in India and knew each other. While Vicky only loved Anjali, he was unaware that Natasha loved him with all her heart. Natasha did manage to bag a date with Vicky, however, she could not keep the appointment as her dad was killed that very same day in an automobile accident. Years later, Vicky and Anjali are very much in love, and Vicky makes a living as a rock-star. Vicky's career gets a boost when he is invited to the U.S. to meet the owner of Angel Music, who are interested in sponsoring him in a major way. He travels to U.S. and it is here that he meets with the owner - none other than Natasha herself. Their meeting is passionately spent in bed for that one night. The next day, Natasha is quite sure that Vicky is in love with her. She even follows him back to India, only to find out that Vicky had had only a one night stand with her, and is still in love with Anjali. This knowledge does not deter Natasha at all, for she knows that when she sets her mind to get something, she ends up getting it - no matter what.::rAjOo (gunwanti@hotmail.com)",
        "Vicky is a popular pop star singer and hopes to get promoted one day. However, he is in love with one of his popular music fan, Anjali and hopes to marry her soon. Luck seems to be in his favor, when one day a music company from Canada called the Angel International Music, gives Vicky the opportunity to do live stage shows. Not wanting to miss this opportunity he accepts the proposal and travels to Canada with the encouragement of Anjali to complete his first music assignment. However, he manages to meet with the owner of Angel International Music, Natasha. They are former college friends and she had a brief infatuation with him at one point and gives her heart to him ever since. Vicky, with the help of Natasha, becomes a singing sensation. She invites him to her home where they both had physical intimacy. Vicky feels guilty for what he did but he cannot leave Natasha since she is attributed to his success. He travels back to India and Natasha follows him there only to create misunderstanding between Vicky and Anjali. Later on she comes to know that Vicky only loves Anjali and doesn't have any feelings for her but she is not willing to accept that and hopes one day Vicky will become affectionate towards her and she shall continue to wait for that day.::gavin (gunmasterM@hotmail.com)"
    ]
}