{
    "id": "0449189",
    "localized title": "Banaras: A Mystic Love Story",
    "original title": "Banaras",
    "cast": [
        "Urmila Matondkar",
        "Ashmit Patel",
        "Dimple Kapadia",
        "Raj Babbar",
        "Naseeruddin Shah",
        "Akash Khurana",
        "Arif Zakaria",
        "Javed Khan Amrohi",
        "Rajeev Mishra",
        "Chetana Das",
        "Meenal Patel",
        "Aditi Pratap",
        "Tara"
    ],
    "genres": [
        "Musical",
        "Drama"
    ],
    "runtimes": "122",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "United Kingdom:PG",
    "original air date": "07 Apr 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjI1MjI5ZTUtNTMxMC00MjRkLTg5OWYtOTZkODJmOGUwODg3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0449189",
    "plot outline": "Shwetambri Nath lives a wealthy lifestyle in the holy city of Banaras in India with her mom, Gayetri, and dad, Mahendra. She is now of marriageable age and has a young man, Satpal Shukla, who is also the Police Inspector in the area, who would like to marry her. But Shwetambri is attracted to an orphan, Soham, of a lower caste who lives with a woman called Dadi who is a sweeper by profession. Nevertheless, Shwetambri continues to meet with Soham on the pretext of learning music, and introduces him to her parents, who instantly disapprove of him. When Shwetambri refuses to marry anyone else, her parents relent and get her formally engaged to Soham, especially after learning that he may not be of a lower caste but of an unknown caste and has no blood relationship with Dadi. Shortly before the marriage takes place, Shwetambri's life is turned upside down when Satpal informs her that Soham has been killed. In her grief, she loses her mind and becomes a loner. Her dad asks a childhood friend, a Psychiatrist from Boston, USA, Dr. Gopal Bhattacharya, to treat her. The doctor finds out that Shwetambri is possibly hallucinating as she talks as if Soham were still alive, and also of meeting and speaking with a holy man named Babaji, who has been deceased for hundreds of years. Quite unknown to the doctor, Shwetambri already knows who is responsible for Soham's death, and it is with this knowledge that she leaves Banaras and goes to Bombay, and gains a solid reputation as a spiritual healer. Years later the past comes to re-visit her when she is asked to return home to meet her dying father. The question is will Shwetambri return to Banaras, and will we ever know who has she identified as Soham's killer?",
    "languages": "Hindi",
    "title": "Banaras",
    "kind": "movie",
    "directors": "Pankaj Parashar",
    "writers": [
        "Javed Siddiqui",
        "",
        "L.C. Singh"
    ],
    "producers": [
        "L.C. Singh",
        "Manorama Singh",
        "Swati Singh"
    ],
    "composers": "Himesh Reshammiya",
    "cinematographers": "Nirav Shah",
    "editors": "Aseem Sinha",
    "editorial department": [
        "Praveen Angre",
        "Ken Metzker",
        "S. Raghunath Varma"
    ],
    "costume designers": [
        "Theia Bomanbehran",
        "Ameira Punvani",
        "Pooja Sarin",
        "Reza Shariffi"
    ],
    "production managers": "Rameshchandra Yadav",
    "assistant directors": [
        "Yashwant Giri",
        "Gambhir Monica",
        "Sohil Shah"
    ],
    "art department": [
        "Martand Mishra",
        "Mihir Shah",
        "Udai Prakash Singh"
    ],
    "sound department": "Santosh Verma",
    "visual effects": [
        "Ken Metzker",
        "P. Mohan",
        "Rajiv Raghunathan",
        "Rajeev Rajasekharan",
        "Prasad Sutar",
        "Jayadev Tiruveaipati"
    ],
    "camera department": "Jagdish Chauhan",
    "music department": [
        "Sanjeev Abhyankar",
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Pranab Kumar",
        "Sonu Nigam",
        "Himesh Reshammiya",
        "Sailesh",
        "Sameer",
        "Aamir Shaikh",
        "Abhijit Swant",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Hardik Bhatt",
        "Saroj Khan",
        "Akash Patel",
        "Devang Shah",
        "Shamsher Walia"
    ],
    "akas": [
        "Ek Dhun Banaras Kee (India, Hindi title)",
        "Banaras: A Mystic Love Story (India, English title)"
    ],
    "writer": [
        "Javed Siddiqui",
        "L.C. Singh"
    ],
    "director": "Pankaj Parashar",
    "production companies": "Setu Creations",
    "distributors": [
        "Pacific Invesment Corporation",
        "Pacific Invesment Corporation"
    ],
    "plot": [
        "A mystic love story... between two people of different castes... set in the oldest living city on Earth...",
        "Shwetambri Nath lives a wealthy lifestyle in the holy city of _Banaras_ (qv) in India with her mom, Gayetri, and dad, Mahendra. She is now of marriageable age and has a young man, Satpal Shukla, who is also the Police Inspector in the area, who would like to marry her. But Shwetambri is attracted to an orphan, Soham, of a lower caste who lives with a woman called Dadi who is a sweeper by profession. Nevertheless, Shwetambri continues to meet with Soham on the pretext of learning music, and introduces him to her parents, who instantly disapprove of him. When Shwetambri refuses to marry anyone else, her parents relent and get her formally engaged to Soham, especially after learning that he may not be of a lower caste but of an unknown caste and has no blood relationship with Dadi. Shortly before the marriage takes place, Shwetambri's life is turned upside down when Satpal informs her that Soham has been killed. In her grief, she loses her mind and becomes a loner. Her dad asks a childhood friend, a Psychiatrist from Boston, USA, Dr. Gopal Bhattacharya, to treat her. The doctor finds out that Shwetambri is possibly hallucinating as she talks as if Soham were still alive, and also of meeting and speaking with a holy man named Babaji, who has been deceased for hundreds of years. Quite unknown to the doctor, Shwetambri already knows who is responsible for Soham's death, and it is with this knowledge that she leaves _Banaras_ (qv) and goes to Bombay, and gains a solid reputation as a spiritual healer. Years later the past comes to re-visit her when she is asked to return home to meet her dying father. The question is will Shwetambri return to _Banaras_ (qv), and will we ever know who has she identified as Soham's killer?::rAjOo (gunwanti@hotmail.com)"
    ]
}