{
    "id": "0465376",
    "localized title": "Aisa Kyon Hota Hai?",
    "cast": [
        "Rati Agnihotri",
        "Amit",
        "Gopi Bhalla",
        "Mehul Bhojak",
        "Megha Chatterji",
        "Dominic Emmanuel",
        "Avtar Gill",
        "Anisha Hinduja",
        "Mitra Joshi",
        "Johny Lever",
        "Akanksha Malhotra",
        "Shruti Malhotra",
        "Manish Mathur",
        "Rachana Maurya",
        "Amit Singh",
        "Aryan Vaid"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Romance"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "original air date": "17 Feb 2006 (India)",
    "imdbID": "0465376",
    "plot outline": "Delhi-based Kiran gets married to Vivek, and after a short period of time he leaves her to re-locate to America, never to return, leaving her to bring up her son, Raj, on her own. She eventually finds out that Vivek had never loved her but was forced to marry her due to an inheritance clause in his late father's will. She never told Raj about his dad as she wanted him to grow up without hating him. Years later Raj has grown up, attends Dominic Savio College and is on the basketball team. Kiran is very proud of her son but does not know that he has been having unprotected sex with a number of fellow-collegians, including Mallika and Pallavi, but plans to marry Tanvi Hyder Ali Khan. Amongst growing anger and violence against innocent Muslims, Kiran must now face the truth that her son may well turn out to be like his father and abandon Mallika; while Raj must come to terms that Tanvi is not in love with him but his best friend, Azad - and the fact that he is HIV positive.",
    "languages": "Hindi",
    "title": "Aisa Kyon Hota Hai?",
    "kind": "movie",
    "directors": "Ajay Kanchan",
    "producers": "Mahesh Bhatt",
    "composers": "Tausif Akhtar",
    "cinematographers": "Rajan Kinagi",
    "editors": "Ashfaq Makrani",
    "assistant directors": "Kamal b Yadav",
    "sound department": "Sreejesh",
    "music department": [
        "Tausif Akhtar",
        "Sunidhi Chauhan",
        "Cherryl",
        "Kunal Ganjawala",
        "Shreya Ghoshal",
        "Kumar Kanchan",
        "Sonu Nigam",
        "Alka Yagnik"
    ],
    "akas": "Aisa Kyon Hota Hai? (India)",
    "director": "Ajay Kanchan",
    "production companies": "Vishesh Films",
    "plot": [
        "A single mother contend with her playboy son's newly diagnosed case of HIV infection.",
        "Delhi-based Kiran gets married to Vivek, and after a short period of time he leaves her to re-locate to America, never to return, leaving her to bring up her son, Raj, on her own. She eventually finds out that Vivek had never loved her but was forced to marry her due to an inheritance clause in his late father's will. She never told Raj about his dad as she wanted him to grow up without hating him. Years later Raj has grown up, attends Dominic Savio College and is on the basketball team. Kiran is very proud of her son but does not know that he has been having unprotected sex with a number of fellow-collegians, including Mallika and Pallavi, but plans to marry Tanvi Hyder Ali Khan. Amongst growing anger and violence against innocent Muslims, Kiran must now face the truth that her son may well turn out to be like his father and abandon Mallika; while Raj must come to terms that Tanvi is not in love with him but his best friend, Azad - and the fact that he is HIV positive.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Delhi-based Kiran gets married to U.S.-based Vivek and both get intimate. Shortly thereafter Vivek returns to the U.S. and refuses to talk to Kiran, who gives birth to a son and names him Raj. She subsequently finds out that Vivek never loved her but got married to her just to fulfill an inheritance clause in his later father's will. She decides not to tell Raj about his dad's real identity.Years later Raj, a star basketball player, has grown up hating men who leave their families. He also speaks out against Bhagwan Shri Ram who had abandoned his pregnant wife; Bhagwan Shri Buddh, who had abandoned his family; as well as Lord Jesus Christ, who had abandoned his aging parents.Raj has numerous unprotected affairs with fellow-collegians, including Mallika and Pallavi. When Mallika gets pregnant, he decides to ditch her and instead starts an affair with new-comer, Tanvi Hyder Ali Khan.Then riots break out between Hindus and Muslims, and a son of a local politician, Ronnie, along with his men start hunting down innocent Muslims, and one of Ronnie's targets is none other than Tanvi. With local Police Inspector Premraj Bhatt, a displaced Kashmiri Pandit, who blames Muslims for his plight, refusing to act, Kiran takes it upon herself to try and save Tanvi, while Raj is concerned about Tanvi's safety, he gets devastating news that he may be HIV positive and that Tanvi is actually in love with his best friend, Azad."
}