{
    "id": "0475627",
    "localized title": "Shikhar",
    "cast": [
        "Ajay Devgn",
        "Shahid Kapoor",
        "Bipasha Basu",
        "Amrita Rao",
        "Jawed Sheikh",
        "John Abraham",
        "Ash Chandler",
        "Manoj Joshi",
        "Ahmed Khan",
        "Akhil Mishra",
        "Akhilendra Mishra",
        "Farha Naaz",
        "Nishad Raj Rana",
        "Sunil Rege",
        "Sushant Singh",
        "Jaywant Wadkar",
        "Raj Zutshi"
    ],
    "genres": "Drama",
    "runtimes": "162",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:U",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "30 Dec 2005 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMmQzYzZlYzAtOGY1Ni00NDU3LTkzMjUtZmY4N2Y2MmI4ZDM0XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0475627",
    "plot outline": "How far can greed take a man? Can the 'greens' ever fight the money and might of the builders lobby? Can nature ever win over the bulldozer? These are the riveting issues raised by Shikhar. Pitted against each other in this battle of man vs nature are two different but equally powerful protagonists. Gaurav Gupta (aka GG) is a man who started with nothing and now believes that only money can fuel his ambitions. While Guruji, to the manor born, believes that wealth means nothing if not used for society. Caught in the tussle between the two is the unworldly Jaidev Vardhan, who while respecting his father's philosophy, falls hook, line and sinker for GG's gilt-edged dreams. While Guruji hopes that Jai will return to his roots, GG uses the glamorous Natasha to bewitch Jai and the unscrupulous politician Amrit Patil, to exploit the tribal into selling their lands. Madhavi watches the man she loves being carried away in to a world of wine, women and wealth. If Shikhar is the Pinnacle of good deeds and thoughts, Shikhar is also the height of ambition and greed. Which peak will Jai choose to scale in this battle of man vs. nature?",
    "languages": "Hindi",
    "title": "Shikhar",
    "kind": "movie",
    "directors": "John Mathew Matthan",
    "writers": [
        "Dr. Bodhisattva",
        "",
        "Manohar Iyer",
        "",
        "John Mathew Matthan",
        "",
        "Chandrashekhar Rajit",
        "",
        "Sameer",
        "",
        "Anita Sarkar",
        "",
        "C.K. Raajaa Chandra Sekar",
        "",
        "Viju Shah",
        "",
        "Mani Shankar",
        "",
        "Sudhakar Sharma",
        "",
        "Abbas Tyrewala"
    ],
    "producers": [
        "John Mathew Matthan",
        "Kulthep Narula",
        "Rachvin Narula"
    ],
    "composers": "Viju Shah",
    "cinematographers": "Apurba Kishore Bir",
    "editors": "Ajoy Varma",
    "costume designers": [
        "Lovleen Bains",
        "Shabinaa Khan"
    ],
    "make up department": [
        "Deepak P. Bhatte",
        "Harish Wadhone"
    ],
    "production managers": "Rama Rao",
    "assistant directors": [
        "Lakshmipriya Devi",
        "Pooja Gujral",
        "Gaurav Gupte",
        "Puneet",
        "Janani Ravichandran",
        "Vinay Waikul"
    ],
    "sound department": "Subir Kumar Das",
    "visual effects": [
        "Avik Banerjee",
        "Vinay Singh Chuphal",
        "P. Mohan",
        "Rohit Sardesai",
        "Chandrakant Shenoy",
        "Prasad Sutar"
    ],
    "stunts": [
        "Javed Karim",
        "Hiralal Yadav"
    ],
    "camera department": [
        "Navin Gadkari",
        "Mahendra Samanta"
    ],
    "music department": [
        "Ash Chandler",
        "Sunidhi Chauhan",
        "Subir Kumar Das",
        "Rohit Kulkarni",
        "Krishnakumar Kunnath",
        "Udit Narayan",
        "Rakesh Pandit",
        "Sadhana Sargam",
        "Jagjit Singh",
        "Alka Yagnik"
    ],
    "script department": "Maithili Kaishap",
    "miscellaneous": [
        "Suvahhdan Angre",
        "Sanjay Bhattacharya",
        "Vaibhavi Merchant",
        "Ramachandran Korattiyapillil Narayan Nair",
        "Deepak Sawakhande",
        "Bharat S. Shah"
    ],
    "thanks": "Bharat S. Shah",
    "akas": [
        "Jeevansh (India, Hindi title)",
        "Неслучайные знакомые (Russia)"
    ],
    "writer": [
        "Dr. Bodhisattva",
        "Manohar Iyer",
        "John Mathew Matthan"
    ],
    "director": "John Mathew Matthan",
    "production companies": "Cinematt Pictures",
    "distributors": "Aagaaz Entertainment",
    "other companies": [
        "Benetone Films",
        "HR Enterprises",
        "Super Cassettes Industries Limited (T-Series)",
        "Tips Cassettes & Records Co."
    ],
    "plot": [
        "Jai Vardhan is influenced by an overambitious man. He is unable to differentiate the good from the bad and is carried over into a world full of women and wealth.",
        "How far can greed take a man? Can the 'greens' ever fight the money and might of the builders lobby? Can nature ever win over the bulldozer? These are the riveting issues raised by _Shikhar_ (qv). Pitted against each other in this battle of man vs nature are two different but equally powerful protagonists. Gaurav Gupta (aka GG) is a man who started with nothing and now believes that only money can fuel his ambitions. While Guruji, to the manor born, believes that wealth means nothing if not used for society. Caught in the tussle between the two is the unworldly Jaidev Vardhan, who while respecting his father's philosophy, falls hook, line and sinker for GG's gilt-edged dreams. While Guruji hopes that Jai will return to his roots, GG uses the glamorous Natasha to bewitch Jai and the unscrupulous politician Amrit Patil, to exploit the tribal into selling their lands. Madhavi watches the man she loves being carried away in to a world of wine, women and wealth. If _Shikhar_ (qv) is the Pinnacle of good deeds and thoughts, _Shikhar_ (qv) is also the height of ambition and greed. Which peak will Jai choose to scale in this battle of man vs. nature?::SoMeONE",
        "Businessman Srinath Vardhan lives a wealthy lifestyle in Bombay along with his wife and a school-going son, Jaidev. While returning from Mahabuleshwar, their car meets with an accident, and Mrs. Vardhan passes away. Adivasis look after Srinath and Jaidev and nurse them back to health. A grateful Srinath decides to settle in the region, and try to assist Adivasis to adapt to a better lifestyle. Years later, Jaidev has grown up, and Srinath decides to entrust the family business to him. Srinath will soon come to know that Jaidev will fall into bad company, will take to alcohol, women, adapt to a lifestyle Srinath has learned to frown upon, will befriend and collaborate with Srinath's opponents, and as such create circumstances that will pit father and son against each other.::rAjOo (gunwanti@hotmail.com)"
    ]
}