{
    "id": "0476729",
    "localized title": "Aksar",
    "cast": [
        "Emraan Hashmi",
        "Udita Goswami",
        "Dino Morea",
        "Tara Sharma",
        "Rajat Bedi",
        "Till Dilumière",
        "Hendrik Greis",
        "Ameya Hunaswadkar",
        "Suresh Menon",
        "Firdaus Mevawala",
        "Himesh Reshammiya",
        "Sunita"
    ],
    "genres": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "United Kingdom:15"
    ],
    "original air date": "03 Feb 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTNjNWQ2YWUtODQ4Ny00MzM5LTk1NGYtNmFkNTNlZjFkZTZhXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "0476729",
    "plot outline": "Rajveer Singh is of East Indian origin and lives a very wealthy lifestyle in London, England along with his wife, former Indian model, Sheena. He finds her devoted but a little bit too possessive, and since they have signed a prenuptial agreement, he cannot divorce her. When Ricky comes to London for a photo shoot, he pays him Thirty Lakh rupees to seduce Sheena, Ricky agrees to do that as he is in debt. For this purpose Ricky is permitted to live in the Singh's mansion. At first Sheena shows hatred for Ricky, as he had ditched her friend, Nisha, but she subsequently succumbs to Ricky's charm. Rajveer then has a change of heart and finds he still loves Sheena, so he decides to pay Ricky Fifty Lakh rupees - this time to leave them - but Ricky refuses. Rajveer makes it up to Sheena by celebrating her birthday lavishly. It is on the night of the birthday that Ricky will be murdered, and this case will be assigned to Chief Investigating Officer Steve Bakshi - who has two suspects - Rajveer himself and the second one being none other than Sheena. Watch what happens when Steve decides to arrest Sheena for Ricky's murder.",
    "languages": "Hindi",
    "title": "Aksar",
    "kind": "movie",
    "directors": "Anant Mahadevan",
    "writers": [
        "Abbaas Hierapurwala",
        "",
        "Anant Mahadevan"
    ],
    "producers": [
        "Shyam Bajaj",
        "Varun Bajaj",
        "Ashwani Chopra"
    ],
    "composers": "Himesh Reshammiya",
    "cinematographers": "Rajkumar K.",
    "editorial department": [
        "Prakash Nikharge",
        "Jitendra Shah"
    ],
    "art directors": "Chokkas Bhaardwaj",
    "assistant directors": [
        "Nandu Achrekar",
        "Ganesh Modak"
    ],
    "sound department": "Prakash Gupta",
    "visual effects": "Pavan Kumar Potluri",
    "camera department": [
        "Araj Khan",
        "Bhavesh Rawal"
    ],
    "location management": "Vikrant Chopra",
    "music department": [
        "Bhavesh Bhatt",
        "Sunidhi Chauhan",
        "Jayesh Gandhi",
        "Kunal Ganjawala",
        "Tulsi Kumar",
        "Krishnakumar Kunnath",
        "Himesh Reshammiya",
        "Sameer"
    ],
    "miscellaneous": [
        "Remo D'Souza",
        "Shabina Khan",
        "Bharat S. Shah"
    ],
    "akas": [
        "Often (India, English title)",
        "Often (Canada, English title)",
        "Often (United States)",
        "Погибший из-за любви (Russia)"
    ],
    "writer": [
        "Abbaas Hierapurwala",
        "Anant Mahadevan"
    ],
    "director": "Anant Mahadevan",
    "production companies": "Siddhi Vinayak Creations",
    "distributors": [
        "Siddhi Vinayak Creations",
        "Venus Worldwide Entertainment",
        "Hotstar"
    ],
    "other companies": "Super Cassettes Industries Limited (T-Series)",
    "plot": [
        "A love triangle where everybody is blackmailing the other two gets a nasty upset when one of them is suddenly found murdered.",
        "Rajveer Singh is of East Indian origin and lives a very wealthy lifestyle in London, England along with his wife, former Indian model, Sheena. He finds her devoted but a little bit too possessive, and since they have signed a prenuptial agreement, he cannot divorce her. When Ricky comes to London for a photo shoot, he pays him Thirty Lakh rupees to seduce Sheena, Ricky agrees to do that as he is in debt. For this purpose Ricky is permitted to live in the Singh's mansion. At first Sheena shows hatred for Ricky, as he had ditched her friend, Nisha, but she subsequently succumbs to Ricky's charm. Rajveer then has a change of heart and finds he still loves Sheena, so he decides to pay Ricky Fifty Lakh rupees - this time to leave them - but Ricky refuses. Rajveer makes it up to Sheena by celebrating her birthday lavishly. It is on the night of the birthday that Ricky will be murdered, and this case will be assigned to Chief Investigating Officer Steve Bakshi - who has two suspects - Rajveer himself and the second one being none other than Sheena. Watch what happens when Steve decides to arrest Sheena for Ricky's murder.::rAjOo (gunwanti@hotmail.com)",
        "Ricky a fashion photographer who likes to flirt with women he gets call from Sheena Roy asking to meet he as her friend Nisha tried to commit suicide as he dumped her the argument leads in Sheena breaking Ricky's expensive camera.Three years later Ricky is holding an exhibition of his art where a millionaire Rajveer Singh purchases his art for 30 Lakhs but Rajveer has a reason of paying such huge amount.Rajveer wants to divorce his wife whose none other then Sheena and wants Ricky to seduce her and make her fall in love with him so that the can accumulate her wealth after divorce.Ricky reaches London an as per the plan makes Sheena fall in love with her but she refuses to divorce Rajveer who now wants Ricky to return back to India but he refuses.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Ricky (Emraan Hashmi) is a leading fashion photographer, who carries his heart on his sleeve. He's an absolute womanizer. The film begins with Ricky getting a call from Sheena (Udita Goswami), who asks him to meet her in a gym. Once there, the two have a showdown since Ricky had used and dumped Sheena's friend Nisha (Tara Sharma). A heartbroken Nisha had even contemplated attempting suicide.Three years later, Ricky is about to hold an exhibition of his creations when a millionaire walks in and buys the entire lot even before the exhibition has begun. The millionaire, Rajveer aka Raj (Dino Morea), has a pre-condition: Ricky should make Raj's wife Sheena fall in love with him (Ricky). Ricky is perplexed, for he fails to understand why a husband would hire someone to have an affair with his wife. But Raj explains that he wants Sheena to divorce him and this would be possible only if she fell in love with another man.Ricky flies to London, where Raj and Sheena live in a splendid mansion, and gets to work. After some setbacks Sheena and Ricky begin a relationship. The plan seems to be working. Raj catches Ricky and Sheena in bed, but Sheena is unfazed. She refuses to divorce Raj and tells him she is intent on continuing with her relationship with Ricky. Raj is stunned that his plan has failed.Realizing that Sheena wouldn't divorce him, Raj asks Ricky to return to India. But now Ricky refuses since he is enjoying his luxurious lifestyle with Sheena. Raj is stunned again. Nisha attends a party in Raj's mansion. After the party, Nisha is crying outside claiming that she was raped by Ricky. The next morning, Sheena confronts Ricky and in a fit of rage, brutally murders him with a sword.A police investigation begins, and Sheena is the prime suspect. As she is being arrested, Raj suddenly confesses to the murder. When Sheena meets him in jail, he transfers all his property to her name. Coincidentally a stress ball belonging to Raj is with the policeman investigating the case. As the policeman plays with it a hidden camera falls out. Sheena's crime is discovered in the recording found on the camera. She is arrested and she transfers Raj's property back to him. It turns out that the entire series of events was carefully planned by Raj who is actually in love with Nisha.In the end Raj gives Nisha the property papers as a token of his love. As the bewildered policeman stares at Raj and Nisha in the car, Raj throws his 'tension ball' at him and casually says,\"Aisa to aksar hota hai\" (This happens often)."
}