{
    "id": "0494290",
    "localized title": "Vivah",
    "cast": [
        "Shahid Kapoor",
        "Amrita Rao",
        "Anupam Kher",
        "Alok Nath",
        "Seema Biswas",
        "Samir Soni",
        "Lata Sabharwal",
        "Manoj Joshi",
        "Amrita Prakash",
        "Dinesh Lamba",
        "Ameya Pandya",
        "Jatin Sial",
        "Aditi Bhatia",
        "Shriya Sharma",
        "Mohnish Bahl",
        "Mreenal Deshraj",
        "Yusuf Hussain",
        "Anita Wahi",
        "Chirag Channa",
        "Jaspreet Singh",
        "Goolshan Mazdiasni",
        "Maariayah Khatri"
    ],
    "genres": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:U::(self-applied)",
        "Italy:T",
        "Singapore:PG",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "10 Nov 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjNjZWViNTYtYzAzZC00OTY2LWIzMTMtNTcxNzQzNzNiYjc4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0494290",
    "plot outline": "After the passing away of his wife, wealthy Delhi-based businessman, Harishchandra, took it upon himself to bring up two sons, Sunil and Prem. When they grew up he got Sunil married to Bhavna, and let Prem complete his education, even let him study abroad. Soon Sunil and Bhavna gave birth to a son, Rahul. When Bhagat told him that he had found a suitable match for Prem in Poonam, the niece of Krishnakant, a fruit merchant from Madhupur, Uttar Pradesh, the family traveled there, met with Krishnakant, his wife, Rama, and daughter, Rajni, and instantly approved of Poonam. Prem and Poonam also approved of each other, the Astrologer was consulted and a marriage was scheduled to take place in six months time. Shortly thereafter the engagement took place. The two families met again in Som Sarovar, Nainital, to let everyone get acquainted, and when Prem got his first contract from Japan, Krishnakant took his family to Delhi to celebrate. With the deadline for the marriage drawing close, both families start their respective preparations - not knowing that fate may have other plans in store for this young couple.",
    "languages": "Hindi",
    "title": "Vivah",
    "kind": "movie",
    "directors": "Sooraj R. Barjatya",
    "writers": [
        "Aash Karan Atal",
        "",
        "Sooraj R. Barjatya",
        "",
        "Raghvendra Singh"
    ],
    "producers": [
        "Ajit Kumar Barjatya",
        "Kamal Kumar Barjatya",
        "Rajat A. Barjatya",
        "Rajkumar Barjatya",
        "Sooraj R. Barjatya",
        "Ravi Sarin"
    ],
    "composers": "Ravindra Jain",
    "cinematographers": "Harish Joshi",
    "editors": "V.N. Mayekar",
    "editorial department": [
        "Shekar Svdc",
        "Jespal Nadar"
    ],
    "art directors": "Sanjay Dhabade",
    "costume designers": "Anna Singh",
    "make up department": "Shailesh Jukar",
    "production managers": [
        "Krishnan Ramanathan",
        "Santosh B. Wanjale"
    ],
    "assistant directors": [
        "Vaibhav Anand",
        "Vidhi Kasliwal",
        "Siddartha P. Malhotra",
        "Raghvendra Singh"
    ],
    "art department": "Rajan Kumar",
    "sound department": [
        "Vijay Angre",
        "Matias Caldarella",
        "Jitendra Chaudhary",
        "Sajjan Choudhary",
        "Subir Kumar Das",
        "Anup Dev",
        "Vijay Kumar",
        "Karnail Singh",
        "Shankar Singh"
    ],
    "visual effects": [
        "Mahesh Deshpande",
        "Sukhjinder Singh Khaira",
        "Rohit Korgaonkar",
        "P. Mohan",
        "Rajiv Raghunathan",
        "Rohit Sardesai",
        "Sarika Salian",
        "Chandrakant Shenoy",
        "Prasad Sutar",
        "Jayadev Tiruveaipati"
    ],
    "stunts": [
        "Sham Kaushal",
        "Moses"
    ],
    "camera department": [
        "Debasis Dutta",
        "Vishal Joshi",
        "Dhananjay Singh"
    ],
    "costume departmen": "Shabina Khan",
    "music department": [
        "Vijay Angre",
        "Subir Kumar Das",
        "Ravindra Jain",
        "Udit Narayan",
        "Aamir Shaikh"
    ],
    "miscellaneous": [
        "Jay Borade",
        "Navmeet Singh",
        "Anusha Srinivasan"
    ],
    "thanks": "Md Parvez Hossain",
    "akas": [
        "Parinayam (India, Telugu title)",
        "Vivah: Mein Herz bleibt dir treu (Germany)",
        "Il mio cuore dice sì (Italy)",
        "Помолвка (Russia)",
        "O Casamento (Brazil)"
    ],
    "writer": [
        "Aash Karan Atal",
        "Sooraj R. Barjatya",
        "Raghvendra Singh"
    ],
    "director": "Sooraj R. Barjatya",
    "production companies": "Rajshri Productions",
    "distributors": [
        "Rajshri Productions",
        "Rajshri Productions",
        "Star Plus"
    ],
    "plot": [
        "Poonam, a traditionally brought-up young woman, is to marry Prem, a groom chosen by her uncle. Poonam and Prem's faith and love are to be tested however, when an accident occurs and Poonam might be scarred for life.",
        "After the passing away of his wife, wealthy Delhi-based businessman, Harishchandra, took it upon himself to bring up two sons, Sunil and Prem. When they grew up he got Sunil married to Bhavna, and let Prem complete his education, even let him study abroad. Soon Sunil and Bhavna gave birth to a son, Rahul. When Bhagat told him that he had found a suitable match for Prem in Poonam, the niece of Krishnakant, a fruit merchant from Madhupur, Uttar Pradesh, the family traveled there, met with Krishnakant, his wife, Rama, and daughter, Rajni, and instantly approved of Poonam. Prem and Poonam also approved of each other, the Astrologer was consulted and a marriage was scheduled to take place in six months time. Shortly thereafter the engagement took place. The two families met again in Som Sarovar, Nainital, to let everyone get acquainted, and when Prem got his first contract from Japan, Krishnakant took his family to Delhi to celebrate. With the deadline for the marriage drawing close, both families start their respective preparations - not knowing that fate may have other plans in store for this young couple.::rAjOo (gunwanti@hotmail.com)",
        "Poonam (Rao) is an orphan, having come into her uncle Krishna Kant's (Alok Nath) household after her parents' death. He considers her a \"gift\", speaking of his aim in life being to nurture this daughter and to marry her off. Poonam lives with her Chacha(uncle) and Chachi (Seema Biswas) and their daughter Choti (Anjali Prakash). The aunt doesn't love Poonam much, because Poonam is prettier than Choti. However the loving Chacha arranges a match for Poonam with the son of a wealthy, industrialist family from Delhi. Where Prem (Shahid Kapoor) is the magnanimous bride-groom, who decides that he will spend a month of each year at his wife's parents' home, well-brought up Pooja is the perfect shudh Hindi speaking addition to the clan. The marriage day draws closer, but a fire in Krishna Kant's house will put Poonam and Prem's well-behaved love to the test . . .::Amodini"
    ],
    "synopsis": "Poonam (Amrita Rao) lost her parents, when she was very young. She was brought up by her uncle Krishna Kant (Alok Nath) and her aunt Rama (Seema Biswas). However, Rama is jealous of her and barely talks to her, since Poonam is more beautiful than her own daughter Rajni (Amrita Prakash), who is lively and friendly. Bhagat-ji (Manoj Joshi), a jeweller, and a friend of Krishna Kant, likes Poonam very much and decides to matchmake her with Prem (Shahid Kapoor), Mr. Harish Chandra's (Anupam Kher) son, as Bhagat-ji is friends with Mr. Harishchandra.\nMr. Harishchandra informs Prem of his plans to matchmake him, as he believes Prem is of proper age, young enough to adapt to someone else, and, Prem's brother, Sunil (Samir Soni), was about the same age when he married Bhavna (Lata Sabharwal). Prem, however, is hesitant to marry, since he thinks himself to be too young and wants to focus on his career first. Harishchandra convinces him to meet Poonam first. They visit Poonam's family and let Prem and Poonam to get to know each other. Though their first conversation is awkward, Prem and Poonam decide to get married, as they are instantly attracted to each other. The two families agree to meet each other again, so Prem and Poonam get the opportunity to know each other better. Krishna Kant invites Prem's family to their summer residence in Som Sarovar and Harishchandra accepts.Poonam anxiously awaits Prem to come to Som Sarovar, however, until Bhavna arranges a meeting between the two, they barely have the chance to talk to each other. After several carefree days, Harishchandra and his family has to leave again because of the family business, which leaves Poonam and Prem only the opportunity to communicate via telephone, internet or letter. Despite the distance between them, they grow closer and Prem, before going to a business trip to Japan, tells Poonam on the phone that he has fallen in love with her. When Prem comes back from Japan, Poonam is there to greet him on the airport, gets to spend some time at his house and finally returns to her own family on order to prepare for the wedding.However, two days before the actual wedding, a fire emerges at Krishna Kant's house. Even though Poonam runs out of the house in time, she realizes that Rajni is still inside and goes to save her. In this attempt Poonam gets heavily burnt. Prem, occupied with his own wedding preparations, is informed by Bhavna of Poonam's accident and goes to see his fiancee at the hospital. She is very unsure if Prem will marry her, now that she has been scarred. The doctor (Mohnish Behl) informs the family that there is hope, however the operation to save Poonam may be dangerous and Poonam will take much time to recover. Harishchandra arranges for specialists to be flown in from Delhi and Prem, despite her injury, still wishes to marry her and accepts her as a wife by bringing sindhoor to her at the hospital. The operation is successful and the wedding commences. They get married joyfully and enjoy their lives together as husband and wife."
}