{
    "id": "0495044",
    "localized title": "Saravana",
    "cast": [
        "T.R. Silambarasan",
        "Jyotika",
        "Prakash Raj",
        "Vivek",
        "Meghna Naidu",
        "Ravi Kale",
        "Krishna",
        "Devadarshini Chetan",
        "Nagesh"
    ],
    "genres": [
        "Action",
        "Romance"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United Kingdom:15",
    "original air date": "01 Feb 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZmYyYTNmMmYtYWJjNy00M2FlLTg4YTMtNDNlY2UyODFkYjM4XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR16,0,101,150_.jpg",
    "imdbID": "0495044",
    "plot outline": "Saravana (Silambarasan) and Krishna (Krishna) are close buddies in college. Saravana sees a video tape of Krishna's sister Sadhana (Jyothika) studying in London and falls in love with her. So to meet her, Saravana goes with Krishna to a village near Tirunelveli where he finds that there is a bloody war going on between two warring caste groups. Krishna's brother Soundarapandi (Prakash Raj) his wife and Krishna are killed by the rival group of Dorai Singam. However Saravana saves Sadhana and takes her to Chennai. Initially Sadhana is not accepted by Saravana's large family but slowly when they come to know about her background they support and love her. The rest of the film is how Saravana tries to help Sadhana to go back to London, and in the process eliminates the entire gang of Dorai Singam single-handedly.",
    "languages": "Tamil",
    "title": "Saravana",
    "kind": "movie",
    "directors": "K.S. Ravikumar",
    "writers": [
        "K.S. Ravikumar",
        "",
        "Sujatha"
    ],
    "producers": [
        "K.C.N. Chandrasekhar",
        "Amudha Durai Raj"
    ],
    "composers": "Srikanth Deva",
    "cinematographers": "Arthur Wilson",
    "editors": "K. Thanigachalam",
    "art directors": "Maniraaj",
    "visual effects": "Ramesh Karthikeyan",
    "stunts": "Kanal Kannan",
    "music department": "Naresh Iyer",
    "miscellaneous": [
        "Robert James",
        "Kalyan",
        "Pankaj Kothari",
        "Brinda Master"
    ],
    "akas": "Dangerous Khiladi 7 (India, Hindi title)",
    "writer": [
        "K.S. Ravikumar",
        "Sujatha"
    ],
    "director": "K.S. Ravikumar",
    "production companies": "Deivanai Movies",
    "distributors": "Sun TV",
    "other companies": "Maruti Cassettes",
    "plot": "_Saravana_ (qv) (Silambarasan) and Krishna (Krishna) are close buddies in college. _Saravana_ (qv) sees a video tape of Krishna's sister Sadhana (Jyothika) studying in London and falls in love with her. So to meet her, _Saravana_ (qv) goes with Krishna to a village near Tirunelveli where he finds that there is a bloody war going on between two warring caste groups. Krishna's brother Soundarapandi (Prakash Raj) his wife and Krishna are killed by the rival group of Dorai Singam. However _Saravana_ (qv) saves Sadhana and takes her to Chennai. Initially Sadhana is not accepted by _Saravana_ (qv)'s large family but slowly when they come to know about her background they support and love her. The rest of the film is how _Saravana_ (qv) tries to help Sadhana to go back to London, and in the process eliminates the entire gang of Dorai Singam single-handedly.::someone_276"
}