{
    "id": "0819777",
    "localized title": "Jigyaasa",
    "cast": [
        "Nassar Abdulla",
        "Rakesh Bedi",
        "Hrishitaa Bhatt",
        "Jaya Bhattacharya",
        "Divya Dwivedi",
        "Milind Gunaji",
        "Vikas Kalantri",
        "Kader Khan",
        "Sikandar Kharbanda",
        "Anupam Shyam",
        "Mukesh Tiwari",
        "Varsha Usgaonkar",
        "Ajay Kumar Verma"
    ],
    "genres": "Drama",
    "runtimes": "147",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "ins"
    ],
    "color info": "Color::(35 mm version)",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Argentina:13",
        "India:A",
        "Japan:R-15",
        "United States:Not Rated"
    ],
    "original air date": "10 Mar 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTI2MDM0NjU2MV5BMl5BanBnXkFtZTcwNjE5NzM0MQ@@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0819777",
    "plot outline": "Story of an innocent girl named Jigyaasa Mathur (Played by Hrishitaa Bhatt) who comes from a middle-class-family and daughter of a school teacher named Malini Mathur (Played by Varsha Usgaonkar). Malini is a woman with principles and emotions. Jigyaasa wants to become a Film Actress and her mother has no objections about it. But Jigyaasa has some other plans. Jigyaasa will go to any limits to reach her goal. Within a time span of five years. Jigyaasa reaches the top and is now India's highest paid Super star. A middle class innocent girl enters Bollywood. And dominates and manipulated the dark world of Bollywood. Based on some actual witnessed events. This roller-coaster ride of a girl's journey to achieve stardom is mixed with Humor, Emotions, Sex, Domination, Dirty Celebrity Gossips, Film-Politics, Abuse, Sadism, Betrayel, Naked-Mobile-Clippings, Drugs, Glamour, Back-Bitching, Molestations, Perversions, Underworld-Connections...All rolled into one!!!",
    "languages": [
        "Hindi",
        "Indian Sign Language"
    ],
    "title": "Jigyaasa",
    "kind": "movie",
    "directors": "Faisal Saif",
    "writers": [
        "Mehmood Ali",
        "",
        "Faisal Saif"
    ],
    "producers": "Raju Chand",
    "composers": "Ram Shanker",
    "cinematographers": [
        "Nadeem Khan",
        "Pappu Kumar Sahu",
        "Pramod Kumar Sahu"
    ],
    "editors": "Tirupathi Reddy",
    "art directors": "Hemant Kakirde",
    "costume designers": "Bhakti Joshi",
    "sound department": "Ashfaq Rentia",
    "miscellaneous": "Indramohan Pannu",
    "writer": [
        "Mehmood Ali",
        "Faisal Saif"
    ],
    "director": "Faisal Saif",
    "production companies": [
        "Chand Films",
        "Das Music"
    ],
    "distributors": "Madhu Videotec",
    "plot": [
        "Determined to be a star, _Jigyaasa_ (qv) offers her body to win the affections of influential producers and celebrities. But when showbiz success finally comes, is the price too great?",
        "Story of an innocent girl named _Jigyaasa_ (qv) Mathur (Played by Hrishitaa Bhatt) who comes from a middle-class-family and daughter of a school teacher named Malini Mathur (Played by Varsha Usgaonkar). Malini is a woman with principles and emotions. _Jigyaasa_ (qv) wants to become a Film Actress and her mother has no objections about it. But _Jigyaasa_ (qv) has some other plans. _Jigyaasa_ (qv) will go to any limits to reach her goal. Within a time span of five years. _Jigyaasa_ (qv) reaches the top and is now India's highest paid Super star. A middle class innocent girl enters Bollywood. And dominates and manipulated the dark world of Bollywood. Based on some actual witnessed events. This roller-coaster ride of a girl's journey to achieve stardom is mixed with Humor, Emotions, Sex, Domination, Dirty Celebrity Gossips, Film-Politics, Abuse, Sadism, Betrayel, Naked-Mobile-Clippings, Drugs, Glamour, Back-Bitching, Molestations, Perversions, Underworld-_Connections_ (qv)...All rolled into one!!!::Faisal Saif"
    ]
}