{
    "id": "0867145",
    "localized title": "Classmates",
    "cast": [
        "Prithviraj Sukumaran",
        "Indrajith Sukumaran",
        "Kavya Madhavan",
        "Narain",
        "Jayasurya",
        "Radhika",
        "Vijeesh",
        "Jagathi Sreekumar",
        "Balachandra Menon",
        "Shobha Mohan",
        "Suraj Venjaramoodu",
        "V.K. Sriraman",
        "Sukumari",
        "Anoop Chandran",
        "Suja Menon",
        "Anil Murali",
        "J. Pallassery",
        "Subbalakshmi"
    ],
    "genres": [
        "Drama",
        "Mystery",
        "Romance",
        "Thriller"
    ],
    "runtimes": "175",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "Aug 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWE2NTJiNTgtOTM0Zi00ZmY1LTgxZWYtNmJjZGM2YjVkMWI2XkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0867145",
    "languages": "Malayalam",
    "title": "Classmates",
    "kind": "movie",
    "directors": "Lal Jose",
    "writers": "James Albert",
    "producers": [
        "Prakash Harikrishnan",
        "P.K. Muraleedharan"
    ],
    "composers": "Alex Paul",
    "cinematographers": "Rajeev Ravi",
    "editors": "Ranjan Abraham",
    "art directors": "Gokul Das",
    "sound department": "Rajakrishnan M.R.",
    "stunts": "Mafia Sasi",
    "music department": [
        "Cicily",
        "Franko",
        "Renjini Jose",
        "Manjari",
        "Devin Powers",
        "Vidhu Prathap",
        "Jyotsna Radhakrishnan",
        "M.G. Sreekumar",
        "Sujatha",
        "Vayalar Sarathchandra Varma"
    ],
    "thanks": [
        "Azhagappan",
        "Lal",
        "Vineeth Sreenivasan"
    ],
    "akas": "Однокурсники (Russia)",
    "writer": "James Albert",
    "director": "Lal Jose",
    "distributors": "Lal Release",
    "plot": "College classmates meet for a 10-year reunion, which does not go as smoothly as planned. Love is discovered, friendships are broken and secrets about tragic events in the past are revealed.",
    "synopsis": "The film centers on a group of classmates who attended the same Chemistry class in their final year of college. Among them, Murali (Narain) is a singer and P. Sukumaran (Prithviraj) is a firebrand leader of the left-winged students union. Sukumaran's rival, Satheesan (Jayasurya), leads the opposite faction of student politics and is aided by his sidekick, Vasu (Vijeesh). Pius (Indrajith), a rich and spoiled brat of parents settled in the Gulf, is the campus Romeo and Sukumaran's best friend. Thara Kurup (Kavya Madhavan) is the daughter of the Member of the state Legislative Assembly (MLA) from Muvattupuzha; she is a dancer who regularly wins awards for the college with her performances.It was Murali's dream to have a ten-year reunion, but he mysteriously dies before the reunion can be organised. His parents, Professor Iyer (Balachandra Menon) and Lakshmi Teacher (Shobha Mohan), both teachers at the college, decide to fulfill their departed son's dream and bring his classmates together for a reunion. Sukumaran is now a diamond dealer based in Mumbai and is a divorcee. Satheesan is now an MLA, following his dreams to become a political leader, while Vasu continues to be his sidekick. Pius is now settled in the Middle East, while Thara, still unmarried, runs a dancing school.The coming together of these classmates is the occasion for them to relive the past and to discover how Murali died. When all are together, Razia (Radhika) arrives. Sukumaran commits a suicide and it is later discovered that he was, in fact, murdered."
}