{
    "id": "0937409",
    "localized title": "Majajan",
    "cast": [
        "Shabnam Chaudhry",
        "Shafqat Cheema",
        "Sardar Kamal",
        "Goshi Khan",
        "Sher Khan",
        "Sher Kumbher",
        "Rashid Mehmood",
        "Saima Noor",
        "Saud",
        "Madhiha Shah",
        "Shaan Shahid",
        "Iftikhar Thakur"
    ],
    "genres": "Drama",
    "runtimes": "140",
    "countries": "Pakistan",
    "country codes": "pk",
    "language codes": "pa",
    "color info": "Color",
    "sound mix": "Dolby Digital::(RCA Sound System)",
    "certificates": "United Kingdom:15",
    "original air date": "24 Mar 2006 (Pakistan)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDZhNTExOGEtMjZkZi00ODYyLWJjNGQtOTczNzhlYzM1MzFlXkEyXkFqcGdeQXVyMzc0NzU5MTc@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0937409",
    "plot outline": "A young son of a Landlord, \"Prince\" falls in love with a poor village belle. She knows that is no match for him but he on the other hand, adores Baba Bulleh Shah and believes that love knows no caste or creed and fights all obstacles that come in its way.",
    "languages": "Punjabi",
    "title": "Majajan",
    "kind": "movie",
    "directors": "Syed Noor",
    "writers": "Rukhsana Noor",
    "producers": [
        "Saima Noor",
        "Syed Noor"
    ],
    "composers": "Wajid A. Nashaad",
    "cinematographers": "Waqar Bokhari",
    "editors": [
        "Aqeel Ali Asghar",
        "Z.A. Zulfi"
    ],
    "sound department": "Javed Khan",
    "music department": [
        "Zulfiqar Ali",
        "M. Arshad",
        "Azra Jahan",
        "Rukhsana Noor",
        "Khawaja Pervez",
        "Aqeel Ahmed Ruby"
    ],
    "miscellaneous": "Khannu Samrat",
    "akas": "Majajan (Pakistan)",
    "writer": "Rukhsana Noor",
    "director": "Syed Noor",
    "production companies": [
        "Paragon Entertainment",
        "Saima Productions"
    ],
    "distributors": "Paragon Entertainment",
    "plot": "A young son of a Landlord, \"Prince\" falls in love with a poor village belle. She knows that is no match for him but he on the other hand, adores Baba Bulleh Shah and believes that love knows no caste or creed and fights all obstacles that come in its way.::Yasir Chaudhary",
    "synopsis": "Majajan is a love story Syed Noor says he \"made most passionately\". Inspired by the life of Baba Bulleh Shah and his 'ishq' with his 'murshad', the film is in its post-production and will be released on Eidul Fitr.Talking to The Nation Plus, the director of Majajan, showman Syed Noor said that he was a very romantic person. \"Hence, the film. \"When I read the verses of Baba Bulleh Shah I promised myself that I will make a film on the great sufi poet's 'ishq' and I was looking for an opportunity to do that. So, I discussed the story with my wife (Rukhsana Noor) who is also a writer. She converted it into a full-fledged script and finally I created Majajan.\" \"She (Saima) didn't compromise on quality, and spent lavishly on making Majajan a masterpiece,\" he said.Love knows no caste or creed, and it fights all obstacles and hindrances that come in its way. This is what Majajan is about. A Syedzada (played by Shan) falls in love with a poor village belle (Saima) who sings songs in the various village occasions. The lady knows that she belongs to a lower class and is no match for the Syedzada.The Syedzada, on the other hand, adores Baba Bulleh Shah and performs dhamal on his verses, wearing ankles around his feet. Noor said that Shan was playing such a character for the very first time on screen. The film revolves completely around Shan and Saima, and both the artistes are said to have given their best performance to date. \"Shan will prove with this film that he is not just good for the usual Punjabi film roles, but also for more subtle characters.\"Noor added that the album of Majajan had ten songs in all, but only five had been added in the film. Zulfikar Ali has composed the music of the film, while Aqeel Rubby, Rukhsana Noor, Khursheed Kamal and Khawaja Pervez have written the lyrics. Noor said that the songs in the film were all situational. He hoped that they would be enjoyed by the audience. \"I'm sure my songs will remind the audience of films like Pattan, Mukhrra, Naji, Ishq-e-Laila, Yakkey Wali and Kartar Singh.\" Noor also said that Majajan was a pure Pakistani film because it had been shot entirely in Pakistan. Though the processing work has been done in Bangkok because this is a DTS film. \"I have hired no Indian singer, composer, choreographer, lyricist, cinematographer or actor,\" Noor said gushingly. \"Majajan is also a pure family entertainment. I am sure our ladies and families will like it immensely.\" It may be mentioned here that Majajan also marks the comeback of Madiha Shah, a talented actress of the 90s. She plays Shan's wife. Noor was all praise for Madeeha, \"It is very unfortunate that the film industry forsake such a good artiste (as Madeeha Shah). There is a whole treasure of talent in her. I am sure if I had cast another actress she would not have delivered as well as Madeeha did.\" The film also stars Saud, Shafqat Cheema, Rashid Mehmood, Adeeb, Shabnam Chaudhry, Iftikhar Thakur, Sardar Kamal, Raseela and Kajal.Syed Noor has finally returned from Thailand with the final prints of Majajan and the film is ready to be released on the 3rd March. In Lahore one of the Cinemas its getting released is the Metropole"
}