{
    "id": "13683556",
    "localized title": "Prathi Gnayiru 9.30 to 10.00",
    "cast": [
        "Kalyani",
        "Karunas",
        "Ramesh"
    ],
    "genres": "Drama",
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "17 Nov 2006 (India)",
    "imdbID": "13683556",
    "plot outline": "Prathi Gnayiru 9.30 to 10.00 movie is about four college students Suresh (Ramesh), Remo (Karunas), Murugan (Balaji) and Seetharaman (Ravi) who are carefree and have no responsibilities in their life. Mistaking Kalyani (Kalyani) to be a call girl, they forcibly gang rape her on a holiday. Coming to know of their mistake, they hurriedly return to Chennai. Suresh is married off to a distant relative by his father (Delhi Ganesh). Only after the wedding, he comes to know that his wife resembles Kalyani. This sends a chill down the spines of Ramesh's friends. A sequence of events lead to Kalyani taking revenge on the friends. Whether they realized their mistake and were they taken to task forms the rest of the storyline. In the end Kalyani kills Suresh by making him inhale chili smoke.",
    "languages": "Tamil",
    "title": "Prathi Gnayiru 9.30 to 10.00",
    "kind": "movie",
    "directors": "M. Anbu",
    "producers": "Salai Maitri",
    "composers": "John Peter",
    "akas": "Prathi Gnayiru 9.30 to 10.00 (India)",
    "director": "M. Anbu",
    "production companies": "Vision 21",
    "plot": "_Prathi Gnayiru 9.30 to 10.00_ (qv) movie is about four college students Suresh (Ramesh), Remo (Karunas), Murugan (Balaji) and Seetharaman (Ravi) who are carefree and have no responsibilities in their life. Mistaking Kalyani (Kalyani) to be a call girl, they forcibly gang rape her on a holiday. Coming to know of their mistake, they hurriedly return to Chennai. Suresh is married off to a distant relative by his father (Delhi Ganesh). Only after the wedding, he comes to know that his wife resembles Kalyani. This sends a chill down the spines of Ramesh's friends. A sequence of events lead to Kalyani taking revenge on the friends. Whether they realized their mistake and were they taken to task forms the rest of the storyline. In the end Kalyani kills Suresh by making him inhale chili smoke."
}