{
    "id": "13684376",
    "localized title": "Don Chera",
    "cast": [
        "Ilavarasu",
        "Meera Krishnan",
        "Sujibala"
    ],
    "genres": "Drama",
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "02 Jun 2006 (India)",
    "imdbID": "13684376",
    "plot outline": "The jobless and carefree young man Cheran (Ranjith) lives with his parents (Chandrasekhar and Meera Krishnan) and his elder brother Ravi (Ramesh Maali). His father wants him to find a job and Cheran sets up a roadside street food business along with his friends. One day, an exchange with a customer escalates and Cheran has to kill him to save his friend Kutty (Velmurugan). The killed customer turns out to be the brother of the rowdy Ezhumalai (V. K. R. Ragu). Cheran and Kutty have no choice but to hide from the police and they then meet Ezhumalai's archenemy \"Royapuram\" Bava (R. N. R. Manohar) who promises to offer them protection. Kamal Bhai (S. Rajasekar), a pious man who solves underworld crime issue, arranges a meeting between Cheran and Ezhumalai. During the meeting, Ezhumalai who is full of rage tries to kill Cheran but Cheran takes a gun and shots him dead. \"Royapuram\" Bava then hires Cheran and Kutty as his henchmen. Cheran starts drinking alcohol, gets addicted to drugs and spends his nights in a brothel where he meets the young prostitute Geetha (Sujibala). Cheran slowly begins to rise in \"Royapuram\" Bava's ranks. When \"Royapuram\" Bava gets killed by his enemies, a vengeful Cheran kills them all. Cheran becomes the most dangerous don of Chennai and he is now called Don Chera by his henchmen. In the meantime, Cheran and Geetha fall in love with each other and they get married with the blessings of his parents. Cheran then starts working for the home minister Perumal (Ilavarasu) who orders him to kill innocent people. Thereafter, Geetha gives birth to a baby boy. His family advises Cheran to leave the criminal underworld and to surrender to the police but Cheran refuses. Perumal is soon under serious pressure from the public and government, they suspect him of employing Cheran. He orders the police to encounter Cheran. his friend Kutty and his henchmen get killed in an encounter. Cheran, who is now on the run, must protect his family as they too are in danger. Kamal Bhai arranges a meeting between Cheran and Perumal, Cheran kills Perumal as he would spoil others' lives like his in the future. In the process, Kamal Bhai is killed by the police and Cheran escapes for the place. Cheran returns to his home and asks his family to save him. Cheran who could not sleep peacefully since he entered the criminal underworld begs his mother to make him sleep and Dhanalakshmi shoots him dead. The film ends with the family fulfilling the annual rites of Cheran on the Chennai beach and with Dhanalakshmi explaining all that happened to her young grandson.",
    "languages": "Tamil",
    "title": "Don Chera",
    "kind": "movie",
    "directors": "K.S. Saravanan",
    "writers": "K.S. Saravanan",
    "producers": "N.T. Sakthi Pandiyan",
    "composers": "Prince .G.",
    "akas": "Don Chera (India)",
    "writer": "K.S. Saravanan",
    "director": "K.S. Saravanan",
    "production companies": "Sivasankaralaya",
    "plot": "The jobless and carefree young man Cheran (Ranjith) lives with his parents (Chandrasekhar and Meera Krishnan) and his elder brother Ravi (Ramesh Maali). His father wants him to find a job and Cheran sets up a roadside street food business along with his friends. One day, an exchange with a customer escalates and Cheran has to kill him to save his friend Kutty (Velmurugan). The killed customer turns out to be the brother of the rowdy Ezhumalai (V. K. R. Ragu). Cheran and Kutty have no choice but to hide from the police and they then meet Ezhumalai's archenemy \"Royapuram\" Bava (R. N. R. Manohar) who promises to offer them protection. Kamal Bhai (S. Rajasekar), a pious man who solves underworld crime issue, arranges a meeting between Cheran and Ezhumalai. During the meeting, Ezhumalai who is full of rage tries to kill Cheran but Cheran takes a gun and shots him dead. \"Royapuram\" Bava then hires Cheran and Kutty as his henchmen. Cheran starts drinking alcohol, gets addicted to drugs and spends his nights in a brothel where he meets the young prostitute Geetha (Sujibala). Cheran slowly begins to rise in \"Royapuram\" Bava's ranks. When \"Royapuram\" Bava gets killed by his enemies, a vengeful Cheran kills them all. Cheran becomes the most dangerous don of Chennai and he is now called _Don Chera_ (qv) by his henchmen. In the meantime, Cheran and Geetha fall in love with each other and they get married with the blessings of his parents. Cheran then starts working for the home minister Perumal (Ilavarasu) who orders him to kill innocent people. Thereafter, Geetha gives birth to a baby boy. His family advises Cheran to leave the criminal underworld and to surrender to the police but Cheran refuses. Perumal is soon under serious pressure from the public and government, they suspect him of employing Cheran. He orders the police to encounter Cheran. his friend Kutty and his henchmen get killed in an encounter. Cheran, who is now on the run, must protect his family as they too are in danger. Kamal Bhai arranges a meeting between Cheran and Perumal, Cheran kills Perumal as he would spoil others' lives like his in the future. In the process, Kamal Bhai is killed by the police and Cheran escapes for the place. Cheran returns to his home and asks his family to save him. Cheran who could not sleep peacefully since he entered the criminal underworld begs his mother to make him sleep and Dhanalakshmi shoots him dead. The film ends with the family fulfilling the annual rites of Cheran on the Chennai beach and with Dhanalakshmi explaining all that happened to her young grandson."
}