{
    "id": "13684536",
    "localized title": "Amirtham",
    "cast": [
        "Ganesh",
        "Girish Karnad",
        "Navya Nair"
    ],
    "genres": "Drama",
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "10 Feb 2006 (India)",
    "imdbID": "13684536",
    "plot outline": "In a village called Mukkudal, the devout Brahmin Ramaswamy Iyengar (Girish Karnad) is a poor temple priest living a peaceful life with his wife Rukkumani (Anuradha Krishnamoorthy) and his soft-spoken daughter Amirtha (Navya Nair). The villagers greatly respect Ramaswamy Iyengar for his goodness. In the same temple, Pasupathi Pillai (Rajeev) is a Nadaswaram exponent and a rich person, he has a good relationship with Ramaswamy Iyengar. He has a wife (Rekha), a son studying in the city and a daughter born to him and his wife's sister. Pasupathi Pillai's son Amirtham (Ganesh) returns to the village after completing his engineering degree. Amirtham is an outspoken atheist and rationalist. Thereafter, Amirtha falls in love with Amirtham while Amirtham's half-sister Sorna (Madhura) is killed by her sadist husband Veerayan (Yugendran). Rukkumani then learns of her daughter's love with the Nadaswaram exponent's son Amirtham and she supports her daughter's love affair. Rukkumani even convinced Amirtham's mother to support their love. However, when Amritha declares his feelings to Amirtham, he rejects her proposals because he doesn't want to affect the friendship between his father and her father. Amirtham then leaves the village and returns in the city. In the meantime, petroleum geologists find petroleum under the temple belt and the government ask the villagers to leave the village for oil drilling and extracting the petroleum in the village. The villagers oppose the move by the government and in the process, the police arrest Ramasamy Iyengar. Amirtham comes back to the village to protest against the demolition of the temple. In a fight between the villagers and the police, Amirtham is shot dead. Afterwards, the Supreme Court stops the demolition of the temple and forces the people to vacate the village. Pasupathi Pillai and his wife leave their place with a heavy heart but to their great surprise, Amirtha decides to go with them thus becoming their daughter.",
    "languages": "Tamil",
    "title": "Amirtham",
    "kind": "movie",
    "directors": "K. Kannan",
    "writers": "K. Kannan",
    "producers": "K. Kannan",
    "composers": "Bhavatharini",
    "akas": "Amirtham (India)",
    "writer": "K. Kannan",
    "director": "K. Kannan",
    "production companies": "Ezhuttu Pattarai",
    "plot": "In a village called Mukkudal, the devout Brahmin Ramaswamy Iyengar (Girish Karnad) is a poor temple priest living a peaceful life with his wife Rukkumani (Anuradha Krishnamoorthy) and his soft-spoken daughter Amirtha (Navya Nair). The villagers greatly respect Ramaswamy Iyengar for his goodness. In the same temple, Pasupathi Pillai (Rajeev) is a Nadaswaram exponent and a rich person, he has a good relationship with Ramaswamy Iyengar. He has a wife (Rekha), a son studying in the city and a daughter born to him and his wife's sister. Pasupathi Pillai's son _Amirtham_ (qv) (Ganesh) returns to the village after completing his engineering degree. _Amirtham_ (qv) is an outspoken atheist and rationalist. Thereafter, Amirtha falls in love with _Amirtham_ (qv) while _Amirtham_ (qv)'s half-sister Sorna (Madhura) is killed by her sadist husband Veerayan (Yugendran). Rukkumani then learns of her daughter's love with the Nadaswaram exponent's son _Amirtham_ (qv) and she supports her daughter's love affair. Rukkumani even convinced _Amirtham_ (qv)'s mother to support their love. However, when Amritha declares his feelings to _Amirtham_ (qv), he rejects her proposals because he doesn't want to affect the friendship between his father and her father. _Amirtham_ (qv) then leaves the village and returns in the city. In the meantime, petroleum geologists find petroleum under the temple belt and the government ask the villagers to leave the village for oil drilling and extracting the petroleum in the village. The villagers oppose the move by the government and in the process, the police arrest Ramasamy Iyengar. _Amirtham_ (qv) comes back to the village to protest against the demolition of the temple. In a fight between the villagers and the police, _Amirtham_ (qv) is shot dead. Afterwards, the Supreme Court stops the demolition of the temple and forces the people to vacate the village. Pasupathi Pillai and his wife leave their place with a heavy heart but to their great surprise, Amirtha decides to go with them thus becoming their daughter."
}