{
    "id": "13684510",
    "localized title": "Nagareega Komali",
    "cast": [
        "Sabitha Anand",
        "Bala Joseph",
        "Bala Singh"
    ],
    "genres": "Drama",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "17 Feb 2006 (India)",
    "imdbID": "13684510",
    "plot outline": "In Madurai, Gopi (Bala Joseph) lives with his widowed mother (Sabitha Anand) and runs a cable TV comedy channel called \"Nagareega Komali\" with his friends. To push up their viewer rating, Gopi and his friends also prank people and telecast it on their channel. One day, Gopi pranks an old woman who was selling idly on the roadside and he gets scolded on phone by an anonymous woman. Gopi tracks down the caller's number and finds the woman: his new neighbour Kaveri (Neetha Sree), a gutsy and outspoken woman who fights for justice and spreads social awareness. In the meantime, a few people are falling into a coma in the city after being administered a strong dose of chloroform. One day, Gopi witnesses Kaveri giving an injection to a greedy loan shark. Gopi then meets her father Ellaiah (Bala Singh) who is working in a tea shop and Ellaiah tells him about their bitter past. Many years ago, in Tanjore, Ellaiah was a farmer who lived happily with his wife and kids. But in 1995, due to drought and lack of water, Ellaiah decided to get a bank loan to build a well in his land. However, there was no water in the well and he could not farm as before so he sold his land. Encumbered with debts and suffering from hunger, Ellaiah, his wife, his little son and Kaveri decide to commit suicide by drinking poison. His wife and son died but Kaveri and Ellaiah survived. Thereafter, for Kaveri's studies, they came to Madurai. Back to the present, Kaveri scolds Gopi and his friends for wasting their time with their comedy channel. Her speech is the eye-opener for Gopi and he decides to do relevant shows for the society on their channel. Gopi slowly falls in love with Kaveri. In the meantime, Kaveri is arrested for giving injections to loan sharks. Thereafter, Gopi faces a lot of problems for making socially conscious shows. Kaveri is then released on bail from jail. Gopi cannot anymore run his cable TV channel as he wished joins, so he joins hand with Kaveri to start a newspaper called \"Nagareega Komali\".",
    "languages": "Tamil",
    "title": "Nagareega Komali",
    "kind": "movie",
    "directors": "Ramji S. Bala",
    "writers": "Ramji S. Bala",
    "producers": "S. Jaganathan",
    "composers": "Ramji S. Bala",
    "sound department": "Ajith Abraham George",
    "akas": "Nagareega Komali (India)",
    "writer": "Ramji S. Bala",
    "director": "Ramji S. Bala",
    "production companies": "Ramji Cine Arts",
    "plot": "In Madurai, Gopi (Bala Joseph) lives with his widowed mother (Sabitha Anand) and runs a cable TV comedy channel called \"_Nagareega Komali_ (qv)\" with his friends. To push up their viewer rating, Gopi and his friends also prank people and telecast it on their channel. One day, Gopi pranks an old woman who was selling idly on the roadside and he gets scolded on phone by an anonymous woman. Gopi tracks down the caller's number and finds the woman: his new neighbour Kaveri (Neetha Sree), a gutsy and outspoken woman who fights for justice and spreads social awareness. In the meantime, a few people are falling into a coma in the city after being administered a strong dose of chloroform. One day, Gopi witnesses Kaveri giving an injection to a greedy loan shark. Gopi then meets her father Ellaiah (Bala Singh) who is working in a tea shop and Ellaiah tells him about their bitter past. Many years ago, in Tanjore, Ellaiah was a farmer who lived happily with his wife and kids. But in 1995, due to drought and lack of water, Ellaiah decided to get a bank loan to build a well in his land. However, there was no water in the well and he could not farm as before so he sold his land. Encumbered with debts and suffering from hunger, Ellaiah, his wife, his little son and Kaveri decide to commit suicide by drinking poison. His wife and son died but Kaveri and Ellaiah survived. Thereafter, for Kaveri's studies, they came to Madurai. Back to the present, Kaveri scolds Gopi and his friends for wasting their time with their comedy channel. Her speech is the eye-opener for Gopi and he decides to do relevant shows for the society on their channel. Gopi slowly falls in love with Kaveri. In the meantime, Kaveri is arrested for giving injections to loan sharks. Thereafter, Gopi faces a lot of problems for making socially conscious shows. Kaveri is then released on bail from jail. Gopi cannot anymore run his cable TV channel as he wished joins, so he joins hand with Kaveri to start a newspaper called \"_Nagareega Komali_ (qv)\"."
}