{
    "id": "14338038",
    "localized title": "Sirivantha",
    "cast": [
        "K.S. Ashwath",
        "Doddanna",
        "Vishnuvardhan"
    ],
    "genres": "Drama",
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "28 Sep 2006 (India)",
    "imdbID": "14338038",
    "plot outline": "Sirivantha revolves around the concept of ideologies and being self-sufficient in life. Narayan Murthy (Vishnu) is a very kindhearted and a peace-loving person. He works as an editor for a newspaper Mitravani and believes in the ideology of helping the needy and spends half of his earnings on his family and the other half to help the needy. His family consists of his wife, two sons and a daughter. They are dead against the principles followed by their father. There is a need in the family for some urgent money as the eldest son needs to pay a bribe to get a Sub Inspector's job, the youngest son needs to get through his education and his son decides to start a business. He is forced to break all his principles and borrow money from a financier friend of his played by Doddanna. Unable to bear the defeat of his ideology, he commits suicide the very day he gives money to his children. After hearing about their father's death, the children run away with the money and hide while the society that he helped and love come in huge numbers to perform his last rites. The rest is how the financier gets his money back and how the children understand the value of life.",
    "languages": "Kannada",
    "title": "Sirivantha",
    "kind": "movie",
    "directors": "S. Narayan",
    "writers": "S. Narayan",
    "producers": "Rockline Venkatesh",
    "composers": "S.A. Rajkumar",
    "akas": "Sirivantha (India)",
    "writer": "S. Narayan",
    "director": "S. Narayan",
    "plot": "_Sirivantha_ (qv) revolves around the concept of ideologies and being self-sufficient in life. Narayan Murthy (Vishnu) is a very kindhearted and a peace-loving person. He works as an editor for a newspaper Mitravani and believes in the ideology of helping the needy and spends half of his earnings on his family and the other half to help the needy. His family consists of his wife, two sons and a daughter. They are dead against the principles followed by their father. There is a need in the family for some urgent money as the eldest son needs to pay a bribe to get a Sub Inspector's job, the youngest son needs to get through his education and his son decides to start a business. He is forced to break all his principles and borrow money from a financier friend of his played by Doddanna. Unable to bear the defeat of his ideology, he commits suicide the very day he gives money to his children. After hearing about their father's death, the children run away with the money and hide while the society that he helped and love come in huge numbers to perform his last rites. The rest is how the financier gets his money back and how the children understand the value of life."
}