{
    "id": "1528282",
    "localized title": "Care of Footpath",
    "cast": [
        "Kishan Shrikanth",
        "Jayashree Basavaraj",
        "Jackie Shroff",
        "Saurabh Shukla",
        "Tara"
    ],
    "genres": [
        "Drama",
        "Family"
    ],
    "runtimes": "110",
    "countries": [
        "India",
        "United States"
    ],
    "country codes": [
        "in",
        "us"
    ],
    "language codes": [
        "en",
        "hi"
    ],
    "color info": "Color::(Technicolor)",
    "aspect ratio": "2.35 : 1",
    "original air date": "01 Jun 2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTc3OTUzNDc2Nl5BMl5BanBnXkFtZTcwNDIzNzY5Mg@@._V1_SY150_CR53,0,101,150_.jpg",
    "imdbID": "1528282",
    "plot outline": "An orphan slum boy who is adopted by an old lady who finds him on a footpath. She brings him to live with her in the slums. With his friends, he makes a living picking up selling rags. An encounter with some school going students, who call him an uneducated brute, changes the life of this slum boy. He takes up a personal challenge to attend school and get educated. The film depicts how this slum boy faces hardships in getting admission and attending schools and in fulfilling his dream to become educated. Ultimately against all odds he succeeds in achieving his goal.",
    "languages": [
        "English",
        "Hindi"
    ],
    "title": "Care of Footpath",
    "kind": "movie",
    "directors": "Kishan Shrikanth",
    "writers": "Mysore Harish",
    "producers": "Aron Govil",
    "cinematographers": "Rajan Mathew",
    "akas": "Care of Footpath (India)",
    "writer": "Mysore Harish",
    "director": "Kishan Shrikanth",
    "production companies": "Aron Govil Productions",
    "distributors": "Aron Govil Productions",
    "plot": "An orphan slum boy who is adopted by an old lady who finds him on a footpath. She brings him to live with her in the slums. With his friends, he makes a living picking up selling rags. An encounter with some school going students, who call him an uneducated brute, changes the life of this slum boy. He takes up a personal challenge to attend school and get educated. The film depicts how this slum boy faces hardships in getting admission and attending schools and in fulfilling his dream to become educated. Ultimately against all odds he succeeds in achieving his goal.::Anonymous",
    "synopsis": "Aron Govil Productions Inc.'s Care of Footpath, a film directed by Kishan Shrikanth (Master Kishan), when he was only 9 years old, earning him the title of World's youngest director by Guiness Book of World Records. The movie also stars Bollywood favorites - Jackie Shroff, Saurabh Shukla, B. Jayashree, Sundeep and Taara.Care of Footpath is the story of an orphan slum boy, Kishan, who is adopted by an old lady who finds him on a footpath (sidewalk). She brings him to live with her in the slum. With his friends, he makes a living picking up rags. An encounter with some school students who call him an uneducated brute, changes the life of this slum boy. This makes him take up a challenge to get educated. He is a fun-loving young kid who wants to achieve something bigger in life. He is interested in studies, but his efforts to get into school is met with failures. Finding that this intelligent boy has lot of interest in learning, a school teacher and a social worker takes interest in getting Kishan admitted to school. Care of Footpath is the story of how this boy finds a way to live his dream: going to school to get an education, amidst all odds. This is the success story of a street boy and is inspired by true life stories of great people like Thomas Alva Edison, Michael Faraday, and our Ex-President A.P.J.Abdul Kalam."
}