{
    "id": "3563156",
    "localized title": "Anjaan",
    "cast": [
        "Suriya",
        "Samantha Ruth Prabhu",
        "Vidyut Jammwal",
        "Manoj Bajpayee",
        "Soori",
        "Chitrangda Singh",
        "Maryam Zakaria",
        "Sanjana Singh",
        "Murali Sharma",
        "Chetan Hansraj",
        "Bobby Bedi",
        "Brahmanandam",
        "Joe Malloori",
        "Manoj Misra",
        "Dalip Tahil",
        "Asif Basra",
        "Bikramjeet Kanwarpal",
        "Pradeep Kabra",
        "Manobala",
        "Rajeevan",
        "Joy Badlani",
        "Vishal Saroye",
        "Prayas Mann",
        "Ashish Virendra Chowdhary",
        "Braj Kishore Tiwari"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "166",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "India:U",
        "Ireland:15A",
        "Netherlands:16",
        "Norway:15::(cinema rating)",
        "Philippines:16+::(self-applied)",
        "Singapore:NC16",
        "South Africa:13",
        "Switzerland:16",
        "United Kingdom:15",
        "United States:Not Rated",
        "United States:TV-MA::(Netflix)"
    ],
    "original air date": "15 Aug 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDEzNjg4Y2UtYjdjOS00ODgxLThlNTgtNWY5YmNlYjE5YTUwXkEyXkFqcGdeQXVyMDc5ODIzMw@@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "3563156",
    "plot outline": "Raju 'Bhai' & Chandru head a thriving gang in Mumbai, taking on & decimating all those who oppose them. When the story of their success reaches the ears of the dreaded don, Imran Bhai, they face his inevitable wrath. It is now up to Krishna, the brother of Raju Bhai, to identify the culprits responsible for the fate suffered by the duo and exact revenge.",
    "languages": "Tamil",
    "title": "Anjaan",
    "kind": "movie",
    "directors": [
        "N. Linguswamy",
        "Suresh"
    ],
    "writers": [
        "N. Linguswamy",
        "",
        "Brindha Sarathy",
        "",
        "N. Linguswamy"
    ],
    "producers": [
        "N. Subash Chandrabose",
        "Dhananjayan G.",
        "Siddharth Roy Kapur",
        "Amrita Pandey",
        "Jairaj Parayan",
        "G.R. Venkatesh"
    ],
    "composers": "Yuvan Shankar Raja",
    "cinematographers": "Santosh Sivan",
    "editors": "Anthony",
    "art directors": [
        "Sonu Hittalmani",
        "Rajeevan"
    ],
    "costume designers": "Deepali Noor",
    "production managers": "Shakti Kanungo",
    "assistant directors": [
        "Aroon",
        "Sadiq Khan",
        "Sharanya Rajgopal",
        "Simranpreet Singh"
    ],
    "art department": [
        "Ravindra Singh Bhouriyal",
        "Hittalmani Sonu"
    ],
    "sound department": [
        "Geeta Gurappa",
        "Dhanush Nayanar"
    ],
    "visual effects": "Rv Balaji",
    "stunts": "Stunt Silva",
    "camera department": [
        "Tanha Farmin",
        "Gautam Kumar Jayaseelan",
        "Jai Khandpur",
        "Anirudh Menon",
        "Kumaran Siva"
    ],
    "casting department": "Vishal Saroye",
    "location management": [
        "Bipin Jadhav",
        "Sundeep Nair"
    ],
    "music department": [
        "Benny Dayal",
        "Andrea Jeremiah",
        "Kabilan",
        "Madhan Karky",
        "Manasi",
        "Na. Muthukumar",
        "Shweta Pandit",
        "Yuvan Shankar Raja",
        "Ranjith",
        "Sooraj Santosh",
        "Suriya",
        "Viveka"
    ],
    "miscellaneous": [
        "Brinda Master",
        "Prakash Nathan",
        "Raju Sundaram"
    ],
    "akas": [
        "Sikandar (India, Telugu title)",
        "Khatarnak Khiladi 2 (India, Hindi title)",
        "Отчаянный (Russia)"
    ],
    "writer": [
        "N. Linguswamy",
        "Brindha Sarathy",
        "N. Linguswamy"
    ],
    "director": [
        "N. Linguswamy",
        "Suresh"
    ],
    "production companies": [
        "Thirupathi Brothers",
        "UTV Motion Pictures"
    ],
    "distributors": [
        "Ayngaran International",
        "Ayngaran International",
        "MKS Retail Group",
        "MRT Studios",
        "Sun NXT",
        "Sun TV",
        "Thirupathi Brothers",
        "UTV Motion Pictures"
    ],
    "other companies": "Sony Music",
    "plot": [
        "Krishna comes to Mumbai in search of his brother Raju Bhai, an underworld don. Through Raju Bhai's gangster friends, his past life is revealed. What happened to Raju Bhai? Will Krishna find him?",
        "Raju 'Bhai' & Chandru head a thriving gang in Mumbai, taking on & decimating all those who oppose them. When the story of their success reaches the ears of the dreaded don, Imran Bhai, they face his inevitable wrath. It is now up to Krishna, the brother of Raju Bhai, to identify the culprits responsible for the fate suffered by the duo and exact revenge.::PipingHotViews",
        "A man with physical challenges travels to Mumbai in search of his missing brother, and learns that his brother actually used to be a dreaded gangster, whose enemies are still out to get him. What is the man's true identity? How will he deal with his enemies and the past?::Santhosh"
    ],
    "synopsis": "A handicapped man named Krishna arrives from Kanyakumari to Mumbai, in order to look for his brother Raju, who is revealed to be a gangster when Krishna meets Raju's friends Rajiv and Karim Bhai. A flashback unfolds when Karim starts telling Krishna about Raju and his brother-like friend Chandru who ruled Mumbai as feared gangsters. One day, the arrival of a new commissioner gave them hard time, and in order to free their henchmen, Raju kidnapped the commissioner's daughter Jeeva on the night of her wedding. The commissioner is forced to release the henchmen, but Jeeva reveals she didn't want to marry and got kidnapped with her consent. Soon, Raju and Jeeva fall for each other. Later, Raju and Chandru try to impress a more powerful don named Imran, who insults and warns them instead. Seeing Chandru enraged, Raju kidnaps Imran and the duo avenge their insult by returning Imran's words to him. Delighted, Chandru gifts Raju with a car and a one-week vacation with Jeeva. During the vacation, Raju and Jeeva are attacked but flee the shootout. Raju later finds Chandru's corpse and orders his henchman Amar to take him to Imran. Amar stops the vehicle near a bridge, retrieves Raju's gun and shoots him as he falls into water. Back to present, Karim sees Amar beat up a worker for not giving him a car he wanted to use for illegal gains. When Krishna is spotted, Amar orders his henchmen to kill him but Krishna surprises them when he is revealed to Raju himself. He fights off everyone, kills Amar and tells Karim he'd remain Krishna unless his mission to hunt down all traitors ends. He seeks refuge at Karim's house and learns from him that Chandru and others were to meet a powerful criminal JK on the day Chandru was killed. Jackie was the only henchman who didn't tag along. Raju finds Jackie, chases and attacks him, before Jackie reveals he tried to contact Raju who was then on vacation, and Chadru whose phone was answered by Johnny. Fearing something bad, Jackie ran away. Using Johnny's prostitute girlfriend, Raju nabs Johnny and makes him confess the truth: Instead of JK, Imran and his henchmen arrived at the rendezvous. Chandru fought them off but was betrayed by Johnny, Amar and Manoj, and stabbed to death by Imran. Raju had called on Chandru's phone during this but was answered by Amar who lied about Chandru being in a meeting, before Chandru kicked the phone away. Learning the truth, Raju shoots Johnny in front of Jackie, and then goes to kill Manoj, a now powerful businessman as well as gangster, by entering his office, first pretending to be Krishna and then tricking everyone into believing Raju is on the way. Raju fights off the henchmen and kills Manoj. Raju tries to kill Imran at his birthday party, but ends up shooting a virtual projection telecast from Dubai. Imran's henchmen vandalize Karim's house and kidnap a girl named Saira, who is revealed to be none other Jeeva; she wanted to secretly keep in touch with Raju until his mission was accomplished, and even took care of him. Learning this, Raju goes to the spot and fights off the henchmen, rescuing Jeeva but himself getting captured by Imran's top henchmen. Imran, who has arrived in India, tries to kill Raju who exacts his revenge by getting Imran betrayed by his own top henchmen. Having turned the henchmen with a promise to rule Mumbai together, Raju kills first Imran and then the henchmen, believing his enemies must not have traitors either. Before departing from Mumbai, Raju and Jeeva meet the taxi driver Raja who helped Raju believing him to be Krishna, and is now shocked to realize it was Raju all along."
}