{
    "id": "5202754",
    "localized title": "Manthan: Ek Amrut Pyala",
    "cast": [
        "Neha Bam",
        "Milind Gunaji",
        "Asawari Joshi",
        "Vijay Kadam",
        "Padmini Kolhapure",
        "Atisha Naik",
        "Suhas Palshikar",
        "Vijay Patkar",
        "Somnath Tadwalkar"
    ],
    "genres": "Drama",
    "runtimes": "116",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "01 Jan 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTRjNjc0ZDQtNDBlMS00NjQ5LWI4YTctOTFkY2JlNWI5OTNlXkEyXkFqcGdeQXVyMTgwMjgwMjM@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "5202754",
    "plot outline": "Anjali Deshpande (Padmini Kolhapure) is a mass communication graduate and married, has a daughter she has lost touch of outside world for the 8-9 years as naturally playing role of wife & mother. Anjali Deshpande is soft, gentle a balanced woman, for about rights & wrong of life. The story moves as she wants to take a job. A new journey starts & Anjali is amused, shocked at other woman's painful situations. It is easy to solve other's problems and one day her own family life takes a turn when she has become the victim of domestic violence. It is so easy while giving answers to others & seeing world. How does Anjali faces life & solves her own problem.",
    "languages": "Marathi",
    "title": "Manthan: Ek Amrut Pyala",
    "kind": "movie",
    "directors": "Mrunalini Patil Dayall",
    "producers": [
        "Mrunalini Patil Dayall",
        "Mrunalinni Patil",
        "Kiran Shahi"
    ],
    "composers": "Krishna",
    "cinematographers": "Sanjay Khanzode",
    "sound department": "Alok De",
    "akas": "Manthan: Ek Amrut Pyala (India)",
    "director": "Mrunalini Patil Dayall",
    "production companies": "Cenchurion Films",
    "distributors": "Video Palace",
    "plot": [
        "Anjali Deshpande (Padmini Kolhapure) is a mass communication graduate and married, has a daughter she has lost touch of outside world for the 8-9 years as naturally playing role of wife & mother. Anjali Deshpande is soft, gentle a balanced woman, for about rights & wrong of life. The story moves as she wants to take a job. A new journey starts & Anjali is amused, shocked at other woman's painful situations. It is easy to solve other's problems and one day her own family life takes a turn when she has become the victim of domestic violence. It is so easy while giving answers to others & seeing world. How does Anjali faces life & solves her own problem.::alex.mjacko@gmail.com",
        "'Manthan' ek amrut pyala is an emotional journey of all the characters of different social strata through the eyes of Anjali Deshpande (Padmini Kolhapure) our main protagonist. The story starts with Deshpande family with a happy note. Anjali Deshpande (Padmini Kolhapure) is a mass communication graduate and married, has a daughter and has lost touch of outside world for the 8-9 years as naturally playing role of wife and mother. Anjali Deshpande is soft, gentle, a balanced woman, firm about rights and wrong of life. The story moves as she wants to take a job. A new journey starts and Anjali is amused, shocked at other woman's painful situations. It is easy to solve other's problems and one day her own family life takes a turn when she has become the victim of domestic violence. It is so easy while giving answers to others and seeing the world. How does Anjali faces life and solves her own problem and what she understands about life and its own view points is Manthan of thoughts, life and its answer \"ek amrut pyala\" a positive outcome.",
        "Anjali Deshpande's is an educated woman who has balanced views yet strong convictions. She is married to Bharat and has a young daughter. Her placid life is turned upside down by a shocking incident of domestic violence, forcing her to re-evaluate her ideas about traditional family roles and the status of women in society."
    ]
}