{
    "id": "6079516",
    "localized title": "I See You",
    "cast": [
        "Helen Hunt",
        "Jon Tenney",
        "Owen Teague",
        "Judah Lewis",
        "Libe Barer",
        "Gregory Alan Williams",
        "Erika Alexander",
        "Allison Gabriel",
        "Adam Kern",
        "Riley Caya",
        "Nicole Forester",
        "John Newberg",
        "Teri Clark",
        "Jeremy Gladen",
        "Wyatt McClure",
        "Brooks Roseberry",
        "Cherie McClain",
        "A.J. Ransom",
        "Brian Bowman",
        "Rick Dremann",
        "Joe Fishel",
        "Bert Gliatta Jr.",
        "Jennifer Grace",
        "Josh Heileman",
        "Daniel Repas",
        "Jostein Sagnes",
        "Mark Salas",
        "Sam Trammell",
        "Thomas W Wolf"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "98",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Argentina:16",
        "Australia:M",
        "Brazil:14",
        "Canada:13+::(Quebec)",
        "Denmark:15::(DVD and Blu-ray rating)",
        "Finland:K-16::(DVD and Blu-ray rating)",
        "France:12",
        "Germany:16",
        "Italy:T::(self-applied)",
        "Mexico:B",
        "Netherlands:12",
        "Norway:15::(DVD and Blu-ray rating)",
        "Poland:16",
        "Portugal:M/14",
        "South Korea:15",
        "Spain:16",
        "Sweden:15::(DVD and Blu-ray rating)",
        "Taiwan:R-12",
        "United Kingdom:15",
        "United States:R",
        "United Arab Emirates:PG-15::(self-applied)"
    ],
    "original air date": "10 Dec 2019 (Canada)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzVkOWM5YTEtMDdkNi00YjMzLWEzNWEtODEwN2IyZTc4Yjg2XkEyXkFqcGdeQXVyMjc5MTg0MzQ@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "6079516",
    "languages": "English",
    "title": "I See You",
    "kind": "movie",
    "directors": "Adam Randall",
    "writers": "Devon Graye",
    "producers": [
        "James Atherton",
        "Jordan Bayer",
        "Eric Fischer",
        "David Gendron",
        "Sean Gowrie",
        "Mark Andrew Hamer",
        "Tom Harberd",
        "Ben Hecht",
        "Phil Hunt",
        "Matt Leipzig",
        "Jan Pace",
        "Compton Ross",
        "Elliot Ross",
        "Fenella Ross",
        "Robert Ruggeri",
        "Chris Sablan",
        "Jason Salzman",
        "Bill Schultz",
        "Matt Waldeck",
        "Viviana Zarragoitia"
    ],
    "composers": "William Arcane",
    "cinematographers": "Philipp Blaubach",
    "editors": "Jeff Castelluccio",
    "editorial department": [
        "Hunter Clancey",
        "Patrick Clancey",
        "Jason Dougherty",
        "Eric Fernandez",
        "Jason Hanel",
        "Jon Mendenhall",
        "Stephen Regnier",
        "Alexis Ross"
    ],
    "casting directors": "Nancy Nayor",
    "production designers": "Carmen Navis",
    "art directors": "Geza Kassai",
    "set decorators": "Grace Smith",
    "costume designers": "Nancy Collini",
    "make up department": [
        "Sandra S. Orsolyak",
        "Dustin Osborne",
        "Darrell Redleaf-Fielder",
        "Holly Sago",
        "Maxi Spisak",
        "Alan Tuskes"
    ],
    "production managers": "Sean Gowrie",
    "assistant directors": [
        "Jesse Bellis",
        "Lynn K. D'Angona"
    ],
    "art department": [
        "Jeffrey Lange",
        "Ron Martin",
        "Alex Mooney",
        "Andriy Pereklita",
        "Monica Plunkett",
        "Brandon Rife",
        "Chris Singleton"
    ],
    "sound department": [
        "Lorita de la Cerna",
        "Demetri Evdoxiadis",
        "K. Joshua Fernberg",
        "Steve Guercio",
        "Jacob Ortiz",
        "Raymond Park",
        "Henri Rapp",
        "Michael Toji"
    ],
    "special effects": [
        "Chad Ball",
        "Schuyler White"
    ],
    "visual effects": "Mark Andrew Hamer",
    "stunts": [
        "Jason Cekanski",
        "Matthew Divis",
        "Richard Fike",
        "Jami Kinton",
        "Kitt Lashley",
        "Dean Allen Ross",
        "Kevin Sheridan",
        "John Sundquist",
        "Klint Tomlinson",
        "Paul Turner"
    ],
    "camera department": [
        "Grant Adams",
        "Dumaine Babcock",
        "Vince Calabrese",
        "Alex Dubois",
        "Nick Giomuso",
        "Daniel M. Henterly",
        "Kevin Hines",
        "Jay B. Johnson",
        "Chris Owen Jones",
        "Timothy James Kane",
        "Ryan Keeper",
        "Donnie Schneider",
        "Rick Stern",
        "John Turk",
        "Briget Wolfe",
        "Zac Popik"
    ],
    "casting department": [
        "Phoebe Benya",
        "Angela Boehm",
        "Frank Ferendo",
        "Jessica Gee-George",
        "Grant George",
        "Dawn Hyde",
        "Kristina Randjelovic",
        "Elizabeth Vitale"
    ],
    "costume departmen": [
        "Jaclyn Laravie",
        "Natalia Piazza",
        "Eric Robinson",
        "Alyssa Tull",
        "Jasmine Woolfork"
    ],
    "location management": "Kathy Ruggeri",
    "music department": [
        "James Mcmillen",
        "Will Quiney"
    ],
    "script department": "Sherry Gunderman",
    "transportation department": [
        "Rob Combest",
        "Ron Hulec"
    ],
    "miscellaneous": [
        "Jenny Armstrong",
        "Dylan Bartolovich",
        "Joel Timothy Bible",
        "Sara Bonakdar",
        "Andy Caley",
        "Natalie Coleman",
        "Sarah Cundall",
        "Elizabeth Flood",
        "Ami Francis",
        "Bryan Geary",
        "Edward E. Giddens",
        "Michael Graf",
        "Ryan Harvie",
        "Mick R. Jones",
        "Kimberly Leitch",
        "Joe Loszack",
        "Alastair Mavor",
        "Dominic Pace",
        "Matt Preuer",
        "Teresa E. Purtiman",
        "Damon Rahz",
        "Brent Reichert",
        "Magdalene Serpa",
        "Joe Sorzano",
        "Sam Tatton-Brown",
        "Anthony J. Taylor"
    ],
    "thanks": [
        "Joseph Fedrl",
        "Travis Killian",
        "Cayla Koslen",
        "Kevin Lehane",
        "David Mott"
    ],
    "akas": [
        "I See You: Das Böse ist näher als du denkst (Germany)",
        "Te veo (Spain)",
        "Σε Είδα (Greece)",
        "À Espreita do Mal (Brazil)",
        "Vidím ťa (Slovakia)"
    ],
    "writer": "Devon Graye",
    "director": "Adam Randall",
    "production companies": [
        "Head Gear Films",
        "Kreo Films FZ",
        "Metrol Technology",
        "Real by Fake",
        "Zodiac Features",
        "Zodiac Holdings"
    ],
    "distributors": [
        "Film & TV House",
        "GEM Entertainment",
        "Bankside Films",
        "Applause Entertainment",
        "Gusto entertainment",
        "L'Atelier d'Images",
        "Saban Films",
        "Capelight Pictures",
        "Capelight Pictures",
        "Front Row Filmed Entertainment",
        "Première TV Distribution",
        "Première TV Distribution",
        "Pris Audiovisuais",
        "Source 1 Media",
        "Source 1 Media"
    ],
    "other companies": [
        "GreenSlate",
        "Monkeyland Audio",
        "Monkeyland Audio",
        "Otto Nemenz International",
        "Quickfire Films",
        "South By Southwest Film Festival (SXSW)",
        "Three Point Capital",
        "Three Point Capital",
        "Zodiac Holdings"
    ],
    "plot": "Strange occurrences plague a small town detective and his family as he investigates the disappearance of a young boy.",
    "synopsis": "As phroggers, who are people that secretly squat inside occupied houses, teenagers Mindy and Alec infiltrate the suburban home of police detective Greg Harper, his counselor wife Jackie, and their teenage son Connor. Although Mindy insists on drawing no attention to themselves while hiding inside the house, Alec begins mentally messing with the Harpers by removing photographs from their frames, turning on televisions, and urinating on Greg while he sleeps. He also hides Jackie's favorite mug which has sunflowers painted on it. The family vaguely wonders if there may be a paranormal presence haunting their home.Connor and Greg remain angry with Jackie in the wake of a revelation that Jackie had an affair. Still coming to terms with how to handle their marriage moving forward, Greg throws his phone through a window in frustration.When a repairman arrives to fix the window while the Harpers are not home, Alec convinces Mindy to let him in since he doesn't know she doesn't live there. Jackie comes home surprised to find the repairman in her house. Jackie's confusion grows when he explains that her daughter let him inside. Jackie reports the repairman to the police after discovering that her silverware is missing, although Alec actually hid it.Lieutenant Moriah Davis assigns Greg and his longtime partner Ray Spitzky to investigate the disappearances of Michael King and 12-year-old Justin Whitter, the latter of whom mysteriously vanished while riding his bike through the woods. At the crime scene, the detectives discover a green pocketknife like those used by Cole Gordon, a man they sent to prison for killing six other boys years earlier.Although Greg and Spitzky consider they are dealing with a copycat, Davis has the duo track down Gordon's two surviving victims to ensure that Gordon's defense attorney doesn't push to reopen the case. They go to see previous victim Tommy Braun. When Tommy turns to look at Spitzky it's revealed that his face is horribly disfigured. Tommy then begins whimpering and yelling.Spitzky listens to his original interview with Tommy. Tommy says that he disfigured his face himself after being in the little house in the trees. Tommy says it's a magic house that disappears. Spitzky asks what that means and Tommy says it means that Spitzky will never find the man.Jackie's lover Todd comes to the Harper house to profess his love for Jackie. From the roof above, Alec smashes Jackie's sunflower mug on Todd's head. Jackie presumes it was thrown by Connor. She takes Todd into the basement to treat his wound.Jackie leaves Todd alone while she drives Connor to school. Mindy decides that she and Alec need to leave the house immediately. She goes to the basement to retrieve the backpack she had hidden there earlier, but is forced to hide when she sees Todd is in the basement. Greg returns home unexpectedly and finds Todd in the basement kneeling in front of a cupboard as he looks for a cloth for his head wound. From her hiding spot Mindy silently witnesses Greg murder Todd by hitting him in the head from behind with a bat.Mindy grabs her backpack and prepares to leave but is forced to hide again as Jackie returns and finds Todd dead from a head wound. Fearing that Connor will be held responsible because of the mug she presumed he threw, Jackie convinces Greg to help her bury Todd's body in the woods.While his parents are out, Connor finds the missing silverware inside the washing machine. Connor then receives an anonymous message asking if he knows what \"phrogging\" is. Connor finds disturbing phrogging videos when he searches the term online. Wearing a frog mask, Alec captures Connor.Catching Alec in the act of tying up Connor, Mindy expresses her terror at the psychotic person Alec is becoming. A struggle ensues between Mindy and Alec. Mindy hits her head and falls unconscious. Alec puts Mindy in the back of Greg's vehicle and attempts to drive away but has trouble getting the vehicle to start. Greg and Jackie return home from burying Todd's body and Alec hides to avoid being seen.Jackie and Greg find Connor bound and gagged in the bathtub with a green pocketknife stuck into a bar of soap beside him. Before Jackie rushes Connor to the hospital Greg tells her he will find the person who did this to Connor.Alec is still hiding in the garage and is horrified to see Greg get in his vehicle and drive away with Mindy still unconscious in the back. Mindy quietly recovers in the back of the vehicle where she finds Justin Whittier's jersey and other evidence to indicates that Greg has been the one abducting and killing boys.When Greg stops, Mindy escapes into nearby woods. She calls 911 to report the killer, which summons Spitzky to investigate, but the connection drops out before her phone's location can be traced.Mindy finds a hidden trailer where Greg imprisoned Michael King and Justin Whitter. The boys tell her that Greg said he is going to kill them and is outside digging a hole to bury them. They beg Mindy to free them. As she tries to free them Greg comes up behind her and suffocates her with a plastic bag. Greg finds Mindy's camcorder documenting all of the phrogging she and Alec did inside the Harper house. Enraged, Greg heads home to hunt for Alec, taking Mindy, who's still alive, with him.When Greg arrives home he takes Mindy in the living room, tells her to stand up and shoots her with his service pistol. He takes a second handgun from his pocket, turns, and shoots two holes in the wall to make it appear as though Mindy shot at him and he killed her in self defense. He then wipes his fingerprints from the second gun and places it in MIndy's hand. With his service pistol in hand, he begins searching the house for Alec.Alec hears the shots and takes an ax from the wall of the garage. He sneaks through the house and finds Mindy's dead body.\nGreg is upstairs hunting for Alec. Alec lures him downstairs by playing a song on the record player. As Greg goes to turn off the record player Alec attacks him with an ax, but Greg overpowers him. Greg knocks Alec out before going to the kitchen sink and stabbing himself with a knife. He turns to plant the knife on Alec and sees that he has disappeared. He hears a hammer cock and sees Alec pointing a gun at him. Alec tells Greg that he knows what he is. Greg explains that he will stage the scene to frame Alec and MIndy as the murderers. Alec steps forward and Greg suddenly becomes frightened, pleading with Alec and telling him that Alec doesn't understand. Unmoved by Greg's plea, Alec shoots him dead just as the cops arrive.A crying Alec stares down at Greg's body. Spitzky breaks into the house and see Greg lying dead on the kitchen floor and Alec standing there holding the gun. He fires a bullet into Alec. Critically wounded, Alec lifts his head and recognizes Spitzky. He whispers Spitzky's name intimating that he was Tommy Braun's friend and had orchestrated the phrogging scheme to take revenge on the man that tortured him and Tommy as children. The police rescue the two captive boys in the woods while Spitzky finds the evidence in the back of Greg's SUV that proves that his partner was the perpetrator. Jackie and Connor return home, shocked to see their yard filled with police cars. Jackie walks toward Spitzky who says something inaudible to her. She brushes past him and stares in silence at the evidence in the back of Greg's SUV.As Alec is wheeled to the ambulance he flashes back to himself and Tommy as young boys walking along a railroad track. They encounter Greg who gives Alec a green pocketknife."
}