{
    "id": "8728982",
    "localized title": "Tekka",
    "cast": [
        "George Baker",
        "Sanghamitra Banerjee",
        "Shambhu Bhattacharya",
        "Nimu Bhowmick",
        "Debasish",
        "Aloka Ganguly",
        "Mili",
        "Krishnokishore Mukherjee",
        "Sunil Mukherjee",
        "Sunita"
    ],
    "genres": [
        "Action",
        "Romance"
    ],
    "runtimes": "127",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2I1ZWZjZGMtMDJiNi00NDEwLTljZjgtZDk0OThlYjM1MjNkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "8728982",
    "plot outline": "Tekka is a social drama that is based on the story of a true and courageous boy who is the main hero. The hero fights against all the evils existing in his society like power plays of gangs, the mistreatment of women by goons, unjust treatment of the poor and weak and the likes. His character is of a model modern man whose principle of true justice and brave behavior serve as an inspiration. The story has many twists and turns and development which will keep you interested. Also with many fight scenes and enjoyable dance songs that keep you entertained. The story ends on a happy and realistic note, where good wins over evil, and our hero fights against all odds and wins.",
    "languages": "Bangla",
    "title": "Tekka",
    "kind": "movie",
    "directors": "Tutul Banerjee",
    "writers": "Tutul Banerjee",
    "producers": "Chakra Producation",
    "composers": "Mohan Chand Goswami",
    "akas": "Tekka (India)",
    "writer": "Tutul Banerjee",
    "director": "Tutul Banerjee",
    "production companies": "Angel Digital.",
    "plot": "_Tekka_ (qv) is a social drama that is based on the story of a true and courageous boy who is the main hero. The hero fights against all the evils existing in his society like power plays of gangs, the mistreatment of women by goons, unjust treatment of the poor and weak and the likes. His character is of a model modern man whose principle of true justice and brave behavior serve as an inspiration. The story has many twists and turns and development which will keep you interested. Also with many fight scenes and enjoyable dance songs that keep you entertained. The story ends on a happy and realistic note, where good wins over evil, and our hero fights against all odds and wins."
}