{
    "id": "0156632",
    "localized title": "Janam",
    "cast": [
        "Kumar Gaurav",
        "Shernaz Patel",
        "Anupam Kher",
        "Anita Kanwar",
        "Deepak Qazir",
        "Kitu Gidwani",
        "Avtar Gill",
        "Madan Jain",
        "Raju Kher",
        "Shilpa Shirodkar"
    ],
    "genres": "Drama",
    "runtimes": "109",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "certificates": [
        "United Kingdom:U",
        "United States:Not Rated"
    ],
    "original air date": "04 Dec 1985 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2JhMTlhMTYtY2EyZC00ZDUxLTliZDAtZTEzYzE4MmU2NWZhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0156632",
    "plot outline": "The protagonist, Rahul, is an aspiring film maker but he does not have a good script nor the money needed to invest in making a movie. That's when his childhood friend steps in and mortgages his restaurant to come up with the money and claims that he is doing it for himself, for he believes in the capability of Rahul, and wants his own name to become immortal. Rahul is the son of a 1950's film director and his keep; his father also has a \"legal\" family which knows about the existence of Rahul and his mother and detest them to no end. Every time Rahul goes to their house to get some money, he is ridiculed by everyone in that household, including his father's mother and his lawfully wedded wife. His father, though, cares more for Rahul's mother than his own wife. Rahul also has a girlfriend who is very supportive of him and who eventually marries him. While Rahul is struggling to make his film and is short on money, every small gesture to fulfill his needs - like smoking - by his working wife flusters him, and the husband and wife have squabbles. When Rahul eventually completes his film, he is very disillusioned since it does not rise up to his expectations. That's when his friend suggests that a film successful film is that which is based on one's own trials and tribulations in life. This provides the necessary spark for Rahul and he starts scripting a new story based on his own life which revolves around his own illegitimate birth, his mother who worked as an extra in his father's films, his father's other family, and the other people associated with him. This story line prompts his father to file a lawsuit against Rahul for personal defamation. When the premier of the film is announced, Rahul is very desirous of his father coming to it even though there is a pending lawsuit against him. The last scene is the Award ceremony where Rahul's film Janam is announced the best film and when Rahul comes to the stage to receive his award he requests that the award be given to him by his father who is sitting in the audience. When his father comes up to the stage to give Rahul the award, he is filled with pride, and he says that this win is akin to when a horse wins a race, the people applaud the jockey, but the horse thinks that the claps are for him. On this note the movie ends whereby the Rahul, his mother, and his father are united even if for an ephemeral moment.",
    "languages": "Hindi",
    "title": "Janam",
    "kind": "tv movie",
    "directors": "Mahesh Bhatt",
    "writers": [
        "Mahesh Bhatt",
        "",
        "Suraj Sanim"
    ],
    "composers": "Ajit Verman",
    "cinematographers": "Pravin Bhatt",
    "art directors": "Madhukar S. Shinde",
    "assistant directors": "Pramod Soni",
    "sound department": "Indrajit Neogi",
    "akas": [
        "Kampen for oprejsning (Denmark)",
        "Jete e dyfishte (Albania)",
        "Birth",
        "Janam - Születés (Hungary)"
    ],
    "writer": [
        "Mahesh Bhatt",
        "Suraj Sanim"
    ],
    "director": "Mahesh Bhatt",
    "production companies": "NH Studioz",
    "distributors": "NH Studioz",
    "plot": [
        "The protagonist, Rahul, is an aspiring film maker but he does not have a good script nor the money needed to invest in making a movie. That's when his childhood friend steps in and mortgages his restaurant to come up with the money and claims that he is doing it for himself, for he believes in the capability of Rahul, and wants his own name to become immortal. Rahul is the son of a 1950's film director and his keep; his father also has a \"legal\" family which knows about the existence of Rahul and his mother and detest them to no end. Every time Rahul goes to their house to get some money, he is ridiculed by everyone in that household, including his father's mother and his lawfully wedded wife. His father, though, cares more for Rahul's mother than his own wife. Rahul also has a girlfriend who is very supportive of him and who eventually marries him. While Rahul is struggling to make his film and is short on money, every small gesture to fulfill his needs - like smoking - by his working wife flusters him, and the husband and wife have squabbles. When Rahul eventually completes his film, he is very disillusioned since it does not rise up to his expectations. That's when his friend suggests that a film successful film is that which is based on one's own trials and tribulations in life. This provides the necessary spark for Rahul and he starts scripting a new story based on his own life which revolves around his own illegitimate birth, his mother who worked as an extra in his father's films, his father's other family, and the other people associated with him. This story line prompts his father to file a lawsuit against Rahul for personal defamation. When the premier of the film is announced, Rahul is very desirous of his father coming to it even though there is a pending lawsuit against him. The last scene is the Award ceremony where Rahul's film _Janam_ (qv) is announced the best film and when Rahul comes to the stage to receive his award he requests that the award be given to him by his father who is sitting in the audience. When his father comes up to the stage to give Rahul the award, he is filled with pride, and he says that this win is akin to when a horse wins a race, the people applaud the jockey, but the horse thinks that the claps are for him. On this note the movie ends whereby the Rahul, his mother, and his father are united even if for an ephemeral moment.::ApneRam",
        "Nalini is an extra in film's and has a secret relationship with top filmmaker Virendra Desai whose also already a married man with kids.However he suddenly suffers a series of flops and can't take care of both the families and abandons Nalini an her son Rahul.Years later Rahul is an aspiring filmmaker spending his nights in empty theatre's and walking on lonely streets.Rahul wants his father Virendra Desai to give respect to his mother and acknowledge them in public.Rahul then decides to make a autobiographical film on the relationship of his father with him and his mother.::alex.mjacko@gmail.com"
    ]
}