{
    "id": "0247911",
    "localized title": "Aap Mujhe Achche Lagne Lage",
    "cast": [
        "Hrithik Roshan",
        "Ameesha Patel",
        "Kiran Kumar",
        "Mukesh Tiwari",
        "Nishigandha Wad",
        "Shahbaaz Khan",
        "Madhuri Sanjeev",
        "Alok Nath",
        "Jimmy Moses",
        "Shaikh Sami",
        "Ali Asgar",
        "Hemant Pandey",
        "Jasbir Thandi",
        "Suchit Jadhav",
        "Prithvi Zutshi",
        "Neha Bam",
        "Vrajesh Hirjee",
        "Mushtaq Khan",
        "Firdaus Mevawala"
    ],
    "genres": [
        "Action",
        "Drama",
        "Romance"
    ],
    "runtimes": "180",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": [
        "Dolby Digital",
        "DTS"
    ],
    "certificates": [
        "Australia:M",
        "Canada:14A::(Alberta)",
        "Canada:13+::(Quebec)",
        "Malaysia:U",
        "New Zealand:M",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "19 Apr 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWIwNGI5OTQtMTQ4OC00MzcwLTg2NTktNDFiYzE1MmRmMGQxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "0247911",
    "plot outline": "Brought up in a very tight, conservative household, Sapna Dholakia (Amisha Patel) is terrified to experience the freedom of falling in love with Rohit (Hrithik Roshan), fearing the upheaval it will cause in her family, namely her dad, Pratap Dholakia (Kiran Kumar), who has plans for Sapna to marry Rishabh Patel, the son of a friend; then there is her brother, Raman Dholakia (Mukesh Tiwari), who follows in the footsteps of his dad, and will prevent Sapna from marrying Rohit. But Rohit is determined to marry Sapna and no one else, come what may, and this is met with resistance from the Dholakia clan, who first severely beat Sapna, and then imprison her in her room; and then lure Rohit to a secluded spot and proceed to beat him within every inch of his life, and there is no one who can even dare to think to intervene and invite the wrath of the Dholakia family.",
    "languages": "Hindi",
    "title": "Aap Mujhe Achche Lagne Lage",
    "kind": "movie",
    "directors": "Vikram Bhatt",
    "writers": [
        "Robin Bhatt",
        "",
        "Girish Dhamija",
        "",
        "Sanjeev Duggal"
    ],
    "producers": [
        "Gautam Kumar",
        "Rohit Kumar",
        "Anupam Sharma",
        "Rohit Kumar Sharma"
    ],
    "composers": "Rajesh Roshan",
    "cinematographers": "Pravin Bhatt",
    "editors": [
        "Reupal D. Rawal",
        "Amit Saxena"
    ],
    "editorial department": [
        "Akiv Ali",
        "Shakti Hasija"
    ],
    "art directors": "Gappa Chakravorty",
    "make up department": "Arvind Uttekar",
    "production managers": [
        "Gyanchand Chauhan",
        "Azim Shaikh",
        "Kailash Vohra"
    ],
    "assistant directors": [
        "Hasnain Hyderabadwala",
        "Sujit Mondal"
    ],
    "sound department": [
        "Vikram Biswas",
        "Sajjan Choudhary",
        "Murari Kishan",
        "Karnail Singh",
        "Anchal Srivastava"
    ],
    "visual effects": "Keya Banerjee",
    "stunts": [
        "Nash Edgerton",
        "Javed Karim",
        "Abbas Ali Moghul",
        "Gordon Waddell"
    ],
    "music department": [
        "Abhijeet",
        "Vijay Angre",
        "Ibrahim Ashq",
        "Satish Gupta",
        "Jack",
        "Pamela Jain",
        "Dev Kohli",
        "Krishnakumar Kunnath",
        "Udit Narayan",
        "Sonu Nigam",
        "A.N. Tagore",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Ganesh Acharya",
        "Renae Begent",
        "Ganesh Hegde",
        "Raju Khan",
        "Suleman Mobhani"
    ],
    "akas": [
        "I've Started to Like You (India, English title)",
        "AMALL (India, Hindi title)",
        "Head Over Heels in Love (India, English title)",
        "Ты мне очень нравишься (Russia)"
    ],
    "writer": [
        "Robin Bhatt",
        "Girish Dhamija",
        "Sanjeev Duggal"
    ],
    "director": "Vikram Bhatt",
    "production companies": [
        "Emkay Films",
        "Loneranger Productions"
    ],
    "distributors": [
        "Shemaroo Video Pvt. Ltd.",
        "Spark Worldwide"
    ],
    "other companies": [
        "McDonald's Corporation",
        "Rocky S. Fashions",
        "Sahara Recording Studio",
        "Studio Link",
        "Universal Music",
        "Zee Cinema"
    ],
    "plot": [
        "The daughter of a rich criminal industrial tycoon falls in love with a college boy. The tycoon, what a surprise, objects...",
        "Brought up in a very tight, conservative household, Sapna Dholakia (Amisha Patel) is terrified to experience the freedom of falling in love with Rohit (Hrithik Roshan), fearing the upheaval it will cause in her family, namely her dad, Pratap Dholakia (Kiran Kumar), who has plans for Sapna to marry Rishabh Patel, the son of a friend; then there is her brother, Raman Dholakia (Mukesh Tiwari), who follows in the footsteps of his dad, and will prevent Sapna from marrying Rohit. But Rohit is determined to marry Sapna and no one else, come what may, and this is met with resistance from the Dholakia clan, who first severely beat Sapna, and then imprison her in her room; and then lure Rohit to a secluded spot and proceed to beat him within every inch of his life, and there is no one who can even dare to think to intervene and invite the wrath of the Dholakia family.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Sapna is the solitary daughter of a rich hidden world Don, Pratap Dholakia. She lives in fear of her dad and brother Raman's oppression, viciousness, and risky pack affiliations. Because of their various adversaries, they have kept Sapna bound at home for her entire life with just her sister-in-law, Nisha, for company and comfort. Profoundly shielded, credulous, and forlorn, Sapna wants to leave the house.One night, Sapna goes to her childhood friend's wedding without her dad's consent, and on the ride back home she is assaulted by Pratap's opponent pack. Rohit, a nearby undergrad, witnesses the assault and secures Sapna. They promptly experience passionate feelings for one another, yet before they can present themselves she is protected by Pratap's men. Furious, Pratap declines Sapna from going out ever again.The following morning, Rohit gets Sapna's name from a newspaper article about the episode. He and his companions figure out how to enter her home as a melodic band, performing for the Navaratri dance festivities. Sparkles fly among him and Sapna over the nine evenings of Navaratri and they begin meeting subtly. In spite of the fact that Raman is dubious, Rohit charms Pratap and gains his trust when Sapna clarifies that he was the person who had saved her the night of the group assault. Rohit sneaks Sapna out for trips in and out of town and takes her home to meet his folks, who get her affectionately. Nisha finds their relationship, cautioning Sapna of Pratap's savagery and what he and Raman would do to Rohit if they came to know. Meanwhile, Pratap, feeling that Sapna would be most secure abroad, orchestrates her to wed the child of a well off companion who lives in London. He declares their engagement on the last night of Navaratri before all visitors, stunning both Sapna and Rohit.One night, Sapna has a nightmare when Rohit embraces her, and then they get caught by Pratap and Raman's men, who capture Sonia and shoot Rohit. Subsequently, Sapna wakes up after a nightmare and ends her relationship with Rohit to save him from her dad and brother. Nisha subtly visits Rohit at his hostel to explain that Sapna loves him so much that she wants to see him safe. Nisha tells him that Sapna wants to save him by separating from him, and she tells him to leave Sapna and forget about her. Resolute, the evening of Sapna's commitment party, Rohit whisks her away to his lodging, thinking that it would be the last place Pratap would look for her. With the assistance of his companions (and, soon, all the young men in the school), Sapna is disguised as a male student and gets comfortable joyfully, tasting the opportunity unexpectedly. In the interim, Pratap accepts that Sapna has been snatched by his opponent, Kania Pathan, and Raman executes a savage quest for her, cruelly assaulting Kania Pathan's men and region. At the point when this demonstrates worthless, Pratap has his phone charge checked and sees constant calls to and from a new telephone number, which turns out to be Rohit's.Raman and his men show up at Rohit's lodging, proposing to recover Sapna forcibly. In safeguard, a hundred of Rohit's friends show up conveying sticks and bats, indicating fortitude with Rohit and Sapna. Before a battle can follow, Pratap shows up and openly yells at Raman for going to the lodging without his consent. He genuinely shows paternal concern, announcing his approval of Rohit and Sapna's relationship and persuading Sapna to get back with him to plan for her wedding to Rohit.Overflowing with bliss, Sapna shows up back home and tells Nisha of her dad's acknowledgment. However, Nisha says that Pratap tricked Sapna to try not to make a scene at the hostel and that her dad's pride is more significant to him than Sapna's satisfaction. Upset, Sapna begs Pratap, who irately tells her that she must travel to London that very night. Under the pretense of harmony, Pratap brings Rohit to his factory, revealing his actual goals. Pratap tells Rohit that he will only be safe if he forgets Sapna. However, Rohit says he will not forget Sapna, Pratap orders Raman and his men to kill Rohit. They fiercely beat Rohit and throw him in a gully, and they leave assuming he is dead. Sapna overhears what Pratap said about Rohit's death and overdoses on pills, expecting to murder herself. She leaves a suicide note in her room and, prior to leaving for the airport, she tells her dad that he has ruined her so much that she wishes to be with her dead mother. After Sapna leaves, Nisha discovers her suicide note and tosses it at Pratap, shouting at him for wrongly ruining his own daughter's life. Pratap then regrets what he has done to his daughter.As Raman and his men escort Sapna to the airport, Rohit shows up, bloodied and infuriated. With recharged strength, he fights them off while Sapna coughs blood. She is about to succumb to her overdose when he maintains his love for her and gets her to a medical clinic, where she is treated and stabilized and still alive. The film concludes with Pratap, enthusiastic and humbled, quietly embracing Rohit for saving Sapna's life again and officially giving the couple his approval for their marriage."
}