{
    "id": "0294662",
    "localized title": "Kaante",
    "cast": [
        "Amitabh Bachchan",
        "Sanjay Dutt",
        "Suniel Shetty",
        "Mahesh Manjrekar",
        "Lucky Ali",
        "Kumar Gaurav",
        "Namrata Singh Gujral",
        "Malaika Arora",
        "Rati Agnihotri",
        "Isha Koppikar",
        "Ranjit Chowdhry",
        "Jf Davis",
        "Morgana Di Castlebesozza",
        "Sanjay Sippy",
        "Gilbert Aguilera",
        "Ike Bram",
        "Aslam Khan",
        "Kurt Sinclair",
        "Chris Chudney",
        "Nils Allen Stewart",
        "Jim Nelson",
        "Deya Simone",
        "Peter Esquivel",
        "Lucas Burke",
        "Ajay Vidure",
        "Michelle Deangekus",
        "Sterling Moore",
        "Rebecca Ritz",
        "Nathaniel McClure",
        "Ted Richard",
        "Arnie Alpert",
        "James Allen Bradley",
        "Shannon Green",
        "Christina Jupinko",
        "Marcy McCusker",
        "Maysen Michaels",
        "Tiffany Shepis",
        "Gulshan Grover",
        "Rohit Roy"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "154",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "DTS",
        "Dolby Digital",
        "SDDS"
    ],
    "certificates": [
        "Australia:MA15+",
        "India:A",
        "India:U::(video)",
        "New Zealand:M",
        "United Kingdom:15",
        "United States:R"
    ],
    "original air date": "20 Dec 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2FiZjY4YWYtNzU4Yy00YzAyLWJhMDMtNzEzNTU0Mjc3MDQ4XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0294662",
    "plot outline": "On or about 12May00, a truck gets stolen in Los Angeles, and the Police bring in six men of South Asian origin for questioning. They are: Yashvardhan Rampal, known as 'Major' educated intelligent, unemployed, with an ailing wife who longs to return to India; Non-English speaking Jay Rehan, otherwise known as 'Ajju', a foul-mouthed, trigger-happy gangster; A out-of-work former nightclub bouncer, Marc Issak, whose girlfriend, Lisa, is a bar dancer, and who is known to get into fights due to his uncontrollable temper; A drug deal, Raj Yadav, otherwise known as Bali, foul-mouthed, womanizer, stutterer, and alcoholic; Bali's sidekick, Maqbool Haider, otherwise known as Mac; White-collared Anand Mathur, alias Andy, recently separated from his wife, Renu, and longing to get back together with his son, who he cannot get custody of due to financial problems. The six confer in a cell, cite woes that even though the Italians have their Mafia, the Colombians have their Cartels, but the East Indian criminal community is yet to forge a Bhai-type organization, resulting in their getting pulled-in as the usual suspects every time there is a crime involving a colored person. They plot to get back at the cops by robbing the American Services Bank, perhaps the only bank which has a majority of it's clientèle employed by the city police. They plan and carry out this caper quite successfully, but when they exit the bank, they find themselves surrounded by the Police. After a shoot-out, They do manage to escape and meet in a secret hideout, to not only share the loot, but also try and find out who betrayed them. Ajju abducts Police Interrogator, Detective MacQuarrie, and it is through him they learn that their informer is one of them - and they must find out his identity - kill him - then divide the loot amongst them and disperse. The only problem is the informer is not willing to come forward - and the gangsters end up suspecting each other and their respective motives.",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Kaante",
    "kind": "movie",
    "directors": "Sanjay Gupta",
    "writers": [
        "Sanjay Gupta",
        "",
        "Yash Keswani",
        "",
        "Yash Keswani",
        "",
        "Vinay",
        "",
        "Milap Zaveri"
    ],
    "producers": [
        "Hanif Chunawala",
        "Anuradha Gupta",
        "Sanjay Gupta",
        "Robert Labrecque",
        "Lawrence Mortorff",
        "Pritish Nandy",
        "Raju Patel",
        "Hussain Shaikh",
        "Sanjay Sippy"
    ],
    "composers": [
        "Lucky Ali",
        "Anand Raj Anand",
        "Vishal Dadlani",
        "Gregor Narholz"
    ],
    "cinematographers": "Kurt Brabbee",
    "editors": "Bunty Nagi",
    "editorial department": "Alex Anthony Fernandes",
    "casting directors": [
        "Jennifer Alessi",
        "Kristan Berona"
    ],
    "production designers": [
        "Peter Jamison",
        "Priya Suhas"
    ],
    "art directors": "Linda Spheeris",
    "set decorators": "Linda Spheeris",
    "costume designers": [
        "Akbar Gabbana",
        "Jerry Ross",
        "Jerry M. Ross"
    ],
    "make up department": [
        "Deepak P. Bhatte",
        "Barbara Cantu",
        "Stephanie Coffey",
        "Sawant Deepak Dutta",
        "April Hutchinson",
        "R.J. McCasland",
        "Myke Michaels",
        "Kiran R. Naik",
        "Janette Nielsen",
        "Rick Wetzel"
    ],
    "production managers": [
        "Jeetendra Bhira",
        "Vanessa Hayes",
        "Susan McGuire",
        "Akhilesh Mishra"
    ],
    "assistant directors": [
        "Max Berryhill",
        "James Allen Bradley",
        "Charles Canzoneri",
        "Umesh Ghadge",
        "Navin Gujral",
        "Susan McGuire",
        "Spiro Razatos"
    ],
    "art department": [
        "Ellis J. Barbacoff",
        "Jennifer Bendror",
        "Tony Bonaventura",
        "Brendon Cowsill",
        "Tiffany Cowsill",
        "Tim Scheu",
        "Erik Thomson",
        "Lee Thomson"
    ],
    "sound department": [
        "C. Reed Hart",
        "Eric Hoeschen",
        "Peggy McAffee",
        "Paul Menichini",
        "Sterling Moore",
        "Anand Pawar",
        "Dhrubajyoti Phukan",
        "Paul Ratajczak",
        "Buck Robinson",
        "Shamim Sharfuddin Shaikh"
    ],
    "special effects": [
        "Frank Ceglia",
        "Brad Harris",
        "Mark Koivu",
        "Larry Roberts"
    ],
    "visual effects": [
        "Mahesh Baria",
        "Ketan Kale",
        "Susheel Peris",
        "Reupal D. Rawal",
        "Merzin Tavaria"
    ],
    "stunts": [
        "Dieter Rauter",
        "Spiro Razatos",
        "Gunter Simon",
        "Kishore Verma",
        "Scott Workman"
    ],
    "camera department": [
        "Jason Andrew",
        "Taylor Drake",
        "Bryan G. Haigh",
        "Harry Hope",
        "David Leite",
        "Terry Meadows",
        "David Moir",
        "Onofrio Nino Pansini",
        "Ron Wisnesky",
        "Rick Fee"
    ],
    "music department": [
        "Lucky Ali",
        "Anand Raj Anand",
        "Sudesh Bhonsle",
        "Sunidhi Chauhan",
        "Sanjay Dutt",
        "Zubeen Garg",
        "Dev Kohli",
        "Kavita Krishnamurthy",
        "Mahesh Manjrekar",
        "Udit Narayan",
        "Sonu Nigam",
        "Dhrubajyoti Phukan",
        "Shekhar Ravjiani",
        "David Santiago",
        "Kumar Sanu",
        "Shaan",
        "Richa Sharma",
        "Sukhwinder Singh"
    ],
    "script department": "Gail Bradley",
    "transportation department": [
        "Tony Barattini",
        "Buck Holland",
        "Constance L. Hoy"
    ],
    "miscellaneous": [
        "Crystal Connell",
        "Remo D'Souza",
        "Sulekha Ebelle",
        "Neisha Folkes-LeMelle",
        "Karen Kaiser",
        "Pankaj Kothari",
        "Scott Pitman",
        "Jayesh Pradhan",
        "Bharat S. Shah",
        "Shari Sontag",
        "Lauren Swearingen",
        "Sudesh Vaidya"
    ],
    "akas": [
        "Thorns (United States)",
        "Чужой среди своих (Russia)"
    ],
    "writer": [
        "Sanjay Gupta",
        "Yash Keswani",
        "Yash Keswani"
    ],
    "director": "Sanjay Gupta",
    "production companies": [
        "Film Club",
        "Pritish Nandy Communications",
        "White Feather Films"
    ],
    "distributors": [
        "MG Distribution",
        "Bollywood Pictures",
        "CMV Laservision",
        "Madman Entertainment",
        "Media Partners"
    ],
    "other companies": [
        "Chapman/Leonard Studio Equipment",
        "Gabbana Fashion",
        "L.A. Power & Light Company"
    ],
    "plot": [
        "Six bank robbers trying to pull off the perfect heist discover one of them is an undercover cop.",
        "On or about 12May00, a truck gets stolen in Los Angeles, and the Police bring in six men of South Asian origin for questioning. They are: Yashvardhan Rampal, known as 'Major' educated intelligent, unemployed, with an ailing wife who longs to return to India; Non-English speaking Jay Rehan, otherwise known as 'Ajju', a foul-mouthed, trigger-happy gangster; A out-of-work former nightclub bouncer, Marc Issak, whose girlfriend, Lisa, is a bar dancer, and who is known to get into fights due to his uncontrollable temper; A drug deal, Raj Yadav, otherwise known as Bali, foul-mouthed, womanizer, stutterer, and alcoholic; Bali's sidekick, Maqbool Haider, otherwise known as Mac; White-collared Anand Mathur, alias Andy, recently separated from his wife, Renu, and longing to get back together with his son, who he cannot get custody of due to financial problems. The six confer in a cell, cite woes that even though the Italians have their Mafia, the Colombians have their Cartels, but the East Indian criminal community is yet to forge a Bhai-type organization, resulting in their getting pulled-in as the usual suspects every time there is a crime involving a colored person. They plot to get back at the cops by robbing the American Services Bank, perhaps the only bank which has a majority of it's clientèle employed by the city police. They plan and carry out this caper quite successfully, but when they exit the bank, they find themselves surrounded by the Police. After a shoot-out, They do manage to escape and meet in a secret hideout, to not only share the loot, but also try and find out who betrayed them. Ajju abducts Police Interrogator, Detective MacQuarrie, and it is through him they learn that their informer is one of them - and they must find out his identity - kill him - then divide the loot amongst them and disperse. The only problem is the informer is not willing to come forward - and the gangsters end up suspecting each other and their respective motives.::rAjOo (gunwanti@hotmail.com)",
        "Kill, threaten, kidnap, maim, murder, steal... Meet the masters. In a world where loyalties are easily abandoned and allegiances bought, six perfect strangers come together to pull off the perfect crime. they must all trust each other. But when their simple robbery explodes into a bloody ambush, the ruthless killers realize that one of them is a cop. But which one?::Finy M <hutbay@yahoo.com>",
        "The story begins when six American citizens of Indian origin are brought together in a police line-up for questioning regarding a stolen truck. When they discover that none of them had anything to do with with the truck, they plan a revenge operation against the cops by robbing the bank where all the cops' salaries are deposited. The plan is supposed to be 'perfect' but it does not turn out to be so, as after the robbery the robbers discover that the cops are waiting for them outside the bank. A shootout ensues and even though the robbers manage to escape, they begin suspecting that one of them is a police informer. Soon everyone is suspicious of the others.::Soumitra",
        "Los Angeles six criminals of Indian origin Major,Andy,Ajju,Mark,Bali and Mak are questioned for stealing a truck as the eye witness had seen an Indian doing it.Ajju tell the rest that when ever such a crime takes place they are first to be arrested even due to know fault of their own. And the city police should pay for this.They all meet and hatch a plan to rob a bank funding the accounts of Los Angeles police and arrange for arms, ammunition,gadgets and vehicles to conduct the robbery.Two days before the robbery Major surprises everyone by telling that the robbery will be conducted next morning instead of scheduled date as no one can make their own plan.That night the six enjoy to the fullest by dancing ,drinking and singing ,next morning they enter the bank according to their plan and loot it successfully.While they are leaving the bank with looted booty they uncover their masked faces and to their shock they find that the city police is waiting just outside the bank to arrest them.::alex.mjacko@gmail.com",
        "Los Angeles, 12th May, 2000. Six Indian-Americans by the names Major, Ajju, Mark, Andy, Bali and Mak are bought into police custody for their \"alleged\" roles in stealing a laptop truck. Although cleared of any wrongdoing, six of them develop a resentment towards the police and plot revenge. Arranging for arms, electronics, explosives and cars, they plan to rob LAPD's Service American Bank. Although the process goes smoothly inside, outside the bank the six are met by a fully prepared SWAT team. They fight their way out to their safe house where a horrifying discovery awaits them: One of the six is actually an undercover cop.::ankit-singh92"
    ],
    "synopsis": "In Los Angeles, six criminals, all of Indian origin, are detained by the Police, and interrogated about stealing a truck full of laptops and its whereabouts. Their deep antipathy towards the police for arresting them without any evidence, just because the witnesses had seen an Indian at the crime scene, grows into a daring plot. Sparked off by \"Ajju\" (Sanjay Dutt) and seconded by \"Major\" (Amitabh Bachchan), they all hatch a plan to rob the bank in which lie the fundings for the Los Angeles Police Department. In return, Ajju reveals that he stole the truck and splits the steal with everyone else.Marc (Suniel Shetty) is a bouncer who hates that his girlfriend has to work as a club-dancer and wants to rescue her from the club owner Cyrus (Gulshan Grover), by paying him the required money. He also has an ongoing spat with Ajju about his girlfriend. Major has a sick wife who he has to look after by supplying her with medicines and injections. Andy (Kumar Gaurav) is a software engineer having divorce and custody troubles, as his wife won't let him meet their child. Bali (Mahesh Manjrekar) and Mak (Lucky Ali) are two drug-peddlers who live off the street selling and buying illicit drugs under a drug lord. They meet when Bali is being chased by some undercover policemen and meets Mak in an alley where he is adjusting something in his car. He agrees to save him only if he splits his loot. They agree to work on this method from that time on.All six meet on a hotel roof-top where they construct their plan and arrange for arms, ammunition, vehicles and gadgets. They do some reconnaissance around the bank and two days before the robbery, Major surprises everyone by declaring that the robbery will take place the next day.While the robbery happens as planned, they find a SWAT team waiting for them outside the bank. They are engaged in gunfight and Mak is hit by a bullet while saving Major. They all escape and meet at their hideout. They realize that someone might have informed the police, which could reach their hideout as well. Mak, who was hit, is not allowed to be taken to the hospital, and Major treats his wound with some alcohol. They all have verbal scuffles after which, Ajju, reveals that he has kidnapped the Police Chief. They interrogate him and learn that one of them is an undercover cop. This strikes terror among them and they decide to bring the stolen amount to their hideout. Major finds out that his wife has died. Ajju befriends Marc and tells him to elope with his girlfriend. When they return, they find Bali dead, killed by Mak for being inhuman in his interrogation of the Police Chief. Ajju reasons that Mak is the undercover cop, but Major disagrees because he believes Mak saved him during the gunfight at the bank. They all arrive at a Mexican stand-off, with Andy as the viewer. He retreats and runs away with the money. They all shoot at each other, after which Major apologizes to Mak for not saving him. In reply, Mak apologizes saying he was just doing his duty. Major realizes his mistake and shoots the already dying Mak in the head. Marc's girlfriend is shown waiting for him at the airport and Andy is shown at the end driving off the highway pursued by a Police helicopter, leaving the end to the discretion of audience followed by ending credits."
}