{
    "id": "0312883",
    "localized title": "Kya Yehi Pyaar Hai",
    "cast": [
        "Jackie Shroff",
        "Aftab Shivdasani",
        "Ameesha Patel",
        "Anupama Verma",
        "Ashish Vidyarthi",
        "Neena Kulkarni",
        "Vrajesh Hirjee",
        "Snehal Dabi",
        "Sarfaraz Khan",
        "Vinod Tharani",
        "Alharis Abdul",
        "Benifer Treasuryvala",
        "Avtar Gill",
        "Atul Mathur"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "United Kingdom:PG",
        "United Kingdom:PG"
    ],
    "original air date": "10 Apr 2002 (Kuwait)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOThiNDcyNTEtYzViZS00N2JjLWIyMzItOGE2MjU0M2ZhNTZiXkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "0312883",
    "plot outline": "Rahul Tiwari secretly love Sandhya Patil for almost 4 years. Using the right opportunity he does express his love to Sandhya only to be told that Sandhya has no similar feelings for him but is only interested in completing her studies and is an abstainer from love and romance due to her drunk and abusive father, Raj Patil alias Raja.",
    "languages": "Hindi",
    "title": "Kya Yehi Pyaar Hai",
    "kind": "movie",
    "directors": "K. Muralimohana Rao",
    "writers": "Javed Siddiqui",
    "producers": [
        "Allu Aravind",
        "Kumar Sadhuram Taurani",
        "Ramesh Sadhuram Taurani",
        "Mukesh Udeshi"
    ],
    "composers": [
        "Wajid Ali",
        "Sajid-Wajid"
    ],
    "cinematographers": "Chota K. Naidu",
    "editors": "K. Ravi Kumar",
    "editorial department": "Raaj Nadar",
    "production managers": "Prakash Talreja",
    "visual effects": "Tarun Kripalani",
    "music department": [
        "Ajay",
        "Sunidhi Chauhan",
        "Raman Dandyan",
        "Rashid Khan",
        "Krishnakumar Kunnath",
        "Sonu Nigam",
        "Kumar Sanu",
        "Jalees Sherwani",
        "Babul Supriyo",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Ritchie Burton",
        "Raaj Nadar"
    ],
    "akas": "Is This Love? (World-wide, English title)",
    "writer": "Javed Siddiqui",
    "director": "K. Muralimohana Rao",
    "plot": [
        "A college slacker pursues the girl of his dreams and will do just about anything to get her to like him.",
        "Rahul Tiwari secretly love Sandhya Patil for almost 4 years. Using the right opportunity he does express his love to Sandhya only to be told that Sandhya has no similar feelings for him but is only interested in completing her studies and is an abstainer from love and romance due to her drunk and abusive father, Raj Patil alias Raja.::gavin (racktoo@hotmail.com)",
        "Rahul Tiwari (Aaftab Shivdasani) is in love with Sandhya Patil (Amisha Patel). For the last four years or so that is, and has not had the courage to tell her. He follows her everywhere; waits until the public bus she uses and then boards it. And as for Sandhya she is not even aware of Rahul leave alone his affection for her. One day Rahul finds out where Sandhya lives, and he also finds out that her father is Police Inspector Raj Patil \"Raja\"(Ashish Vidyarthi), a cruel, sadistic, drunk, and abusive man, whose wife Rachna (Neena Kulkarni) and daughter live in virtual fear, even when he is not around. Raj Patil has no respect for any human being, his superiors, his subordinates, nor members of the public to whom he is sworn to protect. Raj Patil finds out that Rahul is trying to enter the life of his daughter, he arrests him publicly, beats his up, and locks him in a cell in his Police Station. Rahul's brother Dr. Kamlakar Tiwari (Jackie Shroff) arranges to get Rahul out of the cell with the help of Raj Patil's superiors. Kamlakar hopes that this would have taught Rahul a lesson, but it has not, and Rahul contiues to be obsessed with Sandhya, even though Sandhya has clearly told him and his college friend, Neha (Anupama Verma) that she is only interested in pursuing her studies, and not interested in Rahul at all. Raj Patil tells his wife and daughter that they are to leave the city immediately, and move to Hyderbad with his sister. Rahul finds out and he too leaves the city and goes to Hyderabad to seek Sandhya, not knowing these events are going to change his life and way of thinking forever.::rAjOo (gunwanti@hotmail.com)"
    ]
}