{
    "id": "0313844",
    "localized title": "16 December",
    "cast": [
        "Milind Soman",
        "Danny Denzongpa",
        "Gulshan Grover",
        "Dipannita Sharma",
        "Sushant Singh",
        "Aditi Govitrikar",
        "Vinay Varma",
        "Reza",
        "Sohil Mathur",
        "Sajeel Parakh",
        "Gaurav Tiwari"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "158",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(Technicolor)",
    "certificates": [
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "22 Mar 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODczNjBmN2MtZjYwZi00ZjA4LTk1NTEtOTEwZTQwMDRkYzlmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0313844",
    "plot outline": "16 December, 1971 was the day when India won the war against Pakistan, and was also able to liberate Bangla Desh from Pakistan's rule. Although the ruling dictator of Pakistan surrendered unconditionally to India, some of the hard-lined Pakistani soldiers were bitter and angry at the surrender, as they wanted to continue fighting the Indians until their last breath. They retreated in silent and later came together to form their own groups of Jihaadi soldiers to carry out terrorists attacks against neighboring India. One of them was Dost Khan (Gulshan Grover). Although the Indian authorities were aware of Dost Khan's terrorist activities, they were unable to apprehend him as he kept changing disguises, and always kept one step ahead of the authorities. This matter was assigned to Chief of Revenue Intelligence Vir Vijay singh (Danny Denzongpa) and his team of Vikram (Milind Soman), Victor (Sushant Singh), and Sheeba (Dipanita Sharma). Their investigation led them to the conclusion that terrorists had been able to acquire a nuclear bomb, at the time of the break-up of the Soviet Union, and that nuclear bomb is now in India's capital Delhi. 16th December is the deadline for the nuclear bomb to explode, however, Vir Vijay Singh and his team have not idea about the location of the bomb, nor of Dost Khan.",
    "languages": "Hindi",
    "title": "16 December",
    "kind": "movie",
    "directors": "Mani Shankar",
    "writers": [
        "Mani Shankar",
        "",
        "Mani Shankar",
        "",
        "Mani Shankar"
    ],
    "producers": [
        "Ashish Bhatnagar",
        "Anjali Joshi",
        "Arunima Roy"
    ],
    "composers": "Karthik Raja",
    "cinematographers": "Ajay Vincent",
    "editors": [
        "Anjali Joshi",
        "Mani Shankar"
    ],
    "production designers": "Anjali Joshi",
    "special effects": "Mani Shankar",
    "visual effects": "Biju Dhanpalan",
    "camera department": [
        "Mohan Shankar Kopanathi",
        "T. Surendra Reddy"
    ],
    "animation department": "Nitin Bhalla",
    "casting department": "Amit Arora",
    "music department": [
        "Sapna Awasthi",
        "K.S. Chithra",
        "Krishnakumar Kunnath",
        "Sadhana Sargam",
        "Shaan",
        "Milind Soman",
        "Subhiksha"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Alnoor Merchant",
        "Akash Patel",
        "Devang Shah"
    ],
    "akas": [
        "16 grudnia (Poland)",
        "16 декабря (Russia)"
    ],
    "writer": [
        "Mani Shankar",
        "Mani Shankar",
        "Mani Shankar"
    ],
    "director": "Mani Shankar",
    "distributors": "iDream Productions",
    "plot": [
        "Indian intelligence agents race against time to stop a renegade Pakistani terrorist from detonating a nuclear weapon in Delhi.",
        "_16 December_ (qv), 1971 was the day when India won the war against Pakistan, and was also able to liberate Bangla Desh from Pakistan's rule. Although the ruling dictator of Pakistan surrendered unconditionally to India, some of the hard-lined Pakistani soldiers were bitter and angry at the surrender, as they wanted to continue fighting the Indians until their last breath. They retreated in silent and later came together to form their own groups of Jihaadi soldiers to carry out terrorists attacks against neighboring India. One of them was Dost Khan (Gulshan Grover). Although the Indian authorities were aware of Dost Khan's terrorist activities, they were unable to apprehend him as he kept changing disguises, and always kept one step ahead of the authorities. This matter was assigned to Chief of Revenue Intelligence Vir Vijay singh (Danny Denzongpa) and his team of Vikram (Milind Soman), Victor (Sushant Singh), and Sheeba (Dipanita Sharma). Their investigation led them to the conclusion that terrorists had been able to acquire a nuclear bomb, at the time of the break-up of the Soviet Union, and that nuclear bomb is now in India's capital Delhi. 16th December is the deadline for the nuclear bomb to explode, however, Vir Vijay Singh and his team have not idea about the location of the bomb, nor of Dost Khan.::rAjOo (gunwanti@hotmail.com)"
    ]
}