{
    "id": "0316911",
    "localized title": "Yeh Kaisi Mohabbat",
    "cast": [
        "Krishna Abhishek",
        "Viveka Babajee",
        "Sheeba Bhakri",
        "Deeksha",
        "Dinesh Hingoo",
        "Sharad S. Kapoor",
        "Krishna",
        "Johny Lever",
        "Mehmood Jr.",
        "Mukesh Rishi",
        "Javed Rizvi",
        "Anjan Srivastav",
        "Deepak Tijori"
    ],
    "genres": [
        "Musical",
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Stereo",
    "original air date": "31 May 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTllNzJjMGItY2ZmYy00YzUxLThhZDktZjIyZmU3YTUzY2JlL2ltYWdlXkEyXkFqcGdeQXVyMjQ2MjgyNjY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0316911",
    "plot outline": "Yeh Kaisi Mohabbat (YKM) is a romantic thriller. It deals with a whole lot of fun, romance and suspense. It is story of an innocent boy Vicky. The plot involves an innocent poor boy, who is a happy go lucky, always trying to live a stylish life. He is always in search of a rich girl with a view to live a luxurious life with her money. He lives in a motor garage with his six friends. the friends always help him with his requirements. One of the friends is a dress designer and provides him the artist's clothes and imported cars are provided to him to enjoy life. The boy falls in love with a rich girl, Tina. He presents himself to be a rich boy, fool her and romance with her. He saves a rich man (Rahul Thakral) from the goons, who offers him a job. The boy gets a shock when he comes to know that the job involves spying Rahul's wife. He is again shocked to see the wife, she is Tina. He is confused. Priya is a glamorous woman and has high standards of living. She has an emotional bond with a Casino owner (Vijay Pal). Paaji is a millionaire sardarji who believes in distributing & spending lavishly his wealth on his friends. Does the hero succeed love? Does Krishna achieve his love? Where does the high standards take Priya? Who is murdered & who is the murderer... Forms the crux of the film.",
    "languages": "Hindi",
    "title": "Yeh Kaisi Mohabbat",
    "kind": "movie",
    "directors": "Dinkar Kapur",
    "writers": [
        "Aadesh K. Arjun",
        "",
        "Y.N. Kapoor"
    ],
    "producers": [
        "Vinit Handa",
        "Ashok Kotwani",
        "Sanjeev Kumar Sharma"
    ],
    "composers": "Sandeep Chowta",
    "cinematographers": "S. Pappu",
    "make up department": "Shrikant P. Desai",
    "assistant directors": "Rohit Chaudhary",
    "sound department": [
        "Vikram Biswas",
        "Ajith Abraham George"
    ],
    "camera department": "Junaid Shaikh",
    "music department": [
        "Paul Praveen Kumar",
        "Kumar Sanu",
        "Alka Yagnik"
    ],
    "miscellaneous": "Himanshu Jhunjhunwala",
    "akas": "Yeh Kaisi Mohabbat (India)",
    "writer": [
        "Aadesh K. Arjun",
        "Y.N. Kapoor"
    ],
    "director": "Dinkar Kapur",
    "production companies": "Ashco Media Arts",
    "other companies": "Glamsham.com",
    "plot": [
        "_Yeh Kaisi Mohabbat_ (qv) (YKM) is a romantic thriller. It deals with a whole lot of fun, romance and suspense. It is story of an innocent boy Vicky. The plot involves an innocent poor boy, who is a happy go lucky, always trying to live a stylish life. He is always in search of a rich girl with a view to live a luxurious life with her money. He lives in a motor garage with his six friends. the friends always help him with his requirements. One of the friends is a dress designer and provides him the artist's clothes and imported cars are provided to him to enjoy life. The boy falls in love with a rich girl, Tina. He presents himself to be a rich boy, fool her and romance with her. He saves a rich man (Rahul Thakral) from the goons, who offers him a job. The boy gets a shock when he comes to know that the job involves spying Rahul's wife. He is again shocked to see the wife, she is Tina. He is confused. Priya is a glamorous woman and has high standards of living. She has an emotional bond with a Casino owner (Vijay Pal). Paaji is a millionaire sardarji who believes in distributing & spending lavishly his wealth on his friends. Does the hero succeed love? Does Krishna achieve his love? Where does the high standards take Priya? Who is murdered & who is the murderer... Forms the crux of the film.::<bhavik@glamsham.com>",
        "Vicky save the life of a wealthy businessman, Rahul Thakral from the attack of assassins. They then befriend each other and Rahul offers Vicky a job namely to spy on his wife - Vicky accepts the job and realizes that Rahul's wife is the look-alike of his girlfriend, Tina - unknown to Vicky that he is entering a world of lies, deceit and crime which will soon engulf his life.::gavin (racktoo@hotmail.com)",
        "Vicky is a dancer and singer in a local club and hangs out with friends who work in a garage. He meets and falls in love with Tina. One day he rescues a wealthy man, Rahul Thakral from being attacked by assassins. Rahul is pleased and grateful, and offers a job to Vicky, namely to keep an eye on his wife. Rahul reluctantly agrees. When he meets Rahul's wife for the first time, he is shocked for it is none other than Tina, or so he thinks. He eventually realises that Rahul's wife is Tina's look-alike. Rahul's wife finds out that Vicky is spying on her, she befriends him, and even has him over to celebrate her birthday. And then when she goes indoors, Vicky hears a scream, and on going indoors, finds the dead body of Rahul's wife. He panics and runs away. The police are on the lookout for him. His friends eventally tell the police of Vicky's whereabouts and he is arrested. He gets to attend the funeral of Rahul's wife, and forces them to open the coffin, only to find that the woman inside is not Tina's look-alike but someone else.::rAjOo (gunwanti@hotmail.com)",
        "Orphan at a very young age, Vicky is taken in by a few mechanics who runs a garage to make a few bucks. There he grows up and had always had a stylish attitude to woo a wealthy girl and enjoys her wealth. He frequents different stylish nightclubs in the city and even enjoys all new rides that enters the garage, this takes him to Tina, of whom he falls in love with. One day he saves a young and wealthy fellow, Rahul Thakral and became much friendly with him, offers a job to him, namely to keep an eye over his wife, whom he suspect is cheating on him. Vicky does accept the job and a small fee and begins his job, soon he realizes that Rahul's wife is Tina's look-alike. She soon realizes that he is spying on her, befriends him and invite him home to her birthday party, of which he attends. Soon he realizes that Rahul's wife has been murder and he is deem her murderer, now he is on the run from the police and Rahul who wants him dead or alive to turn a around a new twist in the story.::gavin (gunmasterM@hotmail.com)"
    ]
}