{
    "id": "0326983",
    "localized title": "Jaani Dushman: Ek Anokhi Kahani",
    "cast": [
        "Sunny Deol",
        "Arman Kohli",
        "Manisha Koirala",
        "Akshay Kumar",
        "Sonu Nigam",
        "Suniel Shetty",
        "Arshad Warsi",
        "Aftab Shivdasani",
        "Aditya Pancholi",
        "Rambha",
        "Pinky Campbell",
        "Raj Babbar",
        "Kiran Rathod",
        "Sharad S. Kapoor",
        "Rajat Bedi",
        "Johny Lever",
        "Amrish Puri",
        "Preeti Bhutani",
        "Atul Agnihotri",
        "Jaspal Bhatti",
        "Dinesh Hingoo",
        "Ali Khan",
        "Shahbaaz Khan",
        "Kiran Kumar",
        "Raju Mavani",
        "Raza Murad",
        "Gavin Packard",
        "Payal",
        "Shamsuddin",
        "Siddharth",
        "Upasna Singh",
        "Aman Verma"
    ],
    "genres": [
        "Action",
        "Fantasy",
        "Thriller"
    ],
    "runtimes": "170",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Canada:G::(Quebec)",
        "India:A",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "16 Aug 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2NmYTg1NjEtY2IzMy00ZmVjLThkZjYtNDBkZDIzOTlmZWIyXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0326983",
    "plot outline": "Diyva and Karan Saxena are in love and plan to marry. Karan has a younger step-brother, Vivek Saxena who he looks after him as though he were his own brother. Divya and Vivek hang out with quite a few young people of their own age, Atul, Vijay, Prem, Ashok, Nita, Rashmi, Niki, and Priti, just to name a few. Two male members try to sexually molest Divya, and get a sound thrashing from Karan. After apologizing, these two members decide to avenge their beating and humiliation. After entrapping Divya, they sexually molest her to such an extent that Divya attempts to kill herself. Unknown to Divya, she was the lover of Kapil a snake with magical powers, in a previous life. Their love life was shattered by an angry sage who cursed them with separation until the 21st century. Divya, who was called Vasundhara in her previous life, dies after this curse, and is reborn as Divya. Now seeing Divya dying, Kapil swears to avenge her death by killing them one by one. Divya does die, but her spirit has survived and joins Kapil to avenge her humiliation and death, not against the two members, but against all the male members. Soon death visits the friends one by one, and no one can stop the killing.",
    "languages": "Hindi",
    "title": "Jaani Dushman: Ek Anokhi Kahani",
    "kind": "movie",
    "directors": "Rajkumar Kohli",
    "writers": [
        "Naveena Bhandari",
        "",
        "Ravi Shankar Jaiswal",
        "",
        "Rajkumar Kohli",
        "",
        "Rajendra Singh 'Atish'",
        "",
        "K.K. Singh"
    ],
    "producers": "Rajkumar Kohli",
    "composers": [
        "Anand Raj Anand",
        "Anand Chitragupth",
        "Milind Chitragupth",
        "Sandeep Chowta"
    ],
    "cinematographers": [
        "Damodar Naidu",
        "Thomas A. Xavier"
    ],
    "editors": [
        "Dilip Darak",
        "Kuku"
    ],
    "art directors": [
        "Sunil Singh",
        "Pawan Verma"
    ],
    "make up department": "Raju Naag",
    "production managers": "M. Riaz",
    "sound department": "J.P. Sehgal",
    "visual effects": "Govardhan Vigraham",
    "stunts": [
        "James Barla",
        "Javed Karim",
        "Abbas Ali Moghul",
        "Tinnu Verma"
    ],
    "camera department": [
        "Romeo Fonseca",
        "Araj Khan"
    ],
    "music department": [
        "Harry Anand",
        "Sunidhi Chauhan",
        "Raman Dandyan",
        "Pamela Jain",
        "Paul Praveen Kumar",
        "Udit Narayan",
        "Jaspinder Narula",
        "Sonu Nigam",
        "Nayan Rathod",
        "Sameer",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Ganesh Acharya",
        "Raman Bhandari",
        "S.A. Ehsan",
        "Tarique Ejaz",
        "Caesar Gonsalves",
        "Raju Karia",
        "Sanaullah Khan",
        "Bosco Martis"
    ],
    "akas": "Проклятие (Russia)",
    "writer": [
        "Naveena Bhandari",
        "Ravi Shankar Jaiswal",
        "Rajkumar Kohli"
    ],
    "director": "Rajkumar Kohli",
    "production companies": [
        "Chakadola Films",
        "Shankar Films"
    ],
    "distributors": [
        "Video Sound",
        "Video Sound",
        "Video Sound"
    ],
    "plot": [
        "A shape-shifting snake exacts vengeance on a group of friends for a crime they did not even commit.",
        "Diyva and Karan Saxena are in love and plan to marry. Karan has a younger step-brother, Vivek Saxena who he looks after him as though he were his own brother. Divya and Vivek hang out with quite a few young people of their own age, Atul, Vijay, Prem, Ashok, Nita, Rashmi, Niki, and Priti, just to name a few. Two male members try to sexually molest Divya, and get a sound thrashing from Karan. After apologizing, these two members decide to avenge their beating and humiliation. After entrapping Divya, they sexually molest her to such an extent that Divya attempts to kill herself. Unknown to Divya, she was the lover of Kapil a snake with magical powers, in a previous life. Their love life was shattered by an angry sage who cursed them with separation until the 21st century. Divya, who was called Vasundhara in her previous life, dies after this curse, and is reborn as Divya. Now seeing Divya dying, Kapil swears to avenge her death by killing them one by one. Divya does die, but her spirit has survived and joins Kapil to avenge her humiliation and death, not against the two members, but against all the male members. Soon death visits the friends one by one, and no one can stop the killing.::rAjOo (gunwanti@hotmail.com)",
        "A group of young people must try and save themselves from an invincible man, Kapil and his lover, Vasundhara. The problem is Kapil have powers to take the form of anything at any time at will and cannot be destroy by bullets or any other method(s) used to kill him while Vasundhara was raped and killed thus holding the same people she wants to kill responsible for her current plight.::gavin (racktoo@hotmail.com)",
        "Rajesh is killed grievously during his wedding night his friends try to trace his missing wife but find her no where.A dead Divya had posed has his wife and killed him.Divya was in love with Karan but while he was away she was brutally raped by Rajesh and Madan following which she committed suicide.Vijay,Ashok Abdul,Atul,Prem,Vivek and Victor all studied in the same college with Divya,Rajesh and Madan and she believes all are equally responsible for her death which was game played by Rajesh and Madan to get Divya to the party in name of other friends.Before her death Divya found about Kapil that they were snakes in their previous life and loved each other.But hey couldn't be one as Divya died due to a curse by Maharaj.Divya is born as a human being years later while Kapil still waits for her as snake.After he death Divya's spirit and Kapil's magical powers decide to give the harsh punishment to everyone responsible.::alex.mjacko@gmail.com",
        "Diyva and Karan Saxena are in love and plan to marry, after Karan goes to London for some business opportunity. Karan has a younger step-brother, Vivek Saxena who he looks after him as though he were his own brother. Divya and Vivek hang out with quite a few young people of their own age, Atul, Vijay, Prem,Ashok, Nita, Rashmi, Niki, and Priti, just to name a few. Two male members try to sexually molest Divya, and get a sound thrashing from Karan. After apologizing, these two members decide to avenge their beating and humiliation. After entrapping Divya, they sexually molest her to such an extent that Divya attempts to kill herself. Unknown to Divya, she was the lover of Kapil a snake with magical powers, in a previous life. Their love life was shattered by an angry sage who cursed them with separation until the 21st century. Divya, who was called Vasundhara in her previous life, dies after this curse, and is reborn as Divya. Now seeing Divya dying, Kapil swears to avenge her death by killing them one by one. Divya does die, but her spirit has survived and joins Kapil to avenge her humiliation and death, not against the two members, but against all the male members. Soon death visits the friends one by one, and no one can stop the killing. Until one fine day Karan returns from London only to find that Divya is no more alive and that his brother is wanted by Divya and Kapil in connection with Divya's murder but Karan assure to everyone that anyone who touches his brother will not remain alive. And that he will die but keep up his promise.::gavin@sunny_deol2009@yahoo.com"
    ]
}