{
    "id": "0331256",
    "localized title": "Gunaah",
    "cast": [
        "Bipasha Basu",
        "Dino Morea",
        "Ashutosh Rana",
        "Banjara",
        "Sharad Chauhan",
        "Baby Gazala",
        "Avtar Gill",
        "Irrfan Khan",
        "Jahangir Khan",
        "Sumukhi Pendse",
        "Vishwajeet Pradhan",
        "Raja",
        "Mugdha Shah",
        "Shakeel",
        "Yashpal Sharma",
        "Sunil Shende",
        "Jaywant Wadkar",
        "Naushaad Abbas"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:A",
        "New Zealand:M",
        "United Kingdom:15"
    ],
    "original air date": "16 Oct 2002 (Kuwait)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZmZmMTkwMWEtNTI3ZS00NzI5LTliMTktYTBjYWY0MWUxY2E5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "0331256",
    "plot outline": "Tough cop Prabha (Bipasha Basu) is haunted by the demons of her past. Being an illegitimate daughter of a prostitute, she has had a very bad childhood and there once occurred an incident in her life when she was driven to the point of committing a murder. But today, now that she is a cop, she believes that she can clear her conscience by reforming a criminal. Prabha's life is turned topsy-turvy with the entry of Aditya (Dino Morea), who is a good person at heart but was forced to take the path of crime due to the wrong doing of the system. Prabha goes to Aditya's house to nab him, but gets carried away when she sees him bathing. Aditya slips from under her vigilant eyes and a hasty chase follows. Prabha stays close on the heels of fleeing Aditya. At one point when she is about to fall off the rooftop Aditya stops running and extends his hand to save her. This act makes a great impact on Prabha. Prabha decides to know Aditya's past and find out what prompted him to commit crime in the first place. She decides to reform him but herself gets 'reformed' into loving him in the process.",
    "languages": "Hindi",
    "title": "Gunaah",
    "kind": "movie",
    "directors": "Amol Shetge",
    "writers": [
        "Mahesh Bhatt",
        "",
        "Pranay Narayan"
    ],
    "producers": [
        "Mukesh Bhatt",
        "Kumkum Saigal"
    ],
    "composers": [
        "Sajid Ali",
        "Anand Raj Anand",
        "Raju Rao"
    ],
    "cinematographers": "Ishwar Bidri",
    "editors": "Mohammed Rafique",
    "editorial department": "Sundeep Mohnot",
    "art directors": "Satyen Chowdhury",
    "production managers": "Sadashiv Athule",
    "assistant directors": "Pranay Narayan",
    "sound department": [
        "Karnail Singh",
        "Vikram Biswas"
    ],
    "visual effects": "Mukul Rawat",
    "stunts": [
        "Javed Karim",
        "Abbas Ali Moghul"
    ],
    "camera department": "Sanjeev Bidri",
    "music department": [
        "Abhijeet",
        "Faaiz Anwar",
        "Anand Bakshi",
        "Praveen Bhardwaj",
        "Sunidhi Chauhan",
        "Sonu Nigam",
        "Roop Kumar Rathod",
        "Afzal Sabri",
        "Kumar Sanu",
        "Babul Supriyo",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Reshma Khan",
        "Sumit Sabherwal",
        "Ramesh Thapar"
    ],
    "writer": [
        "Mahesh Bhatt",
        "Pranay Narayan"
    ],
    "director": "Amol Shetge",
    "production companies": "NH Studioz",
    "distributors": "NH Studioz",
    "other companies": "Sony Music",
    "plot": [
        "Tough cop Prabha (Bipasha Basu) is haunted by the demons of her past. Being an illegitimate daughter of a prostitute, she has had a very bad childhood and there once occurred an incident in her life when she was driven to the point of committing a murder. But today, now that she is a cop, she believes that she can clear her conscience by reforming a criminal. Prabha's life is turned topsy-turvy with the entry of Aditya (Dino Morea), who is a good person at heart but was forced to take the path of crime due to the wrong doing of the system. Prabha goes to Aditya's house to nab him, but gets carried away when she sees him bathing. Aditya slips from under her vigilant eyes and a hasty chase follows. Prabha stays close on the heels of fleeing Aditya. At one point when she is about to fall off the rooftop Aditya stops running and extends his hand to save her. This act makes a great impact on Prabha. Prabha decides to know Aditya's past and find out what prompted him to commit crime in the first place. She decides to reform him but herself gets 'reformed' into loving him in the process.::gavin@sunny_deol2009@yahoo.com",
        "In his aggression to expose the criminal activities of Dr. Mahesh Mirchandani through his writing; a journalist, Satyakam Kashyap finds himself on the threshold of life when he is mercilessly killed by Mahesh and a corrupt police inspector, Digvijay Pandey. Though corrupt six years later Digvijay manages to progress in the eyes of the law and is promoted to Assistant Commissioner of Police; quite unknown to him that Satyakam's son, Aditya is thirsty for revenge and has join a group of revolutionaries headed by the notorious Parshuram. Aditya manages to locate Mahesh and kill him but unfortunately while committing the act he gets caught on surveillance camera which alerts the police department where-by police inspector, Prabha Narayan arrests him and lodges him in a cell pending trial in a court of law. A few days later Aditya's case is called up in court and the verdict is to keep him under police remand for a period of 12 days until he confesses the where-about of the remanding of the gang. Eventually Prabha and Aditya starts to get acquainted with each other which blossoms into friendship with both sharing each other past miseries prompting the relationship to lead to the path of love and affections. Then there is a showdown when Aditya escapes from police custody and is on the verge of killing Digvijay and Prabha is the one assign to either re-arrest or shoot him.::gavin (racktoo@hotmail.com)",
        "In Mumbai, Prabha Narayan is an honest cop close to exposing a corrupt assistant commissioner, ACP Panday. She's also investigating the murder of a prominent man and has a suspect in custody within a few hours of the crime. The suspect, Aditya, is a puzzle: in the course of the arrest, he saves her life, and once in jail, he says nothing. There are connections she must untangle: why has this compassionate young man committed murder, who are his associates, and why is Panday taking such an interest in this case? As she finds herself attracted to the murder suspect, she also finds herself tracking revolutionaries and reopening a murder case that's six years old. All is connected.::<jhailey@hotmail.com>",
        "When Aditya Kashyap finds out that his father has been mysteriously murdered, he goes to the police station to file a First Information Report, however, the police refuse to comply. Frustrated he joins a group of revolutionaries, lead by their leader, Parshuram, and ends up killing Social Worker/Dr. Mahesh Mirchandani. Unfortunately for Aditya, he is caught on video camera, apprehended by Inspector Prabha Narayan and held in a cell for questioning. He refuses to speak until such time Prabha manages to convince him that she has fallen in love with him. Both talk about their previous life experiences and find out that they do have a lot in common. With Aditya and Ex-Havaldar's Madhusudan Gokhale's help, Prabha is able to get A.C.P. Digvijay Pandey and his close associate, Inspector Patil suspended from work, pending an inquiry about their active involvement in Satyakam's death. Pandey mocks the Indian Judicial System and is quite confident that he will not be charged, as so many inquiries had taken place in the past - and they have never resulted in the conviction and imprisonment of any politician or policeman. A few days later, Aditya finds out that Prabha has been killed by Pandey, and he dramatically escapes from prison - his mission to find and kill Pandey and whoever dares to stop him.::rAjOo (gunwanti@hotmail.com)",
        "Due to the loopholes of the law, young Aditya is forced onto the path of crime. Forming his own gang, he became the biggest criminal lord of the city. A disturbed female cop, Prabha is given the task of apprehending Aditya. She does manage to nab him and attempts to find out why he became a criminal and attempts to reform him. In the process of reforming him, Prabha falls in love with Aditya. She soon convinces him to surrender to the law, which he does, he is soon tried in court, proven guilty and is held in a cell. Due to a change in the judicial system, corrupt cop, ACP Digvijay Pandey looses his job and vows to average this from Prabha, he does so by abducting her, sexually molest her and she is soon pronounced dead. Now Aditya is baying for his blood and will only wait for a chance to escape and grant his revenge from Digvijay Pandey.::gavin (gunmasterM@hotmail.com)"
    ]
}