{
    "id": "0375997",
    "localized title": "Nandha",
    "cast": [
        "Suriya",
        "Laila",
        "Raj Kiran",
        "Rajashri",
        "Karunas",
        "Saravanan",
        "Sheela Kaur",
        "Rajashree",
        "'Nandha' Saravanan",
        "Vinoth Kishan",
        "Mu Ramaswamy"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "165",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "sound mix": "DTS",
    "certificates": [
        "Canada:13+::(Quebec)",
        "India:A",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "14 Nov 2001 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzVkMzBlYjQtNjljZi00YjM5LTljYmQtYTU3Zjk1ZjIzYzJiXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR8,0,101,150_.jpg",
    "imdbID": "0375997",
    "plot outline": "Nandha kills his father in the confusion that follows when his mother discovers her husband's philandering. Nandha is packed off to juvenile prison, leaving behind his deaf and dumb mother and baby sister. When Nandha exits prison, it is as a young man (Surya) who, first crack out of the box, discovers that his mother wants to have nothing to do with him.",
    "languages": "Tamil",
    "title": "Nandha",
    "kind": "movie",
    "directors": "Bala",
    "writers": "Bala",
    "composers": "Yuvan Shankar Raja",
    "cinematographers": "R. Rathnavelu",
    "editors": "Suresh Urs",
    "art directors": "Raamachandran",
    "visual effects": [
        "Zameer Hussain",
        "Vee Jay",
        "Ramesh Karthikeyan",
        "P. Mohan",
        "Kalai Selvan"
    ],
    "music department": [
        "Aandaal",
        "S.P. Balasubrahmanyam",
        "Pazhani Bharathi",
        "Fegi",
        "Ganga",
        "Ilaiyaraaja",
        "Kanchana",
        "Raja Lakshmi",
        "Madhumita",
        "Charulatha Mani",
        "Febi Mani",
        "Na. Muthukumar",
        "Pulamaipithan",
        "Malgadi Shubha",
        "Anuradha Sriram",
        "Thamarai",
        "Unnikrishnan",
        "Pa. Vijay"
    ],
    "akas": [
        "The Return of Vaastav",
        "Нанда (Russia)"
    ],
    "writer": "Bala",
    "director": "Bala",
    "production companies": "Aparanjeeth Films",
    "distributors": [
        "Aparanjeeth Films",
        "Pyramid",
        "Sun NXT",
        "Sun TV"
    ],
    "other companies": [
        "Five Star",
        "Mass Audios",
        "Roja Audios"
    ],
    "plot": [
        "Looking to put behind a past that haunts him, _Nandha_ (qv) tries to reconcile with his mother and live life on his terms.",
        "_Nandha_ (qv) kills his father in the confusion that follows when his mother discovers her husband's philandering. _Nandha_ (qv) is packed off to juvenile prison, leaving behind his deaf and dumb mother and baby sister. When _Nandha_ (qv) exits prison, it is as a young man (Surya) who, first crack out of the box, discovers that his mother wants to have nothing to do with him.::RC"
    ],
    "synopsis": "The story happens in the town of Ramanathapuram. Nandha (Suriya) is shipped off a restoration community for killing his dad as a kid in the wake of seeing his dad's disloyalty and maltreatment towards Nandha's mom (Rajashree) when she discovers it. He gets back to his mom, who is deaf and mute, and his sister (Sheela), who are as still in depression after what happened their family. NeitNandha chooses to get another life by attempting to give himself an college education. Having the record of being an ex-convict, he finds it hard to get a seat in a school. He meets Periyavar (Rajkiran), a rich taskmaster who runs an arts and science school with an iron hand. Periyavar's ancestors were the rulers of the Ramanathapuram realm and conformed in with the Britishers. After autonomy, the entirety of their castles and titles were taken by India's administration, however a great deal of other material abundance was in their grasp. He actually thinks of himself as a watchman of individuals and helps a great deal of poor people. He even goes to the degree of giving equity when law and police can't or won't.Periyavar builds up a delicate corner for Nandha and aides him like his own child. Kalyani (Laila), a Tamil exile from Sri Lanka, meets Nandha and both begin to fall in love. Then, the villain Saravanan asks Periyavar, who likewise helps Sri Lankan studies in his college a lot, to help a withdrawn component, however, Periyavar denies it.Periyavar's son-in-law consents to help Saravanan. Then, Periyavar falls sick and gets admitted to the hospital. Nandha remains around to care for his mentor and guide. Worried about what he has done may be out in the light, the son-in-law pulls out the oxygen tube of Periyavar in the medical clinic when Nandha is not there and accuses Nandha of killing his father-in-law. Nandha, suffering the torment of losing the only man who allowed him another opportunity to live, is also in danger of being convicted of murder once again as well as getting a possible jail sentence or the death penalty for this incident and decides to murder Periyavar's son-in-law in the court grounds. The case is excused because there is no proof at all. Finally, Nandha is cleared as there are no observers to the homicide.After being acquitted for Periyavar's son-in-law's murder, Nandha gets back. However, His neurotic mother, who still thinks that her child still has a habit of murdering, holds up at home to feed a meal, which she has poisoned herself. He starts to eat it. He discovers that the food is poisoned when he eats it, but keeps on doing as such with a fulfillment that he is being taken care of by his mom. Nandha dies in his mom's lap and when his sister, and his friends, 'Lodukku' Pandi and Kalyani all come out to see what has happened, they all find out that both the mother and son are dead. Because of this, Nandha's sister, and his friends 'Lodukku' Pandi, and Kalyani all mourn the deaths of Nandha and his mother."
}