{
    "id": "0929796",
    "localized title": "Sreeram",
    "cast": [
        "Uday Kiran",
        "Anita Hassanandani Reddy",
        "Deepa",
        "Siva Krishna",
        "M.S. Narayana",
        "Paruchuri Venkateswara Rao",
        "Sudha",
        "Ashish Vidyarthi"
    ],
    "genres": "Action",
    "runtimes": "162",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "original air date": "21 Jun 2002 (India)",
    "imdbID": "0929796",
    "plot outline": "Sreeram (Uday Kiran) is an unemployed youth who tries for the police selections to become a Sub Inspector of Police. There is a righteous police officer Narayana (Siva Krishna) who encourages Sreeram to become a police officer. He has a steady girl friend Madhu (Anitha). One evening, Sreeram beats a guy black and blue as that guy misbehaves with Madhu. Later on, Sreeram realizes that the person whom he has beaten is a deadly CI (Circle Inspector) of Police whose name is 'Encounter Shankar' (Asish Vidyardhi). Sreeram's sister marriage is settled with the brother of Madhu. When the marriage of Sreeram's sister is about to happen, Encounter Shankar traces Sreeram and beats him up badly in police station and leaves him on a railway track and expects the train to run over Sreeram. But luckily, the will-powered Sreeram jumps form the train track and escapes from the death. The parents of Sreeram find out the beaten up Sreeram with the help of Narayana and they join him in a hospital. The doctor inspects the injuries, dresses him up and tells them that Sreeram won't be able to move his body for 3 months and he needs complete rest. But his interview for SI post is scheduled in the next month, which requires him to be physically fit. He motivates himself and attends interview as with 100% fitness. In the meantime, Encounter Shankar is under impression that Sreeram is dead. But Sreeram is selected for the post of SI and Encounter Shankar is asked to enquire and give the conduct certificate of Sreeram. After confirming that Sreeram is alive, Encounter Shankar gives a bad conduct certificate. And he also teases Sreeram into a street fight and takes clandestine photographs and produces them to the higher authorities as evidence. The hide and seek game between Sreeram and Encounter Shankar comes to an end when Encounter Shankar comes to Sreeram's place to humiliate him. How Sreeram win over Encounter Shankar is that point that is covered in the climax.",
    "languages": "Telugu",
    "title": "Sreeram",
    "kind": "movie",
    "directors": "V.N. Aditya",
    "writers": [
        "Dharani",
        "",
        "Paruchuri Venkateswara Rao",
        "Gopalakrishna Paruchuri",
        "",
        "Paruchuri Venkateswara Rao",
        "Gopalakrishna Paruchuri"
    ],
    "producers": "Burugapally Siva Rama Krishna",
    "composers": "Patnaik R.P.",
    "cinematographers": "Shiva Kumar",
    "editors": "Marthand K. Venkatesh",
    "visual effects": [
        "Ravikiran Chanda",
        "Ramu Peddireddy",
        "Satish Ratakonda",
        "Ramsai Rayanapati",
        "Ram Sai"
    ],
    "akas": "Sreeram (India)",
    "writer": [
        "Dharani",
        "Paruchuri Venkateswara Rao",
        "Gopalakrishna Paruchuri"
    ],
    "director": "V.N. Aditya",
    "production companies": "Sri Venkateswara Art Films",
    "distributors": "Sri Venkateswara Art Films",
    "other companies": "Whacked Out Media",
    "plot": "_Sreeram_ (qv) (Uday Kiran) is an unemployed youth who tries for the police selections to become a Sub Inspector of Police. There is a righteous police officer Narayana (Siva Krishna) who encourages _Sreeram_ (qv) to become a police officer. He has a steady girl friend Madhu (Anitha). One evening, _Sreeram_ (qv) beats a guy black and blue as that guy misbehaves with Madhu. Later on, _Sreeram_ (qv) realizes that the person whom he has beaten is a deadly CI (Circle Inspector) of Police whose name is 'Encounter Shankar' (Asish Vidyardhi). _Sreeram_ (qv)'s sister marriage is settled with the brother of Madhu. When the marriage of _Sreeram_ (qv)'s sister is about to happen, Encounter Shankar traces _Sreeram_ (qv) and beats him up badly in police station and leaves him on a railway track and expects the train to run over _Sreeram_ (qv). But luckily, the will-powered _Sreeram_ (qv) jumps form the train track and escapes from the death. The parents of _Sreeram_ (qv) find out the beaten up _Sreeram_ (qv) with the help of Narayana and they join him in a hospital. The doctor inspects the injuries, dresses him up and tells them that _Sreeram_ (qv) won't be able to move his body for 3 months and he needs complete rest. But his interview for SI post is scheduled in the next month, which requires him to be physically fit. He motivates himself and attends interview as with 100% fitness. In the meantime, Encounter Shankar is under impression that _Sreeram_ (qv) is dead. But _Sreeram_ (qv) is selected for the post of SI and Encounter Shankar is asked to enquire and give the conduct certificate of _Sreeram_ (qv). After confirming that _Sreeram_ (qv) is alive, Encounter Shankar gives a bad conduct certificate. And he also teases _Sreeram_ (qv) into a street fight and takes clandestine photographs and produces them to the higher authorities as evidence. The hide and seek game between _Sreeram_ (qv) and Encounter Shankar comes to an end when Encounter Shankar comes to _Sreeram_ (qv)'s place to humiliate him. How _Sreeram_ (qv) win over Encounter Shankar is that point that is covered in the climax.::jeevi"
}