{
    "id": "10409824",
    "localized title": "Gemeni",
    "cast": [
        "Venkatesh Daggubati",
        "Namitha"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "151",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "original air date": "11 Oct 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWFiMDA4MTUtNGY3My00NGFiLThiNGEtNWY4MGZjODdlZTIwXkEyXkFqcGdeQXVyNDc2NzU1MTA@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "10409824",
    "plot outline": "Gemeni (Venkatesh) is a rowdy in the city Vijayawada who maintains a gang. Another gang is headed Ladda (Kalabhavan Mani). Gemeni happens to see a beautiful Marwadi girl called Manisha Natwarlal and falls in love with her. He attends Night College so that he could get an opportunity to talk to her. Both of them fall in love. Viswanath (Murali) - a new commissioner of police - takes the charge of Commissioner of Police for Vijayawada. He brings Gemeni and Ladda to the book and put them in a cell. They convince police commissioner that they are changed men need a chance to live like a citizen.",
    "languages": "Telugu",
    "title": "Gemeni",
    "kind": "movie",
    "directors": "Sarann",
    "writers": "Krishna Murali Posani",
    "producers": "Saravanan M.",
    "composers": "Patnaik R.P.",
    "cinematographers": "A. Venkatesh",
    "akas": "Gemeni (India)",
    "writer": "Krishna Murali Posani",
    "director": "Sarann",
    "distributors": "Whacked Out Media",
    "plot": [
        "_Gemeni_ (qv) (Venkatesh), a hooligan falls in love with Manisha (Namitha) that leads him on a path to reform. But his rival, another local gang leader Ladda (Kalabhavan Mani) keeps disturbing _Gemeni_ (qv) which lands him in trouble.",
        "_Gemeni_ (qv) (Venkatesh) is a rowdy in the city Vijayawada who maintains a gang. Another gang is headed Ladda (Kalabhavan Mani). _Gemeni_ (qv) happens to see a beautiful Marwadi girl called Manisha Natwarlal and falls in love with her. He attends Night College so that he could get an opportunity to talk to her. Both of them fall in love. Viswanath (Murali) - a new commissioner of police - takes the charge of Commissioner of Police for Vijayawada. He brings _Gemeni_ (qv) and Ladda to the book and put them in a cell. They convince police commissioner that they are changed men need a chance to live like a citizen."
    ]
}