{
    "id": "1365500",
    "localized title": "Roja Kootam",
    "cast": [
        "Srikanth",
        "Bhoomika Chawla",
        "Raghuvaran",
        "Radhika Sarathkumar",
        "Vivek",
        "Jai Akash",
        "Vijay Adhiraj",
        "Rekha",
        "Sorna",
        "Sahadevan",
        "Mahadevan",
        "Bava Lakshmanan",
        "Lawrence Raghavendra",
        "Mumtaj"
    ],
    "genres": "Romance",
    "runtimes": "149",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United Kingdom:PG",
    "original air date": "14 Feb 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjZlNjFmYjItMDUwMi00NmY5LWE5YzgtNzFmNjVlOGJlZDMwXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "1365500",
    "plot outline": "Roja Kootam movie is all about Ilango (Srikanth) and Sriram (Ajay) who are best friends. Ilango is the only son of Radhika and Raghuvaran who is interested in anything but his academics. He falls in love with Mano who also eventually happens to reside opposite their house with her loud-mouthed sub-inspector Mom, Rekha. With the responsibilities of a brother to get his sisters married Sriram leaves for Libya on a job received through Srikanth's parents. Before he leaves, he tells Ilango that Mano and himself are in love and asks Ilango to look after his lover until he is back. Ilango swallows his love secret for the sake of friendship. Meanwhile Rekha arranges for Bhoomika to get married to Vijay Adhiraj for his wealth. At this juncture Mano and Ilango lie that they are already married. They both leave their parents and Ilangostarts earning to support Mano. Finishing his job assignment Sriram returns only to give yet another family responsibility as an excuse. He apologizes for not being able to marry Mano as he is a tight corner to marry somebody else for the sake of his sister's marriage.",
    "languages": "Tamil",
    "title": "Roja Kootam",
    "kind": "movie",
    "directors": "Sasi",
    "writers": [
        "Sasi",
        "",
        "Sasi"
    ],
    "producers": "Viswanathan Ravichandran",
    "composers": "Bharathwaj",
    "cinematographers": "M.V. Paneer Selvam",
    "location management": "Anil Kaistha",
    "akas": "Roja Kootam (India)",
    "writer": [
        "Sasi",
        "Sasi"
    ],
    "director": "Sasi",
    "production companies": "Oscar Films",
    "distributors": [
        "Oscar Films",
        "Sun TV"
    ],
    "other companies": "Star Music India",
    "plot": [
        "Two friends fall in love with the same girl.",
        "_Roja Kootam_ (qv) movie is all about Ilango (Srikanth) and Sriram (Ajay) who are best friends. Ilango is the only son of Radhika and Raghuvaran who is interested in anything but his academics. He falls in love with Mano who also eventually happens to reside opposite their house with her loud-mouthed sub-inspector Mom, Rekha. With the responsibilities of a brother to get his sisters married Sriram leaves for Libya on a job received through Srikanth's parents. Before he leaves, he tells Ilango that Mano and himself are in love and asks Ilango to look after his lover until he is back. Ilango swallows his love secret for the sake of friendship. Meanwhile Rekha arranges for Bhoomika to get married to Vijay Adhiraj for his wealth. At this juncture Mano and Ilango lie that they are already married. They both leave their parents and Ilangostarts earning to support Mano. Finishing his job assignment Sriram returns only to give yet another family responsibility as an excuse. He apologizes for not being able to marry Mano as he is a tight corner to marry somebody else for the sake of his sister's marriage.::Sadiq khan (sadiqkhandirector@gmail.com)"
    ]
}