{
    "id": "13939508",
    "localized title": "Padai Veetu Amman",
    "cast": [
        "Devayani",
        "Meena",
        "Ravali"
    ],
    "genres": "Drama",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "04 Nov 2002 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTYzZWE3YTUtYjBmMi00MWQyLTk1OGQtOGQ5YTlmNWIzOGI3XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "13939508",
    "plot outline": "Meena plays the dual role of Goddess Padai Veettu Amman, and the neighbouring deity Muthu Maariamman, cutting a pretty picture in all her finery. Devayani plays Chamundi, a devotee, and the film opens with her being killed brutally on the eve of her marriage by the henchmen of the local bigwig. The latter's daughter was in love with the intended bridegroom Shankar and the fond father had wanted to remove the only hurdle in the way. The bigwig, in order to get his hands on a hidden treasure, had also taken the help of an evil tantrik. The presiding deity Muthu Maariamman is helpless, bound as she was by a vow she had made to Chamundi. That she wouldn't step out of her abode till Chamundi herself asked her to. It is time for the neighbouring deity Padai Veetu Amman to come to the rescue of the distressed village.",
    "languages": "Tamil",
    "title": "Padai Veetu Amman",
    "kind": "movie",
    "directors": "Pugazhmani",
    "producers": "Pugazhmani",
    "composers": "S.A. Rajkumar",
    "akas": "Padai Veetu Amman (India)",
    "director": "Pugazhmani",
    "production companies": "Televista Digitals",
    "plot": "Meena plays the dual role of Goddess Padai Veettu Amman, and the neighbouring deity Muthu Maariamman, cutting a pretty picture in all her finery. Devayani plays Chamundi, a devotee, and the film opens with her being killed brutally on the eve of her marriage by the henchmen of the local bigwig. The latter's daughter was in love with the intended bridegroom Shankar and the fond father had wanted to remove the only hurdle in the way. The bigwig, in order to get his hands on a hidden treasure, had also taken the help of an evil tantrik. The presiding deity Muthu Maariamman is helpless, bound as she was by a vow she had made to Chamundi. That she wouldn't step out of her abode till Chamundi herself asked her to. It is time for the neighbouring deity _Padai Veetu Amman_ (qv) to come to the rescue of the distressed village."
}