{
    "id": "2605464",
    "localized title": "Wehshi Jatt",
    "cast": [
        "Aasia",
        "Afzaal Ahmad",
        "Ali Ejaz",
        "Ghazala",
        "Iqbal Hassan",
        "Ilyas Kashmiri",
        "Shah Nawaz",
        "Sultan Rahi"
    ],
    "genres": "Action",
    "runtimes": "128",
    "countries": "Pakistan",
    "country codes": "pk",
    "language codes": "pa",
    "color info": "Black and White",
    "original air date": "08 Aug 1975 (Pakistan)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZmI0YTMzMjctNzJmYy00MDA5LWFjNzItMWI4ZTFhMDcxNmFkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTAzMTc1NjE@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "2605464",
    "languages": "Punjabi",
    "title": "Wehshi Jatt",
    "kind": "movie",
    "directors": "Hassan Askari",
    "writers": "Nasir Adib",
    "producers": "Abdul Majeed",
    "music department": [
        "Safdar Hussain",
        "Waris Ludhianvi"
    ],
    "akas": "Wehshi Jatt (Pakistan)",
    "writer": "Nasir Adib",
    "director": "Hassan Askari",
    "plot": "Maula Jutt, the youngest of the Jutt family is not interested in the family business but when his father is murdered by the rival Malik family, Maula swears revenge at all costs and then he goes on a killing spree .",
    "synopsis": "This film is based on the short story Gandasa (Punjabi Machete) which describe the tale of rivalry in Gujranwala between the Malik clan and Maula's clan. The film differs from the short story but it's core components are the same.\nThe Malik clan and Jutt clan are involved in a dispute. Maula Jutt the youngest of the Jutts is a young man who is interested only in the finer things of life and wrestling. When his father is murdered by Ranga of the Malik clan, Maula swears revenge at all costs, saying, \"The murders will start only now, I will murder even those who are yet to be born who will become our enemies\"\nMaula's friend Raushan tries to calm down Maula and make him see reason however Maula will heed no reason. One by one Maula takes on the Malik clan and lays waste to them. He is aided by Baala, the buffalo cart driver who he befriends after Baala defends him when he is attacked by the Maliks.\nThe Malik clan are arrested and Maula is offered the chance to condemn them to execution but he spurns the opportunity saying he was coerced into testifying against them by his brothers. His reason for mercy is that unless he kills his enemies with his own hands he will not rest in peace."
}