{
    "id": "0265148",
    "localized title": "Main Prem Ki Diwani Hoon",
    "cast": [
        "Hrithik Roshan",
        "Kareena Kapoor",
        "Abhishek Bachchan",
        "Johny Lever",
        "Pankaj Kapur",
        "Raju Srivastava",
        "Vrajesh Hirjee",
        "Kunal Vijaykar",
        "Himani Shivpuri",
        "Reema Lagoo",
        "Upasna Singh",
        "Tanaaz Currim Irani",
        "Himakshi",
        "Dalreen Meyers",
        "Arti Avasthi",
        "Kusumit Sana",
        "Parizad C. Kolah",
        "Rituv Kambow",
        "Shubha Khote",
        "Farida Jalal",
        "Jaaved Jaaferi",
        "Ruby Bhatia",
        "Manmeet Singh Sawhney",
        "Chetan Aneja",
        "B.K. Giri",
        "Mukesh Ahuja",
        "Ritu Vashisht",
        "Geetawali Rajkumari"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Musical",
        "Romance"
    ],
    "runtimes": "197",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "DTS",
        "Dolby Digital"
    ],
    "certificates": [
        "Canada:G::(Quebec)",
        "India:U",
        "Malaysia:U",
        "New Zealand:PG",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "27 Jun 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTg5OTk5MDI3OV5BMl5BanBnXkFtZTcwNjE3NTAxMw@@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0265148",
    "plot outline": "The Kapoor family are very rich Indians who live in India and want their youngest daughter,Sanjana,to get married to an American-Indian businessman named Prem. Prem is welcomed, and after a few misunderstandings, both Sanjana and Prem fall in love with each other. Then chaos descends upon the Kapoor family when they find out that the boy named Prem is a fake, and that the real Prem was delayed and is now reaching India. How will this news affect Sanjana, who has given her heart to the fake Prem?",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Main Prem Ki Diwani Hoon",
    "kind": "movie",
    "directors": "Sooraj R. Barjatya",
    "writers": "Sooraj R. Barjatya",
    "producers": [
        "Ajit Kumar Barjatya",
        "Kamal Kumar Barjatya",
        "Rajkumar Barjatya",
        "Sayed Faizan Hussain"
    ],
    "composers": "Anu Malik",
    "cinematographers": "Rajan Kinagi",
    "editors": [
        "Mukhtar Ahmed",
        "Reupal D. Rawal"
    ],
    "art directors": "Bijon Das Gupta",
    "production managers": [
        "Krishnan Ramanathan",
        "Zaki"
    ],
    "assistant directors": [
        "Aarti S. Bagdi",
        "Gaurav Gupta",
        "Rajul Mishra",
        "Kshiti Nijhawan"
    ],
    "sound department": [
        "Javed Khan",
        "Ashish Manchanda",
        "Narinder Singh",
        "Jayant Vajpayee"
    ],
    "visual effects": [
        "Ashish",
        "Elam Parithi",
        "Naveen Paul",
        "Satish Ratakonda",
        "Srinivas Vel"
    ],
    "camera department": [
        "Debasis Dutta",
        "Rajendra Upadhyaya"
    ],
    "animation department": [
        "Upen Patel",
        "Viren"
    ],
    "music department": [
        "Sunidhi Chauhan",
        "K.S. Chithra",
        "Kareena Kapoor",
        "Krishnakumar Kunnath",
        "Shaan",
        "Sandeep Shirodkar",
        "Jackie Vanjari"
    ],
    "miscellaneous": [
        "Jay Borade",
        "Suleman Mobhani",
        "Akhil Rajendra"
    ],
    "akas": [
        "I Am Crazy About Love (United States)",
        "I Will Love Him Till the End of Time (World-wide, English title)",
        "Main prem ki diwani hoon - Ich sehne mich nach deiner Liebe (Germany)",
        "Я схожу с ума от любви (Russia)"
    ],
    "writer": "Sooraj R. Barjatya",
    "director": "Sooraj R. Barjatya",
    "distributors": "Yash Raj Films",
    "special effects": [
        "Crest Communication",
        "Prasad EFX"
    ],
    "other companies": [
        "Crest Communication",
        "EFX"
    ],
    "plot": [
        "This is the story of Sanjana, a girl of today's generation full of life and vibrant ecstasy. She lives life on her own terms and gets very upset when her mother Susheela, arranges for her to see a boy leading to a marriage prospect.",
        "The Kapoor family are very rich Indians who live in India and want their youngest daughter,Sanjana,to get married to an American-Indian businessman named Prem. Prem is welcomed, and after a few misunderstandings, both Sanjana and Prem fall in love with each other. Then chaos descends upon the Kapoor family when they find out that the boy named Prem is a fake, and that the real Prem was delayed and is now reaching India. How will this news affect Sanjana, who has given her heart to the fake Prem?::Sumitra (corrected by Carrie)",
        "Sanjana (Kareena Kapoor)'s parents want her to get married. So Sanjana's sister Roopa suggests the name of Prem Kumar, a U.S. based businessman. Prem (Hrithik Roshan) lands up in Sanjana's town and Sanjana's family receive him. Sanjana is disapproving at the start, but later falls for Prem's charming ways. But by a twist of fate, everyone (except Sanjana) comes to know that this Prem is not the actual suitor. His real name is Prem Kishen and he is a subordinate of the actual Prem Kumar. Later the actual Prem Kumar (Abhishek Bachchan) lands in India and Prem Kishen flies out for some work . Prem no.2 and Sanjana hit it off very well and when Sanjana gets to know the truth , she has to make a choice...::Soumitra",
        "_Main Prem Ki Diwani Hoon_ (qv) is the story of Sanjana (Kareena Kapoor), a girl of today's generation full of life and vibrant ecstasy. She lives life on her own terms and gets very upset when her mother Susheela (Himani Shivpuri), arranges for her to see a boy leading to a marriage prospect. Roopa, the eldest daughter shows Sanjana's photos to Prem's mother who instantly approves of her. She eventually meets Prem Kishen (Hrithik Roshan). At first she cannot stand him but eventually both fall in love with each other. Her parents are happy that Sanjana likes him, but suddenly Sanjana's sister Roopa, e-mails them and tells them that Prem could not make it so they sent someone else. The confused parents later find out that the boy that is here is not in fact the Prem, the rich N.R.I (non resident Indian) whom Sanjana was meant to meet. He is Prem Kishen, an employee in Prem Kumar's company. It gets even worse when the real Prem (played by Abhishek Bachchan) arrives to meet Sanjana. The meddling mother ousts Prem Kishen, though the father (played by Pankaj Kapoor) has reservations about doing so as he sees how much Sanjana and Prem are in love. Prem Kumar likes Sanjana instantly and Sanjana can't believe how much she has in common with Prem Kumar, but Sanjana is now inseparable from Prem Kishen, her true love. Trouble ensues; a marriage is decided for Sanjana to marry Prem Kumar with Prem Kumar's mothers (Reema Lagoo) blessing. Prem Kishen's loyalty to his boss and his bosses happiness forces him to leave and let the marriage go on. Sanjana finally meets her soul mate when Prem Kumar gets to know the reality.::gavin@sunny_deol2009@yahoo.com",
        "Roopa (Tanaaz Currim) from the U.S., the elder married daughter of Satyaprakash (Pankaj Kapur) and Susheela (Himani Shivpuri) has a marriage proposal for her younger sister Sanjana (Kareena Kapoor), that being Prem Kumar (Abishek Bachchan). She emails her dad that Prem is on his way to see Sanjana. So her dad goes to the airport to receive Prem, the bring him home, which he does. He and his wife literally throw Sanjana into Prem's arms, and eventually both fall in love with each other. And then Roopa emails her dad that Prem could not make it earlier, but is on his way now. Things change radically against Prem, who is actually Prem Kishen Mathur (Hrithik Roshan) in his host's house, as they think he cheated them on purpose. When Sanjana comes to know of the real Prem, she does meet him, and finds out that both of them have a lot in common, a lot more that she had ever had in common with Prem Kishen.::rAjOo (gunwanti@hotmail.com)"
    ]
}