{
    "id": "0348662",
    "localized title": "Kucch to Hai",
    "original title": "Kucch To Hai",
    "cast": [
        "Tusshar Kapoor",
        "Esha Deol",
        "Ramesh Bhatkar",
        "Ashay Chitre",
        "Sulabha Deshpande",
        "Vrajesh Hirjee",
        "Jeetendra",
        "Rishi Kapoor",
        "Jaswir Kaur",
        "Razak Khan",
        "Sikandar Kharbanda",
        "Johny Lever",
        "Anita Hassanandani Reddy",
        "Shiva Rindani",
        "Kusumit Sana",
        "Moon Moon Sen",
        "Nandita Thakur",
        "Yash Tonk",
        "Supriya Vinod",
        "Chirag Vohra"
    ],
    "genres": [
        "Horror",
        "Mystery"
    ],
    "runtimes": "143",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "DTS",
        "Dolby Digital"
    ],
    "certificates": [
        "India:A",
        "Singapore:PG",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "24 Jan 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTU3NjU2MTEzNF5BMl5BanBnXkFtZTcwMjYwMDQzMg@@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0348662",
    "plot outline": "Indian film-makers have now come up with their very own \"I Know What You Did Last Summer', a story centering around a College Professor, who kills his wife, and hides her body in the College campus. When some students, who have been caught cheating in their exams, decide to change their marks, they break into the Professor's room, and this is where they find his wife's lifeless body. Afraid, they may get blamed for breaking and entering as well as this murder, they decide to run away, leave the city and try to forget this ever happened. Years the college friends meets at a mutual friends' wedding - and this is where they will find out that the killer of the woman is still at large, knows about them, and this time they are going to be his next victims",
    "languages": "Hindi",
    "title": "Kucch To Hai",
    "kind": "movie",
    "directors": [
        "Anurag Basu",
        "Anil v Kumar"
    ],
    "writers": [
        "Rajeev Jhaveri",
        "",
        "Anurag Prapanna",
        "",
        "Umesh Shukla"
    ],
    "producers": [
        "Ekta Kapoor",
        "Shobha Kapoor",
        "Narravula Gopi Krishna"
    ],
    "composers": [
        "Anu Malik",
        "Amar Mohile"
    ],
    "cinematographers": [
        "Fowzia Fathima",
        "Johny Lal"
    ],
    "editors": "Srinivas Patro",
    "art directors": [
        "Smita Gupta",
        "Salim Syed"
    ],
    "costume designers": [
        "Shabinaa Khan",
        "Nim Sood"
    ],
    "production managers": "Umesh Ray",
    "assistant directors": [
        "Ranjeet Gupta",
        "Sanjeev More",
        "Sanjeev More"
    ],
    "art department": "Dhananjay Thorat",
    "sound department": [
        "Vikram Biswas",
        "Leslie Fernandes",
        "Vinod Potdar",
        "Shamim Sharfuddin Shaikh",
        "Karnail Singh"
    ],
    "stunts": "Mahendra Verma",
    "camera department": "Vinayak Radhakrishnan",
    "music department": [
        "Nivedita Basu",
        "Priya Bhattacharya",
        "Sunidhi Chauhan",
        "Krishnakumar Kunnath",
        "Sonu Nigam",
        "Pradip Routray",
        "Sameer",
        "Sadhana Sargam",
        "Shaan",
        "Babul Supriyo",
        "Jackie Vanjari",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Ganesh Acharya",
        "Simrit Brar",
        "Longiness Fernandes",
        "Raju Khan",
        "Saroj Khan",
        "Binny Padda",
        "Ravi Padda",
        "Howard Rosemeyer"
    ],
    "akas": [
        "Kucch to Hai (India, Hindi title)",
        "Скажи что-нибудь (Russia)"
    ],
    "writer": [
        "Rajeev Jhaveri",
        "Anurag Prapanna",
        "Umesh Shukla"
    ],
    "director": [
        "Anurag Basu",
        "Anil v Kumar"
    ],
    "production companies": "Shri Siddhivinayak Films",
    "distributors": [
        "Indian Entertainment for You Ltd.",
        "Video Sound",
        "Video Sound",
        "Video Sound",
        "Vidtape"
    ],
    "other companies": "KURAN (NZ) Ltd.",
    "plot": [
        "Indian film-makers have now come up with their very own \"I Know What You Did Last Summer', a story centering around a College Professor, who kills his wife, and hides her body in the College campus. When some students, who have been caught cheating in their exams, decide to change their marks, they break into the Professor's room, and this is where they find his wife's lifeless body. Afraid, they may get blamed for breaking and entering as well as this murder, they decide to run away, leave the city and try to forget this ever happened. Years the college friends meets at a mutual friends' wedding - and this is where they will find out that the killer of the woman is still at large, knows about them, and this time they are going to be his next victims::Sumitra (corrected by Sonia)",
        "Karan (Tusshar Kapoor) and Natasha \"Tashu\" (Natassha) are childhood friends. Natassha has always loved Karan, albeit secretly. Karan, however falls for Tanya (Esha Deol), the new admission in college. Meanwhile, Professor Bakshi (Rishi Kapoor) who is rumoured to have murdered is wife and hidden her body is re-instated at the college. When Tanya is caught cheating at the exams, the group of friends sneak inside Prof. Bakshi's house to retrieve the exam papers. When they find a woman's dead body there they try to run away but are chased by Prof. Bakshi. Their car accidentally hits Prof. Bakshi and he falls down the cliff. Fearing their arrest, they run away. Tanya is traumatized by these events and leaves the town to start life anew. Years later, Tanya, Karan and their group have a reunion at one of their friend's wedding. However a killer is lurking somewhere nearby and is waiting to strike....who could it be?::Soumitra",
        "Karan (Tusshar Kapoor) is in love with Tanya (Eesha Deol) and has a best friend Tashu (Natassha) who also secretly adores him. The three along with their six friends innocently commit an accident. Weighed down by their own sense of guilt the six drift apart but now, after three years they are brought back together. The unknown avenger has come back and he wants to finish the game and the six do not have any way to escape, no place to hide but to take refuge in the arms of death.::gavin@sunny_deol2009@yahoo.com",
        "Karan lives a wealthy lifestyle with his dad, Ravi, in Delhi, India. He studies in a prestigious college in scenic Simla, and is friendly with Yash Tonk, Tashu (his girlfriend), Pat, Dolly, and Khush. When Tanya Oberoi joins the college, he falls madly in love with her, much to Tashu's displeasure. When Tanya is caught cheating during an exam by Professor Bakshi, a frantic Karan, in order to ensure that Tanya does not lose a college year, breaks into Bakshi's office to eliminate any evidence of Tanya's wrong-doing, and comes across the dead body of Bakshi's wife. Bakshi sees him, a scuffle ensues, and Bakshi ends up dead with Karan's fingerprints all over his gun. Uneasy and guilt-ridden, the group disposes off Bakshi's dead body, leave for their respective homes, hoping never to return back. Subsequently, Ravi announces the engagement of Tashu and Karan, and a short while later Pat telephones them that Dolly and Yash Tonk are going to get married in Simla. The group reluctantly re-unite, find out to their relief that Bakshi is very much alive, and take part in the lavish marriage ceremony. Later they book individual rooms in a nearby hotel. This is where their past will come back to haunt them - making them regret their wrong actions - and none of them may live to tell this tale.::rAjOo (gunwanti@hotmail.com)",
        "Due to his mentally unstable condition; a college Professor Bakshi wife decides to distance her self from him. Unable to accept this rejection Bakshi decides to murder her and keep her body preserve at home but his life changes when he red-handedly caught one of his students, Tanya Oberoi cheating in an examination. This prompts Tanya and some of her other friends to go to Bakshi's house in order to replace her answer sheet; unexpectedly they discover Bakshi's dead wife, the police are notify and they accidentally run over Bakshi. Unknown to the duo that Bakshi survives and is all set to take revenge by killing all of them.::gavin (racktoo@hotmail.com)",
        "Karan,Tashu,Pat,Dolly and Kush are good college friends,Tashu loves Karan secretly but he finds love in college new entrant Tanya whose also wooed by a college playboy Yash,Karan and Yash have tiff with each other but later they become good friends.College is feared by a psycho professor Bakshi an everyone believes that he has killed his missing wife ,during an examination Tanya is held by Bakshi for passing mark sheet in the classroom which is actually due to mistake of Karan and Yash.Karan decides that he wont let Tanya loose a year and decides to enter Bakshi's house to exchange the mark sheet along with Yash and other friends.Tanya finds about it and reaches Bakshi's house but Bakshi enters and the group plan to escape where they find that he has indeed killed his wife and kept her body in the storeroom. Before they could escape Bakshi chases them and on their way Tanya's car hits someone and tragically it turns to be Bakshi.Tanya starts living in fear as she feels Bakshi's spirit is haunting her and leaves the town,years later they all have reunion in the same town for a friends wedding where someone is following them leading to strange events and killing of some friends.::alex.mjacko@gmail.com"
    ]
}