{
    "id": "0349058",
    "localized title": "88 Antop Hill",
    "cast": [
        "Atul Kulkarni",
        "Rahul Dev",
        "Suchitra Pillai",
        "Shweta Menon",
        "Jasmine D'Souza",
        "Shaukat Baig",
        "Sachin Dubey",
        "Subrat Dutta",
        "Harsh Khurana",
        "Rahul Pandey",
        "Sharad Ponkshe",
        "Tuhina Vohra"
    ],
    "genres": [
        "Mystery",
        "Thriller"
    ],
    "runtimes": "119",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:18"
    ],
    "original air date": "27 Jun 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjE3MTM1MzkyOF5BMl5BanBnXkFtZTcwNDc0MjUyMQ@@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0349058",
    "plot outline": "Antara Shelar lives an upper middle-class life with her husband, Pratyush, and a young daughter. She is exasperated with her husband spending more and more time at work, and not with her and their daughter, so she decides to leave him. Alone, Pratyush gets a desperate phone call from his co-worker, Aslam Durrani, to attend at 88 Antop Hill. Upon arrival, he is met with a tall, gorgeous young woman, who goes by the name of Teesta. Anxious to find out Aslam's plight and also of is attraction towards her, they go for a drive, and have a drink at a bar. When they return, she invites him into her apartment, and goes to change her clothes. The next day, Murli Mansukhani, Teesta's neighbor summons the police, who arrive and find Teesta's dead body, slain with a sharp instrument. Then begins the manhunt for the killer, who the watchman has now identified as Pratyush. Pratyush meets with Aslam the next day, Aslam admits to having played a prank on him. But denies ever going to Antop Hill, nor ever knowing anyone by the name of Teesta. The Police conclude that there were only two people in Teesta's apartment that night, and that Teesta was killed by whoever was with her that night. Pratyush finds himself in an impossible position, unable to get an alibi, nor talk to his wife and daughter, he decides to burn all evidence, thus implicating himself all the more, - and then the police find the murder weapon in his house - but Pratyush is nowhere to be found.",
    "languages": "Hindi",
    "title": "88 Antop Hill",
    "kind": "movie",
    "directors": "Kushan Nandy",
    "writers": [
        "Ashish Deo",
        "",
        "Kushan Nandy",
        "",
        "Kiran Shroff"
    ],
    "producers": [
        "Kushan Nandy",
        "Kiran Shroff"
    ],
    "composers": "Rajesh Roy",
    "cinematographers": "Hari Nair",
    "editors": "Ashmith Kunder",
    "make up department": "Santosh Gayke",
    "production managers": "Kasim Bhatt",
    "sound department": [
        "Leslie Fernandes",
        "Jayant Haldar",
        "Ashmith Kunder"
    ],
    "visual effects": [
        "Biju Dhanpalan",
        "Wilson Louis",
        "Prasad Sutar"
    ],
    "camera department": [
        "Sangram Giri",
        "Virendra Lanke",
        "Mahendra Samanta"
    ],
    "music department": [
        "Anita",
        "Ravi Basnet",
        "Manoj Bhaskar",
        "Ehsaan",
        "Kalpana Iyer",
        "Pritha Majumdar",
        "Rana Mazumder",
        "Kaushik Paul",
        "Rajesh Roy",
        "Debojit Saha",
        "Dipali Somaiya",
        "Amitabh Sriijit",
        "Sharmila Vora"
    ],
    "miscellaneous": [
        "Vinod Bhalla",
        "Himanshu Jhunjhunwala"
    ],
    "akas": "88 Antop Hill (India)",
    "writer": [
        "Ashish Deo",
        "Kushan Nandy",
        "Kiran Shroff"
    ],
    "director": "Kushan Nandy",
    "production companies": "Das Music",
    "distributors": "Spark Worldwide",
    "plot": [
        "A prank goes horribly wrong when the victim ends up implicated in a murder and has no alibi to prove otherwise. Desperate, he goes on the run to solve the mystery and clear his name.",
        "Antara Shelar lives an upper middle-class life with her husband, Pratyush, and a young daughter. She is exasperated with her husband spending more and more time at work, and not with her and their daughter, so she decides to leave him. Alone, Pratyush gets a desperate phone call from his co-worker, Aslam Durrani, to attend at _88 Antop Hill_ (qv). Upon arrival, he is met with a tall, gorgeous young woman, who goes by the name of Teesta. Anxious to find out Aslam's plight and also of is attraction towards her, they go for a drive, and have a drink at a bar. When they return, she invites him into her apartment, and goes to change her clothes. The next day, Murli Mansukhani, Teesta's neighbor summons the police, who arrive and find Teesta's dead body, slain with a sharp instrument. Then begins the manhunt for the killer, who the watchman has now identified as Pratyush. Pratyush meets with Aslam the next day, Aslam admits to having played a prank on him. But denies ever going to Antop Hill, nor ever knowing anyone by the name of Teesta. The Police conclude that there were only two people in Teesta's apartment that night, and that Teesta was killed by whoever was with her that night. Pratyush finds himself in an impossible position, unable to get an alibi, nor talk to his wife and daughter, he decides to burn all evidence, thus implicating himself all the more, - and then the police find the murder weapon in his house - but Pratyush is nowhere to be found.::rAjOo (gunwanti@hotmail.com)"
    ]
}