{
    "id": "0357328",
    "localized title": "Yeh Dil",
    "cast": [
        "Tusshar Kapoor",
        "Anita Hassanandani Reddy",
        "Chetana Das",
        "Akhilendra Mishra",
        "Sharat Saxena",
        "Saurabh Shukla",
        "Pratima Kazmi",
        "Baba",
        "Banerjee",
        "Divya Dwivedi",
        "Giri",
        "Imran",
        "Jeetendar",
        "Jennifer",
        "Supriya Karnik",
        "Mushtaq Khan",
        "Madhu",
        "Murali",
        "Manoj Nandam",
        "Jhony Nirmal",
        "Vijay Patkar",
        "Achyut Potdar",
        "Pushpa",
        "Raju",
        "Reshmi",
        "Shadaab",
        "Mahinder Shera",
        "Anupam Shyam",
        "Sunila",
        "Sunitha",
        "Vineeth",
        "Yogi"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "147",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "certificates": "United Kingdom:15",
    "original air date": "04 Apr 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTdjNWFiMzktYTU3MS00Y2Q4LTg2NGMtZTkyMzBlMDc1MDQ0XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR8,0,101,150_.jpg",
    "imdbID": "0357328",
    "plot outline": "A musical love story of Ravi and Vasundhara who study in the same college. Both are good friends until their friendship transforms into true love. Their urge of getting married is objected by both their families. After going through many obstacles they are successful in getting married with the help of their college principal and friends.",
    "languages": "Hindi",
    "title": "Yeh Dil",
    "kind": "movie",
    "directors": "Teja",
    "producers": "Kiran",
    "composers": [
        "Shravan Rathod",
        "Nadeem Saifi"
    ],
    "cinematographers": "Ravi Varman",
    "production designers": "Velamati Venkata Narayana Prasad",
    "costume designers": "Shabinaa Khan",
    "assistant directors": "Veerabhadramchowdary",
    "visual effects": "Yugandhar Tammareddy",
    "music department": [
        "Abhijeet",
        "Tausif Akhtar",
        "Sonu Nigam",
        "Neeraj Pandit",
        "Sameer",
        "K.J. Singh",
        "Alka Yagnik"
    ],
    "miscellaneous": "Himanshu Jhunjhunwala",
    "director": "Teja",
    "distributors": "Starmedia Home Entertainment",
    "plot": [
        "A musical love story of Ravi and Vasundhara who study in the same college. Both are good friends until their friendship transforms into true love. Their urge of getting married is objected by both their families. After going through many obstacles they are successful in getting married with the help of their college principal and friends.::gavin@sunny_deol2009@yahoo.com",
        "Multi-millionaire Raghuraj Pratap Singh has an only son, Ravi who studies in a College. Ravi excels at everything he does including sports but is poor in his studies; he meets with a poor girl, Vasundhara alias Vasu the daughter of a milk-man, Mitua Yadav, Vasu is a well-behaved student who is good at her studies. Ravi asks Vasu to assist him with his studies and invite her at his home to do so but at his home, Vasu is insulted by Raghuraj and is asked to leave, anger at this Ravi also leave and eventually follows Vasu to her home. At her home questions arise and in anger Vasu answer by claiming a relationship with Ravi, soon both Ravi and Vasu fall in love but both families object to there marriage. Raghuraj arranges Ravi's marriage with his mistress, Mrs. Chowdhary's daughter while Mitua Yadav tries his best to prevent the couple from meeting. Ravi goes to Vasu's house to look for her and is badly beaten by Mitua's goons and at the same time Vasu goes to Ravi's house to look for him and a man is paid a million rupees by Raghuraj to do away with Vasu so that the couple never meet again.::raj (krazymonster@ymail.com)",
        "Multi-millionaire Raguraj Pratab Singh has an only son, Ravi who attends College and excels at sporting activities but is poor at his studies. Ravi meets his fellow collegian, Vashundara, a girl who performs well in each and every subject areas and comes from a poor household; her dad makes his living by selling milk and is called Mithwa Yadav. Ravi asks Vashundara to come to his house so that she can share some of her book knowledge with him and then slowly both started to fall in love with each other. But when there dads find out about there love they opposes marriage since they find that there children are not of the same class. Raguraj and Mithwa decide to do anything in there power even involve the police and local goons to separate there children. Now Ravi and Vashundara decide to elope to go against there dad's wishes and be united but even after eloping the couple's life is still threatened by goons.::gavin (racktoo@hotmail.com)"
    ]
}