{
    "id": "0364621",
    "localized title": "Qayamat: City Under Threat",
    "cast": [
        "Ajay Devgn",
        "Suniel Shetty",
        "Sanjay Kapoor",
        "Arbaaz Khan",
        "Chunky Pandey",
        "Ayub Khan",
        "Isha Koppikar",
        "Riya Sen",
        "Neha Dhupia",
        "Kamal Adib",
        "Nitin Arora",
        "Ashok Beniwal",
        "Amit Bhalla",
        "Deepak Bhatia",
        "Aashish Chaudhary",
        "Deep Dhillon",
        "Kaveri",
        "Kulbhushan Kharbanda",
        "Lopsang",
        "Anil Nagrath",
        "Govind Namdeo",
        "Achyut Potdar",
        "Tej Sapru",
        "Rajesh Kumar Singh",
        "Anjan Srivastav",
        "Raveena Tandon",
        "Dharmesh Tiwari",
        "Surendra Rahi"
    ],
    "genres": [
        "Action",
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "180",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:MA15+",
        "India:A",
        "United Kingdom:18",
        "United States:Not Rated"
    ],
    "original air date": "11 Jul 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjAyODE5NzQ2MV5BMl5BanBnXkFtZTgwOTM5OTk1MDE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0364621",
    "plot outline": "CBI Officer Akram Sheikh (Sunil Shetty) is on the verge of nabbing three dreaded Pakistan-backed arms dealers , the brothers Ali (Arbaaz Khan) and Abbas (Sanjay Kapoor) and their common moll Laila (Isha Koppikar) . When Sheikh busts an important arms deal conducted by his three targets , Ali-Abbas join forces with Gopal (Chunky Pandey) , a corrupt scientist to get hold of a deadly virus and take the tourists at the Elphinstone Jail resort as hostage . Akram Sheikh is now compelled to get help from Rachit (Ajay Devgan) , a criminal serving jail time who was a former associate of Ali-Abbas and the only person in history to have successfully escaped the Elphinstone jail . Along with a commando team , they try to pull off a rescue attempt by breaking in the jail and rescuing the hostages .",
    "languages": "Hindi",
    "title": "Qayamat: City Under Threat",
    "kind": "movie",
    "directors": "Harry Baweja",
    "writers": [
        "Suparn Varma",
        "",
        "Pathik Vats"
    ],
    "producers": "Paramjeet Baweja",
    "composers": [
        "Salim Merchant",
        "Shravan Rathod",
        "Nadeem Saifi"
    ],
    "cinematographers": "Sanjay F. Gupta",
    "editors": [
        "Reupal D. Rawal",
        "Merzin Tavaria"
    ],
    "editorial department": "Rohan Desai",
    "art directors": "Nitish Roy",
    "costume designers": "Komal Shahani",
    "make up department": [
        "Ramesh Mohanty",
        "Suresh Mohanty",
        "Harish Wadhone"
    ],
    "production managers": "Kamal Sharma",
    "assistant directors": [
        "Amar Preet Chhabra",
        "Sameer Kapoor",
        "Sameer Kapoor",
        "Harsh Kumar",
        "Purnendu Chandra Paanda",
        "Siddharth Saigal",
        "Maninder Wasu"
    ],
    "art department": [
        "Baban Adagale",
        "Udai Prakash Singh",
        "Dhananjay Thorat"
    ],
    "sound department": [
        "Subir Kumar Das",
        "Anup Dev",
        "Prakash Gupta",
        "Vijay Kumar",
        "Kunal Mehta",
        "Ali Merchant"
    ],
    "special effects": "Agnelo D'Souza",
    "visual effects": [
        "Mahesh Baria",
        "Goolzar Buchia",
        "Biju Dhanpalan",
        "Ketan Kale",
        "Sandeep Kamal",
        "Jignesh Patel",
        "Susheel Peris",
        "Reupal D. Rawal",
        "Ken Robinson",
        "Merzin Tavaria"
    ],
    "stunts": [
        "Allan Amin",
        "Siraj"
    ],
    "camera department": [
        "Surendra Singh Farswan",
        "Pramod Khandale",
        "Mahendra Samanta"
    ],
    "music department": [
        "Abhijeet",
        "Vijay Angre",
        "Alisha Chinai",
        "Subir Kumar Das",
        "Kavita Krishnamurthy",
        "Sonu Nigam",
        "Sameer",
        "Kumar Sanu",
        "Hema Sardesai",
        "Sadhana Sargam",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Simrit Brar",
        "Murli Chhatwani",
        "Remo D'Souza",
        "Caesar Gonsalves",
        "Raju Khan",
        "Bosco Martis",
        "Jayesh Pradhan",
        "Merzin Tavaria",
        "Baba Yadav"
    ],
    "akas": "Возвращение к жизни (Russia)",
    "writer": [
        "Suparn Varma",
        "Pathik Vats"
    ],
    "director": "Harry Baweja",
    "distributors": [
        "Panorama Studios",
        "Venus Entertainment (Europe)"
    ],
    "special effects companies": "Prime Focus",
    "other companies": "Glamsham.com",
    "plot": [
        "CBI officer Akram seeks to nab three terrorists, Ali, Abbas and Laila, who have held 213 tourists as hostage in Elphinstone Jail. For this, he seeks help from Rachit, a former associate of the trio.",
        "CBI Officer Akram Sheikh (Sunil Shetty) is on the verge of nabbing three dreaded Pakistan-backed arms dealers , the brothers Ali (Arbaaz Khan) and Abbas (Sanjay Kapoor) and their common moll Laila (Isha Koppikar) . When Sheikh busts an important arms deal conducted by his three targets , Ali-Abbas join forces with Gopal (Chunky Pandey) , a corrupt scientist to get hold of a deadly virus and take the tourists at the Elphinstone Jail resort as hostage . Akram Sheikh is now compelled to get help from Rachit (Ajay Devgan) , a criminal serving jail time who was a former associate of Ali-Abbas and the only person in history to have successfully escaped the Elphinstone jail . Along with a commando team , they try to pull off a rescue attempt by breaking in the jail and rescuing the hostages .::Soumitra",
        "A Muslim CBI Officer Akram Sheikh (Sunil Shetty) is in hot pursuit of terrorists. He is on the verge of nabbing three dreaded Pakistan-backed arms dealers, the brothers Ali (Arbaaz Khan) and Abbas (Sanjay Kapoor) and their common moll Laila (Isha Koppikar). When Sheikh busts an important arms deal conducted by his three targets, Ali-Abbas join forces with Gopal (Chunky Pandey), a corrupt scientist to get hold of a deadly virus and take the tourists at the Elphinstone Jail resort as hostage. Akram Sheikh is now compelled to get help from Rachit (Ajay Devgan). Rachit used to be an associate of the Ramani brothers, but was double-crossed by them. Rachit is said to be the only person in history to have successfully escaped the Elphinstone jail, he had killed one person and had been re-captured and is now serving time in a high security prison. The two lads along with the entire police force is going to take on the criminals with everything in it. Along with a commando team, they try to pull off a rescue attempt by breaking in the jail and rescuing the hostages. But at last they were being showed desired results and finally manage to defeat the terrorist and were all assured success.::gavin@sunny_deol2009@yahoo.com",
        "In a view to acquire Kashmir, India; the Pakistani force ISI decides to send down three of their agents Abbas and Ali Ramani along with their girlfriend Laila to India. The mission the three undertaken consist of aiming a deadly virus using a missile in and around all the water reservoirs and by abducting and locking up some of Kashmir's citizens in an abandoned jail so that the Indian government can comply with their wishes. Their case is handed down to a capable CBI officer Akram Sheikh who comes around with a plan to crush these ISI agents by taking his crew through an underground tunnel to reach the duo hide-out. The only person that knows his way through this tunnel is a prisoner also an enemy of Abbas and Ali, Rachit.::gavin (racktoo@hotmail.com)",
        "Central Bureau of Investigations (CBI) has assigned the case of three Muslim terrorists to Akram Sheikh. The three terrorists are two brothers Ali and Abbas Ramani, and their girlfriend, Laila. Akram takes charge of this case, and asks his superiors to get Rachit to assist him. Rachit used to be an associate of the Ramani brothers, but was double-crossed by them. Rachit had escaped from prison and had killed one person, and had been re-captured and is now serving time in a high security prison. Akram does get permission to get Rachit to accompany him. Both of them, together with a team of ace commandos set out to capture the trio, only to find out that a missile containing a deadly virus, is aimed by them at various lakes, and water reservoirs in and around Bombay City, and no power on Earth is going to stop them from launching this missile.::rAjOo (gunwanti@hotmail.com)",
        "There are four terrorists in India, and their names are Laila, a woman, Rachit, Ali and Abbas. The Police in India are able to nab Rachit and hold him in prison. But he manages to escape, and kills a man. He is captured again and now held in a jail which has more security. But the rest of his former gang continue to terrorize people in India. No one knows where and how they operate. So the Police ask Akram to get control of this case, find the culprits and arrest them. Akram is unable to do so. He then enlists Rachit's help - but is this really wise to get assistance of a former gang member - who may be pretending to help the Police, but may secretly be helping the terrorists.::Sumitra (Corrected by Calista)"
    ]
}