{
    "id": "0366874",
    "localized title": "Police Karthavyam",
    "original title": "Parasuram",
    "cast": [
        "Abbas",
        "Rahul Dev",
        "Kiran",
        "Gayathri Raghuram",
        "Kiran Rathore",
        "Arjun Sarja",
        "Sashikumar"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "142",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ta",
        "hi"
    ],
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "30 May 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjliNzI5MGEtYmI2MC00MmFjLTkxYjctZWQ2N2ZlNmU1ZDM4XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0366874",
    "plot outline": "An underground terror group led by a mysterious proxy Akash recruits unemployed youth and turns them into suicide bombers. Asst. Commisioner of Police Parashuram decides to take the case (and the film) into his own hands in a fit of patriotic fervour. In a subsequent fit of wisdom, he hides a key witness at the home of his flaky fiancee, thereby endangering both and his anti-terror mission in general.",
    "languages": [
        "Tamil",
        "Hindi"
    ],
    "title": "Parasuram",
    "kind": "movie",
    "directors": "Arjun Sarja",
    "producers": [
        "M.A. Aleem",
        "Raaj Varma"
    ],
    "composers": "A.R. Rahman",
    "cinematographers": "K.S. Selvaraj",
    "editors": "Sai Suresh",
    "visual effects": [
        "Zameer Hussain",
        "Ramesh Karthikeyan",
        "P. Mohan",
        "Narasimhan Srinivasan"
    ],
    "stunts": [
        "Kanal Kannan",
        "Power Fist Karuppu"
    ],
    "miscellaneous": [
        "Nagendra Prasad",
        "Raju Sundaram"
    ],
    "thanks": [
        "Sunku Ramesh Babu",
        "Ramesh Singanamala"
    ],
    "akas": [
        "Police Karthavyam (India, Telugu title)",
        "Parashuram: One Man Army"
    ],
    "director": "Arjun Sarja",
    "plot": [
        "An IPS officer fights a terrorist group composed of disaffected youth.",
        "An underground terror group led by a mysterious proxy Akash recruits unemployed youth and turns them into suicide bombers. Asst. Commisioner of Police Parashuram decides to take the case (and the film) into his own hands in a fit of patriotic fervour. In a subsequent fit of wisdom, he hides a key witness at the home of his flaky fiancee, thereby endangering both and his anti-terror mission in general.::Joyojeet Pal",
        "Unemployment, corruption, and crime are rampant in modern day India. To add to these, hundreds of young men are now being reported missing by their parents. The Police have no clue as to the whereabouts of these men, but unknown to them, these men are being recruited by an international terrorist named Akash. ACP Parashuram Singh is assigned to apprehend Akash and bring him to justice. He befriends a restaurant waiter, Shiva, and permits him to live with him. Then a petty thief, Meena, finds out about Akash and reveals his plans to Parashuram. Since Meena's life is in danger, he places her in the care of his girlfriend, Anjali, only to find out that Shiva is Akash's spy. When Akash's men attempt to kill Meena, they are interrupted by Parashuram, who also manages to convince Shiva to rat on Akash, which he does. The Police entrap Akash in a village field, but Akash manages to escape. Shortly thereafter, Akash's bullet-ridden body is found. The Police are all set to close this case, when a Political Minister's son is abducted. This is when Parashuram will find out that Akash is not dead, and the body they found was of Shankaran Kutti, Akash's twin. While attempting to rescue first the Minister's son and then Shiva, Parashuram finds himself a captive and face to face with a terrorist - who even if killed - has already brainwashed hundreds of young men to follow in his destructive path - to be terrorists and suicide bombers themselves.::rAjOo (gunwanti@hotmail.com)",
        "Unemployment, corruption, and crime are rampant in modern day India. To add to these, hundreds of young men are now being reported missing by their parents. The Police have no clue as to the whereabouts of these men, but unknown to them, these men are being recruited by an international terrorist named Akash. ACP _Parasuram_ (qv) is assigned to apprehend him. He befriends a restaurant waiter, Shiva, and permits him to live with him. Then a petty thief, Meena, finds out about Akash and reveals his plans to _Parasuram_ (qv). Since Meena's life is in danger, he places her in the care of his girlfriend, Anjali, only to find out that Shiva is Akash's spy. When Akash's men attempt to kill Meena, they are interrupted by _Parasuram_ (qv), who also manages to convince Shiva to rat on Akash, which he does. The Police entrap Akash in a village field, but Akash manages to escape. Shortly thereafter, Akash's bullet-ridden body is found. The Police are all set to close this case, when a Political Minister's son is abducted. This is when _Parasuram_ (qv) will find out that Akash is not dead, and the body they found was of Shankaran Kutti, Akash's twin. While attempting to rescue first the Minister's son and then Shiva, _Parasuram_ (qv) finds himself a captive, and face to face with a terrorist - who even if killed - has already brainwashed hundreds of young men to follow in his destructive path - to be terrorists and suicide bombers themselves.::rAjOo (gunwanti@hotmail.com)"
    ]
}