{
    "id": "0375021",
    "localized title": "Rules: Pyaar Ka Superhit Formula",
    "cast": [
        "Tanuja Samarth",
        "Milind Soman",
        "Meera Vasudevan",
        "Namrata Barua",
        "Raj Zutshi",
        "Manish Chaudhari",
        "Mandeep Bevli",
        "Mandeep Devli",
        "Vicky Ahuja",
        "Kishore Pradhan",
        "Bipasha Basu",
        "Rajkumar Kanojia"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "original air date": "05 Sep 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTZlOTg3OGUtMDg5MS00MjBjLTg4MzktNmFjMGI5ZWNmNzhiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0375021",
    "plot outline": "Radha is employed with an advertising agency, and has a chance to see and meet prominent models. She meets her dreamboat, Vikram Verma, on one such day. Needless to state, she is madly in love with him, but he has eyes for his girlfriend, the gorgeous model, Maggie, only. Radha's attempts to make him notice her are in vain, and in desperation she confides in her grandma, for a solution. Her grandma instructs her to follow a number of simple rules, which will make Vikram notice her. Radha agrees to do so, but will the meek and timid young lady, be able to make an established young man like Vikram notice her?",
    "languages": "Hindi",
    "title": "Rules: Pyaar Ka Superhit Formula",
    "kind": "movie",
    "directors": "Parvati Balagopalan",
    "writers": [
        "Urmi Juvekar",
        "",
        "Ajitabh Menon",
        "",
        "Ajitabh Menon",
        "",
        "Anahata Menon"
    ],
    "producers": [
        "Parvati Balagopalan",
        "Deepa Sahi",
        "Nirja Shah",
        "Milind Soman"
    ],
    "composers": [
        "Vanraj Bhatia",
        "Sandesh Shandilya"
    ],
    "cinematographers": "Chinmaya Khatri",
    "editors": "Jyotsna Murthy",
    "editorial department": "Paul A. Byrne",
    "art directors": [
        "Satish Chipkar",
        "Meera Dabir"
    ],
    "costume designers": [
        "Tanuja Dabir",
        "Suneet Verma"
    ],
    "make up department": "Tanuja Dabir",
    "production managers": "Tejaswita Desai",
    "assistant directors": [
        "Sandhir Flora",
        "Kumar Megha",
        "Ajitabh Menon",
        "Amit Vachharajani"
    ],
    "art department": "Mihir Shah",
    "sound department": [
        "Vikram Biswas",
        "Leslie Fernandes",
        "Kunal Sharma"
    ],
    "visual effects": [
        "Biju Dhanpalan",
        "Prasad Sutar"
    ],
    "stunts": "Allan Amin",
    "animation department": "Nitin Bhalla",
    "music department": [
        "R.N. Dubey",
        "Kunal Ganjawala",
        "Krishnakumar Kunnath",
        "Sonu Nigam",
        "Sanjeevani",
        "Subrat Sinha",
        "Bombay Vikings"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Anand Kumar"
    ],
    "writer": [
        "Urmi Juvekar",
        "Ajitabh Menon",
        "Ajitabh Menon"
    ],
    "director": "Parvati Balagopalan",
    "production companies": [
        "Crossover Films",
        "E_Motion Pictures"
    ],
    "distributors": [
        "Channel Nine Entertainment Ltd.",
        "Madhu Entertainment and Media",
        "Rainbow Films U.S.A."
    ],
    "plot": [
        "Radha is employed with an advertising agency, and has a chance to see and meet prominent models. She meets her dreamboat, Vikram Verma, on one such day. Needless to state, she is madly in love with him, but he has eyes for his girlfriend, the gorgeous model, Maggie, only. Radha's attempts to make him notice her are in vain, and in desperation she confides in her grandma, for a solution. Her grandma instructs her to follow a number of simple rules, which will make Vikram notice her. Radha agrees to do so, but will the meek and timid young lady, be able to make an established young man like Vikram notice her?::rAjOo (gunwanti@hotmail.com)",
        "Assistant photographer Radha, silently salivates over model Vikram Verma. Of course Vikram, who already has a girlfriend (Namrata Barua as the perpetually pouting Maggie) is totally unaware of her presence. Hence, Radha is sad and distracted, and silently sighs, and sighs, and sighs... until her sprightly grandmother (Tanuja in an endearing role) notices, and offers her a solution for the problem. Her solution consists of Radha's application of 5 rules, with Nirvana i.e.; Vikram's undying love as the ultimate goal. Radha agrees, of course (duh !). Begin application. End application. Goal achieved ? Watch Rules and find out.::Amodini (http://hindimoviereviews.blogspot.com)"
    ],
    "synopsis": "The story begins with a fashion show in which Vikram Verma( Milind Soman) the supermodel is participating and Radha is dreaming to be climbing the stage and hugging the superstar. This is how we enter the life of Radha, a plain Jane with curly hair brown eyes and glasses. Vikram Verma is Radha's teenage crush that has been only growing upwards ever since. She even says to her grandmother ( Tanuja) many a times that she dreams of him every night since all these years and own over 6000 photographs of her only and only crush. Daadi like everybody has been ignoring it as Radha's never to be fulfilled dream but destiny had some plans for Radha when the advt company for which Radha works gets an add campaign featuring Vikram Verma along his pouty yet hot girlfriend supermodel Maggie( Namrata Baruah).\nRadha messes her first meeting with Vikram and breaks her specks and falls on everything around. She returns home crying to her daadi and recounts how Vikram Verma even didn't notice that she existed. She was heartbroken so Daadi decided to help Radha fulfill an impossible dream by sharing the golden 5 rules of attraction which will bring Vikram to her. Radha gladly agrees and here begins the big chase.\nRule #1 - If you want someone's attention then don't give him attention.\nRadha enters her office where Vikram also enters after her and she completely ignores him. She makes him hold the box she was to keep in the car trying not to look at him to baffle him all the more. This makes Vikram notice her and he greeted her and asked her name. Happy as a peacock Radha returns home telling how she had a start with Vikram due to Daadi's rule. The rule had simple rationale, Vikram is used to attention and he is bound to notice the person he is having no impact on.\nRadha gets Rule #2 from Daadi- Don't run after someone, let him run after you.\nNow the characters of Vikram and Maggie are explored further and we delve into their relationship. All is not rosy between the couple where Vikram nurtures dream of opening a restaurant and Maggie wants them to work in a movie. Vikram is always gentle towards Maggie but clearly not happy in the relationship. The argument over this issue gets nasty and Maggie leaves without shooting for the day and stops taking Vikram's calls.\nVikram like everyone also starts leaving sees Radha there. They enter a convention where Radha asks him for extra date in lieu of today's cancelled shoot. He feels apologetic and offers Radha a drop. The second rule rings in Radha's head and she declines and takes a taxi most unwillingly. To her surprise Vikram also joins her in the taxi and asks his driver to get the car home. We get a scene where Radha is dying to keep looking at Vikram but following the rules turns her head in opposite direction as soon as Vikram turns his head toward her and majority of the journey passes like this. Vikram then initiates a conversation that he joined her because Maggie was not taking his calls and she might take hers. They stop at a P.C.O from where Radha calls Maggie which she does not picks. Vikram tells Radha that perhaps she will come in Arunimas party so he will meet her there and asks Radha if she is coming too. Radha who in the morning itself had snubbed that party to Piyali was now most eager to attend. She does special shopping with Daadi to impress Vikram and gets daadi's third rule of attraction.\nRule #3-Remain mysterious to the man whose attention you are seeking.\nRadha reaches the party wearing a eye mask to maintain the mysterious feel of the third rule. Radha was basking high on the success with Vikram, those rules were giving. She meets Vikram in the party and share comfortable time with each other. By this time we get to see that super hot Vikram has started to like Radha's company. He dances with her and then accidentally they fall in the pool. Vikram starts looking at Radha affectionately when she was zinging her dripping hair and Radha notices his gaze and returns the affection. Vikram post party drops Radha home in his car. Radha obviously was on cloud 9. Next days page 3 headline is Vikram with a mysterious Radha in the mask. Piyali and Maggie are chatting about it when over chirpy Radha enters. Piyali asks Radha if she knows this girl in the party and before she replies, Maggie jumps in saying she must be some cheap floozy with whom Vikram just spent an evening as he was upset and post party he came straight to her as he missed only her in the party. Radha feels shattered knowing what Vikram felt of her company for which she wasn't able to hold back her happiness. She came home crying to Daadi and gets the next rule.\nRule #4- If you want someone's love, don't let him know that he has power to hurt you.\nFor outdoor shoot the team goes to Manali. We see Maggie showing her usual tantrums and Vikram seemingly lost in his thoughts. He seems disturbed seeing Radha ignoring him. He is not able to converse warmly with Maggie and reacts distraught when Maggie says she loves him and doesn't reverts the same back. He reaches Radha who is sitting alone against the snow capped mountains. Vikram tries a conversation with her but she responds rudely blaming that he is doing all this to make Maggie jealous as he did in that party. Vikram confronts her strongly that whatever she has been told by Maggie is false and passionately held her close and kissed her tightly saying this is what he wants. Radha softens and kisses him back gently and they share a long kiss and hug each other tightly.\nComing back from outdoor shoot, Vikram starts spending time with Radha. Radha shares their romantic pictures with Daadi who acts shocked to learn that Vikram has yet not told her that he loves her. Radha is now more than happy and confident of her relationship and tells dadi she doesn't need the 5th rule to make Vikram confess his love for her. They go for dinner that night where Vikram tells Radha that he likes everything in her, he likes it when she scolds him, he likes it when she makes faces to him, he likes when she looks at him, he likes when she laughs, he likes the way she sees him. The aunties on the next table starts crying but Radha is angry that Vikram still did not say I Love You to her.\nRadha comes back home and asks Dadi the 5th rule.\nRule #5- To make a man confess his love, shower him with praises after praises.\nRadha comes to Vikram's flat where he has cooked food for her. Radha starts praising everything he says or does. Vikram keeps wondering why Radha is behaving so different with him but still sails along. Radha starts speaking to herself that what is happening is not right to which Vikram responds that whatever she does is always right for him and confesses that he loves her also wonders seeing Radha's surprise on his confession of love how she didn't know it from his behavior. As he starts speaking his heart to her saying he has been into her ever since they met as if he had no choice but to love her, she suddenly leaves him and goes away. Vikram goes running after her but her taxi is shown leaving. Next we see that Vikram has been calling her since last three days but she is not taking his calls. Radha tells Dadi that Vikram doesn't loves him on his own but she with her plots and plans have made him fall in love, neither she loves him as if she did she wouldn't have done this to him.\nDadi is also upset seeing both Vikram and Radha upset. Vikram reaches Radha's office to talk to her and tells Uday that she is not taking his calls. Uday advices him to do that film with her to which Vikram tells him that he is talking of Radha not Maggie. Uday always had been teasing Radha about Vikram as her crush and now Vikram is turning Devdas for her is a revelation for him. Radha arrives and Vikram confronts her asking the reason of her behavior and she confesses about the 5 rules with which she made in fall in love with her. She also believed that if she didn't used those rules he would have never even looked at her so this is not love and it's her connivance. Vikram is shattered hearing this and gets angry and asks Radha what rule she has now for him to deal with this situation as now with or without rules he is in love. He accuses her of putting him in this pain he is going through and leaves in a huff. Radha goes on crying. Vikram on the other hand is always upset and thinking of Radha.\nDadi sees both of them in so much pain and admits that she had given rules of attraction but Radha and Vikram have actually fallen in love which has no rules.\nVikram is shown in considerable pain and makes a fool of himself when he sees Radha with her cousin in the mall and not knowing him to be her cousin keeps ranting how insensitive a women she is and must have used those rules on him too. The passers byes tell him that she is with her cousin and starts laughing on the superstar behaving like mad.\nAgain an outdoor shoot is planned and Radha hands over the file to dadi which had over 6000 pictures of Vikram which she had been collecting from 14 years of age. She says she doesn't need them now and leaves in the bus with the rest of the crew.\nVikram still not able to get over her, comes to take her with him in his car to the outdoor shoot where he meets dadi. Meanwhile dada comes from morning walk and switches on the fan which makes the picture cuttings in the file to all fly up in the room. There are Vikrams pictures flying everywhere and he starts chuckling seeing this. Dadi tells him and we all know that Radha loves him, only she doesn't know.\nIn the bus, Radha is in her usual melancholic mood when all others are enjoying. Vikram reaches near to the bus waving his jacket in the air through the sun roof of his car. He is super happy. He gets into the bus and fixes his gaze yearningly on Radha. The shoot starts and hot air balloon is getting prepared for next scene in which Radha is monitoring something. Somehow the balloons anchor untangles and the balloon with Radha in it rises in the sky. Seeing this Vikram jumps off the cliff catching the rope dangling from the balloon. Radha feels scared for Vikram now but Vikram manages to climb the hanging rope and gets inside the balloon. Radha hugs him tight to which Vikram asks that she should look at herself and ask if she still thinks this is not love. She realizes that what she felt from her teenage for him was not but now what she feels for him is surely love and she now has understood it. The next scene we are shown the wedding pic of Vikram and Radha and dadi promising to tell the rules of successful marriage some other time"
}