{
    "id": "0385982",
    "localized title": "Raja Bhaiya",
    "cast": [
        "Sadashiv Amrapurkar",
        "Rakesh Bedi",
        "Kajal Chakraborty",
        "Aarti Chhabria",
        "Anang Desai",
        "Shama Deshpande",
        "Govinda",
        "Dinesh Hingoo",
        "Kanishka Kapoor",
        "Satyendra Kapoor",
        "Javed Khan Amrohi",
        "Mushtaq Khan",
        "Anil Nagrath",
        "Vishwajeet Pradhan",
        "Rajesh Puri",
        "Tej Sapru",
        "Sheela Sharma",
        "Tiku Talsania",
        "Ajit Vachani",
        "Zubaida"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "127",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "DTS",
    "certificates": [
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)"
    ],
    "original air date": "24 Oct 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTQ3ODM1MzM4Nl5BMl5BanBnXkFtZTcwODc0MjUyMQ@@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0385982",
    "plot outline": "Saved from committing suicide under a train, a girl with amnesia is taken care of by Raja Bhaiya (Govinda) and his mom. As she cannot remember her name, they name her Radha. The girl suffers from mental instability, and is unable to live the life of a mature girl. Raja's mom thinks that she will make a suitable wife for her son. Raja has taken on a life of celibacy and refuses to marry anyone. When Radha saves Raja's mom's life during a fire, and Raja is indebted to her, and decides to marry her, and the marriage takes place. Radha's relatives are looking all over for her, and they eventually find her, and bring her back home. She undergoes treatment, and resumes her earlier life, and has no recollection of Raja nor her marriage to him. When Raja goes to ask her to come with him, she turns him down. Will Raja return back to his celibacy days? Or will he find someone else to marry?",
    "languages": "Hindi",
    "title": "Raja Bhaiya",
    "kind": "movie",
    "directors": "Raman Kumar",
    "producers": [
        "Maann Singh Deep",
        "Kalyaani Singh"
    ],
    "composers": [
        "Shravan Rathod",
        "Nadeem Saifi"
    ],
    "sound department": [
        "Javed Khan",
        "Mohammad Iqbal Paratwada",
        "Anchal Srivastava"
    ],
    "visual effects": [
        "Prateek Pandya",
        "Ranjit N. Patil"
    ],
    "music department": "Tabun Sutradhar",
    "akas": "Raja Bhaiya (India)",
    "director": "Raman Kumar",
    "distributors": "Spark Worldwide",
    "plot": [
        "Raja saves the life of a young girl, Radha, with amnesia. Over time, they decide to marry each other. When Radha's parents find her and get her treated, she has no memory of Raja or their marriage",
        "Saved from committing suicide under a train, a girl with amnesia is taken care of by _Raja Bhaiya_ (qv) (Govinda) and his mom. As she cannot remember her name, they name her Radha. The girl suffers from mental instability, and is unable to live the life of a mature girl. Raja's mom thinks that she will make a suitable wife for her son. Raja has taken on a life of celibacy and refuses to marry anyone. When Radha saves Raja's mom's life during a fire, and Raja is indebted to her, and decides to marry her, and the marriage takes place. Radha's relatives are looking all over for her, and they eventually find her, and bring her back home. She undergoes treatment, and resumes her earlier life, and has no recollection of Raja nor her marriage to him. When Raja goes to ask her to come with him, she turns him down. Will Raja return back to his celibacy days? Or will he find someone else to marry?::rAjOo (gunwanti@hotmail.com)"
    ]
}