{
    "id": "0396961",
    "localized title": "Not Only Mrs. Raut",
    "cast": [
        "Tushar Dalvi",
        "Aditi Deshpande",
        "Vikram Gokhale",
        "Vandana Gupte",
        "Kaushal Inamdar",
        "Mohan Joshi",
        "Prasad Kamat",
        "Ketaki Karadekar",
        "Vidya Malgunde",
        "Ravindra Mankani",
        "Smita Oak",
        "Milind Shah",
        "Milind Shinde",
        "Madhura Velankar"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "imdbID": "0396961",
    "plot outline": "Mrs Raut kills her boss Kharkhanis and surrenders herself to the cops.Advocate S.M Garud shows interest in fighting her case but Mrs Raut in no mood to have a defense lawyer and asks the court to punish her for her crime.Swati Dandavate a young lawyer on the list of court panels is asked to fight her case but her family is against it and wants her to leave the case.Swati is adamant to fight but Mrs Raut is not ready to disclose anything and only asks for punishment until Garud discloses about Mrs Raut's past to Swati.",
    "languages": "Marathi",
    "title": "Not Only Mrs. Raut",
    "kind": "movie",
    "directors": "Gajendra Ahire",
    "writers": "Gajendra Ahire",
    "producers": "Aditi Deshpande",
    "composers": "Kaushal Inamdar",
    "cinematographers": "Imtiaz Bargir",
    "editors": [
        "Gajendra Ahire",
        "Shivaji Choudhury",
        "Mahesh Paraskar"
    ],
    "assistant directors": "Mahesh Pawaskar",
    "miscellaneous": "Ram Kondilkar",
    "akas": "Not Only Mrs. Raut (India)",
    "writer": "Gajendra Ahire",
    "director": "Gajendra Ahire",
    "production companies": "My Group",
    "plot": [
        "Aditya Dandavate is not the public prosecutor in this case, instead he was Raghuvir Karkhanis's lawyer in a previous rape case.",
        "Mrs Raut kills her boss Kharkhanis and surrenders herself to the cops.Advocate S.M Garud shows interest in fighting her case but Mrs Raut in no mood to have a defense lawyer and asks the court to punish her for her crime.Swati Dandavate a young lawyer on the list of court panels is asked to fight her case but her family is against it and wants her to leave the case.Swati is adamant to fight but Mrs Raut is not ready to disclose anything and only asks for punishment until Garud discloses about Mrs Raut's past to Swati.::alex.mjacko@gmail.com",
        "A homeless bedraggled woman, wondering around the Juhu Beach area of Bombay, clutching a bag, shuffles over to a small restaurant and orders some food. She eats like she has been starving and hasn't eaten for days. When she finishes her meal, she gets up to leave, only to be stopped by the waiter, who asks her to pay her bill. She says she has no money, and the waiter severely beats and kicks her and only stops after she starts screaming loudly in pain. The next day, she goes to the Juhu Police Station, gives a statement that she has killed a man near the beach area with a dagger, the evidence being a bloodied dagger from her bag and places it before the Police Inspector. She is asked to make a statement and held in a cell. Her name is Vidya Raut and she has killed her former employer, Raghuvir Karkhanis. Advocate Swati A. Dandavate decides to defend her, not realizing that the Public Prosecutor in this case is none other than her husband, Aditya Vishnu Dandavate, the brother of the influential Dada Dandavate, who are dead set against a woman in their household attempting to defend a homeless woman who has already confessed to the police. Swati, nevertheless decides to go ahead with this uphill task knowing fully well that her relationship with her husband and her brother-in-law will never be the same again.::rAjOo (gunwanti@hotmail.com)"
    ]
}