{
    "id": "0816654",
    "localized title": "Soori",
    "cast": [
        "Parthiban",
        "Uma Shankari",
        "Vijayalakshmi",
        "Chinnijayanth",
        "Manobala",
        "Senthil",
        "Uma"
    ],
    "genres": "Romance",
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "1.33 : 1",
    "sound mix": "DTS::(Westrex Recording System)",
    "certificates": "India:A",
    "original air date": "19 Dec 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzkzNWU3ODYtOGNjZC00NTc1LWE0MTYtNTQyZmE4ZjA4MDE3XkEyXkFqcGdeQXVyMjA4OTI5NDQ@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0816654",
    "plot outline": "Surya (Vignesh), a sales representative, is in love with college student Rishaba (Uma). They decide to put their love to an endurance test to prove to themselves that the romance is much more than infatuation. The loving duo decides to inflict on themselves the pain of separation. Main Guard Gate Manikandan (Parthiban), a thug, makes his entry at this point. Several things happen and Surya is in a state of shock when at the end of the year he finds himself the jilted lover. Love turns to hatred and revenge, as he goes looking for Rishaba. What transpires eventually is an interesting twist. If his debut venture \"Soori\" is a sample, Shelvan sure has potential.",
    "languages": "Tamil",
    "title": "Soori",
    "kind": "movie",
    "directors": "Selvan",
    "writers": "Selvan",
    "producers": "Dr. Vijayakkumar",
    "composers": "Deva",
    "cinematographers": "Vijay Milton",
    "editors": "Suresh Urs",
    "akas": "Soori (India)",
    "writer": "Selvan",
    "director": "Selvan",
    "plot": "Surya (Vignesh), a sales representative, is in love with college student Rishaba (Uma). They decide to put their love to an endurance test to prove to themselves that the romance is much more than infatuation. The loving duo decides to inflict on themselves the pain of separation. Main Guard Gate Manikandan (Parthiban), a thug, makes his entry at this point. Several things happen and Surya is in a state of shock when at the end of the year he finds himself the jilted lover. Love turns to hatred and revenge, as he goes looking for Rishaba. What transpires eventually is an interesting twist. If his debut venture \"_Soori_ (qv)\" is a sample, Shelvan sure has potential.::Anonymous"
}