{
    "id": "13801882",
    "localized title": "Bheeshmar",
    "cast": [
        "Devayani",
        "Riyaz Khan",
        "Ranjith"
    ],
    "genres": "Drama",
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "27 Sep 2003 (India)",
    "imdbID": "13801882",
    "plot outline": "Bheeshmar (Ranjith) is an honest and upright police officer. He is married to Gowri (Devayani), and they have a six-year-old girl named Pappathi (Baby Prahasitha). Bheeshmar is transferred to a new department which is filled with corrupt police officers. Soon, Bheeshmar clashes with policemen Aadhi (Ilavarasu) and Dhandapani (Vasu Vikram), Assistant Commissioner Singampuli (Sadiq), and the heartless politician R. K. (Rami Reddy). Later, Bheeshmar has been suspended for beating up Singampuli in court. Afterwards, the police arrested Bheeshmar for a crime he did not commit, and he is put in jail. Gowri sells her kidney for the advocate expenses to release him. After that, Bheeshmar ends up fighting with rowdies while bringing the medicine for his wife. He is not able to make it at the right time, so his wife dies in the hospital. The unemployed Bheeshmar turns berserk and kills all of his enemies. He is again arrested and is brought by a police van. In the traffic signal, he sees his daughter begging for food. She tries to run towards his van, and meanwhile, an accident happens to her. Bheeshmar wakes up screaming with his daughter nearby; he realizes that it was a nightmare. At that point, he understands that the evil in the society is way more powerful than him. He then burns his police uniform and decides to start a new life with Pappathi.",
    "languages": "Tamil",
    "title": "Bheeshmar",
    "kind": "movie",
    "directors": "Ranjith",
    "writers": "Ranjith",
    "producers": "Priya Raman",
    "composers": "S.P. Venkatesh",
    "akas": "Bheeshmar (India)",
    "writer": "Ranjith",
    "director": "Ranjith",
    "production companies": "Maverick Entertainment",
    "plot": "_Bheeshmar_ (qv) (Ranjith) is an honest and upright police officer. He is married to Gowri (Devayani), and they have a six-year-old girl named Pappathi (Baby Prahasitha). _Bheeshmar_ (qv) is transferred to a new department which is filled with corrupt police officers. Soon, _Bheeshmar_ (qv) clashes with policemen Aadhi (Ilavarasu) and Dhandapani (Vasu Vikram), Assistant Commissioner Singampuli (Sadiq), and the heartless politician R. K. (Rami Reddy). Later, _Bheeshmar_ (qv) has been suspended for beating up Singampuli in court. Afterwards, the police arrested _Bheeshmar_ (qv) for a crime he did not commit, and he is put in jail. Gowri sells her kidney for the advocate expenses to release him. After that, _Bheeshmar_ (qv) ends up fighting with rowdies while bringing the medicine for his wife. He is not able to make it at the right time, so his wife dies in the hospital. The unemployed _Bheeshmar_ (qv) turns berserk and kills all of his enemies. He is again arrested and is brought by a police van. In the traffic signal, he sees his daughter begging for food. She tries to run towards his van, and meanwhile, an accident happens to her. _Bheeshmar_ (qv) wakes up screaming with his daughter nearby; he realizes that it was a nightmare. At that point, he understands that the evil in the society is way more powerful than him. He then burns his police uniform and decides to start a new life with Pappathi."
}