{
    "id": "13914002",
    "localized title": "Thennavan",
    "cast": [
        "Nassar",
        "Kiran Rathod",
        "Vijayakanth"
    ],
    "genres": "Drama",
    "runtimes": "146",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "15 Aug 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODEzYjVlZTgtZWViMC00N2QzLTg1ZmMtYjY0NzAwYTcyNjFhXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR22,0,101,150_.jpg",
    "imdbID": "13914002",
    "plot outline": "Thennavan (Vijayakanth) is an honest and upright IAS officer and he is handpicked by the Prime Minister of India to be the Chief Election Commissioner of India. His first assignment is conducting the Indian general election in Tamil Nadu and for the election, he suggests passing five laws in order to fix the electoral system. Thennavan quickly gains the support of the public. The current Chief Minister of Tamil Nadu Ilanthiraiyan (Nassar), a corrupt and greedy politician who wants to win the next election, successfully convinces the Prime Minister to not pass the five laws. In the meantime, Divya (Kiran Rathod) falls in love with Thennavan and tries to convince him to marry her. To win the election, Ilanthiraiyan orders Mustafa (Thalaivasal Vijay) to plant a bomb during one of his public meetings. As he expected, the bomb kills many innocent people. Ilanthiraiyan blames his enemies to have planned it and gains sympathy from the voters. During the polls, Thennavan finds out about the sham and stops the vote counting. An angry Ilanthiraiyan takes the matter to court. In court, Thennavan provides uncontested evidence and the culprits including Ilanthiraiyan are sentenced to life imprisonment. Divya eventually marries her lover Thennavan. With Ilanthiraiyan in jail, his naive wife Pushpalatha (Urvasi) replaces him as the new chief minister and bails him out of jail. Thennavan is then arrested but Pushpalatha makes him release due to public pressure. After a small quarrel with her husband, Pushpalatha resigns from her function and her government is dismissed by the governor. With the election campaign going on full swing, Thennavan resigns from his position. He then holds a public meet: he urges the voters to boycott the election to save the country from corrupt politicians and to stop people who will try to vote. The day of the election, not a single vote has been cast and it is well received by the public. The prime minister praises Thennavan for his achievement and accepts to pass the five laws.",
    "languages": "Tamil",
    "title": "Thennavan",
    "kind": "movie",
    "directors": "A.M. Nandakumar",
    "writers": "R.N.R. Manohar",
    "producers": "L.K. Sudhish",
    "composers": "Yuvan Shankar Raja",
    "akas": "Thennavan (India)",
    "writer": "R.N.R. Manohar",
    "director": "A.M. Nandakumar",
    "production companies": "Captain Cine Creations",
    "plot": "_Thennavan_ (qv) (Vijayakanth) is an honest and upright IAS officer and he is handpicked by the Prime Minister of India to be the Chief Election Commissioner of India. His first assignment is conducting the Indian general election in Tamil Nadu and for the election, he suggests passing five laws in order to fix the electoral system. _Thennavan_ (qv) quickly gains the support of the public. The current Chief Minister of Tamil Nadu Ilanthiraiyan (Nassar), a corrupt and greedy politician who wants to win the next election, successfully convinces the Prime Minister to not pass the five laws. In the meantime, Divya (Kiran Rathod) falls in love with _Thennavan_ (qv) and tries to convince him to marry her. To win the election, Ilanthiraiyan orders Mustafa (Thalaivasal Vijay) to plant a bomb during one of his public meetings. As he expected, the bomb kills many innocent people. Ilanthiraiyan blames his enemies to have planned it and gains sympathy from the voters. During the polls, _Thennavan_ (qv) finds out about the sham and stops the vote counting. An angry Ilanthiraiyan takes the matter to court. In court, _Thennavan_ (qv) provides uncontested evidence and the culprits including Ilanthiraiyan are sentenced to life imprisonment. Divya eventually marries her lover _Thennavan_ (qv). With Ilanthiraiyan in jail, his naive wife Pushpalatha (Urvasi) replaces him as the new chief minister and bails him out of jail. _Thennavan_ (qv) is then arrested but Pushpalatha makes him release due to public pressure. After a small quarrel with her husband, Pushpalatha resigns from her function and her government is dismissed by the governor. With the election campaign going on full swing, _Thennavan_ (qv) resigns from his position. He then holds a public meet: he urges the voters to boycott the election to save the country from corrupt politicians and to stop people who will try to vote. The day of the election, not a single vote has been cast and it is well received by the public. The prime minister praises _Thennavan_ (qv) for his achievement and accepts to pass the five laws."
}