{
    "id": "13915036",
    "localized title": "Military",
    "cast": [
        "Manivannan",
        "Rambha",
        "Sathyaraj"
    ],
    "genres": "Drama",
    "runtimes": "142",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "28 Feb 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGU5MWU2ZTUtMjkzZS00MzFmLWI0N2UtNmQ1MzA0ZWVmMjhkXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR83,0,101,150_.jpg",
    "imdbID": "13915036",
    "plot outline": "Madhavan (Sathyaraj), locally known as Military, is a protective brother of five younger sisters: Ammu (Indhu), Seetha (Vijayalakshmi), Nandhini (Lavanya), Kamali (Arunasri) and Archana (Poorvaja). Their father (Manivannan) remarried after his first wife's death, because of that his children does not speak to him. With his second wife, he has two daughters (Karpagam and Santhoshi). Ammu, the eldest of Madhavan's sisters, was raped by her widower professor (Nizhalgal Ravi). Madhavan asked Ammu to marry the professor, who was quite old. The other sisters did not know about the matter. Seetha elopes with her cousin Balasubramaniam (Livingston) and they later come to stay in their neighbourhood. Madhavan's enemies try to kill his brother-in-law and put the blame on Madhavan. Luckily, his brother-in-law survives and tells the truth.",
    "languages": "Tamil",
    "title": "Military",
    "kind": "movie",
    "directors": "Suraaj",
    "writers": "Suraaj",
    "producers": "S. Siddique",
    "composers": "Deva",
    "writer": "Suraaj",
    "director": "Suraaj",
    "production companies": "Cine Times Entertainment",
    "plot": "Madhavan (Sathyaraj), locally known as _Military_ (qv), is a protective brother of five younger sisters: Ammu (Indhu), Seetha (Vijayalakshmi), Nandhini (Lavanya), Kamali (Arunasri) and Archana (Poorvaja). Their father (Manivannan) remarried after his first wife's death, because of that his children does not speak to him. With his second wife, he has two daughters (Karpagam and Santhoshi). Ammu, the eldest of Madhavan's sisters, was raped by her widower professor (Nizhalgal Ravi). Madhavan asked Ammu to marry the professor, who was quite old. The other sisters did not know about the matter. Seetha elopes with her cousin Balasubramaniam (Livingston) and they later come to stay in their neighbourhood. Madhavan's enemies try to kill his brother-in-law and put the blame on Madhavan. Luckily, his brother-in-law survives and tells the truth."
}