{
    "id": "13914680",
    "localized title": "Sena",
    "cast": [
        "Aravind Akash",
        "Anandraj",
        "Fatih Sahin",
        "Sathyaraj",
        "Salih Sigirci"
    ],
    "genres": "Drama",
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "12 Apr 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmU0Y2MxMzctOWNiMi00MGQwLWIwMzgtYTY3NWE1YzA2Njc2XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "13914680",
    "plot outline": "Sena (Sathyaraj) took to rowdyism as a young boy in order to feed his brother Vikram (Aravind Akash). Vikram hates rowdyism and wants Sena to stop his activities. There is a gang war between Mastan Bhai (Anandaraj) and Naaga's (Chandrasekhar) gangs. Sena works for Mastan, and Mastan considers Sena as his best henchman. Naaga, who was Mastan's former right-hand, wants to kill him. Vikram is in love with Janu (Charulatha), who is the sister of police officer Sathya. Sena is close to Sathya. Later, Sathya is killed by Mastan's henchmen, and Vikram wants to punish the culprits. What transpires next forms the rest of the story.",
    "languages": "Tamil",
    "title": "Sena",
    "kind": "movie",
    "directors": "Sujeeth",
    "writers": "Sujeeth",
    "producers": "P. Suneetha Anandakumar",
    "composers": "D. Imman",
    "akas": "Sena (India)",
    "writer": "Sujeeth",
    "director": "Sujeeth",
    "production companies": "Sri Saivani Movies",
    "plot": "_Sena_ (qv) (Sathyaraj) took to rowdyism as a young boy in order to feed his brother Vikram (Aravind Akash). Vikram hates rowdyism and wants _Sena_ (qv) to stop his activities. There is a gang war between Mastan Bhai (Anandaraj) and Naaga's (Chandrasekhar) gangs. _Sena_ (qv) works for Mastan, and Mastan considers _Sena_ (qv) as his best henchman. Naaga, who was Mastan's former right-hand, wants to kill him. Vikram is in love with Janu (Charulatha), who is the sister of police officer Sathya. _Sena_ (qv) is close to Sathya. Later, Sathya is killed by Mastan's henchmen, and Vikram wants to punish the culprits. What transpires next forms the rest of the story."
}