{
    "id": "3332304",
    "localized title": "Thirumalai",
    "cast": [
        "Joseph Vijay",
        "Jyotika",
        "Avinash",
        "Manoj K. Jayan",
        "Vivek",
        "Raghuvaran",
        "Annadurai Kannadasan",
        "Karunas",
        "Kousalya",
        "Vijay Krishnaraj",
        "Lawrence Raghavendra",
        "Kiran Rathod"
    ],
    "genres": [
        "Action",
        "Romance"
    ],
    "runtimes": "169",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:U",
        "New Zealand:M",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "24 Oct 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDU3MGFiZTYtNjM2OC00YTdhLWIyZWQtMGUwZDA1YWM4Yjk3XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR7,0,101,150_.jpg",
    "imdbID": "3332304",
    "plot outline": "Thirumalai (Vijay) mechanic who lives in Pudupet and has three close friends for whom he would do anything. Raghuvaran is an artist who comes to stay near Tirumalai's mechanic shop with his wife Nagalakshmi (Kousalya). Thirumalai happens to meet Swetha (Jyothika), on a New Year's Day. As she appears in front of him all of a sudden, she happens to greet saying 'Everyone will do fine'. From that very day, things start to shine up in Thirumalai's life. He falls in love with Swetha as he thinks that good things started to happen in his life only after she greeted him. Swetha first ignores him, but soon she understands his nature and reciprocates. Meanwhile Swetha's father (Avinash), a business tycoon who owns six satellite channels hates the idea of a mechanic being his son-in-law and seeks the help of a local thug Arasu (Manoj.K.Jayan) whose only job is to kill people for huge money. Arasu plots an attempt to kill Thirumalai. Does Thirumalai succeed in winning his girl or is he caught up in the plot against him forms the rest of the story.",
    "languages": "Tamil",
    "title": "Thirumalai",
    "kind": "movie",
    "directors": "Ramana",
    "writers": "Ramana",
    "producers": "Pushpa Kandasamy",
    "composers": "Vidyasagar",
    "cinematographers": "R. Rathnavelu",
    "editors": "Suresh Urs",
    "writer": "Ramana",
    "director": "Ramana",
    "production companies": "Kavithalayaa Productions",
    "distributors": "Kavithalayaa Productions",
    "plot": [
        "_Thirumalai_ (qv), a mechanic, falls in love with Sweta. However, her father, the owner of a TV channel, is unhappy with their relationship. He takes Arasu help to create differences between the couple.",
        "_Thirumalai_ (qv) (Vijay) mechanic who lives in Pudupet and has three close friends for whom he would do anything. Raghuvaran is an artist who comes to stay near Tirumalai's mechanic shop with his wife Nagalakshmi (Kousalya). _Thirumalai_ (qv) happens to meet Swetha (Jyothika), on a New Year's Day. As she appears in front of him all of a sudden, she happens to greet saying 'Everyone will do fine'. From that very day, things start to shine up in _Thirumalai_ (qv)'s life. He falls in love with Swetha as he thinks that good things started to happen in his life only after she greeted him. Swetha first ignores him, but soon she understands his nature and reciprocates. Meanwhile Swetha's father (Avinash), a business tycoon who owns six satellite channels hates the idea of a mechanic being his son-in-law and seeks the help of a local thug Arasu (Manoj.K.Jayan) whose only job is to kill people for huge money. Arasu plots an attempt to kill _Thirumalai_ (qv). Does _Thirumalai_ (qv) succeed in winning his girl or is he caught up in the plot against him forms the rest of the story.::Manoj M K courtesy Wikipedia"
    ]
}