{
    "id": "3592248",
    "localized title": "Bhalo Theko",
    "cast": [
        "Vidya Balan",
        "Soumitra Chatterjee",
        "Parambrata Chattopadhyay",
        "Joy Sengupta"
    ],
    "genres": "Family",
    "runtimes": "119",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTQyNWUwYjctOWQ2Mi00NTVhLThlYjAtOTJjZTQ4N2VhZjllXkEyXkFqcGdeQXVyNTM2NTg3Nzg@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "3592248",
    "plot outline": "The film is set in Acharya Jagadish Chandra Bose's home in Falta, masquerading as Uttarpara. It deals with the story of a girl Anandi and her family (including uncle, brother, parents and sister), lover (brother's friend Babua) and few neighbors. Nature, tradition and love are Anandi's pillars of support in difficult times. Her brother will slowly drift away with bad or risky companies, will not return home one day, and will be lost forever. Her parents will die heartbroken and her sister will get married suddenly and will leave the family. Babua will go abroad and marry somebody else. It is implied that Anandi is forgetful of her sorrows that she was deceived by Babua (Joy Sengupta) whom she loved most. Babua comes back from abroad only to say: 'Anandi, I came back to set you free.' Bhalo Theko has a non-linear pace with frequent jumps between current time and past. Film critics described Anandi as a large canvas painted in several hues. She stands against rootless internalization and perplexed culture. A poem by a renowned Bangladeshi author and scholar Humayun Azad named \"Shuvescha\" was recited in the ending of the film by Anandi while wandering lonely in their garden.",
    "languages": "Bangla",
    "title": "Bhalo Theko",
    "kind": "movie",
    "directors": "Gautam Haldar",
    "writers": "Leena Gangopadhyay",
    "editors": "Gautam Haldar",
    "akas": "Bhalo Theko (India)",
    "writer": "Leena Gangopadhyay",
    "director": "Gautam Haldar",
    "production companies": "Angel Digital.",
    "plot": [
        "The film revolves around Anandi and her relation with nature. Her boyfriend goes abroad and marries another girl. The film ends with a symbolic reference of the immersion of Anandi in nature.",
        "The film is set in Acharya Jagadish Chandra Bose's home in Falta, masquerading as Uttarpara. It deals with the story of a girl Anandi and her family (including uncle, brother, parents and sister), lover (brother's friend Babua) and few neighbors. Nature, tradition and love are Anandi's pillars of support in difficult times. Her brother will slowly drift away with bad or risky companies, will not return home one day, and will be lost forever. Her parents will die heartbroken and her sister will get married suddenly and will leave the family. Babua will go abroad and marry somebody else. It is implied that Anandi is forgetful of her sorrows that she was deceived by Babua (Joy Sengupta) whom she loved most. Babua comes back from abroad only to say: 'Anandi, I came back to set you free.' _Bhalo Theko_ (qv) has a non-linear pace with frequent jumps between current time and past. Film critics described Anandi as a large canvas painted in several hues. She stands against rootless internalization and perplexed culture. A poem by a renowned Bangladeshi author and scholar Humayun Azad named \"Shuvescha\" was recited in the ending of the film by Anandi while wandering lonely in their garden.::Kalikinkar Das"
    ]
}