{
    "id": "4960754",
    "localized title": "Aparichit 2",
    "original title": "Kadhal Sadugudu",
    "cast": [
        "Vikram",
        "Priyanka Upendra",
        "Prakash Raj",
        "Alphonsa",
        "Delhi Ganesh",
        "Ilavarasu",
        "Paravai Muniyamma",
        "Nalini",
        "Rekha",
        "C.R. Vijayakumari",
        "Vivek"
    ],
    "genres": [
        "Action",
        "Drama",
        "Romance"
    ],
    "runtimes": "138",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:UA",
        "India:A",
        "India:A",
        "Singapore:PG",
        "United Kingdom:PG"
    ],
    "original air date": "11 Apr 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDY2OGE5YTUtMTc0Mi00NmQyLWE1NDUtNmQwYjg3NjM0NDI1XkEyXkFqcGdeQXVyODE0NjUxNzY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "4960754",
    "plot outline": "Aparichit 2 revolves around the accidentally-turned bitter relationship of Suresh and Sitharam. Suresh is a simple yet loving man, who one day meets Sitharam, the good and the powerful man in the village. Suresh meets with a small accident by Sitharam, and later Sitharam meets one too, from Suresh. Both being unknown or \"APARICHIT\" to each other don't realize themselves and form a different image of each other. Sitharam feels Suresh is a villain, while Suresh considers Sitharam a good man. One day, Suresh meets Kaushalya, Sitharam's daughter, and both fall in love with each other after a series of events. But...besides this, a series of accidental events also takes place, which causes Sitharam to become Suresh's enemy. When he comes to know about the relationship of Suresh and Kaushalya, he decides to part them away. Despite being heart broken, Suresh decides to win back Kaushalya and her father's trust in the best possible way he can. Can Suresh prove his goodness and win back his love? The solution to this question lies in watching this fast paced emotional action movie.",
    "languages": "Tamil",
    "title": "Kadhal Sadugudu",
    "kind": "movie",
    "directors": "V.Z. Dhorai",
    "writers": "V.Z. Dhorai",
    "producers": "S.S. Chakravarthy",
    "composers": "Deva",
    "cinematographers": "M.S. Prabhu",
    "editors": "Suresh Urs",
    "akas": [
        "Aparichit Returnz 2 (India, Hindi title)",
        "Adhisayam (India, Tamil title)",
        "Sivudu (India, Telugu title)",
        "Aparichit 2 (India, Hindi title)",
        "Vidataa Ek Fauladi Taaqat (India, Hindi title)"
    ],
    "writer": "V.Z. Dhorai",
    "director": "V.Z. Dhorai",
    "production companies": [
        "NIC Arts",
        "Wide Angle Media"
    ],
    "distributors": [
        "NIC Arts",
        "Sun TV"
    ],
    "plot": [
        "A man who does everything unintentionally is misunderstood by the father of the girl he loves.",
        "Aparichit 2 revolves around the accidentally-turned bitter relationship of Suresh and Sitharam. Suresh is a simple yet loving man, who one day meets Sitharam, the good and the powerful man in the village. Suresh meets with a small accident by Sitharam, and later Sitharam meets one too, from Suresh. Both being unknown or \"APARICHIT\" to each other don't realize themselves and form a different image of each other. Sitharam feels Suresh is a villain, while Suresh considers Sitharam a good man. One day, Suresh meets Kaushalya, Sitharam's daughter, and both fall in love with each other after a series of events. But...besides this, a series of accidental events also takes place, which causes Sitharam to become Suresh's enemy. When he comes to know about the relationship of Suresh and Kaushalya, he decides to part them away. Despite being heart broken, Suresh decides to win back Kaushalya and her father's trust in the best possible way he can. Can Suresh prove his goodness and win back his love? The solution to this question lies in watching this fast paced emotional action movie.::Prashast Singh"
    ],
    "synopsis": "The film starts off by showing Chithambaram (Prakash Raj), and how he's an important man in the village. He is an adamant character who always sticks on to his decisions. When the temple festival starts, Kausalya (Priyanka Trivedi) goes to her grandfather's house to celebrate. There she meets Suresh (Vikram), and they fall in love. Meanwhile, Chithambaram gets into many conflicts with Suresh, not even knowing who the other was. All the things that Suresh did were unintentional, but Chithambaram doesn't realize this. Therefore, Chithambaram ends up with a very negative opinion of Suresh. One day, everyone in Kausalya's grandfather's home find out that Suresh and Kausalya are in love by seeing Suresh pressing Kausalya's sweating navel, thereby tasting her lips, and she is unable to stop him as she has applied mehandi on her hands. On seeing this they try to get Chithambaram (Kausalya's father) to agree to the wedding. He, however stubbornly sticks to his decision that the marriage should not take place.Finally, Suresh asks him what would make him happy. Chithambaram says that he would be happy if Suresh dies. Realizing arguing further would be futile, Suresh decides to go back to Madras. Meanwhile, while Kausalya washes her clothes, Ilavarasu gets attracted towards her physique, and she is being molested by him. She somehow manages to escape and reports it to her father, but she feels she is insecure and needs a companion. Kausalya tries to join him at the railway station to go with him, but Suresh refuses saying \"If I marry you, it will be with your father's permission and acceptance,\" so at that time Chithambaram had arrived at the station to prevent his daughter from eloping with Suresh to Madras. He hears this conversation and now after this incident Chithambaram realizes how good Suresh is so finally decides to accept Suresh as his daughter's love, and fiancé. Suresh, seeing that Chithambaram is no longer withholding consent for their match, also agrees."
}