{
    "id": "8669128",
    "localized title": "Aasai Aasaiyai",
    "cast": [
        "Anandraj",
        "Jiiva",
        "Lavanya",
        "Livingston",
        "Lawrence Raghavendra",
        "Santhoshi",
        "Sharmili",
        "Singamuthu",
        "Srividya",
        "Vijayakumar",
        "Vindhya",
        "Yuvarani"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "31 Jan 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjBiNjY4MDAtYzQ1Yi00ZWMwLWE1NTItN2YxMjVjYWI0MWRjXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR41,0,101,150_.jpg",
    "imdbID": "8669128",
    "plot outline": "The story revolves around Vinod (Jiiva), who aspires to become a businessman after completing his bachelors. His parents keep nudging him to start working in a job. He also works part- time as a private detective. He is assigned a detective job to follow a girl and find out her general activities and also if she is in love with anyone. While doing this job, he eventually falls in love with the girl (Sharmelee), and quits his detective job. Sharmelee, who is the daughter of a rich gold seller, has a strict policy in her life to not love anyone, because her sister eloped with another guy in the past and her father (Nasser) had suffered a heart attack. The crux is how Jiiva wins Sharmelee's heart and how they convince their parents to accept their marriage. Watch the full movie Aasai Aasaiyai online, only on Eros Now.",
    "languages": "Tamil",
    "title": "Aasai Aasaiyai",
    "kind": "movie",
    "directors": "Ravi Mariya",
    "writers": "Ravi Mariya",
    "producers": "R.B. Choudary",
    "composers": "Mani Sharma",
    "cinematographers": "Pawan Sheker",
    "editors": "V. Jayashankar",
    "akas": "Aasai Aasaiyai (India)",
    "writer": "Ravi Mariya",
    "director": "Ravi Mariya",
    "production companies": "Super Good Films",
    "distributors": "Super Good Films",
    "plot": "The story revolves around Vinod (Jiiva), who aspires to become a businessman after completing his bachelors. His parents keep nudging him to start working in a job. He also works part- time as a private detective. He is assigned a detective job to follow a girl and find out her general activities and also if she is in love with anyone. While doing this job, he eventually falls in love with the girl (Sharmelee), and quits his detective job. Sharmelee, who is the daughter of a rich gold seller, has a strict policy in her life to not love anyone, because her sister eloped with another guy in the past and her father (Nasser) had suffered a heart attack. The crux is how Jiiva wins Sharmelee's heart and how they convince their parents to accept their marriage. Watch the full movie _Aasai Aasaiyai_ (qv) online, only on Eros Now."
}