{
    "id": "9616700",
    "localized title": "Adú",
    "cast": [
        "Luis Tosar",
        "Álvaro Cervantes",
        "Anna Castillo",
        "Moustapha Oumarou",
        "Miquel Fernández",
        "Jesús Carroza",
        "Adam Nourou",
        "Zayiddiya Dissou",
        "Ana Wagener",
        "Nora Navas",
        "Issaka Sawadogo",
        "Bella Agossou",
        "Josean Bengoetxea",
        "Eliane Chagas",
        "Koffi Gahou",
        "Belén López",
        "Emilio Buale",
        "Hamid Krim",
        "Marta Calvó",
        "Tarik Rmili",
        "Mariano Nguema",
        "Babou Cham",
        "Candela Cruz",
        "Iván Mendes",
        "Chumo Mata",
        "Mulie Jarju",
        "Maitena Salinas",
        "Roberto Lezana",
        "Xavi Lite",
        "Rubén Miralles",
        "Louis Afam",
        "Djédjé Apali",
        "Joseph Ewonde",
        "Luis Fernández Lago"
    ],
    "genres": "Drama",
    "runtimes": "119",
    "countries": "Spain",
    "country codes": "es",
    "language codes": [
        "fr",
        "en",
        "es"
    ],
    "color info": "Color",
    "aspect ratio": "2.39:1",
    "sound mix": "Dolby Atmos",
    "certificates": [
        "Argentina:16",
        "Australia:MA15+",
        "Brazil:12::(self-applied)",
        "Canada:TV-MA::(self-applied)",
        "France:13::(self-applied)",
        "Germany:12::(self-applied)",
        "Italy:VM14::(self-applied)",
        "Japan:R18+::(self-applied)",
        "Mexico:TV-MA::(self-applied)",
        "Netherlands:12",
        "Singapore:NC16",
        "Spain:16::(ICAA)",
        "United Kingdom:15",
        "United States:TV-MA"
    ],
    "original air date": "30 Jun 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTg0NjBiNzItOGZkZS00MDg0LThlNDEtZDEzYmU5MjZhYzg0XkEyXkFqcGdeQXVyODc0OTEyNDU@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "9616700",
    "plot outline": "In the coastal autonomous city of Melilla (located in north Africa but belonging Spain), Mateo is a Civil Guard with the task to protect the barb wire which divides the city of the rest of Africa to avoid the entering of African immigrants to Spain. During a mass attempt a night, Mateo is witness about as his partner Javi hits with his club in the head to an immigrant named Tatu, falling of the barb wire to the ground and dying in the fall, causing the rage in the rest of immigrants that seen it. At the same time, in a reservation of Mbouma, Cameroon, Gonzalo is a Spaniard working as external advisor to prevent the killing of elephants by poachers, who arrives too much late to save the most important elephant of the reservation. Unaware for him, this killing causes that the child Alika and his younger brother Adu be forced to flee from their little town in Mbouma pursued by poachers, after that they were accidental witnesses of the killing. While in Melilla Mateo doubts between saying the truth about what happened or keeping silence to protect Javi, Gonzalo is fired of his job after a discussion with the reservation's guards and he moves to the airport to meet Sandra, his longtime stranded daughter (a lover of alcohol, drugs, party and wild side of life) who still continues resentful with her father after he left she and her mother when Sandra was a child, forced to move with Gonzalo after some troubles in Madrid (center to Spain and country's capital). Hoping to arrive Spain to meet with their father, Alika and Adu take a flight as stowaways hiding them in the undercarriage, but Alika dies by frozen and falls to the sea when the plane opens the undercarriage to take land, leaving alone to Adu who by mistake arrives Mauritania. While Mateo is visited by Tatu's lawyer Paloma trying to convince him to be honest in Javi's trial, Gonzalo tries to save Sandra of her self-destructive spiral of addictions to reconcile each other, and Adu is saved of the police by the teenager Massar who decides to care Adu as his new older brother for traveling Spain by offering sexually himself to truck drivers in order to earn money for finally arriving mount Gurugu, makeshift camp close to Melilla where immigrants await the right moment to pass the border, not knowing that their paths will cross with Mateo and Gonzalo in the most unexpected ways.",
    "languages": [
        "French",
        "English",
        "Spanish"
    ],
    "title": "Adu",
    "kind": "movie",
    "directors": "Salvador Calvo",
    "writers": "Alejandro Hernández",
    "producers": [
        "Álvaro Augustin",
        "Ghislain Barrois",
        "Ricardo Marco Budé",
        "Luis Fernández Lago",
        "Cristóbal García",
        "Paloma Molina",
        "Ana Parra",
        "Edmon Roch",
        "Ignacio Salazar-Simpson",
        "Jorge Tuca",
        "Javier Ugarte"
    ],
    "composers": "Roque Baños",
    "cinematographers": "Sergi Vilanova Claudín",
    "editors": "Jaime Colis",
    "editorial department": [
        "Quique Cañadas",
        "Bea Górriz",
        "Rafa Marmodoro",
        "Alberto Merino",
        "Gabriela Pérez",
        "Carlos Quirós",
        "Laura Sánchez"
    ],
    "casting directors": [
        "Cendrine Lapuyade",
        "Eva Leira",
        "Yolanda Serrano"
    ],
    "production designers": "César Macarrón",
    "art directors": "Alba Sueiro",
    "costume designers": "Patricia Monné",
    "make up department": [
        "Mara Collazo",
        "Elena Cuevas",
        "Irene Sánchez Cuevas",
        "Sergio López",
        "Belén Redondo Villoslada",
        "Paula Sánchez"
    ],
    "production managers": [
        "Sergio Gil Alonso",
        "Alberto Merino",
        "Ana Parra",
        "Gabriela Pérez",
        "Irene Ramos Ballesteros",
        "Eva Taboada"
    ],
    "assistant directors": [
        "Arcade Assogba",
        "José Baños",
        "Gregory Brossard",
        "Borja Grandío",
        "Álvaro Monis",
        "Jorge Vega"
    ],
    "art department": [
        "Ayax Caplliure Almodóvar",
        "Miriam García",
        "Sergio González Kuhn",
        "Eduardo Gómez",
        "Daniel Hernández",
        "Elsa Hernández",
        "Javier López Antía",
        "Rita M. Mon",
        "Daniel Macarrón",
        "Paula Macarrón",
        "Jose Anton Machado",
        "Paula Martí",
        "Chelo Murcia",
        "Olivia O'Sullivan",
        "César Pardiñas",
        "Alex Porras",
        "Raúl Rodriguez",
        "Carmen Rodríguez",
        "Pablo Trasancos",
        "Patricia Walker"
    ],
    "sound department": [
        "Jorge Alarcón",
        "Jorge Bergia Mediterráneo",
        "Nicolas de Poulpiquet",
        "Eduardo Esquide",
        "Juan Ferro",
        "Markus Glunz",
        "Anqi He",
        "Tomás Kruse",
        "Tapio Liukkonen",
        "Steve Miller",
        "Pablo Rivas Leyva",
        "Jamaica Ruiz",
        "Oscar Schlicht",
        "Óscar Segovia",
        "Álvaro Silva",
        "Pablo Áset"
    ],
    "special effects": [
        "Iker de la Calle",
        "Susana Contera",
        "Pablo Fernández Gallego",
        "Pedro González",
        "Miguel Olarieta",
        "Álex Rodilla",
        "Pablo Rodriguez",
        "Raúl Romanillos",
        "Paloma Seseña",
        "Borja Zubiaga Delclaux"
    ],
    "visual effects": [
        "Carlos Cantalapiedra Vaquero",
        "Milagros Gracia",
        "Ferran Piquer",
        "Miriam Piquer",
        "Andrés Ramírez",
        "Rocío Soriano Martín",
        "José Miguel Zapata"
    ],
    "stunts": [
        "Carlos Abella",
        "Óscar Barrios",
        "Gregory Brossard",
        "Héctor Chele",
        "Moustapha Fall",
        "Jhon Jairo",
        "Fran Mora",
        "Agustín Nchama",
        "Rubén Oyono",
        "Jesús Mendoza Palacios",
        "Sergio del Val",
        "Chinyere Victor"
    ],
    "camera department": [
        "David Acereto",
        "Marco Alonso Monedero",
        "Chisko Blanco",
        "Jara Bustos",
        "Javier Casado",
        "David Catalán",
        "Josu Cejuela",
        "Manu Cervantes",
        "Manuel Cervantes",
        "Iker Criado",
        "Miguel Ángel Cárdenas",
        "Luis Miguel Daza",
        "Elías Fernández",
        "Raúl García",
        "Fernando Gil G.",
        "Shantall González",
        "Francisco Lara",
        "Emilio Lillo",
        "Germán Lorenzo",
        "Manuel Mateos Fernández",
        "Victor Pajares",
        "Manolo Pavón",
        "Ernesto Reguera",
        "Ramiro Sabell hijo",
        "Susana Siscart",
        "Juanjo Sánchez",
        "Rebeca Sánchez",
        "José Tamayo",
        "Sandra Toral Álvarez",
        "Xabier Urretavizcaya"
    ],
    "casting department": [
        "Iván Armesto",
        "Leticia Criado",
        "Cristina Vicente",
        "Marcelo Cortazzo"
    ],
    "costume departmen": [
        "Mar Bardavío",
        "Svetlana Lezhneva",
        "María Manchado",
        "Saida Molina",
        "Ariane Núñez",
        "Rocío Pérez Valero",
        "Rocío Redondo",
        "Vanessa Sánchez"
    ],
    "location management": [
        "Nadder Acabani",
        "Daniel Botello",
        "Jorge Galerón",
        "Carmen Mier",
        "David Perea",
        "Alex Porras",
        "Eva Yuste"
    ],
    "music department": [
        "Cherif Badua",
        "Ginés Carrión",
        "Tessy Díez",
        "Vanessa Garde"
    ],
    "script department": [
        "Ana Rosa Diego",
        "Virginia Lacorzana"
    ],
    "transportation department": [
        "Daniel Bravo",
        "Javier Brito",
        "Miguel Ángel García",
        "Eva María Márquez",
        "Florencio Polo",
        "Jose Luis Torres"
    ],
    "miscellaneous": [
        "Bella Agossou",
        "Pilar Alcántara",
        "Josepmaria Anglès",
        "Hakim Asliman",
        "Fernando Baldellou",
        "Agossou Bella",
        "Ángelas Beotas",
        "Clever Beretta Custodio",
        "Pilar Bergés",
        "Victoria Borrás",
        "Aroa Bueno",
        "Ana Belen Carmona",
        "Eva López Carranza",
        "Yago Casariego",
        "Francisco Celma",
        "Carlos del Valle",
        "Sandra Ejarque",
        "Manuel Eslava Fajardo",
        "Fernando Esteban",
        "Leyre Estébanez",
        "Estefanía Ferrer",
        "Jorge Galerón",
        "Ana Gamboa",
        "Lidia López García",
        "Luca Giammatteo",
        "Has-San Hamed",
        "Samir Hamed",
        "Mar Ilundain",
        "Ana Izquierdo",
        "Simón Lorenzo",
        "Bodegas Lozano",
        "Antonio Angel Martinez",
        "Lucía Gómez Meca",
        "Carmen Mier",
        "Cristóbal Moya",
        "Tony Muñoz Collado",
        "Paloma Nebot",
        "Laura Castro Otero",
        "Patricia Paredes",
        "Ainhoa Pernaute",
        "Adrián Martínez Pérez",
        "Gemma Pérez",
        "Gema Ramos",
        "Irene Ramos",
        "Irene Ramos",
        "Begoña Sanz",
        "Arantxa Sebastián",
        "Carlos Segovia",
        "Elisa Sirvent",
        "Eva Taboada",
        "Ana Toro",
        "Ana Torres",
        "Paloma Gonzalez Torrijo",
        "Patti Vera",
        "Luis Vázquez"
    ],
    "thanks": [
        "Alejandro Hernández",
        "Paolo Vasile"
    ],
    "akas": [
        "Un mundo prohibido (Spain)",
        "Adu (World-wide, English title)",
        "Adu (United States)",
        "Аду (Russia)"
    ],
    "writer": "Alejandro Hernández",
    "director": "Salvador Calvo",
    "production companies": [
        "Ikiru Films",
        "Instituto de la Cinematografía y de las Artes Audiovisuales",
        "Mediaset España",
        "Mogambo",
        "Netflix",
        "Telecinco Cinema",
        "Terraza Films, La",
        "Un Mundo Prohibido"
    ],
    "distributors": [
        "Netflix",
        "Netflix",
        "Netflix",
        "Netflix",
        "Paramount Pictures"
    ],
    "other companies": "WhyOnSet",
    "plot": [
        "Three people, three stories, one thing in common: Africa.",
        "In the coastal autonomous city of Melilla (located in north Africa but belonging Spain), Mateo is a Civil Guard with the task to protect the barb wire which divides the city of the rest of Africa to avoid the entering of African immigrants to Spain. During a mass attempt a night, Mateo is witness about as his partner Javi hits with his club in the head to an immigrant named Tatu, falling of the barb wire to the ground and dying in the fall, causing the rage in the rest of immigrants that seen it. At the same time, in a reservation of Mbouma, Cameroon, Gonzalo is a Spaniard working as external advisor to prevent the killing of elephants by poachers, who arrives too much late to save the most important elephant of the reservation. Unaware for him, this killing causes that the child Alika and his younger brother _Adu_ (qv) be forced to flee from their little town in Mbouma pursued by poachers, after that they were accidental witnesses of the killing. While in Melilla Mateo doubts between saying the truth about what happened or keeping silence to protect Javi, Gonzalo is fired of his job after a discussion with the reservation's guards and he moves to the airport to meet Sandra, his longtime stranded daughter (a lover of alcohol, drugs, party and wild side of life) who still continues resentful with her father after he left she and her mother when Sandra was a child, forced to move with Gonzalo after some troubles in Madrid (center to Spain and country's capital). Hoping to arrive Spain to meet with their father, Alika and _Adu_ (qv) take a flight as stowaways hiding them in the undercarriage, but Alika dies by frozen and falls to the sea when the plane opens the undercarriage to take land, leaving alone to _Adu_ (qv) who by mistake arrives Mauritania. While Mateo is visited by Tatu's lawyer Paloma trying to convince him to be honest in Javi's trial, Gonzalo tries to save Sandra of her self-destructive spiral of addictions to reconcile each other, and _Adu_ (qv) is saved of the police by the teenager Massar who decides to care _Adu_ (qv) as his new older brother for traveling Spain by offering sexually himself to truck drivers in order to earn money for finally arriving mount Gurugu, makeshift camp close to Melilla where immigrants await the right moment to pass the border, not knowing that their paths will cross with Mateo and Gonzalo in the most unexpected ways.::Chockys",
        "In a desperate attempt to reach Europe and crouched before an airstrip in Cameroon, a six-year-old boy and his older sister wait to sneak into the holds of an airplane. Not too far away, an environmental activist contemplates the terrible image of an elephant, dead and fangless. Not only do you have to fight against poaching, but you will also have to meet the problems of your newly arrived daughter from Spain. Thousands of kilometers to the north, in Melilla, a group of civil guards prepare to face the furious crowd of sub-Saharan people who have begun the assault on the fence. Three stories linked by a central theme, in which none of its protagonists know that their destinies are doomed to cross and that their lives will no longer be the same.::scallyscouser"
    ],
    "synopsis": "In the coastal autonomous city of Melilla (located in north Africa but belonging Spain), Mateo is a Civil Guard with the task to protect the barb wire which divides the city of the rest of Africa to avoid the entering of African immigrants to Spain. During a mass attempt a night, Mateo is witness about as his partner Javi hits with his club in the head to an immigrant named Tatu, falling of the barb wire to the ground and dying in the fall, causing the rage in the rest of immigrants that seen it. At the same time, in a reservation of Mbouma, Senegal, Gonzalo is a Spaniard working as external advisor to prevent the killing of elephants by poachers, who arrives too much late to save the most important elephant of the reservation. Unaware for him, this killing causes that the child Alika and his younger brother Adu be forced to flee from their little town in Mbouma pursued by poachers, after that they were accidental witnesses of the killing. While in Melilla Mateo doubts between saying the truth about what happened or keeping silence to protect Javi, Gonzalo is fired of his job after a discussion with the reservation's guards and he moves to the airport to meet Sandra, his longtime stranded daughter (a lover of alcohol, drugs, party and wild side of life) who still continues resentful with her father after he left she and her mother when Sandra was a child, forced to move with Gonzalo after some troubles in Madrid (center to Spain and country's capital). Hoping to arrive Spain to meet with their father, Alika and Adu take a flight as stowaways hiding them in the undercarriage, but Alika dies by frozen and falls to the sea when the plane opens the undercarriage to take land, leaving alone to Adu who by mistake arrives Mauritania. While Mateo is visited by Tatu's lawyer Paloma trying to convince him to be honest in Javi's trial, Gonzalo tries to save Sandra of her self-destructive spiral of addictions to reconcile each other, and Adu is saved of the police by the teenager Massar who decides to care Adu as his new older brother for traveling Spain by offering sexually himself to truck drivers in order to earn money for finally arriving mount Gurugu, makeshift camp close to Melilla where immigrants await the right moment to pass the border, not knowing that their paths will cross with Mateo and Gonzalo in the most unexpected ways."
}