{
    "id": "0090859",
    "localized title": "कोब्रा",
    "original title": "Cobra",
    "cast": [
        "Sylvester Stallone",
        "Brigitte Nielsen",
        "Reni Santoni",
        "Andrew Robinson",
        "Brian Thompson",
        "John Herzfeld",
        "Lee Garlington",
        "Art LaFleur",
        "Marco Rodríguez",
        "Ross St. Phillip",
        "Val Avery",
        "David Rasche",
        "John Hauk",
        "Nick Angotti",
        "Nina Axelrod",
        "Joe Bonny",
        "Brad Bovee",
        "Kevin Breslin",
        "Roger Aaron Brown",
        "John Cahill",
        "Malik Carter",
        "Louise Caire Clark",
        "Christine Craft",
        "Gregory Cruz",
        "Deborah Dalton",
        "Harry Demopoulos",
        "Scott Dockstader",
        "Laura Drake",
        "Ken Hill",
        "Arthur Kassell",
        "Karen Kondazian",
        "Fred Lucky",
        "Robert Martini",
        "Joe Masino Jr.",
        "Dorothy Meyer",
        "Paul Dion Monte",
        "Joe Stone",
        "Jim Wilkey",
        "Bert Williams",
        "Leslie Morris",
        "Clare Torao",
        "Steve Lentz",
        "Glenda Wina",
        "Michael Bershad",
        "Joe Fowler",
        "Brian Edwards",
        "David Eisen",
        "Julie Hampton",
        "Kurt V. Hulett",
        "Ron Jeremy",
        "Helen Kelly",
        "Don Ramey Logan"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "87",
    "countries": [
        "United States",
        "Israel"
    ],
    "country codes": [
        "us",
        "il"
    ],
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "sound mix": [
        "70 mm 6-Track::(70 mm prints)",
        "Ultra Stereo::(35 mm prints)::(as Eagle Stereo)"
    ],
    "certificates": [
        "Argentina:18",
        "Australia:R",
        "Brazil:18",
        "Brazil:14",
        "Brazil:16",
        "Canada:14A",
        "Canada:R::(Manitoba/Nova Scotia/Ontario)",
        "Canada:13+::(Quebec)",
        "Canada:14+::(TV rating)",
        "Chile:14",
        "Denmark:15::(DVD and Blu-ray rating)",
        "Finland:K-18",
        "Finland:K-16",
        "Finland:K-16",
        "Finland:K-18",
        "France:12",
        "Germany:18",
        "Iceland:16",
        "India:A",
        "Italy:VM14",
        "Mexico:C",
        "Netherlands:16",
        "New Zealand:M",
        "New Zealand:RP16::(withdrawn)",
        "Norway:18::(DVD rating)",
        "Norway:15::(VOD)",
        "Norway:18::(video premiere)",
        "Norway:(Banned)::(1986-2003)",
        "Peru:18",
        "Portugal:M/16",
        "Russia:14+",
        "Singapore:PG",
        "South Africa:16",
        "South Korea:15",
        "Spain:18",
        "Sweden:15",
        "United Kingdom:18",
        "United Kingdom:18",
        "United States:R",
        "West Germany:18"
    ],
    "original air date": "1986 (Poland)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWZhOWVmMzctY2RjMi00YzkxLTkwOGQtODA2MDk1MDg1ZWVlXkEyXkFqcGdeQXVyMDEwMjgxNg@@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0090859",
    "plot outline": "As crime runs rampant in the United States, the hard-as-nails LAPD Lieutenant, Marion \"Cobra\" Cobretti, is the only cure for the crime-infested urban jungle of Los Angeles. In the meantime, a string of seemingly unconnected and unmotivated random assaults on civilians will soon drag the hardened officer into a violent war against the psychopaths of the secret organisation named \"The New World\". With the criminal society's sole purpose to weed out the weak, Cobra will escort an important witness--the young model, Ingrid--out of town to protect her; however, the movement's delusional killers will stop at nothing to track her down. Now, the only one who stands in their way is the one-man-army Lieutenant. Are they prepared for Cobra's nasty bite?",
    "languages": "English",
    "title": "Cobra",
    "kind": "movie",
    "directors": "George P. Cosmatos",
    "writers": [
        "Paula Gosling",
        "",
        "Sylvester Stallone"
    ],
    "producers": [
        "James D. Brubaker",
        "Yoram Globus",
        "Menahem Golan",
        "Tony Munafo"
    ],
    "composers": "Sylvester Levay",
    "cinematographers": "Ric Waite",
    "editors": [
        "James R. Symons",
        "Don Zimmerman"
    ],
    "editorial department": [
        "Carmen Baker",
        "Donah Bassett",
        "Paul Cichocki",
        "Gregory M. Gerlich",
        "Martin November",
        "Robert Raring",
        "Markus Schaub",
        "Ron South"
    ],
    "production designers": "Bill Kenney",
    "art directors": [
        "Adrian Gorton",
        "William Ladd Skinner"
    ],
    "set decorators": "Robert Gould",
    "costume designers": "Tom Bronson",
    "make up department": [
        "Stephen Abrums",
        "Leonard Engelman",
        "Lola Kemp",
        "Barbara Lorenz"
    ],
    "production managers": "Mary Eilts",
    "assistant directors": [
        "Duncan Henderson",
        "Eric Jewett",
        "Janet G. Knutsen",
        "Terry Leonard",
        "Seanna McPherson"
    ],
    "art department": [
        "Cate Bangs",
        "Max E. Brehme",
        "William D. Derham",
        "Louis S. Fleming",
        "Douglas Forsmith",
        "Kurt V. Hulett",
        "David F. Klassen",
        "Frederick Lietzman",
        "Fred Lucky",
        "Gayle Simon",
        "Michael J. Smith",
        "Jane Stewart",
        "Ward Welton",
        "Paul Breuninger",
        "Robert W. King",
        "D.A. Zingelewicz"
    ],
    "sound department": [
        "Fred J. Brown",
        "Teri E. Dorman",
        "Evelyn Dutton",
        "Michael Evje",
        "Stanley B. Gill",
        "Avram D. Gold",
        "Joseph A. Ippolito",
        "Rick Kline",
        "Gregg Landaker",
        "James M. McCann",
        "Michael Minkler",
        "Robert Nichols II",
        "Margie O'Malley",
        "Michelle Pleis",
        "Gary Ritchie",
        "Michele Sharp",
        "Fredrick Talmage",
        "Jay Wilkinson",
        "Donald C. Rogers"
    ],
    "special effects": [
        "Phil Cory",
        "Jim Schwalm",
        "David Simmons",
        "Ken Speed",
        "Ray Svedin",
        "Hans Metz"
    ],
    "stunts": [
        "Brad Bovee",
        "David D. Darling",
        "Mark De Alessandro",
        "Scott Dockstader",
        "Richard Epper",
        "Corey Michael Eubanks",
        "Debbie Evans",
        "Joe Finnegan",
        "Terry Jackson",
        "Mike Johnson",
        "Tracy Keehn-Dashnaw",
        "Paul M. Lane",
        "Lane Leavitt",
        "Terry Leonard",
        "Mike H. McGaughy",
        "Gary McLarty",
        "Branscombe Richmond",
        "Pat Romano",
        "Kerry Rossall",
        "Michael Runyard",
        "Ben Scott",
        "Mike Tillman",
        "Perry Barndt",
        "Mark De Alessandro",
        "Corey Michael Eubanks",
        "Diane Kay Grant",
        "Terry Jackson",
        "Jeff Langton",
        "Terry Leonard",
        "Greg McMickle",
        "Denney Pierce",
        "Larry Randles",
        "George A. Sack Jr."
    ],
    "camera department": [
        "Danny Boldroff",
        "Steve Boldroff",
        "Carl Boles",
        "Dave Friedman",
        "Roger Gebhard",
        "Jack Glenn",
        "Howard Hagadorn",
        "Larry Hezzelwood",
        "Michael J. Hogan",
        "Christopher Ishii",
        "Richard L. Jordan",
        "John London",
        "Nick McLean",
        "Richard A. Mention III",
        "Rick Neff",
        "Keith Pallant",
        "Timothy Prince",
        "Tony Rivetti",
        "Michael St. Hilaire",
        "Jeff Stanman",
        "Eddie Taylor",
        "Ken Tosic",
        "Ian Wayne",
        "Don Whipple",
        "Stephen St. John"
    ],
    "casting department": [
        "Henry Alford",
        "Barbara Harris",
        "Susie Johnson",
        "Cynthia Rothkopf",
        "Sally Stiner",
        "Joy Todd"
    ],
    "costume departmen": [
        "Robin Borman-Wizan",
        "Linda Henrikson",
        "Murray Lantz",
        "Michael J. Long"
    ],
    "location management": [
        "Robert H. Lemer",
        "Janice Polley",
        "Laura Sode-Matteson"
    ],
    "music department": [
        "Dan Bates",
        "George Brand",
        "Tom Brown",
        "Robin Garb",
        "Sylvester Levay",
        "Thomas Pasatieri",
        "George Doering",
        "Robin Garb",
        "Norman Ludwin",
        "Lisa Donovan Lukas",
        "Spencer Proffer"
    ],
    "script department": "Hope Williams",
    "transportation department": [
        "John Armstrong",
        "Ed Arter",
        "Michael W. Broomer",
        "Michael Brum",
        "John Cahill"
    ],
    "miscellaneous": [
        "Tina M. Arter-Duquette",
        "Marcei A. Brown",
        "Susan J. Brubaker",
        "Bruce Carter",
        "James Ealy",
        "Tom Gray",
        "Laurie Allison Harmon",
        "Joseph R. Hessekiel",
        "Richard Liebegott",
        "Verla Loomis Randall",
        "James E. Lorimer",
        "Tony Maffatone",
        "Lynn C. Marchionno",
        "Lucy Mardonovich",
        "Maggie Martin",
        "Paul Dion Monte",
        "Anna M. Perron",
        "Susan Persily",
        "Anthony Poll",
        "Franklin A. Vallette",
        "Bill Wells",
        "Cynthia Wise",
        "Omneya 'Nini' Mazen",
        "Joe Straw"
    ],
    "thanks": "Randy Miller",
    "akas": [
        "Die City-Cobra (Germany)",
        "Cobra, el brazo fuerte de la ley (Spain)",
        "कोब्रा (India, Hindi title)",
        "Stallone: Cobra (Brazil)",
        "コブラ (Japan, Japanese title)"
    ],
    "writer": [
        "Paula Gosling",
        "Sylvester Stallone"
    ],
    "director": "George P. Cosmatos",
    "production companies": [
        "Warner Bros.",
        "The Cannon Group",
        "Golan-Globus Productions"
    ],
    "distributors": [
        "Cannon Film Distributors",
        "Warner Bros.",
        "Columbia-Warner Filmes de Portugal",
        "Warner Bros.",
        "Warner Bros.",
        "Warner Bros.",
        "Warner-Columbia Films",
        "Warner-Columbia Films",
        "Warner-Columbia Filmverleih",
        "Warner Bros Pictures",
        "American Broadcasting Company (ABC)",
        "Argentina Video Home",
        "Canal+",
        "Fazer Musiikki Oy/Fazer Video",
        "Future Film",
        "Mainostelevisio (MTV3)",
        "RTL Entertainment",
        "Scream Factory",
        "Sub",
        "Varus Video",
        "ViacomCBS",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Yleisradio (YLE)"
    ],
    "other companies": [
        "Cinema Research",
        "International Alliance of Theatrical Stage Employees (IATSE)",
        "Panavision",
        "The Mark Baron Company",
        "Warner Hollywood Studios"
    ],
    "plot": [
        "A tough-on-crime street cop must protect the only surviving witness to a strange murderous cult with far-reaching plans.",
        "As crime runs rampant in the United States, the hard-as-nails LAPD Lieutenant, Marion \"_Cobra_ (qv)\" Cobretti, is the only cure for the crime-infested urban jungle of Los Angeles. In the meantime, a string of seemingly unconnected and unmotivated random assaults on civilians will soon drag the hardened officer into a violent war against the psychopaths of the secret organisation named \"The New World\". With the criminal society's sole purpose to weed out the weak, _Cobra_ (qv) will escort an important witness--the young model, Ingrid--out of town to protect her; however, the movement's delusional killers will stop at nothing to track her down. Now, the only one who stands in their way is the one-man-army Lieutenant. Are they prepared for _Cobra_ (qv)'s nasty bite?::Nick Riganas",
        "A tough-on-crime street cop must protect the only surviving witness to a strange murderous cult with far reaching plans. Tensions are further heightened when a desperate _Cobra_ (qv) is challenged to an arm wrestle. The prize? The freedom of his beloved son",
        "A gang of neo-fascist thugs, led by the self-proclaimed 'Night Slasher', are breaking into people's homes and cars, then killing them at random. When of of these thugs holds up a food store and takes hostages, Lt. Marion Cobretti - an intense, take-no-prisoners cop, is brought onto the scene to end the hostage-taking. Ranting bizarrely about a 'New World', the man levels a sawed-off shotgun at Cobretti, who hits him with a knife, then guns him down when the man refuses to put down his weapon. Later that night, another murder occurs, attributed to the Night Slasher - and the next day, another one. This one is witnessed by a young woman, Ingrid Knutsen. She drives away before the thugs can kill her, but it isn't long before some creepy-looking people start making attempts on her life - and Cobretti's. Cobretti plans to move the only witness to the blood spree upstate, but with inside information, the thugs follow them. And a battle for survival rages between Cobretti and the thugs.::Derek O'Cain",
        "In the mid-1980s Marion Cobretti, nicknamed _Cobra_ (qv), is a ruthless LAPD lieutenant whose leather-jacketed garb and souped-up early-50s car make him \"a reject from the 1950s,\" as his partner Sergeant Reni Gonzalez puts it. Cobretti and Gonzalez are part of the LAPD's Zombie Squad, officers tasked with criminals considered too violent or unpredictable for regular police; the Zombie Squad, however, is also considered a \"dumping ground\" for officers considered too extreme for a department increasingly besieged by politics, shown in Cobretti's running clashes with Detective Andrew Monte, an officer who despises Cobretti's methods (the two officers nearly come to blows when Monte accuses Cobretti of using a terrified witness solely as expendable bait), and also in a confrontation between Cobretti and a TV journalist after a gun-wielding psychopath opens fire in a supermarket and is dispatched with ruthless panache by Cobretti. The supermarket showdown comes amid a wave of knife killings by a man known as The Night Slasher, and Detective Monte stubbornly refuses to heed Cobretti's warning that the Night Slasher killings are the work of a criminal anomaly - an organized army of psychopaths. Cobretti's theory proves accurate when Ingrid Knudson, a model, accidentally witnesses a Night Slasher killing and is pursued by the gang, and is placed under the protective wing of Cobretti and Gonzalez. Tragedy nearly strikes, however, when a message from police HQ separates Cobretti and Gonzalez from Ingrid Knudson, and simultaneous attempts are made on the lives of Cobretti and Knudson that both barely escape. Furious that a mole in the department is working for Night Slasher, Cobretti and Gonzalez must take Knudson out of the city, unaware that the department is quietly hoping this will draw Night Slasher's gang away, which leaves the two officers and their scared witness in a wild flight for their lives in upstate California.::Michael Daly"
    ],
    "synopsis": "\"Crime is a disease. Meet the cure.\" Lt. Marion Cobretti, nicknamed Cobra, is a sunglasses wearing, matchstick chewing cop who is all about getting the criminal and breaking the rules. He has the entire department on his back all the time about his very violent and forceful way of getting the bad guys, normally making the punks end up in a body bag loaded with lead issued from his trusty pearl handled Colt .45.But Cobra is set a real challenge when a killer cult is spreading rapidly in the city. The cult kills innocent people, seeming to pick random victims and slaying them with jagged knifes and getting off on the hunted's fear. But they make a huge mistake when they kill a woman at an bus stop and a young model sees them. She doesn't exactly know that they've killed someone, but is extremely scared when one of the killers, a muscle bound and rather deformed looking man, gives her a spine chilling look. Soon the killers are after her! And they kill her photographer, a security guard and very nearly make her meet their sadistic style of murder. Cobra is soon on the scene, with his junk food loving partner, Sergeant Gonzales. They ask the young model, whose name turns out to be Ingrid, if she saw the killers. She says she only saw some people at the bus stop acting very odd and a man who scared her badly.But Cobra's progress into solving the case is halted by the pencil pushing, fat headed Detective Monte, who is always on his case about too much force. He tells Cobra that he's on the Zombie squad for a reason, he's too violent and doesn't please the press.Much too Monte's disgust, the Chief and Captain Sears decided to let Cobra use his street wise talk to fight the killer. Cobra goes through the entire population of the nocturnal seediness of downtown, where all the prostitutes, pimps, bar flies and cons of the city hang out. But\nhe doesn't find any kind of help from these people, they have no idea who the killers are.Cobra soon connects a supermarket killing, that involved a psycho who claimed that he was part of \"the new order\" who would wipe out the weak and make the strong survive, to the mass murders ripping at the soft under belly of the capital. But Detective Monte's smart mouth antics and somewhat spineless Captain Sears try to stop him from using aggressive force, not caring that Ingrid almost got killed by one of the cult followers, Night Slasher and that numerous other people were slayed in the hospital at night. The Captain agrees to let Cobra take Ingrid to the countryside with Gonzales and a female cop named Nancy Stalk. Little does he know that the heat is going to be turned up instead\nof cooled off when they leave the city. Nancy is in fact a cult member and leading the Night Slasher and his cronies right to where Cobra is taking Ingrid.While in a motel that's off the beaten track, Ingrid and Cobra realize their attraction to one another. The romantic mood is short lived however, and the cult is back on Cobra's trail. They burn down the motel and almost kill Gonzales. Cobra and Ingrid ride off in a pick up truck and almost meet their end by crashing into a burning car that's blocking the road. Cobra still manages to take some punks down though, with a very nice piece of weaponry called the laser mount sub-machine gun.They end up in a steel mill and finally Night Slasher and Cobra come face to face. In a very psychotic speech Night Slasher says that Cobra's law is weak and that their cult will always survive. This sends Cobra off the deep end and Slasher onto a huge metal hook, that rips through his back and sends him off into a molten vat of metal. Nancy however is still alive and tries to kill Cobra, but she is also killed.After all the bloodshed, Cobra and Ingrid emerged slightly bruised and dirty, from the factory. The Captain congratulates Cobra, but Monte is too proud to actually admit that Cobra won the fight. He picks up his bit about too much excessive force, but earns himself a good punch from Cobra, sending him to the ground stone cold. Ingrid and Cobra ride off on a motorbike into the sunset to Kiss singing \"Can you get enough me baby, I can't get enough of you.\" In true Stallone/ Cobra style, the day is saved and the conveniently pretty chic is too!"
}