{
    "id": "0113118",
    "localized title": "Friday",
    "cast": [
        "Ice Cube",
        "Chris Tucker",
        "Nia Long",
        "Tom Lister Jr.",
        "John Witherspoon",
        "Anna Maria Horsford",
        "Regina King",
        "Paula Jai Parker",
        "Faizon Love",
        "DJ Pooh",
        "Angela Means",
        "Vickilyn Reynolds",
        "Ronn Riser",
        "Kathleen Bradley",
        "Tony Cox",
        "Anthony Johnson",
        "Demetrius Navarro",
        "Jason Bose Smith",
        "Bernie Mac",
        "Justin Revoner",
        "Meagan Good",
        "LaWanda Page",
        "Terri J. Vaughn",
        "F. Gary Gray",
        "Yvette Wilson",
        "WC",
        "Reynaldo Rey",
        "Michael Clarke Duncan"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "91",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:MA",
        "Brazil:18",
        "Canada:14A::(Canadian Home Video rating)",
        "Canada:R::(Manitoba)",
        "Canada:14::(Nova Scotia)",
        "Canada:AA::(Ontario)",
        "Canada:13+::(Quebec)",
        "France:Tous publics",
        "Germany:16",
        "Germany:12::(TV rating)",
        "Iceland:16",
        "Ireland:18",
        "Ireland:15",
        "Japan:G",
        "New Zealand:R16",
        "Norway:15",
        "Philippines:PG-13",
        "Poland:16::(self-applied)",
        "Russia:12+",
        "Singapore:NC16",
        "South Korea:18",
        "Spain:18",
        "United Kingdom:15",
        "United States:TV-14::(DLSV, TV Rating.)",
        "United States:R",
        "United States:R"
    ],
    "original air date": "26 Apr 1995 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYmEwNjNlZTUtNzkwMS00ZTlhLTkyY2MtMjM2MzlmODQyZGVhXkEyXkFqcGdeQXVyNTI4MjkwNjA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0113118",
    "plot outline": "It is Friday and Craig Jones (Ice Cube) is unemployed, having been fired yesterday. This has lead to trouble with Smokey's (Chris Tucker's) supplier, Big Worm (Faizon Love), who now wants his money, or his product back, or Smokey is a dead man. Then there's Deebo (Tommy \"Tiny\" Lister, Jr.), the local bully, plus Craig's jealous, psychotic girlfriend, Joi (Paula Jai Parker), and Debbie (Nia Long), the neighbor Craig has a crush on. A lot can happen while lounging around your house on a Friday.",
    "languages": "English",
    "title": "Friday",
    "kind": "movie",
    "directors": "F. Gary Gray",
    "writers": [
        "Ice Cube",
        "DJ Pooh"
    ],
    "producers": [
        "W.E. Baker",
        "Patricia Charbonnet",
        "Helena Echegoyen",
        "Ice Cube",
        "DJ Pooh",
        "Andre Robinson Jr.",
        "James Tripp-Haith",
        "Bryan Turner"
    ],
    "composers": [
        "Frank Fitzpatrick",
        "Simon Franglen",
        "Chuck Wild"
    ],
    "cinematographers": "Gerry Lively",
    "editors": "John Carter",
    "editorial department": [
        "Bob Fredrickson",
        "J.R. Post",
        "Dirk Westervelt"
    ],
    "casting directors": [
        "Jaki Brown",
        "Kimberly Hardin"
    ],
    "production designers": "Bruce Bellamy",
    "set decorators": "Michelle Harding Hollie",
    "costume designers": "Shawn Barton",
    "make up department": [
        "Kokeeta Douglas",
        "Cassi Mari",
        "Genna Sapia-Ruffin",
        "Rea Ann Silva",
        "Roddy Stayton"
    ],
    "production managers": [
        "W.E. Baker",
        "James Tripp-Haith",
        "Ted Zachary"
    ],
    "assistant directors": [
        "Algric Leo Chaplin",
        "Kimberly Sizemore",
        "Dwight Williams"
    ],
    "art department": [
        "Jerrah Armistead",
        "Davor Atles",
        "Maria L. Baker",
        "Daniel Bates",
        "James T. Bellamy",
        "Edwin Bogar",
        "James E. Bowen Jr.",
        "Neil Bowman",
        "Raull Butcher",
        "Keef Butterworth",
        "Reagae Clark",
        "Tamara Clinard",
        "Leif Cole",
        "Aleslie Coleman",
        "Aaron Daniels",
        "John Darcey",
        "Marc Dessornes",
        "Elizabeth Flaherty",
        "Roscoe Fowler",
        "Eduardo Garcia",
        "Laren Hafliger",
        "Dale Hart",
        "Ron Helderle",
        "Twain Herron",
        "John Hirtle",
        "Geoff Hubbard",
        "Leza Ingalls",
        "Kirt Johnson",
        "Larry Johnson",
        "Robert Jordan",
        "Harvey Keys",
        "Darol King",
        "Aleksandre Kravets",
        "John Lawrence",
        "Jeff Leahy",
        "John Leynes",
        "Robert Loftin",
        "David Maahs",
        "Enoch Mack",
        "Michael Madzar",
        "Sasha Madzar",
        "Paul Mancieri",
        "Leonard Martin",
        "Thomas J. Martinez",
        "Lori Mazuer",
        "Seth Micklin",
        "Chris Nembhart",
        "Roderick Nunnally",
        "Guy Owens",
        "Lionel Perezdiez",
        "Jeffrey Reed",
        "Kevin Rodgers",
        "Francis J. Roix",
        "Danny Ronay",
        "Guadalupe Sandoval",
        "Jose Sandoval",
        "Dwain Scarborough",
        "Rob Shepps",
        "Sherman Singletary",
        "Nick Sternberg",
        "Nicholas Stewart",
        "Kelly Thompson",
        "Royce Vaughn",
        "Marc Vena",
        "Miriam Warwick",
        "Karen E. Weber",
        "Martell Webster",
        "Robbie Whitelaw",
        "Ronald Williams"
    ],
    "sound department": [
        "Gregg Barbanell",
        "Ken Boesch",
        "Stanley Carr",
        "Robert Davenport",
        "Andrew DeCristofaro",
        "William Freesh",
        "Jonathan Karp",
        "Laura Macias",
        "Leonard Marcel",
        "Holly Montgomery",
        "Rod O'Brien",
        "Yuri Reese",
        "Paul Rodriguez",
        "Allan Schultz",
        "Tony Sereno",
        "John C. Stuver",
        "Gary Sula-Goff",
        "Ken Teaney",
        "Eric Thompson",
        "Kerri Wilson",
        "Bry Worthy",
        "D. Chris Smith"
    ],
    "special effects": [
        "Robert Loftin",
        "Mike Sullivan"
    ],
    "stunts": [
        "Amanda LeFlore",
        "Julius LeFlore",
        "Rusty McClennon",
        "Harry Stanback",
        "F. Pierre Gatling"
    ],
    "camera department": [
        "James Bass",
        "Jon Bauroth",
        "David Jamal Childress",
        "Jack Chouchanian",
        "John Clevenger",
        "Steve Coleman",
        "Howard Cosgrove",
        "Michelle Crenshaw",
        "Brian Cross",
        "Stephen Dennis",
        "Sean 'A.H.' Duggan",
        "Chris Funk",
        "Kirk R. Gardner",
        "Nicola Goode",
        "Emil Hampton",
        "Bradford R. Jamieson",
        "Earl Joachim",
        "Van Johnson",
        "Kevin Kallen",
        "Dave Kemp",
        "John Mang",
        "Michael Martino",
        "Julius Metoyer",
        "Reginald Morris",
        "Ngoli Vukani Nyirenda",
        "Dwayne Platz",
        "Emmet Riser",
        "Jason Rothkowitz",
        "Mark Scott",
        "Mark Spignese",
        "Jeff Stewart",
        "Jeffrey Ray Strong",
        "Scott T. Sudduth",
        "Rick Tucker",
        "Darryl Walthall",
        "Warren Washington",
        "Derek Wells",
        "Paul Woods",
        "Vernon Wynne",
        "Roderick Young",
        "Chris 'Kit' Ryan"
    ],
    "casting department": [
        "Monica R. Cooper",
        "Keno K. Deary",
        "Teddy Stewart",
        "Leah Daniels Butler"
    ],
    "costume departmen": [
        "Paulette E. Holmon",
        "Katrina Mastrolia",
        "Bess Stansell",
        "Eric Upshur",
        "Ernestine Wallace",
        "Dana R. Woods"
    ],
    "location management": [
        "Douglas 'Butch' Allen",
        "Lawrence T. Holmes",
        "Kojo Lewis",
        "Thomas Murry",
        "Eric Powers",
        "Andrew Price",
        "Mark Richardson",
        "Chris W. Tyson"
    ],
    "music department": [
        "Ross Bolton",
        "Tim Boyle",
        "Thom Brennan",
        "Bobby Bryant",
        "Frank Fitzpatrick",
        "Simon Franglen",
        "Willie Green Jr.",
        "Phenix Horns",
        "David Kitay",
        "Iki Levi",
        "Preston Middleton",
        "Lui Lui Satterfield",
        "Andrew Shack",
        "Sandy K. Tanaka",
        "John Joseph Thomas",
        "David Tobocman",
        "Chuck Wild",
        "Dorothy Coleman-Pincus",
        "Dana Sano"
    ],
    "script department": "Melisa Sánchez",
    "transportation department": [
        "John Blenkhorn",
        "Paul Bortoli",
        "G. Ivan Connelly",
        "Heath Culp",
        "Johnny Davis",
        "John De Troia",
        "Walter Foster",
        "Michael Gardley",
        "Michael Granata",
        "James Grant",
        "Mark W. Jones",
        "Mary S. Jones",
        "Nelson Jones",
        "David Lifton",
        "Terry Mack",
        "Donald B. Martin",
        "Sean Neel",
        "Antonio Onate",
        "Benjamin Rivera",
        "Mary LaRee Sgrignoli",
        "Mark Timpe",
        "DeAnna Weippert",
        "Carlos Williams"
    ],
    "miscellaneous": [
        "Donnya Banks",
        "Barry F. Boyd",
        "Vicki Boyd",
        "Paul DeWayne Calderon",
        "Phil Colo'n",
        "Charmaine Dixon",
        "Melissa Elliott",
        "Frank Fitzpatrick",
        "John Frick",
        "Lucia Gerbino",
        "Emily Glatter",
        "Barbara Harris",
        "Monique Hernandez-Fisher",
        "James Patrick Hill",
        "Tanisha Holmon",
        "Ezekiel Jackson",
        "Tony Jacobs",
        "Sati Jamal",
        "Jackie Kiang",
        "Tendaji Lathan",
        "Ricardo Lozier",
        "Kia M. Neal",
        "Shari Poindexter",
        "Doran Reed",
        "Kelly Richardson",
        "E.J. Roberts",
        "Mai Lei Robinson",
        "Karen Sanquist",
        "Carita Spencer-Bryant",
        "Heather Wesley",
        "Tami Womack",
        "Ryan Stefan Bantu",
        "Ronald C. Briggs Jr.",
        "Georgina Cabrera",
        "Denise Jordan Walker"
    ],
    "thanks": [
        "Michael Gruber",
        "Nina Shaw",
        "Lee Young"
    ],
    "akas": [
        "Todo en un viernes (Spain)",
        "friday (Japan, Japanese title)",
        "El viernes (Mexico)",
        "Petek (Slovenia)",
        "Pátek (Czechia)"
    ],
    "writer": [
        "Ice Cube",
        "DJ Pooh"
    ],
    "director": "F. Gary Gray",
    "production companies": [
        "New Line Cinema",
        "Priority Films"
    ],
    "distributors": [
        "New Line Cinema",
        "United Paramount Network (UPN)",
        "Alliance",
        "Entertainment Film Distributors",
        "Fathom Events",
        "GAGA.",
        "Roadshow Entertainment",
        "Alliance Home Video",
        "Entertainment in Video",
        "Front Row Filmed Entertainment",
        "HBO Max",
        "MGM Worldwide Television",
        "New Line Home Video",
        "Rainboworld Entertainment",
        "Roadshow Entertainment Video",
        "Sandrew Film & Teater",
        "Sirius Publishing",
        "Turner Home Entertainment",
        "VCL Communications",
        "Warner Home Video"
    ],
    "other companies": [
        "IMS Film & Media Insurance",
        "Priority Records"
    ],
    "plot": [
        "It's _Friday_ (qv), and Craig and Smokey must come up with $200 they owe a local bully or there won't be a Saturday.",
        "It is _Friday_ (qv) and Craig Jones (Ice Cube) is unemployed, having been fired yesterday. This has lead to trouble with Smokey's (Chris Tucker's) supplier, Big Worm (Faizon Love), who now wants his money, or his product back, or Smokey is a dead man. Then there's Deebo (Tommy \"Tiny\" Lister, Jr.), the local bully, plus Craig's jealous, psychotic girlfriend, Joi (Paula Jai Parker), and Debbie (Nia Long), the neighbor Craig has a crush on. A lot can happen while lounging around your house on a _Friday_ (qv).::grantss",
        "An African-American family wake up one _Friday_ (qv) morning and get ready for an average _Friday_ (qv) of work and school. Craig gets a call from his former girlfriend, abusing him and accusing him of going out with another woman. He gets out of his bed, angry and frustrated, and goes and gets cereal, then his Dad says the all famous line: \"Every time I come in the kitchen, you in the kitchen. In the goddamn refrigerator. Eatin' up all the food. All the chitlins - All the pigs' feet - All the collard greens - All the hog maws. I wanna eat them chitlins - I like pigs' feet\". Craig's friend Smokey puts his head through the window and they sit on the front porch and start making conversation. They Perve on the local mothers and neighbors. They see the local bully, Deebo, and hide all their valuables. Deebo talks Smokey into helping him break into his next door neighbor's house. After that the boys get high. They then get shot at by some people that Smokey owes money to. They finally leave and they see the girl that Craig wants getting hit by the bully. So he pulls a gun out on the bully to scare him, this doesn't work, so hit hits him over the head with a brick and then he gets knocked out, the movie ends.",
        "A lot can happen between Thursday and Saturday - Before the sun sets, Craig must get his friend out of trouble, find a new job so his parents don't evict him, escape his girlfriend long enough to capture a new woman's heart and survive a climatic confrontation with the neighborhood menace.",
        "Craig Jones (Ice Cube) and Smokey (Chris Tucker) are two guys in Los Angeles, California hanging out on their porch on a _Friday_ (qv) afternoon, smoking and looking for something to do. Encounters with neighbors and other friends over the course of the day and night, and their ensuing antics, make up the rest of the movie.",
        "Having just been canned from his job on his day off, Craig Jones (Ice Cube) and his best friend Smokey (Chris Tucker) spend the day smoking up in their South Central neighborhood while dealing with a neighborhood bully, relationship troubles, an angry drug dealer, and a lot of other odd characters.::mystic80"
    ],
    "synopsis": "On Friday in South Central Los Angeles, Craig (Ice Cube) has recently been fired from his job while attempting to collect his wages, as he was allegedly caught on camera stealing packages, although he claims innocence. Exacerbating his dilemma, his father, Mr. Jones (John Witherspoon), attempts to persuade Craig to join him in becoming a dog catcher, threatening to kick him out if he doesn't find a job. All the while, Craig has been eyeing pretty neighbor Debbie (Nia Long), but his insanely jealous girlfriend Joi (Paula Jai Parker) is a formidable obstacle. Meanwhile, Craig's best friend, Smokey (Chris Tucker), has also been smoking a brokered consignment of marijuana, which he was supposed to be selling for the psychopathic drug dealer Big Worm (Faizon Love).Throughout the day, friends and local neighborhood characters pass through, such as the harmless but always-scheming crackhead and petty thief Ezal (Anthony Johnson); the unkempt, perpetual crackhead/moocher Felisha (Angela Means), who is also Debbie's sister; lascivious Pastor Clever (Bernie Mac), who has a brief sex affair with sultry parishioner Mrs. Parker (Kathleen Bradley), before being unexpectedly interrupted by her infuriated, diminutive dwarf husband (Tony Cox); Shana (Terri J. Vaughn), a friend of Craig's sister Dana (Regina King); and Hector (Demetrius Navarro), a well-known stoner who rides around the neighborhood in a lowrider. There's also package-delivery driver Red (DJ Pooh), Craig's former coworker, whose stolen bicycle and black eye are courtesy of the hulking neighborhood bully Deebo (Tommy Lister, Jr.). The latter and Smokey break into the house of Stanley (Ronn Riser), Craig's next door neighbor, and both steal $200, which Deebo keeps for himself.As Big Worm is making his rounds, he stops through the neighborhood in an Ice Cream Truck to collect his money from Smokey. In an attempt to explain his obvious lack of revenue, Smokey inadvertently incriminates Craig, subjecting both to Big Worm's wrath. Big Worm has had enough of Smokey \"playing with his emotions\" and warns him to collect either the $200 dollars no later than 10:00 that evening, or he and Craig will be killed. Craig, although infuriated that Smokey incriminated him, reluctantly agrees to help his friend . Craig's first attempt is to borrow the money from his girlfriend, Joi, but after another run in with Felisha, he is unsuccessful.Craig has a serious moment with Smokey, because the latter doesn't understand the severity of Big Worm's threat. He goes into his house to receive the gun he bought, but his father eventually learns of the plan, and tells Craig that he should use his hands instead of guns to resolve his problems, all while telling his son the story of how Mr. Jones' brother lost his life due to gun violence. Craig ponders on this thought and eventually goes back outside, where Smokey makes a marijuana transaction with Hector (after Craig has to remind him of what's at stake). Suddenly, Deebo comes back around to hassle the duo and Red, who at this point gets his chain snatched. Later on, the two plan how they are going to get Big Worm's money. By then, Rita (Yvette Wilson), a girl Debbie had set Smokey up with earlier on the phone, arrives. Smokey approaches her car with confidence until he finds out that she lied about her image; instead of resembling Janet Jackson like she said, she is fat and practically bald. Meanwhile, Craig attempts to borrow money from Dana, who doesn't give him the money but informs their father of Big Worm's threat. He then attempts to borrow money from his mother, but she doesn't feel comfortable with loaning him anything since he just lost his job the previous day.Angered that Debbie tricked him, Smokey heads to her house and confronts her, before noticing Red's bike on the lawn, and inquiring on why Deebo is there, to which Debbie informs that he's asleep with Felisha. Smokey - upon seeing an opportunity - sneaks into Felisha's room and tries to retrieve the money that he and Deebo stole from Stanley's house earlier, but he's interrupted by Ezal, who unintentionally wakes Deebo up, leaving both men having to escape empty-handed. Smokey enlists Craig's help to go back and try again, but at that moment, Deebo rides Red's bike past them. Smokey decides to give up as nothing seems to be going their way, but right before they can go back to their houses, Lil Chris tries to scare and taunt them, trying to speed away on his bike - he is unsuccessful and Smokey whips him with a belt, getting revenge for all the times he's knocked their trashcans over.The two notice a black car driving up slowly and they hide, suspecting a possible drive-by shooting. Scared, they settle back into Craig's room for an hour, trying to get in touch with Big Worm. As paranoia kicks in, Smokey makes one last attempt to contact the dealer, but is interrupted by Mr. Jones, as he was informed by Dana about the situation at hand - after he shoos them (Smokey in particular) out, they decide to go back outside to prove they are not scared. Once outside, they notice a van parked in the middle of the street with its headlights off - Big Worm's men, who start shooting at them.Quickly, the duo flees the scene hides in the bed of a truck to remain safe. Craig's parents and their neighbors come out of their houses after hearing the gunshots, with Dana being particularly worried, asking the neighbors the whereabouts of her brother and Smokey. Debbie then confronts Deebo for assaulting Felisha, after Deebo falsely accuses Felisha of Smokey's attempted theft. Deebo eventually assaults Debbie, as Craig and Smokey arrive.Angered that Deebo has assaulted Debbie, Craig stands up to him, and threatens him with his gun. Deebo scoffs at the threat, and Mr. Jones encourages Craig to put the gun down and fight with his hands. Shortly after, Craig and Deebo fight. After nearly losing, Craig wins by using various objects as weapons (such as a brick and a trash can) and knocks Deebo off. As Debbie tends to Craig, Smokey steals back the money he was robbed of earlier and flees the scene. Red punches Deebo to make sure he doesn't wake up, and retrieves his stolen chain and bicycle, while Ezal steals Deebo's shoes. Craig and Debbie agree to meet up the following day and Craig breaks up with Joi on the phone. Craig has seemingly overcome all of the day's tribulations, save for finding employment.Later that night, Smokey settles with Big Worm, who explains that he had to warn Smokey too many times about his money and that it was all about the principle of handling business. Smokey rebuffs, telling Big Worm to sell the weed himself the next time, as he announces that he is giving up drug dealing and going to rehabilitation. After hanging up, Smokey looks up, lights a joint, and closes the movie by breaking the fourth wall and telling the audience, \"I was just bullshittin'! And you know this, man!\""
}