{
    "id": "0476805",
    "localized title": "Malamaal Weekly",
    "cast": [
        "Paresh Rawal",
        "Om Puri",
        "Riteish Deshmukh",
        "Reema Sen",
        "Rajpal Naurang Yadav",
        "Sudha Chandran",
        "Govardhan Asrani",
        "Shakti Kapoor",
        "Arbaaz Khan",
        "Innocent",
        "Rasika Joshi",
        "Sona Nair",
        "Priyanshi",
        "Bineesh Kodiyeri",
        "Ravindranath",
        "Rakhi Sawant",
        "Paresh Bramhbhatt"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "137",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "India:UA",
        "New Zealand:PG",
        "Singapore:PG",
        "United Kingdom:PG"
    ],
    "original air date": "10 Mar 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTNlNjZkZTEtODM0Ni00MGNhLTlkODctMTZhNDlhODg3YTgyXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0476805",
    "plot outline": "Laholi is a small village in India whose inhabitants are poor, simple-minded, and are used to their lives being controlled by the dictatorial Landlord, Thakurain, and her brother, Baj Bahadur. Although Lilaram is the one with the highest educational qualifications, he is unable to secure any job. He decides to make a living selling lottery tickets, especially the Delhi-based Malamaal Weekly, but is barely able to make ends meet. Then one day he finds out that one of his lottery tickets is a winner. He concocts a scheme with his wife, which involves pawning her pet goat with the Thakurain, getting people together for a feast, so that he can get their tickets back - all in vain. Then he finds out that the only one who was absent was the town drunk, Anthony Fernandes. When he goes to Anthony's house he finds him dead, happily clutching his winning lottery ticket. When Lilaram tries to take the ticket from Anthony's hand, another villager, Balwant, happens to come by, both of them compromise and decide to share the one crore prize. They decide to toss the body in the river. Then Kanhaiya, who wants to marry Lilaram's daughter, Sukhmani, comes by, he overhears, and is also made a partner. Kanhaiya is asked to dispose off the body, which he does. The next day when Lilaram telephones the lottery office, he is told that Anthony had already phoned in his winning number. Lilaram, Kanhaiya, and Balwant rush to get Anthony's body back, which they find perched on a tree, as Kanhaiya had not done a good job. They take the body back and it is there that they are met by Anthony's estranged sister, Mary, who also knew about the winning ticket. After a few clarifications, Mary, her husband, and her child are also made partners. Then the sky literally falls on them when they find several village businessmen, to whom Anthony owed money, assembled in front of the house to collect their dues. They too are inducted as partners and then begins the trial of convincing the Lottery Inspector, Jayesh Agarwal, that Anthony is alive. Watch hilarious chaos unfold when Baj Bahadur, who also wants to marry Sukhmani, finds out about the winning lottery ticket.",
    "languages": "Hindi",
    "title": "Malamaal Weekly",
    "kind": "movie",
    "directors": "Priyadarshan",
    "writers": [
        "Manisha Korde",
        "",
        "Priyadarshan",
        "",
        "Priyadarshan",
        "",
        "Chandu Shah"
    ],
    "producers": [
        "Suresh Balaje",
        "George Pius",
        "Mahesh Ramanathan",
        "Darshan Rohira",
        "Shailendra Singh",
        "Chhitra Subramaniam"
    ],
    "composers": "Uttank Vora",
    "cinematographers": "Sameer Arya",
    "editors": [
        "N. Gopalakrishnan",
        "Arun Kumar"
    ],
    "art directors": "Sabu Cyril",
    "production managers": [
        "Sumith Kumar",
        "Manivarma"
    ],
    "assistant directors": "Suraj Sadanah",
    "art department": "Sreeroop Menon",
    "sound department": "Rajakrishnan M.R.",
    "visual effects": [
        "Bejoy Arputharaj",
        "Thirumurugan Krishnan",
        "Caarthick Raju",
        "Stalin Saravanan",
        "Andrew Shibi"
    ],
    "camera department": "Vineet Malhotra",
    "music department": [
        "Javed Ali",
        "Nawab Arzoo",
        "Sai Barve",
        "Shreya Ghoshal",
        "Mahalakshmi Iyer",
        "Nitin Raikwar",
        "Vaishali Samant",
        "Karsan Sargathiya",
        "Abhijit Vaghani",
        "Chhaya Vora"
    ],
    "miscellaneous": [
        "Sameer Chopra",
        "Abu Kumar Jain",
        "Chhitra Subramaniam",
        "Pony Verma",
        "Lalji Wagh",
        "Tiku Talsania"
    ],
    "akas": [
        "Der Hauptgewinn (Germany)",
        "Der Hauptgewinn (Austria)",
        "Счастливый случай (Russia)"
    ],
    "writer": [
        "Manisha Korde",
        "Priyadarshan",
        "Priyadarshan"
    ],
    "director": "Priyadarshan",
    "production companies": [
        "Percept Picture Company",
        "Sahara One Motion Pictures"
    ],
    "distributors": "Crystal Distributor",
    "special effects": "Land Marvel Animation Studios",
    "other companies": [
        "IndiaFM.com",
        "Super Cassettes Industries Limited (T-Series)"
    ],
    "plot": [
        "Lilaram sells lottery tickets and one customer has hit the jackpot but dies of shock upon finding out that he has won. Now, Lilaram wants all the money, and so does everyone around him.",
        "Laholi is a small village in India whose inhabitants are poor, simple-minded, and are used to their lives being controlled by the dictatorial Landlord, Thakurain, and her brother, Baj Bahadur. Although Lilaram is the one with the highest educational qualifications, he is unable to secure any job. He decides to make a living selling lottery tickets, especially the Delhi-based _Malamaal Weekly_ (qv), but is barely able to make ends meet. Then one day he finds out that one of his lottery tickets is a winner. He concocts a scheme with his wife, which involves pawning her pet goat with the Thakurain, getting people together for a feast, so that he can get their tickets back - all in vain. Then he finds out that the only one who was absent was the town drunk, Anthony Fernandes. When he goes to Anthony's house he finds him dead, happily clutching his winning lottery ticket. When Lilaram tries to take the ticket from Anthony's hand, another villager, Balwant, happens to come by, both of them compromise and decide to share the one crore prize. They decide to toss the body in the river. Then Kanhaiya, who wants to marry Lilaram's daughter, Sukhmani, comes by, he overhears, and is also made a partner. Kanhaiya is asked to dispose off the body, which he does. The next day when Lilaram telephones the lottery office, he is told that Anthony had already phoned in his winning number. Lilaram, Kanhaiya, and Balwant rush to get Anthony's body back, which they find perched on a tree, as Kanhaiya had not done a good job. They take the body back and it is there that they are met by Anthony's estranged sister, Mary, who also knew about the winning ticket. After a few clarifications, Mary, her husband, and her child are also made partners. Then the sky literally falls on them when they find several village businessmen, to whom Anthony owed money, assembled in front of the house to collect their dues. They too are inducted as partners and then begins the trial of convincing the Lottery Inspector, Jayesh Agarwal, that Anthony is alive. Watch hilarious chaos unfold when Baj Bahadur, who also wants to marry Sukhmani, finds out about the winning lottery ticket.::rAjOo (gunwanti@hotmail.com)"
    ]
}