{
    "id": "1941638",
    "localized title": "Sadda Adda",
    "cast": [
        "Karan Sharma",
        "Karanvir Sharma",
        "Shaurya Chauhan",
        "Bhaumik Sampat",
        "Kadambari Jethwani",
        "Rohin Robert",
        "Kunal Pant",
        "Parimal Aloke",
        "RaghuMinati",
        "Maryam Zakaria"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(35 mm version)",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:UA::(recommended rating)",
        "Singapore:PG",
        "United Kingdom:15::(trailer)",
        "United States:Not Rated"
    ],
    "original air date": "13 Jan 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTVlZGI3ODUtZWFhYy00N2QxLTg4OGItODgyMTk4MWFmZDRhXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1941638",
    "plot outline": "'The only thing that will stop you from fulfilling your dreams is you\" People have dreams, but not all of us have the guts to put faith in ourselves. Most of us lose focus and give up. We are most afraid to believe in our own dreams. Those who do are the true winners. This slice of life film is set in the backdrop of our capital city- Delhi. A city that brings in thousands of North Indians in search of opportunities that was never available in their own home towns. Like-wise, six boys from different states come together to share a two BHK apartment in a middle-class colony, which they lovingly call \"Sadda Adda\". This film is their story. It is about how six bachelors, with completely different backgrounds and personalities, live together. Their apartment \"Sadda Adda\" is a complete mess with empty beer bottles, cigarette butts, unwashed clothes, mattresses tossed all over the floor etc - yet together they cook food, clean, buy groceries, pay rent, laugh, cry, fight over insignificant issues and always stand up for each other - like a family. \"Sadda Adda\" which began as a transitional accommodation to help them work towards their dreams, becomes their home. The film takes us through a journey of their camaraderie and self-belief. The interwoven stories of these 6 characters takes us through a heart warming journey of the lives of these boys. This movie is about real characters from life who have fun, who fight the wave everyday and through very light heart moments inspire us in the most modest way. The crests and troughs that shape them into the men they will become in the future - because Boys will not always be boys.",
    "languages": "Hindi",
    "title": "Sadda Adda",
    "kind": "movie",
    "directors": "Muazzam Beg",
    "writers": "Muazzam Beg",
    "producers": [
        "Rajeev R. Agarwal",
        "Ramesh Agarwal",
        "Tarun R. Agarwal",
        "Bantoo Khanna",
        "Sahil Phull",
        "Ankur B. Saraiya",
        "Mukesh Udeshi"
    ],
    "cinematographers": "Harvey Glen",
    "editors": [
        "Sandeep Singh Bajeli",
        "Vatsa"
    ],
    "art directors": "Varunn Kumaar",
    "costume designers": "Kashmira Gaonkar",
    "production managers": [
        "Subhash Chavan",
        "Sachin Vaish"
    ],
    "assistant directors": [
        "Sarfraz Alvi",
        "Shahid Kabeer",
        "Raakesh Pandit",
        "Sahil Phull"
    ],
    "sound department": [
        "Shahaab Alam",
        "Nabiullah Khan"
    ],
    "stunts": "Manohar Verma",
    "camera department": "Dipak Nayak",
    "miscellaneous": [
        "Milind Dabke",
        "Avi Udeshi"
    ],
    "writer": "Muazzam Beg",
    "director": "Muazzam Beg",
    "production companies": [
        "Rajtaru Studios",
        "Rajtaru Video Sonic"
    ],
    "special effects": "Rajtaru Video Sonic",
    "other companies": "MoviezAdda",
    "plot": "'The only thing that will stop you from fulfilling your dreams is you\" People have dreams, but not all of us have the guts to put faith in ourselves. Most of us lose focus and give up. We are most afraid to believe in our own dreams. Those who do are the true winners. This slice of life film is set in the backdrop of our capital city- Delhi. A city that brings in thousands of North Indians in search of opportunities that was never available in their own home towns. Like-wise, six boys from different states come together to share a two BHK apartment in a middle-class colony, which they lovingly call \"_Sadda Adda_ (qv)\". This film is their story. It is about how six bachelors, with completely different backgrounds and personalities, live together. Their apartment \"_Sadda Adda_ (qv)\" is a complete mess with empty beer bottles, cigarette butts, unwashed clothes, mattresses tossed all over the floor etc - yet together they cook food, clean, buy groceries, pay rent, laugh, cry, fight over insignificant issues and always stand up for each other - like a family. \"_Sadda Adda_ (qv)\" which began as a transitional accommodation to help them work towards their dreams, becomes their home. The film takes us through a journey of their camaraderie and self-belief. The interwoven stories of these 6 characters takes us through a heart warming journey of the lives of these boys. This movie is about real characters from life who have fun, who fight the wave everyday and through very light heart moments inspire us in the most modest way. The crests and troughs that shape them into the men they will become in the future - because Boys will not always be boys.::Muazzem Beg"
}