{
    "id": "1954470",
    "localized title": "Gangs of Wasseypur",
    "cast": [
        "Manoj Bajpayee",
        "Richa Chadha",
        "Nawazuddin Siddiqui",
        "Tigmanshu Dhulia",
        "Jameel Khan",
        "Piyush Mishra",
        "Jaideep Ahlawat",
        "Huma Qureshi",
        "Zeishan Quadri",
        "Vipin Sharma",
        "Satyakam Anand",
        "Aditya Kumar",
        "Rajkummar Rao",
        "Vineet Kumar Singh",
        "Sankalp Acharekar",
        "Aditya",
        "Akshat",
        "Hasrat Ali",
        "Mohammed Azam Ansari",
        "Vasan Bala",
        "Mahesh Balraj",
        "Rajat Bhagat",
        "Vidya Bhushan",
        "Bobby",
        "Niranjan Chaubey",
        "Mukesh Chhabra",
        "Tarzan Dada",
        "Sujata Das",
        "Dulaari Devi",
        "Shreedhar Dubey",
        "Karuna Dutt",
        "Upal Dutta",
        "Vivek Ghamande",
        "Amitabh Kishen Ghanekar",
        "Hemangini Ghanekar",
        "Neeraj Ghaywan",
        "Radhe Shyam Giri",
        "Guddu",
        "Siddharth Gupt",
        "Naman Jain",
        "Anurita Jha",
        "Lali Ji",
        "Chandan Kaif",
        "Sameer Kamble",
        "Omprakash Kashyap",
        "Vicky Kaushal",
        "Zafar Khan",
        "Harish Khanna",
        "Aditya Kumar",
        "Amit Kumar",
        "Murari Kumar",
        "Sumit Kumar",
        "Vishnu Kumar",
        "Vishnu Kunwar",
        "Ram Lakhan",
        "Mahesh",
        "Faisal Malik",
        "Ashtabhuja Mishra",
        "Sudhanshu Mishra",
        "Vinay Mishra",
        "Pranay Narayan",
        "Bhola Nath",
        "Kaushal Nigel",
        "Balram Pandey",
        "Ila Pandey",
        "Pramod Pathak",
        "Suman Pathak",
        "Sankata Prasad",
        "Syed Zeeshan Qadri",
        "Tilak Raj",
        "Vijesh Rajan",
        "Amritraj Rana",
        "Ravi",
        "Khan Saab",
        "Veena Sahay",
        "Reema Sen",
        "Ashfaque Shaikh",
        "Salim M. Shaikh",
        "Amit Sharma",
        "Gaurav Sharma",
        "Gaurav Sharma",
        "Rajesh Kumar Sharma",
        "Shlok Sharma",
        "Tez Bahadur Sharma",
        "Yashpal Sharma",
        "Zahir Sheikh",
        "Suhas Shirsat",
        "Shivam",
        "Shubham",
        "Vijay Shukla",
        "Janmajaya Singh",
        "Nitin Raj Singh",
        "Nityanand Singh",
        "Pawan Singh",
        "Ram Raksha Singh",
        "Sanjay Singh",
        "Santosh Singh",
        "Vivek Singh",
        "Akash Sinha",
        "Varun Sinha",
        "Suhas Sirsat",
        "Praveen Sisodia",
        "Pravin Singh Sisodia",
        "Amreesh Srivastava",
        "Anup Srivastava",
        "Shilpa Srivastava",
        "Mamta Tiwari",
        "Prerna Tiwari",
        "Rajnikant Trigul",
        "Heramba Shankar Tripathi",
        "Pankaj Tripathi",
        "Rati Shankar Tripathi",
        "Vijay Tripathi",
        "Utkarsh",
        "Sanjeeva Vats",
        "Sagar Verma",
        "Jack Wayne",
        "Luv Yadav",
        "Rambhu Yadav",
        "Rashmi Yadav",
        "Tripurari Yadav",
        "Kiran Yaday",
        "Rohit Pandey",
        "Sanjeeva Vatsa"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "321",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "Dolby Digital EX",
        "Datasat"
    ],
    "certificates": [
        "Australia:MA15+",
        "Brazil:18",
        "Canada:14A::(Alberta)",
        "Canada:13+::(Quebec)",
        "Canada:14A::(second part)",
        "France:Tous publics avec avertissement::(first part)",
        "France:12::(second part)",
        "Germany:16::(Blu-ray rating)",
        "Germany:16::(first part)",
        "Germany:18::(second part)",
        "India:A::(first part)",
        "India:A::(second part)",
        "Netherlands:16",
        "Singapore:M18",
        "Spain:16::(ICAA)",
        "Sweden:15",
        "Switzerland:16",
        "United Kingdom:18",
        "United Kingdom:15::(Part 1)",
        "United Kingdom:18::(Part 2)",
        "United States:Not Rated"
    ],
    "original air date": "22 Jun 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTc5NjY4MjUwNF5BMl5BanBnXkFtZTgwODM3NzM5MzE@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "1954470",
    "plot outline": "Shahid Khan is exiled after impersonating the legendary Sultana Daku in order to rob British trains. Now outcast, Shahid becomes a worker at Ramadhir Singh's colliery, only to spur a revenge battle that passes on to generations. At the turn of the decade, Shahid's son, the philandering Sardar Khan vows to get his father's honor back, becoming the most feared man of Wasseypur.",
    "languages": "Hindi",
    "title": "Gangs of Wasseypur",
    "kind": "movie",
    "directors": "Anurag Kashyap",
    "writers": [
        "Akhilesh Jaiswal",
        "",
        "Anurag Kashyap",
        "",
        "Sachin K. Ladia",
        "",
        "Zeishan Quadri"
    ],
    "producers": [
        "Apoorva Bakshi",
        "Rakesh Bhagwani",
        "Sunil Bohra",
        "Prasanth Kumar Chandran",
        "Jyoti Kapur Das",
        "Maitreyee Dasgupta",
        "Shivaji Dasgupta",
        "Anurag Kashyap",
        "Vikram Malhotra",
        "Guneet Monga",
        "Ajay Rai",
        "Meraj Shaikh",
        "Adi Shankar",
        "Shubh Shivdasani"
    ],
    "composers": [
        "Sneha Khanwalkar",
        "G.V. Prakash Kumar"
    ],
    "cinematographers": "Rajeev Ravi",
    "editors": "Shweta Venkat",
    "editorial department": [
        "Nitin Baid",
        "Kunjan Oza",
        "Parag Sankhe",
        "Vikas Sharma",
        "Ganapathy Subramanian",
        "Jespal Nadar"
    ],
    "casting directors": "Mukesh Chhabra",
    "production designers": "Wasiq Khan",
    "costume designers": "Subodh Srivastava",
    "make up department": [
        "Shrikant Desai",
        "Zuby Johal",
        "Rajiv Subba"
    ],
    "production managers": [
        "Sankalp Acharekar",
        "Sachin Agarwal",
        "Omshankar Bhagat",
        "Rahul Jadhav",
        "Deep Singh Kakkad",
        "Rashid Ali Khan",
        "Rahul Rawat",
        "Salim M. Shaikh",
        "Sachin Vaish"
    ],
    "assistant directors": [
        "Karuna Dutt",
        "Neeraj Ghaywan",
        "Sameer Kamble",
        "Anubhuti Kashyap",
        "Vicky Kaushal",
        "Jai Mehta",
        "Rohit Pandey",
        "Shivansu Sachan",
        "Shlok Sharma",
        "Shilpa Srivastava",
        "Prerna Tewari"
    ],
    "art department": [
        "Saikat Bose",
        "Laxmi Keluskar",
        "Liyakat Ali Khan",
        "Tariq Umar Khan"
    ],
    "sound department": [
        "Shantanu Akerkar",
        "Sayed Aslam",
        "Zahir Bandukwala",
        "Joy Banerjee",
        "Prapul Betapudi",
        "Mishaal Chinai",
        "Sajjan Choudhary",
        "Alok De",
        "Sinoy Joseph",
        "Boney M. Joy",
        "Abhijeet V. Sapre",
        "Kunal Sharma",
        "Shrihari",
        "Karnail Singh",
        "Sreejesh",
        "Varun Visoi",
        "Keshav Waghe",
        "Maitreya Shah"
    ],
    "special effects": "Gagan Vishwakarma",
    "visual effects": [
        "Avnish",
        "Mahendra Golay",
        "Mahendra Goley",
        "Prakash Joseph",
        "Rajiv Joseph",
        "Santosh Kale",
        "Antony Prabhu",
        "Vijesh Rajan",
        "Punit S. Upadhyaya",
        "Dhanendra Sahu",
        "Balakrishna P. Subaiah",
        "Jayadev Tiruveaipati"
    ],
    "stunts": "Sham Kaushal",
    "camera department": [
        "Dharmendra Bhurji",
        "Vinod Ellampally",
        "Ketan Mehta",
        "Soumyajit Nandy"
    ],
    "casting department": [
        "Aakash Dahiya",
        "Jai Mehta",
        "Pawan Singh",
        "Kumar Vijay Sippy",
        "Prasad Thakur"
    ],
    "location management": [
        "Jayesh Anand",
        "Navmeet Singh"
    ],
    "music department": [
        "Rahat Fateh Ali Khan",
        "Wajid Ali",
        "Mohammed Aziz",
        "Usri Banerjee",
        "Sanjay Chandrasekhar",
        "Sunidhi Chauhan",
        "Durga",
        "Shreya Ghoshal",
        "Varun Grover",
        "Rekha Jha",
        "Sneha Khanwalkar",
        "Deepak Kumar",
        "Piyush Mishra",
        "Sonu Nigam",
        "Ranjeet Baal Party",
        "Khushboo Raaj",
        "Rajneesh",
        "Shaan",
        "Shyamoo",
        "Bhupesh Singh",
        "Mika Singh",
        "Vivek Singh",
        "Shraddha Sinha",
        "Vedesh Sookoo",
        "Sujeet",
        "Manish J. Tipu",
        "Manoj Tiwari",
        "Amit Trivedi",
        "Gaurav Vaswani",
        "Akshay Verma"
    ],
    "transportation department": "Simon Rebis",
    "miscellaneous": [
        "Apoorva Bakshi",
        "Mithun D'Souza",
        "Avishek Ghosh",
        "Neo Juris Gitika Aggarwal",
        "Anku Pande",
        "Siddharth Pande",
        "Harsh Parmar",
        "Swapnil Rane",
        "Tripur Singh",
        "Vivek Tiwari"
    ],
    "thanks": "Harish Khanna",
    "akas": [
        "G.O.W. (World-wide, English title)",
        "Asian Godfather - Die Gangs von Wasseypur I + II (Germany)",
        "Asian Godfather - Die Gangs von Wasseypur (Germany)",
        "瓦塞浦黑帮(上) (China, Mandarin title)",
        "Gangs of Wasseypur: Part 1 (Sweden)"
    ],
    "writer": [
        "Akhilesh Jaiswal",
        "Anurag Kashyap",
        "Sachin K. Ladia"
    ],
    "director": "Anurag Kashyap",
    "production companies": [
        "Jar Pictures",
        "AKFPL",
        "Bohra Bros Productions",
        "Tipping Point Films",
        "Viacom18 Motion Pictures"
    ],
    "distributors": [
        "Happiness Distribution",
        "Imagine Films Distribution",
        "MVP Entertainment",
        "Mara Pictures",
        "Spot On Distribution",
        "Cinelicious Pics",
        "Cinelicious Pics",
        "Filmfreak Distributie",
        "Polyband"
    ],
    "other companies": [
        "BHURJI GRIPS",
        "Pentacle Creationz",
        "Spice PR",
        "Toronto International Film Festival"
    ],
    "plot": [
        "A clash between Sultan and Shahid Khan leads to the expulsion of Khan from Wasseypur, and ignites a deadly blood feud spanning three generations.",
        "Shahid Khan is exiled after impersonating the legendary Sultana Daku in order to rob British trains. Now outcast, Shahid becomes a worker at Ramadhir Singh's colliery, only to spur a revenge battle that passes on to generations. At the turn of the decade, Shahid's son, the philandering Sardar Khan vows to get his father's honor back, becoming the most feared man of Wasseypur.::anonymous",
        "Inspired by the real-life exploits of local gangs and beginning with the bandit-like career of Shahid Khan in the 1940s, the film follows the ruthless rise of his son Sardar and his offspring, Danish, Perpendicular and Definitive Khans. GANGS OF WASSEYPUR mirrors the tumultuous and explosive growth of modern India with ferocious cinematic intensity.The least likely of Sardar's children - the perpetually stoned Faizal who rises to the top ranks of the Khan crime family, vowing brutal revenge on their longtime nemesis, the wily and seemingly unstoppable Ramadhir Singh.::Bb",
        "In the town of Wasseypur, a town in Bengal in the 1940s controlled by a family known as the Qureshi's a man named Shahid Khan begins robbing trains using the name of the Qureshi's famed ancestor,Sultana,after being forced to leave the village by the Qureshi leader he goes to the nearby city of Dhanbad and after a series of events becomes an enforcer for a powerful Coal owner named Ramadhir Singh,who upon discovering a plot by Shahid to kill him has him assasinated ,his son ,Sardar and his brother-in-law, Nasir manage to escape and Sardar finding out about his father's fate,Sardar swears revenge and as he returns to Wasseypur to take revenge he reignites a battle with the ruthless Sultan Qureshi leading to a generation spanning battle between the gangs of Wasseypur.::RRR"
    ],
    "synopsis": "Prologue\nIn January 2004 , a gang of heavily armed men scour and finally narrow down on a house in Wasseypur. They surround the house and unleash a wave of bullets and grenades on it with the intention of killing the family inside it. After heavy firing on the house, they retreat from the crime scene in a vehicle, convinced they have killed everyone within. The leader of the gang then calls J.P. Singh on his cell phone and reports that the family has been successfully executed but he is double crossed by JP Singh as a fire fight erupts between them and a police check post blocking their escape route. The scene cuts abruptly for a prologue by the narrator, Nasir. The whole scene is then revealed in the sequel.Introduction of Wasseypur and Dhanbad\nNasir's narration describes the history and nature of Wasseypur. During the British Raj, Wasseypur and Dhanbad were located in the Bengal region. After India gained its independence in 1947, they were carved out of Bengal and redistricted into the state of Bihar in 1956. In 2000, Wasseypur and Dhanbad were redistricted for a second time into the newly formed state of Jharkhand where they remain. The village has been historically dominated by the Qureshi Muslims, a sub-caste of animal butchers who are feared by the non-Qureshi Muslims living there and Dhanbad by extension.During British colonial rule, the British had seized the farm lands of Dhanbad for coal which began the business of coal mining in Dhanbad. The region was a hotbed of the local faceless dacoit Sultana Qureshi who robbed British trains in the night and thus held some patriotic value for the locals.1940s\nIn 1941 , Shahid Khan (Jaideep Ahlawat), a Pathan, takes advantage of the mysteriousness of the faceless dacoit Sultana, a Qureshi, by impersonating his identity to rob British ferry trains. The Qureshi clans eventually find out and order the banishment of Shahid Khan and his family from Wasseypur. They settle down in Dhanbad where Shahid begins work as a labourer in a coal mine. He is unable to be at his wife's side during childbirth, and she dies. The enraged Shahid kills the coal mine's muscleman who had denied him leave on that day. In 1947, independent India begins to assert its authority over itself. The British coal mines are sold to Indian industrialists and Ramadhir Singh (Tigmanshu Dhulia) receives a few coal mines in the Dhanbad region. He hires Shahid Khan as the new muscleman of one of the coal mines. Shahid terrorises the local population to seize their lands and extract compliance.On a rainy day, Ramadhir Singh overhears Shahid's ambitions of taking over the coal mines from him. Singh tricks Shahid into traveling to Varanasi for business but instead has him murdered by an assassin named Yadav Ji (Harish Khanna). Nasir (Piyush Mishra), Shahid's cousin, finds Ramadhir's umbrella with his initials near the door and concludes that Ramadhir eavesdropped on their conversation. He flees from the house with Shahid's son Sardar in the nick of time as Ehsaan Qureshi (Vipin Sharma), another associate of Ramadhir Singh and a member of the Wasseypur Qureshi clan, shows up to kill them but is too late. An unsuccessful Ehsaan lies to Singh that Shahid's family has been murdered, burnt, and buried. Under the care of Nasir, Sardar grows up along with Nasir's nephew Asgar (Jameel Khan). Sardar learns the truth about his father's death, upon which he shaves his head and vows not to grow his hair until he has avenged his father's murder.Early and Mid 1970s\nIn 1972 , the coal mines are nationalised. A mature Sardar Khan (Manoj Bajpai) and his kin start hijacking Ramadhir's coal trucks mid-transit. Ramadhir Singh suspects S.P. Sinha, a Coal India official, to be behind the hijackings and has him murdered. After Sinha's murder, Ramadhir's reputation for ruthlessness grows, and he becomes feared in Dhanbad.Sardar marries Nagma Khatoon (Richa Chadda). The pregnant Khatoon confronts Sardar Khan and a prostitute inside a brothel and chases him away. Later, Nagma gives birth to Danish Khan but gets pregnant immediately afterwards. Unable to have sex with a pregnant Nagma, Sardar confesses his sexual frustrations with his kin. At dinner, Nagma gives her consent to Sardar to sleep with other women but with the condition that he won't bring them home or dishonour the family name.Sardar, Asgar and Nasir start working for J.P. Singh (Satya Anand), Ramadhir Singh's son. They misuse their employment by secretly selling the company petrol in the black market. Later, they rob a petrol pump and a train bogey belonging to the Singh family. They usurp Singh's land, which forces the two families to confront each other for talks. The meeting ends in a scuffle, but Ramadhir Singh realizes that Sardar Khan is in fact the son of Shahid Khan who he had murdered in the late 1940s. Sardar and Asgar are jailed for assaulting J.P. Singh during the meeting.Early 1980s\nIn 1979 , Sardar and Asgar escape from jail. While hiding in Wasseypur, Sardar marries a Bengali Hindu woman named Durga (Reema Sen). Asgar informs Nagma that Sardar has taken a second wife, leaving Nagma helpless. Meanwhile, Wasseypur has merged with Dhanbad and the Qureshi clan continues to terrorise the non-Qureshi Muslims. The locals then approach Sardar Khan for help as he was well known for standing up to Ramadhir Singh. During Muharram, both Shias and Sunnis are out mourning, including the Qureshi clan. Sardar uses the opportunity to launch a major bomb attack on many Qureshi shops and houses. When word spreads about Sardar's raids, his reputation grows and he commands more fear than the Qureshi clan.Eventually, Sardar returns home to Nagma and she gets pregnant again. Sardar tries to initiate sex with a pregnant Nagma but she refuses, which prompts an angry Sardar to leave. He goes to stay with his second wife, Durga, and she gives birth to his son, Definite. Ramadhir Singh, noticing that Sardar has abandoned his first family, tries to reach out to Nagma through Danish by giving him money. An enraged Nagma beats Danish for taking the money while she breaks down in front of Nasir. A thirsty Faizal wakes up in the middle of the night to find Nagma and Nasir about to have sex. Angry, he storms out of the house and becomes a stoner, permanently seen with his chillum. Nasir reveals that the desires were never consummated, but Faizal and Nasir never see eye to eye again.Mid and Late 1980s\nSensing Sardar's increasing clout, Ramadhir calls his old associate Ehsaan Qureshi who brokers a meeting between Sultan Qureshi(Pankaj Tripathi), his nephew and Ramadhir Singh where the two decide to become allies against their common enemy, Sardar. Sultan asks Ramadhir for modern automatic weapons which the latter promises to give.1990s\nSardar becomes the most feared man in Wasseypur and shifts his business to stealing iron ore. Danish Khan (Vineet Kumar Singh) joins the family business. A failed attack from Sultan Qureshi leaves Danish with a minor injury and causes reconciliation between Sardar and Nagma. Sardar finds Ramadhir and warns him of terrible consequences if anything ever happens to his family.A mature Faizal (Nawazuddin Siddiqui) is seriously affected by Bollywood movies as he starts behaving, talking and dressing like Bollywood characters. Sardar sends Faizal to Varanasi to buy guns, but Faizal is caught by the police and jailed. Upon release, he kills the gun seller Yadav, who unbeknownst to Faizal was the nameless assassin who had killed Shahid Khan (Faizal's grandfather) and who had implicated Faizal to police earlier. Meanwhile, Sardar seizes a lake belonging to a local temple and charges commission on fish sellers who make a catch in that lake. An uneasy peace is maintained between the Qureshi and Khan families when Danish Khan marries Shama Parveen, the sister of Sultan Qureshi. At the same time, Faizal begins romancing Mohsina Hamid (Huma Qureshi), another kin of Sultan.Epilogue\nFaizal reveals to his friend, Faizlu that his father Sardar would be travelling without security the next day. Unbeknownst to Faizal, Faizlu is actually an ally of Sultan. Late that night, while Faizal is still asleep, Faizlu calls up the Qureshis and tells them that Sardar's bodyguards wouldn't be with him the next day. The next morning, Sardar leaves home alone and reaches Durga's house where he gives her her expense allowance. Once Sardar leaves, Durga also calls up the Qureshis and tells them that he has just left her house. The Qureshi men follow Sardar's car, and when the latter stops at a petrol pump to refuel they start shooting as Sardar ducks in the car for cover. The Qureshi men put several close rounds through the car window ensuring a precise and unmistakable hit, after which they escape. A shocked Sardar opens the car door and stands up to reveal multiple bullet wounds, with one bullet embedded in his head. He steps out with his gun drawn to stop a cycle ferry on which he eventually collapses to his death."
}