{
    "id": "2077833",
    "localized title": "Rowdy Rathore",
    "cast": [
        "Akshay Kumar",
        "Sonakshi Sinha",
        "Nassar",
        "Yashpal Sharma",
        "Paresh Ganatra",
        "Gurdeep Kohli",
        "Mushtaq Khan",
        "Amit Tiwari",
        "Supreeth Reddy",
        "Ashok Samarth",
        "Anant Jog",
        "Ananya",
        "Raj Arjun",
        "Darshan Jariwala",
        "Kareena Kapoor",
        "Naushaad Abbas",
        "Saniya Anklesaria",
        "Swatantra Bharat",
        "Bhupindder Bhoopii",
        "Ragini Dev",
        "Prabhu Deva",
        "Helena Fonseca",
        "Jayant Gadekar",
        "Pradeep Kabra",
        "Mumait Khan",
        "Meenakshi",
        "Shakti Mohan",
        "Meet Mukhi",
        "Shivansu Sachan",
        "Shireesh Sharma",
        "Jayshankar Tripathi",
        "Joseph Vijay",
        "Maryam Zakaria"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Crime"
    ],
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Stereo",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "Canada:14A::(Manitoba)",
        "Canada:13+::(Quebec)",
        "Hong Kong:IIB",
        "India:UA",
        "Ireland:15A",
        "Netherlands:16",
        "New Zealand:R16",
        "Norway:15::(cinema rating)",
        "Philippines:18+::(self-applied)",
        "Singapore:NC16",
        "South Africa:16",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "01 Jun 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODkwODAzOTA3MV5BMl5BanBnXkFtZTcwMjc4NjI2Nw@@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "2077833",
    "plot outline": "Shiva (Akshay Kumar) is a small time conman in love with Paro (Sonakshi Sinha), a pretty girl whom he met at a wedding he wasn't invited to. Into this picture perfect world enters six year old Chinki who inexplicably believes Shiva to be her dad! And if this wasn't bad enough, Shiva also becomes the object of a series of life threatening attacks by a gang of deadly criminals who seem to know something he doesn't. While trying desperately to save his life and love, Shiva stumbles upon a deadly secret. A secret that will take him to a small town in Bihar; a town terrorized by a ruthless politician and the mafia he controls; a town whose inhabitants only hope for redemption is ... Shiva!",
    "languages": "Hindi",
    "title": "Rowdy Rathore",
    "kind": "movie",
    "directors": "Prabhu Deva",
    "writers": [
        "Vijayendra Prasad",
        "",
        "Shiraz Ahmed",
        "",
        "Shiraz Ahmed"
    ],
    "producers": [
        "Sanjay Leela Bhansali",
        "Ishaan Dutta",
        "Vijay Kadechkar",
        "Siddharth Roy Kapur",
        "Shabinaa Khan",
        "Manan Sampat",
        "Ronnie Screwvala",
        "Yogiraj Shetty",
        "Sandeep Singh",
        "Namrata Sinha",
        "Ashish Tandel",
        "Ravinder Thakur"
    ],
    "composers": [
        "Sajid Ali",
        "Wajid Ali"
    ],
    "cinematographers": "Santhosh Thundiyil",
    "editors": [
        "Sanjay Sankla",
        "Anurag Singh"
    ],
    "editorial department": [
        "Saddique Iqbal",
        "Rohit Karkera",
        "Debakriti Kundu",
        "Nitin Minz",
        "Mayuresh Sawant",
        "Ganesh Shinde",
        "Shekhar Singh"
    ],
    "casting directors": "Girdhar Swami",
    "production designers": "Wasiq Khan",
    "costume designers": [
        "Shabinaa Khan",
        "Neharika Singh"
    ],
    "make up department": "Ganesh Palav",
    "production managers": [
        "Preejith Balan",
        "Shiva Chandra",
        "Sanjay Inamdar",
        "Shah Naimish",
        "Manohar Ravindran",
        "Manan Sampat",
        "Shakti Sisodiya",
        "Rajiv Thakur",
        "Varun Uppunda"
    ],
    "assistant directors": [
        "Ranjit Govind",
        "Ali Khan",
        "Naresh Midha",
        "Gambhir Monica",
        "Harsh Raseen",
        "Sajid Shaikh",
        "Anuj Sharma",
        "Sonu Sinha",
        "Pranjal Srivastava",
        "Anand Tiwari",
        "Rohit Saini"
    ],
    "art department": [
        "Baban Adagale",
        "Sikander Ahmad",
        "Mrinal Das",
        "Musa Husain",
        "Laxmi Keluskar",
        "Tariq Umar Khan",
        "Boishali Sinha"
    ],
    "sound department": [
        "Sayed Aslam",
        "Santosh Gupta",
        "Parikshit Lalwani",
        "Kunal Mehta",
        "Sarath Mohan",
        "Rhitwik Raj Pathak",
        "Parinita Sharma",
        "Sreejesh",
        "Aravind Vijayakumar"
    ],
    "visual effects": [
        "Sajjad Fateh",
        "Pradeep Gownipuram",
        "Arun Kataria",
        "Abrez Mohammed",
        "Nadeem Mohd",
        "Vijayan Paulsami",
        "Rajiv Raghunathan",
        "Rajeev Rajasekharan",
        "Abdul Rasheed",
        "Shubham Singh Rathore",
        "Vijay Singh Rawat",
        "Teresa Sana",
        "Selvakumar",
        "Prashant Kumar Singh"
    ],
    "stunts": [
        "Anl Arasu",
        "Gn Murugan"
    ],
    "camera department": [
        "Raju Ahmed",
        "Krishna",
        "Santosh Kumar",
        "Lawrence",
        "B.K. Sivan",
        "Pudiyamuthu Sundaram",
        "Thillaikumarbala"
    ],
    "casting department": "Girdhar Swami",
    "location management": [
        "Manoj R. Dharmot",
        "Birendra Kumar Loadh"
    ],
    "music department": [
        "Javed Ali",
        "Sajid Ali",
        "Wajid Ali",
        "Faaiz Anwar",
        "Shreya Ghoshal",
        "Amaal Mallik",
        "Sameer",
        "Sarosh Sami",
        "Kumar Sanu",
        "Mamta Sharma",
        "Sandeep Shirodkar",
        "Mika Singh"
    ],
    "miscellaneous": [
        "Joe D'Souza",
        "Prabhu Deva",
        "Shikha Kapur",
        "Imran Hafiz Khan",
        "Rajesh Kumar",
        "Pankaj Mishra",
        "Prakash Nathan",
        "Sahil Sai",
        "Ajay Singh",
        "Raj Surani",
        "Vishnudeva"
    ],
    "thanks": "Rafi Kazi",
    "akas": [
        "Роди Ратор (Russia)",
        "Роді Ратор (Ukraine)"
    ],
    "writer": [
        "Vijayendra Prasad",
        "Shiraz Ahmed",
        "Shiraz Ahmed"
    ],
    "director": "Prabhu Deva",
    "production companies": [
        "Bhansali Productions",
        "UTV Motion Pictures"
    ],
    "distributors": [
        "Mind Blowing Films",
        "UTV Motion Pictures"
    ],
    "special effects": "Reliance Media Works VFX",
    "plot": [
        "A con man uncovers a deadly secret and must save his lady love, the small-town locals and the little girl who insists she's his daughter, from the mob.",
        "Shiva (Akshay Kumar) is a small time conman in love with Paro (Sonakshi Sinha), a pretty girl whom he met at a wedding he wasn't invited to. Into this picture perfect world enters six year old Chinki who inexplicably believes Shiva to be her dad! And if this wasn't bad enough, Shiva also becomes the object of a series of life threatening attacks by a gang of deadly criminals who seem to know something he doesn't. While trying desperately to save his life and love, Shiva stumbles upon a deadly secret. A secret that will take him to a small town in Bihar; a town terrorized by a ruthless politician and the mafia he controls; a town whose inhabitants only hope for redemption is ... Shiva!::Official site"
    ],
    "synopsis": "Shiva (Akshay Kumar) is a small-time thief in Mumbai who falls in love with Paro (Sonakshi Sinha) from Patna. He tells her the truth about being a thief and resolves to give up crime because he loves Paro dearly. Before that, he decides to commit a large robbery along with his con-friend 2G (Paresh Ganatra), which would enable him to earn a lot of money; hence he can give up crime. He \"tricks\" a woman on a railway station and flees with a trunk. This leads Shiva to Chinki, a little girl who was in the trunk instead of the wealth he thought was there. Chinki thinks that he is her father. Puzzled, he is forced to keep Chinki with him, as a police officer Vishal Sharma (Yashpal Sharma) keeps his eye on him.Shiva fears Paro will catch him with Chinki and he will lose her forever. He finds a photo of Chinki and her father, who looks exactly like Shiva, thus realizing why Chinki thinks Shiva is her father. It is revealed that Chinki's father is Vikram Rathore (Akshay Kumar), who is a brave cop, who criminals fear. While chasing a goon to find his daughter, Rathore gets hit by an auto and his brain endures severe trauma. The doctor tells him that the brain injury is serious enough to put his life in danger.After a few days, Shiva gets fed up with Chinki and breaks the tape recorder she uses to listen to her late mother's voice. The next morning, he learns that her mother died. Feeling guilty, he fixes the recorder and becomes fond of Chinki, taking care of her. Unfortunately, Paro sees this and believes he has a daughter that he hid from her and Paro leaves for Patna heartbroken. Soon, the goons who are after Rathore see Shiva. Thinking he is Rathore, they start chasing him. Shiva and Chinki flee for their lives and encounter the woman from the railway station and the police officer from earlier, who tell Shiva to run. Shiva is soon surrounded by the goons. It is revealed that Rathore is watching the whole thing from the top of a building. Just as Shiva is about to get stabbed, Rathore jumps down, killing one of goons.Shiva and the goons are shocked to see the identical-looking Rathore. Rathore locks Shiva and Chinki in a cell for safety, and starts fighting the goons. His brain injury gets worse but he eventually kills every goon by himself.At the hospital, Shiva realizes that the railway station woman is in fact a real police officer, Insp.Razia Khan (Gurdeep Kohli). The officers tell Shiva that the man who looks like him is ASP Vikram Rathore, a disciplined and respected police officer.The officers narrated the whole incident to Shiva. Six months ago, Rathore traveled to a village called Devgarh as the new ASP. There, a goon called Baapji (Nassar) and his son Munna trouble, torture and annex money from the villagers. Rathore immediately arrests Munna for raping Vishal Sharma's wife but he is released because of Baapji's political influence. Baapji arranges a party celebrating Munna's release. At the party, Munna humiliates the police officers and makes them pull their pants down. Rathore, being the next target, moves back to the balcony, where Munna falls by slipping bullet,which Rathore puts and gets hanged by the belt of a humiliated inspector. The next day, Rathore gets attacked by Baapji's brother Titla (Supreeth Reddy), where he is stabbed at the back while the people were celebrating Munna's death and shot in the head while trying to save a village child. He is then assumed to be dead. While the police officers are getting ready to bury him, he starts breathing, having survived. Everybody promises not to disclose this to anyone. The officers then took Rathore to Mumbai for treatment. After Shiva hears the whole story, the doctors say that Rathore doesn't have much time left. Rathore requests Shiva to take care of his daughter. Shiva promises and says that Chinki is now his daughter. Rathore dies holding Shiva's hand.Shiva vows to complete Rathore's unfinished work. He takes on Rathore's identity and goes to Devgarh with Chinki to take revenge. He sets Baapji's liquor factory on fire and distributes the grains and money back to the villagers. Paro finds out the truth, and that Shiva will now always be Vikram Rathore. She apologizes to him and vows that she will also take care of Chinki. In a heavy climax, Shiva eventually kills Baapji and Titla. The people of Devgarh are now safe. Shiva marries Paro and starts his new life as a police officer with her, Chinki, Razia, Vishal, and 2G."
}