{
    "id": "2172071",
    "localized title": "Student of the Year",
    "cast": [
        "Alia Bhatt",
        "Sidharth Malhotra",
        "Varun Dhawan",
        "Rishi Kapoor",
        "Sana Saeed",
        "Sahil Anand",
        "Manasi Rachh",
        "Kayoze Irani",
        "Manjot Singh",
        "Ronit Roy",
        "Prachi Shah",
        "Ram Kapoor",
        "Gautami Kapoor",
        "Farida Jalal",
        "Akshay Anand",
        "Manini Mishra",
        "Nandini Sen",
        "Boman Irani",
        "Abdul Quadir Amin",
        "Rohan Gokhale",
        "Kunal Gupta",
        "Hrasif",
        "Brent Lovell",
        "Liam Stewart",
        "Kitu Gidwani",
        "Sushma Seth",
        "Farah Khan",
        "Vaibhavi Merchant",
        "Kajol",
        "Sara Latif"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Music",
        "Romance",
        "Sport"
    ],
    "runtimes": "146",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:PG",
        "Belgium:KT/EA",
        "Canada:PG::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:G::(Quebec)",
        "Hong Kong:IIA",
        "India:UA",
        "Ireland:12A",
        "Japan:G",
        "Malaysia:P13",
        "Netherlands:6",
        "New Zealand:M",
        "Norway:7::(cinema rating)",
        "Singapore:PG13",
        "South Africa:13",
        "Thailand:13",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "19 Oct 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWY2Y2I2YTUtYWE1Yi00OGE5LTgyOTEtNDIyYzUyZjM5Yzk0XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "2172071",
    "plot outline": "Dean Yoginder Vashisht (Rishi Kapoor), retired, has fallen gravely ill. Several students from his final year at St. Theresa's College rush to his side. In flashbacks, they all recall the events that none of them have gotten over yet, including the dean, and how the \"Student of the Year\" competition shaped who they were, how they related, and what they've become.",
    "languages": "Hindi",
    "title": "Student of the Year",
    "kind": "movie",
    "directors": "Karan Johar",
    "writers": [
        "Renzil D'Silva",
        "",
        "Niranjan Iyengar",
        "",
        "Karan Johar"
    ],
    "producers": [
        "Marijke Desouza",
        "Hiroo Johar",
        "Karan Johar",
        "Pravin Khairnar",
        "Gauri Khan",
        "Apoorva Mehta",
        "Kulthep Narula"
    ],
    "composers": [
        "Vishal Dadlani",
        "Shekhar Ravjiani"
    ],
    "cinematographers": "Ayananka Bose",
    "editors": "Deepa Bhatia",
    "editorial department": [
        "Sajjad Fateh",
        "Sanjay Ingle",
        "Rohit Karkera",
        "Debakriti Kundu",
        "Nitin Minz",
        "Akshara Prabhakar",
        "Ganesh Shinde"
    ],
    "casting directors": "Nandini Shrikent",
    "production designers": [
        "Amrita Mahal",
        "Natasha Poonawala"
    ],
    "costume designers": [
        "Manish Malhotra",
        "Shiraz Siddique",
        "Archana Walavalkar"
    ],
    "make up department": [
        "Manish Joshi",
        "Shailesh Keskar",
        "Vinod B. Upadhyay"
    ],
    "production managers": [
        "Abhay Bhedasgaonkar",
        "Marijke Desouze",
        "Rahul Dindilkar",
        "Pankaj Pandya"
    ],
    "assistant directors": [
        "Rohit D'Souza",
        "Parzaan Dastur",
        "Pravesh Gurung",
        "Armaan Jain",
        "Arif Khan",
        "Robert Miller",
        "Shamin Mistry",
        "Anirudh Pratap",
        "Aditya Shah",
        "Balakrishnan Thevar",
        "Sidhanth Uberoi"
    ],
    "art department": [
        "Woraphol Dhanashoti",
        "Shraddha Johri",
        "Akshi Kapoor",
        "Nidhi Rungta",
        "Sumayya Shaikh"
    ],
    "sound department": [
        "Sayed Aslam",
        "Nageshwar Rao Choudhary",
        "Pingal Kalita",
        "Aziz Khan",
        "Bhabani Mallick",
        "Ali Merchant",
        "Gandhar Mokashi",
        "Ajay Kumar P.B.",
        "Abhijeet V. Sapre",
        "Javed Ahmed Shaikh"
    ],
    "visual effects": [
        "Yatin Bhave",
        "Yogesh Chhag",
        "Kinchit Desai",
        "Swapnil Dhawre",
        "Nelson Dsouza",
        "Saurabh Lakshakar",
        "Ken Metzker",
        "Abrez Mohammed",
        "Nadeem Mohd",
        "Shahnawaz Mosani",
        "Saurabh Nandedkar",
        "Paresh Navlakha",
        "Binny Padda",
        "Ravi Padda",
        "Rajiv Raghunathan",
        "Ankur Raikwar",
        "Rohit Rane",
        "Mrinal Ranjan",
        "Abdul Rasheed",
        "Ranadheer Reddy",
        "Sathiyakumar",
        "Selvakumar",
        "Kanwaljeet Singh",
        "Shaikh Sohel",
        "Sridharan",
        "Meera Sukhathankar",
        "Viral Thakkar",
        "Prashant Thakur",
        "Vinay Thakur"
    ],
    "stunts": "Parvez Shaikh",
    "camera department": [
        "Piyush Acharya",
        "Piyush Ghosh",
        "Amyn Hooda",
        "Manikandan Ramalingam",
        "Jayesh Sen",
        "Ganesh Sud",
        "Kapil Verma"
    ],
    "casting department": [
        "Ronjoy Chatterjee",
        "Parikshit Dhume",
        "Piyush Joshi",
        "Alyssa Lobo",
        "Radhika Malhotra",
        "Nida Naik",
        "Gabbar Sangrur",
        "Ravi Sarin",
        "Ketaki Walawalkar"
    ],
    "costume departmen": [
        "Terrence Lobo",
        "Radhika Mehra",
        "Megha Tandon"
    ],
    "music department": [
        "Pallikonda Adrushta Deepak",
        "Shefali Alvaris",
        "Sunidhi Chauhan",
        "Vishal Dadlani",
        "Benny Dayal",
        "Marianne Dcruz",
        "Anvita Dutt",
        "John Stewart Eduri",
        "Abhishek Ghatak",
        "Shreya Ghoshal",
        "Satchith Harve",
        "Nazia Hasan",
        "Shahid Mallya",
        "Nisha Mascarenhas",
        "Salim Merchant",
        "Neeti Mohan",
        "Udit Narayan",
        "Shekhar Ravjiani",
        "Sandeep Thakur"
    ],
    "miscellaneous": [
        "Gopal Babel",
        "Eshna Chopra",
        "Remo D'Souza",
        "Caesar Gonsalves",
        "Varun Gupta",
        "Farah Khan",
        "Brent Lovell",
        "Vaibhavi Merchant",
        "Robert Miller",
        "Siddharth Pande",
        "Augustus Pereira",
        "Sharic Sequeira",
        "Vijay Singh",
        "Sinaporn Sripatoomvaraporn",
        "Raj Surani",
        "Abhishek Varman"
    ],
    "thanks": "Dushyant Singh Gurjar",
    "akas": [
        "SOTY (World-wide, English title)",
        "Студент року (Ukraine)",
        "Estudante do Ano (Portugal)",
        "Студент года (Russia)",
        "スチューデント・オブ・ザ・イヤー 狙え！No.1!! (Japan, Japanese title)"
    ],
    "writer": [
        "Renzil D'Silva",
        "Niranjan Iyengar",
        "Karan Johar"
    ],
    "director": "Karan Johar",
    "production companies": [
        "Dharma Productions",
        "Red Chillies Entertainment"
    ],
    "distributors": [
        "Slide Screen Entertainment",
        "Unplugged"
    ],
    "special effects": "Prime Focus",
    "other companies": [
        "Benetone Films",
        "Bottomline Media",
        "Fresh Television",
        "Light n Light",
        "Pentacle Creationz",
        "ReelSports Solutions"
    ],
    "plot": [
        "Several alumni reminisce about their final year at St. Theresa's College and the events that shaped their lives.",
        "Dean Yoginder Vashisht (Rishi Kapoor), retired, has fallen gravely ill. Several students from his final year at St. Theresa's College rush to his side. In flashbacks, they all recall the events that none of them have gotten over yet, including the dean, and how the \"_Student of the Year_ (qv)\" competition shaped who they were, how they related, and what they've become.::L. Y. Hostrawser",
        "Dean Yogendra Vashisht of St Teresa's school in Dheradhun is on his death bed who had distanced from everyone over the last ten years but wishes to see students of his last batch.Sudo,Shruti,Jeet and Tanya arrive to meet him at the hospital where they reprise their memories of their old days and how dean held Student Of The Year competition every year since last 25 years.Apart from the four the gang belonged to rich brats Rohan and Shanaya who are dating each other but have differences among themselves then enters Abhimanyu a small town boy who has big dreams.Rohan and Abhimanyu have differences but end up being best friends Abhimanyu tries to help Rohan and Shanaya mend their relationship but ends up falling in love with Shanaya.Shanaya to realizes that Abhimanyu loves her and starts liking him when Rohan finds about it their friendship and the Student Of The Year competition turns into rivalry.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Former principal Dean Yogendra Vashisht (Rishi Kapoor) has aged and fallen ill. He desires to see the students from his last batch, who were part of the \"Student of the Year\" competition. Some former students arrive to the hospital to meet the Dean and talk about their regrets from ten years ago in college. They hold themselves responsible for the lively Dean having falling ill. The film then goes into a flashback set ten years back at the college.The richest and most popular guy in the college, Rohan \"Ro\" Nanda (Varun Dhawan), is the son of a huge business tycoon Ashok Nanda (Ram Kapoor). His father wants him to be a businessman like him and disagrees with his passion for music. Shanaya Singhania (Alia Bhatt), a fashion addict and the most popular girl in the campus is Rohan's girlfriend. She is unsatisfied with her family, as her mother constantly divorces and marries rich men. Shanaya gets upset with Rohan's regular flirting with Tanya Israni (Sana Saeed), another student. Abhimanyu \"Abhi\" Singh (Sidharth Malhotra) arrives at the college and becomes the classy new heartthrob. Abhi becomes the most popular guy in the college. He plays the role of the perfect student and a perfect man. He is an orphan from a middle-class family, and lives with his aunt, uncle and grandmother. His dream is to become a big business tycoon like Ashok. Rohan and Abhimanyu argue at first but soon become best friends. Rohan introduces Shanaya to Abhimanyu, warning Abhimanyu not to get involved with her romantically.Abhimanyu is invited to Rohan's elder brother's destination wedding in Thailand, which Shanaya and other rich family friends are attending as well. In Thailand, Shanaya sees Tanya and Rohan flirting again and gets even more upset when Rohan is rude to her and sides with Tanya. Abhimanyu tells her that they can teach Rohan to respect his girlfriend. At a party, Shanaya openly flirts with Abhimanyu, attempting to make Rohan jealous. The plan works but Rohan discovers she did this to get him back on track.On the wedding day, Rohan apologizes to her and is easily forgiven while Abhimanyu realizes that he is in love with Shanaya. They head back to India, where the \"Student Of The Year\" competition, which determines the best student with good logical thinking and is a good sportsperson, commences. First round is the quiz in which Rohan, Abhi and most of their friends win. The second round is the treasure hunt. Abhimanyu and Shanaya's team wins the hunt, though Rohan's team also qualifies. Abhimanyu's grandmother falls sick and eventually dies. Shanaya stands by him during this difficult time. Upset, Abhimanyu sends Shanaya away, but now she is also attracted to him, stays back and they happen to kiss. Rohan sees this and is heartbroken, becoming enemies and fighting with Abhimanyu. After having a fight with his father, Ashok disowns Rohan as a son, and he leaves the house.In the third round, the Prom, a confused Shanaya picks Rohan's friend Jeet Khurana (Sahil Anand) as her partner as she can't choose between Abhimanyu and Rohan. Rohan, who disowns Jeet and ends his friendship with him, goes with Tanya and Abhimanyu with Shanaya's ex best friend Shruti Pathak (Manasi Rachh) when she has a spat with Shanaya. Shanaya is disqualified for leaving the dance before it ends. The last round of the competition is a triathlon. Abhimanyu is winning but sees how Ashok doesn't want Rohan to win. He intentionally slows down and lets Rohan win. In the award ceremony, Yogi is abused by a drunken friend of theirs, Kaizad \"Sudo\" Sodabottleopenerwala (Kayoze Irani) due to which he eventually retires.In the present, Rohan is a pop star but single. Abhimanyu and Shanaya are now married and Abhimanyu in the present day is now a successful investment banker. They all see each other after coming to meet their principal, Abhimanyu and Rohan have a fight and let out everything they were holding back for ten years. They then unite after Rohan discovers the truth about the triathlon. They realize how important friendship is."
}