{
    "id": "2216242",
    "localized title": "Mayilu",
    "cast": [
        "Shammu",
        "Shri Sriram"
    ],
    "genres": "Family",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "imdbID": "2216242",
    "plot outline": "The film revolves around village girl Mayilu who happens to fall in love with Chellapandi. Chellapandi doesn't believe in god. But turns out to be someone whose words were considered as God's one by the village people. Village people considered that the local deity has manifested in him. Mayilu informs Chellapandi that she is pregnant and elopes with Chellapandi. Murugan helps them. City doctor reveals to Murugan that Chellapandi has some psychological issues. Mayilu is married to Chellapandi. Due to his psychological issues, Chellapandi gets aggressive when he hear lies. He beats the one who lied to him in his working time severely. Murugan calms him. Without knowing his reaction to lies the same day in house Mayilu reveals to Chellapandi that she lied to him that she was pregnant as she fear of losing him. Later Chellapandi gets treatment. Treated Chellapandi asks for Mayilu, Murugan recalls what happened on a fateful night when Mayilu told the truth to Chellapandi. Fearing the aggressive Chellapandi, the ignorant Mayilu though him as the manifestation of the local deity and hands over the \"Aruval\" to him and asks the deity to leave Chellapandi for the betterment of their life. And without his own conscious he kills her. The film ends showing him being arrested and leaving in van and watching the people who are going for local deity worship.",
    "languages": "Tamil",
    "title": "Mayilu",
    "kind": "movie",
    "directors": "Jeevan",
    "producers": "Prakash Raj",
    "composers": "Ilaiyaraaja",
    "editorial department": "Raghuraman",
    "visual effects": "Raghuraman",
    "miscellaneous": "Geetanjali Mehlwal",
    "akas": "Mayilu (India)",
    "director": "Jeevan",
    "production companies": "Duet Movies",
    "distributors": "Duet Movies",
    "plot": "The film revolves around village girl _Mayilu_ (qv) who happens to fall in love with Chellapandi. Chellapandi doesn't believe in god. But turns out to be someone whose words were considered as God's one by the village people. Village people considered that the local deity has manifested in him. _Mayilu_ (qv) informs Chellapandi that she is pregnant and elopes with Chellapandi. Murugan helps them. City doctor reveals to Murugan that Chellapandi has some psychological issues. _Mayilu_ (qv) is married to Chellapandi. Due to his psychological issues, Chellapandi gets aggressive when he hear lies. He beats the one who lied to him in his working time severely. Murugan calms him. Without knowing his reaction to lies the same day in house _Mayilu_ (qv) reveals to Chellapandi that she lied to him that she was pregnant as she fear of losing him. Later Chellapandi gets treatment. Treated Chellapandi asks for _Mayilu_ (qv), Murugan recalls what happened on a fateful night when _Mayilu_ (qv) told the truth to Chellapandi. Fearing the aggressive Chellapandi, the ignorant _Mayilu_ (qv) though him as the manifestation of the local deity and hands over the \"Aruval\" to him and asks the deity to leave Chellapandi for the betterment of their life. And without his own conscious he kills her. The film ends showing him being arrested and leaving in van and watching the people who are going for local deity worship."
}