{
    "id": "2271641",
    "localized title": "Thaandavam",
    "cast": [
        "Vikram",
        "Jagapathi Babu",
        "Anushka Shetty",
        "Amy Jackson",
        "Raai Laxmi",
        "Santhanam",
        "Nassar",
        "Saranya Ponvannan",
        "Thambi Ramaiah",
        "Kota Srinivasa Rao",
        "Sayaji Shinde",
        "Delhi Ganesh",
        "M.S. Bhaskar",
        "Sujitha",
        "Balaji",
        "Sathish",
        "Daniel Kish",
        "Paul Blackwell",
        "Chris Cowlin",
        "Mike Parish",
        "Santi Scinelli",
        "Javed Khan",
        "Ignacio Guirado",
        "Alexx O'Nell",
        "Kristina Linder",
        "Isaak Gracia",
        "Jean-Marc Chautems",
        "Anusha Prakash",
        "Lee Money",
        "Nigel Genis",
        "Halle Handji",
        "Paul Little",
        "John Duggan",
        "Carrie-Louise Knight",
        "Gary Alan Hawker",
        "Senem Temiz",
        "Guglielmo Richards",
        "Mohammed Ali",
        "Murtaza Arif",
        "Raj Arjun",
        "Joy Badlani",
        "Bluehomie",
        "Gioacchino Jim Cuffaro",
        "Danny Erskine",
        "Alexia Evripidou",
        "Monisha Hassen",
        "Zaira John",
        "Daniel Jordan",
        "Jim Lawrence",
        "Jon L. Morris",
        "Candice Pereira",
        "Alex Reed",
        "Sam Shoubber"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "India:U",
        "Netherlands:12",
        "New Zealand:M",
        "Norway:15::(cinema rating)",
        "Singapore:PG",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "28 Sep 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWVhMzRmNGYtY2IxNy00Y2ExLTk5YWQtNzlkODFhNzc4ZjhhXkEyXkFqcGdeQXVyODE0NjUxNzY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2271641",
    "plot outline": "The film opens with Kenny (Vikram), a Pianist in a church and a blind man who is on a vendetta mission in London, which has been ravaged by a series of bomb blasts. During the night, Kenny becomes an obsessed killing machine and goes on a killing spree murdering mostly white men. In a flashback mode it is revealed that Kenny is actually a top RAW officer Sivakumar whose buddy was Sarath (Jagapathy Babu), his colleague in the intelligence department. Siva marries Meenakshi (Anushka) an eye surgeon and was leading a peaceful life till fate intervened cruelly and turned his life upside down.",
    "languages": "Tamil",
    "title": "Thaandavam",
    "kind": "movie",
    "directors": "A.L. Vijay",
    "writers": [
        "Nigel Genis",
        "",
        "Mike Parish",
        "",
        "A.L. Vijay"
    ],
    "producers": [
        "Siddharth Roy Kapur",
        "Ronnie Screwvala"
    ],
    "composers": "G.V. Prakash Kumar",
    "cinematographers": "Nirav Shah",
    "editors": "Anthony",
    "editorial department": [
        "Sridharan Gk",
        "Rohit Karkera",
        "Nitin Minz",
        "Vishal Sanjeeva"
    ],
    "casting directors": [
        "Naila Mughal",
        "Sangeeth Varghese"
    ],
    "art directors": "R.K. Naguraj",
    "costume designers": "Falguni Thakore",
    "production managers": [
        "Preejith Balan",
        "David Choudhry",
        "Ganesan",
        "Manivarma",
        "Amin Mansoori",
        "Shah Naimish"
    ],
    "assistant directors": [
        "Kompala Gautham",
        "Gokulakrishnan",
        "Victor Jayaraj",
        "Divya Madhan",
        "Krishna Marimuthu",
        "Martina Niranjini",
        "Martina Niranjini",
        "Ragesh Ram",
        "Vishal Sanjeeva",
        "Deepak Sundarrajan"
    ],
    "art department": "Aruna Rakhee",
    "sound department": [
        "Harish",
        "Rajakrishnan M.R.",
        "P.C. Vishnu"
    ],
    "special effects": [
        "Ben Ashmore",
        "Steve Cawood",
        "Simon Davey"
    ],
    "visual effects": [
        "Kotamraju Karthik",
        "P.T. Njanasundaran",
        "Rajiv Raghunathan",
        "Rudresh Vyas"
    ],
    "stunts": [
        "Charles Fergusson",
        "Manohar Verma"
    ],
    "camera department": [
        "Badhri Panindhar Kumar",
        "B.K. Sivan"
    ],
    "casting department": "Naveed Aslam",
    "costume departmen": [
        "Reha Jain",
        "Devyani Kapoor"
    ],
    "location management": "Sarwar Mohammad",
    "music department": [
        "Alyssa",
        "S.P. Balasubrahmanyam",
        "Haricharan",
        "Chinnaponnu Kumar",
        "G.V. Prakash Kumar",
        "Maria",
        "Singer Megha",
        "Na. Muthukumar",
        "Rahul Nambiar",
        "Mike Parish",
        "Sathya Prakash",
        "Saindhavi",
        "Shrihari",
        "Vandana Srinivasan",
        "Megha Sriram",
        "Velmurugan"
    ],
    "miscellaneous": [
        "Ross Andrews",
        "Gopal Balaji",
        "Prakash Nathan",
        "Gaurav Verma"
    ],
    "thanks": [
        "Kay Aujla",
        "Rebecca Barry",
        "Jessica Carroll",
        "Charmichael Diana",
        "Adam Diggle",
        "Andrew Foster",
        "David Golt",
        "Lee Harris",
        "Tary Kay",
        "Taryn Kay",
        "Orlando Papushi",
        "Nick Sayce",
        "Lamin Tamba"
    ],
    "akas": [
        "Sivathaandavam (India, Telugu title)",
        "Desh Prem the Real Hero",
        "Слепой (Russia)"
    ],
    "writer": [
        "Nigel Genis",
        "Mike Parish",
        "A.L. Vijay"
    ],
    "director": [
        "A.L. Vijay",
        "A.L. Vijay"
    ],
    "production companies": "UTV Motion Pictures",
    "distributors": [
        "Ayngaran Video",
        "BR Films International",
        "Hotstar",
        "Star VijayTV"
    ],
    "special effects companies": [
        "Future Effects",
        "Imaging-Lab"
    ],
    "plot": [
        "The identity of a blind church pianist is uncovered. Military officer Shiva Kumar is on the run as an accused fugitive, and is attempting to take revenge against those who killed his wife.",
        "The film opens with Kenny (Vikram), a Pianist in a church and a blind man who is on a vendetta mission in London, which has been ravaged by a series of bomb blasts. During the night, Kenny becomes an obsessed killing machine and goes on a killing spree murdering mostly white men. In a flashback mode it is revealed that Kenny is actually a top RAW officer Sivakumar whose buddy was Sarath (Jagapathy Babu), his colleague in the intelligence department. Siva marries Meenakshi (Anushka) an eye surgeon and was leading a peaceful life till fate intervened cruelly and turned his life upside down.::Ajith"
    ],
    "synopsis": "A serial bomb blast attack occurs on the tenth of December in 2011 in London, causing panic and fear among civilians and being labeled the most destructive attack since America's W.T.C assault . A year later, a blind Church pianist named Kenny Thomas is received by an anonymous friend at a grieving ceremony in honor of the bombing victims. After leaving, Kenny is picked up by a comical Tamilian taxi driver named Sathyan. Sathyan drives Kenny to an apartment complex and refuses to take the money, naively saying that he'll gladly wait for him if he needs to come back. Kenny breaks into an elderly man's apartment room, and stalks him whilst producing clicking sounds indicating echolocation. He scares the old man who begs for his life and seemingly recognizes him and claims that he has nothing to do with \"it\". Sathyan gets into an argument with a man at the building entrance and both panic upon seeing the elderly man's body crash onto a car below. Kenny silently leaves the building without going back to Sathyan. He is seen the next day playing at the local church and is shown as a compassionate individual as he safely removes an ant on his piano.The London police investigate the man's death and arrest Sathyan when they find his taxi in security footage. The chief of police Veerakathy interrogates Sathyan and dismisses him as a witness. The coroner Vinayagam gives Veerakathy the autopsy report and Veerakathy confirms that it was murder, since he died two minutes before he actually crashed as seen in the photo of his watch time. Vinayagam's daughter Sara is a fashion model who wins the title of Ms. London and later is recruited by a modeling agency to photo shoot environmental advertisements and promote philanthropy. Kenny is present at the photo shoot and is received by his friend again. Later that day, Sara is with Satish, the man who recruited her for the organization, at the church Kenny plays at. Since his sister Dilsha is a well known member there he uses the location to conduct another photo shoot as a social service. It's disapproved by the church's father who kicks Satish out, who knocks Kenny over. Sara helps him up and apologizes, which he forgives. The two later become mutual friends.Sathyan encounters Kenny again and excitedly greets him, telling him about the murder at the apartment and how he wonders why the police suspected him. Kenny looks down with regret but asks Sathyan to drive him to the country club, and decides to sleep close to the club in his car. Kenny finds a woman named Cathy living at the club and draws her out of her house, locking her out. She sees Kenny walk up to the door and screams believing he's a \"ghost\". Cathy flees but Kenny stealthily outflanks her and strangles her with his bare hands before dumping her body into the river. Veerakathy arrives at the club and finds Sathyan, asking him about what he's doing. He states that he dropped off a customer before resting and he's arrested believing he is connected. He helps the police draw a forensic sketch of Kenny but doesn't recall the look of his face and states he didn't have any weapons nor hostile attitude when he was with Sathyan. Kenny is attacked in a hit and run and is hospitalized. Given the description of his clothing and possible facial features by Sathyan, Veerakathy looks into Kenny as a suspect, matching his schedule, appearance, and lack of alibi with the time of the murders. He takes Kenny's picture in the hospital and realizes that Kenny has acute hearing as he asks him to delete the photo.Sara too is later hospitalized when she foolishly tries to experience being blind and walks around the house blindfolded, tripping down the stairs. Kenny and Sara look after each other and tour around London. Many days later, Kenny breaks into a wealthy man's house while he's relaxing in his sauna and beats him to death. The next day at a fashion ceremony Kenny and Sara head home but are attacked by a man named Rod, who's girlfriend was previously rejected by the company that recruited Sara. He and his goons begins harassing Sara and Kenny out of jealousy, and Sara is startled when Kenny effortlessly beats them up, using his echolocation to detect their precise location. He leaves immediately and Sara is left baffled upon seeing what he's capable of. She takes Kenny's phone seeing that he dropped it. Sathyan is still unable to tell the police everything about his customer and remains in custody. Veerakathy deduces that all three murders have the same M.O and must be conducted by the same person: Sathyan's customer, but is unable to find a motive. Kenny is seen standing alone on an open lawn.A flashback is shown in which Kenny's real identity is Shiva Kumar, an Indian military espionage officer. He is shown helping a squad of soldiers bust a terrorist gang. In the process he befriends the leader of the squad, Sharath and becomes close friends with him. He returns home after his service disappointed to find that his family is conducting an arranged marriage against his permission. Shiva explains that his line of work is dangerous and that he's not at all ready for marriage or family, however nobody in his family listens. He is initially strongly against it but changes his mind upon seeing compassion and ambition from the bride Meenakshi, who is passionate about music, art, literature, and is a skilled eye doctor. Both Meena and Shiva find that they are both dedicated to their work and think of each other as likable, but have yet to be on a romantic level. Meena tells Shiva about her dreams of running an organization to help those with eye problems. She initially believes Shiva is a sub inspector and Shiva decides not to tell her about his status as a military officer.Coming back to the present, the police department have no leads on Shiva's victims and Sathyan shows Veerakathy his picture in the newspaper as it was taken during the fashion ceremony. Vinayagam is skeptical since he's blind and a lonely man who could have no such motive. Veerakathy interrogates the church father and finds that Kenny attends a school for the blind, run by Daniel Kish. Veerakathy learns of the echolocation method blind people use to get around, by projecting sound to find the distances of objects with. Kish tells Veerakathy about how he lost his sight at the bombing in the last year. Veerakathy finds records of a man named Kenny Thomas in files for the vicitms of the blast. They scan Shiva's picture in the newspaper and match him with his true identity in the records. Apparently, Shiva was accused of a conspirator of the bombing and portrayed as a presumed dead terrorist. Vinayagam calls Sarah and tells her everything they know about Kenny/Shiva. She meets with Sathyan who initially refuses to help the woman whose friends with the man who's accused as a murderer. Sara finds on Shiva's phone that he is going after a man named Victor at an office building. Sarah and Sathyan stop him from killing Victor and Kenny tries to escape Veerakathy's forces in Sathyan's taxi, which plunges into a river. The taxi is recovered but nobody is in it.Veerakathy interrogates Victor and believes he's lying about why he thinks Shiva is trying to kill him. He suggests it's not merely because he and the other victims are rich. Sathyan, Sara, and Shiva wash up at a river. Sara and Sathyan try to escape Shiva and take help from a woman named Geetha. When they realize that she's actually Shiva's friend and is giving him shelter, they flee. Geetha and Shiva confront them and attempt to clarify whom Shiva really is. Another flashback goes back to after Shiva's marriage with Meena and that they're living happily. Shiva and Sharath are dealing with a case in which a nuclear scientist Ravi Mugra has been murdered after synthesizing a bomb and that the flowchart for it has gone missing. Sharath formally meets Meena and briefs Shiva on the case, that the flow chart allows construction of a minuscule bomb that's immune to detection and can destroy anything in a fifty meter radius, and that it's easy to construct. After the briefing, Shiva attends piano lessons in an attempt to impress Meena. Sharath investigates Mugra's murder while Shiva calls up Meera at her work and asks her to come to him, which she refuses frustrated. It's revealed that Shiva was running a paint exhibition to raise funds for Meena's eye research organization and has sold every painting except one she drew herself. She meets with Shiva that night who apologizes and she forgives.Sharath's friends have conducted many investigations around the nation to find out who killed Mugra and it comes to nothing. Shiva suggests that the suspect could be a foreign spy and that he's a contact awaiting the flowchart. Since no major bombing has occurred he may not have left the nation yet. That night, Shiva tries to confess true love to Meena but she goes to sleep before their date. Shiva and Sharath's organization state that they'll spoil diplomatic relations without a solid lead on the suspect, and Sharath states that the situation will get worse for them if a bombing attack occurs. Sharath is frustrated when his ideas of taking the matter to his hands are dismissed and the department turns to Shiva for his service on unrelated issues. Shiva and Meena attend a party for the chief doctor's anniversary. The Dehli police commissioner is present and Meena introduces him to Shiva. Shiva and the commissioner already know each other and that the commissioner who has high respect for him. The commissioner's friends tell Meena that Shiva is an intelligence officer working with R.A.W. He performs at the party with the piano and becomes closer with Meena.Meena later finds a love card Shiva wrote in one of her books and about how he was hesitant to tell her. She decides to confess later as a surprise. Shiva, Meena, Sharath, and his wife eat out but are called in immediately to work when a foreign suspect named Steven is busted and on the run. Sharath leaves early and the other three catch up with him at the housing complex he's been looking for Steven at. Shiva arms himself with a hand gun and finds Steven assaulting Sharath in his room. Steven shoots Sharath and Shiva beats him hand to hand. Steven escapes but a wounded Sharath kills him. Shiva joins the case and believes that someone in the department may be helping Steven. Shiva goes through Steven's belongings and analyzes the crime scene photos. He finds a receipt in Steven's pocket and realizes that his associates have smuggled the flowchart out of the nation into Britain and that a British intelligence traitor is going to receive it. Shiva decides that Britain's spy network knowing of the case will be too risky and give India financial problems for it. He states that he must venture to London and infiltrate their cargo delivery to find the flowchart.Shiva heads to London with the false name \"Arjun Rathore\" and meets a fellow spy named Kenny Thomas, who is to help him recover the bomb's flowchart. They meet a man named Richard Ford at a car department who is meant to pick Shiva up after the mission is over. Shiva also meets Geetha, Kenny's wife. They talk about the mission at a cafe. Kenny recognizes a dispatch officer of the delivery company who frequently visits a local pub, as confirmed by the cafe employee who serves them. Shiva meets a woman named Andrea who knows about the delivery company and agrees to assist him in the recovery. Lastly, the meet a hacker and steel factory owner Victor, who agrees to freeze the security cameras during the time they find the flowchart. Andrea and Shiva infiltrate the cargo office at night and find the locker with the flowchart, but the police somehow arrive early upon being tipped off. Andrea panics and runs leaving Shiva behind. Shiva escapes into the loading deck and the police surround him. Shiva finds out that he's disoriented and that he has somehow been drugged. He fights his way out of the police blockade and heads to the back of the office, but Ford fails to arrive and Shiva faints.The next day, Shiva wakes up in a park confused about the events of the previous night. He goes to Kenny's house but finds a different couple living there, and they dismiss him. He also finds out that there's nobody named Richard Ford working at the dealership where he and Kenny met him. Shiva places the drive with the bomb blueprint into his laptop and finds it empty. Furthermore he realizes that Victor didn't actually freeze the cameras and sees his picture in the newspaper. As he ponders the events of last night he finds the London police are onto him and he runs, evading the police. He is found by Kenny, who confesses that the entire operation was staged against him. The people that they met were in on it together, including the cafe employee, Andrea, Ford, and Victor. They all held his wife Geetha hostage to play his part, and that the woman Shiva met and Kenny's house was an imposter, not Geetha's actual wife. Shiva realizes that the flow chart was never smuggled and that someone in the department sent him there specifically to frame him as a terrorist. Shiva and Kenny find that Geetha's impostor is in the city and spy on her, and she secretly meets with Victor.All of the people who pretended to participate in the operation collaborate in a hotel, including Ford, Geetha's imposter, the cafe employee who drugged Shiva's coffee, and Victor. Shiva sees that they have acquired the flow chart and calls up Sharath to inform him. Much to his and Kenny's horror they find Sharath in the same apartment building on his phone and leading the terrorist group that has bought the flowchart. Shiva is unable to comprehend it and calls Sharath up. He states that he has sacrificed everything including his son's life for his work and never received as much respect as Shiva did whom he believed upstaged him. He reveals that he sent Shiva to London just to set him up, and that he actually was the traitor and Steven's contact. Steven was going to give Sharath the flowchart but Sharath betrays him and attempts to kill him to keep the flowchart to himself. Shiva however sets the scene and fights Steven, then Sharath kills him to avoid his identity from being given away. Sharath states that he had cared about Shiva enough not to let him interfere with Sharath's vigilantism through force, which he apparently intended through making profit off of the flow chart.. Shiva is disgusted at his lust for power and money and justification through saving Shiva's skin with it. He swears to reveal his identity to the department.Meena walks into Sharath's room and Sharath tells her that Shiva wishes to meet her tomorrow at the Tower Bridge. Kenny and Shiva arrive at the scene to talk secretly to Meena and tell her about Sharath's actions. Kenny agrees to talk to Meena in the park to avoid Shiva getting caught by CCTV cameras. Shiva stays behind a wall and observes a man, the same man who drugged him at the cafe slip a parcel into a trash bin. Realizing it's a bomb, Shiva yells for Kenny and Meena to run for their lives. The bomb explodes and Kenny and Meena are both killed and Shiva looses his eyesight. Shiva goes missing and is presumed dead, with his family and department believing that he was the one who betrayed the nation and schemed the bombing, as per Sharath's doing. The real Geetha, knowing that Shiva did nothing wrong takes him in and Shiva takes the guise of Kenny and pretends to be Geetha's husband. Shiva since was under Geetha's care and trained under Kish. One by one they investigated each of the terrorists who were responsible for the bombing and their spouse's deaths. It's revealed that the people Shiva killed were the terrorists who deceived him. Ford was the elderly man, the woman named Cathy was Andrea, and the man in the sauna was the cafe employee.Realizing that Shiva has resurfaced, Sharath and Victor in the present day decide that Shiva will spill his identity along with Sharath's if the police get his hands on him. Veerakathy has previously suspected Victor and looked into his identity, finding out that he had the Steel Factory for a year and previously was a spy for Sharath's people. He placed a bug on Victor's car allowing them to find out that Victor somehow knew about Geetha being Shiva's contact. Victor finds that Geetha has been spying on him and heads to her house to kill her. He attempts too kill Shiva too but is killed himself. Veerakathy finds Sara and Sathyan as well who tell him of Shiva's past. Sathyan also drops Shiva off at his wanted address, Victor's steal factory and the police meet there to find out whom he's after. Shiva confronts Sharath at the factory where he has taken shelter and fights him. Sharath uses Shiva's blindness to his advantage and activates the emergency alarm, halting his echolocation. Sharath beats Shiva and severely injures him. When Sharath check's Shiva's pulse, Shiva reveals that he faked unconsciousness and grasps Sharath's wrist. Shiva retaliates furiously and bashes Sharath into the steal shelves around him, killing him. Shiva escapes the building before an electric failure causes an explosion.Shiva is taken into custody but is let go of with Veerakathy understanding that he was neutralizing a threat. The British intelligence disclose Shiva's past to courts and Shiva's department. Shiva is found innocent in trials and his name is cleared among those who thought wrong of him. He agrees to live the rest of his life with his true self and in memory of Meena. He is seen placing flowers at the memorial for the bombing victims along with Sara who joins him."
}