{
    "id": "2346744",
    "localized title": "Cigarette Ki Tarah",
    "cast": [
        "Muntazir Ahmad",
        "Ashok Banthia",
        "Sudesh Berry",
        "Yuvika Chaudhary",
        "Prashant Narayanan",
        "RajKumar",
        "Madhurima Tuli",
        "Bhoop Yaduvanshi"
    ],
    "genres": [
        "Romance",
        "Thriller"
    ],
    "runtimes": "107",
    "countries": "India",
    "country codes": "in",
    "language codes": "zxx",
    "color info": "Color::(Cinecolor)",
    "certificates": "United States:Not Rated",
    "original air date": "14 Dec 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTk5ZTkzYWItNjI4NC00MjgzLWFlNDUtOTA3NmEyZjlmY2UxXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "2346744",
    "plot outline": "A guy falls in love blindly with a beautiful girl. This blind love leads him into deep trouble, and further separates him from other people like one man versus the entire world. In these dark situations, where one surely gives up on everything, he doesn't, and thus keeps on believing and trusting on his blind love, which eventually shows him all the ways to be out from all the difficulties. Watch the full movie Cigarette Ki Tarah online, only on Eros Now.",
    "languages": "None",
    "title": "Cigarette Ki Tarah",
    "kind": "movie",
    "directors": "Akashaditya Lama",
    "writers": [
        "Pradip Atluri",
        "",
        "KamlshGupt",
        "",
        "Bobby Khan"
    ],
    "producers": [
        "Rana Bhatia",
        "Amit Choudhary",
        "Rajeev Kapoor"
    ],
    "composers": [
        "Sudeep Banerjee",
        "Ankur Mishra",
        "Viraj Sawant",
        "Kavita Seth"
    ],
    "cinematographers": "Ramesh Krishna",
    "editorial department": "Shekhar Reddy",
    "costume designers": "Manish Ranjan",
    "production managers": "Sagnik Bhattacharjee",
    "assistant directors": [
        "Rhea Anand",
        "Jagruti Jethe",
        "KamlshGupt",
        "Surinder Khokhar",
        "Kamlesh Kumar",
        "Amanpreet Singh Sekhon",
        "Samitinjay Shukla",
        "Srishti Singh"
    ],
    "sound department": "Devabrot Chaliha",
    "visual effects": [
        "Debasish Borah",
        "Mohamed Ghouse",
        "P. Mohan"
    ],
    "miscellaneous": [
        "Sanjeev k Sharma",
        "Srishti Singh"
    ],
    "akas": "Cigarette Ki Tarah (India)",
    "writer": [
        "Pradip Atluri",
        "KamlshGupt",
        "Bobby Khan"
    ],
    "director": "Akashaditya Lama",
    "production companies": "P. Y. Films",
    "other companies": [
        "Eros Worldwide",
        "MoviezAdda"
    ],
    "plot": "A guy falls in love blindly with a beautiful girl. This blind love leads him into deep trouble, and further separates him from other people like one man versus the entire world. In these dark situations, where one surely gives up on everything, he doesn't, and thus keeps on believing and trusting on his blind love, which eventually shows him all the ways to be out from all the difficulties. Watch the full movie _Cigarette Ki Tarah_ (qv) online, only on Eros Now.",
    "synopsis": "A story filled with twists and turns which will keep you on the edge of your seats, this romantic thriller is the story of a Guy, How He falls in love blindly and the blind love leads him in deep trouble, separates him from others like one man vs. world, in dark circumstances where everyone gives up but he does not, keeps on believing on his blind love which shows him the all ways to be out from all the troubles.The movie has an engaging story which is filled with lots of twists and turns that will keep the viewers on the edge of their seats. This romantic thriller is the story of a young and handsome guy, and how he falls in love blindly with a young beautiful girl. In precise, the story follows with how this blind love leads the guy into a deep trouble, and further separates him from other people like one man versus the entire world. In these dark situations, where one surely gives up on everything, but he doesnt, and thus keeps on believing and trusting on his blind love, which eventually and fortunately shows him all the ways to be out from all the difficulties."
}