{
    "id": "2404801",
    "localized title": "Kumki",
    "cast": [
        "Vikram Prabhu",
        "Lakshmi Menon",
        "Thambi Ramaiah",
        "Ashwin Raja",
        "Joe Malloori",
        "Jeffin"
    ],
    "genres": "Drama",
    "runtimes": "148",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:U::(theatrical rating)",
        "Singapore:PG13"
    ],
    "original air date": "14 Dec 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2JiMjMzMjctMGM3Yi00YTRhLThmMTUtOGQ4MTQwODBhMWM5XkEyXkFqcGdeQXVyODk1MzE5NDA@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "2404801",
    "plot outline": "Bomman (Vikram Prabhu) a mahout and his pet elephant Manickam make a living out of performing in temples and film shootings. He is assisted by his uncle (Thambi Ramaiah) a drunkard and wastrel. Due to certain circumstances, they find themselves in a remote village protecting the villagers from a wild heard of elephants. Bomman knows that Manickam is not a trained Kumki elephant who can take on or stop the attack of the wild elephants. However he does not care as by then he has fallen madly in love with the village chieftain's daughter Alli (Lakshmi Menon). Meanwhile the villagers treat him like their saviour, as the wait begins for the wild elephant on rampage.",
    "languages": "Tamil",
    "title": "Kumki",
    "kind": "movie",
    "directors": "Prabu Solomon",
    "writers": "Prabu Solomon",
    "producers": [
        "N. Subash Chandrabose",
        "N. Linguswamy"
    ],
    "composers": "D. Imman",
    "cinematographers": "Sukumar",
    "editors": "L.v.k.doss",
    "assistant directors": "Sandhomer",
    "sound department": [
        "Jaikar",
        "Sandhomer"
    ],
    "visual effects": [
        "Loganathan Boopathy",
        "Prabhakher",
        "Raghuraman"
    ],
    "music department": [
        "Benny Dayal",
        "Bhanuka Fernando",
        "Shreya Ghoshal",
        "Haricharan",
        "D. Imman",
        "Alphons Joseph",
        "Karthik",
        "Magizhini Manimaaran",
        "Aditi Paul",
        "Ranjith",
        "Malin Samarasekara",
        "Yugabharathi"
    ],
    "miscellaneous": [
        "Noble",
        "Sabir",
        "Naveen Varadarajan"
    ],
    "akas": [
        "Gajaraju (India, Telugu title)",
        "Кумки (Russia)"
    ],
    "writer": "Prabu Solomon",
    "director": "Prabu Solomon",
    "production companies": "Thirupathi Brothers",
    "distributors": [
        "Studio Green",
        "Thirupathi Brothers",
        "Amazon Prime Video",
        "Star VijayTV"
    ],
    "other companies": [
        "Dakshaa",
        "Sony Music India"
    ],
    "plot": [
        "The love between a mahout and an elephant.",
        "Bomman (Vikram Prabhu) a mahout and his pet elephant Manickam make a living out of performing in temples and film shootings. He is assisted by his uncle (Thambi Ramaiah) a drunkard and wastrel. Due to certain circumstances, they find themselves in a remote village protecting the villagers from a wild heard of elephants. Bomman knows that Manickam is not a trained _Kumki_ (qv) elephant who can take on or stop the attack of the wild elephants. However he does not care as by then he has fallen madly in love with the village chieftain's daughter Alli (Lakshmi Menon). Meanwhile the villagers treat him like their saviour, as the wait begins for the wild elephant on rampage.::Karthik",
        "Bomman, a Mahout, with his Pet Manickam, a tamed elephant, and his Uncle accidentally gets into the job of protecting a Village from a wild elephant, Komban. Initially the job was given to him for few days until the real kumki elephant( An Elephant which could fight wild elephants) reaches village. In the meantime, he witnesses a girl named Alli in the village and falls in love. So he decides to stay in that village and stops kumki elephant's arrival. Rest of the story deals with love between Bomman & Alli , and whether Manickam defeated Komban or not."
    ]
}