{
    "id": "2457394",
    "localized title": "Laptop",
    "cast": [
        "Van Esza",
        "Edy Ganem",
        "Albert Rodriguez"
    ],
    "genres": [
        "Short",
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "9",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzMwMjk3MWItZWVjNC00MTVmLWExNDQtYzJkMzg2YmU0ODlhXkEyXkFqcGdeQXVyNTgzMzk4NDQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2457394",
    "plot outline": "On April 29, 2009, Jenny vanished from her apartment in the city of Los Angeles. The only piece of evidence recovered was a digital hard-drive from her mac laptop. On the day she vanished, the webcam was on auto record mode.",
    "languages": "English",
    "title": "Laptop",
    "kind": "video movie",
    "directors": "Azron Shai",
    "writers": "Azron Shai",
    "cinematographers": "Arsen Matevossian",
    "writer": "Azron Shai",
    "director": "Azron Shai",
    "plot": "On April 29, 2009, Jenny vanished from her apartment in the city of Los Angeles. The only piece of evidence recovered was a digital hard-drive from her mac laptop. On the day she vanished, the webcam was on auto record mode.::Anonymous",
    "synopsis": "On April 29, 2009, Jenny vanished from her apartment in the city of Los Angeles. The only piece of evidence recovered was a digital hard-drive from her laptop. On the day she vanished, her webcam was on auto record mode which captured most of the evidence. It is believed that Jenny's laptop was wired by an unknown stranger. The masked villain was never captured and has the capability to strike again. Jenny's body was never recovered but there are speculations that she may still be alive and is locked in a females dungeon between the San Diego and the Tijuana border. The internet can be a dangerous zone. Someone can be peeking through your webcam. This is exactly what happened to Jenny as she returned from an exhausting day of work. Research by the crime and forensic department believe that the mastermind of this terrifying event was somebody that knew or who has met Jenny. It is someone who planned and watched every move of this young girl. It can be the boy next door or the friendly mailman who has a psychotic issue. Laptop is a thrilling short film that will leave you at the edge of your seat."
}