{
    "id": "2527740",
    "localized title": "Thiruvambadi Thamban",
    "cast": [
        "Jayaram",
        "Jagathi Sreekumar",
        "Kishore Kumar G.",
        "Haripriya",
        "Janardanan",
        "V. Jayaprakash",
        "Shaju K.S.",
        "Babu Namboothiri",
        "Karate Raja",
        "T.G. Ravi",
        "Samuthirakani",
        "Sreelatha",
        "Nedumudi Venu",
        "Jayaraj Warrier"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "25 May 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGUyMGVlMzEtNDAxYi00MmViLThkYWYtNGIzMThmZmE0MDA0L2ltYWdlXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "2527740",
    "plot outline": "Thiruvambadi Thamban (Jayaram) hails from a family that have been supplying elephants for temple processions for years. To add some romance to the story, Jayaram is given company by Haripriya who plays a Brahmin girl in the film. On the way back to Kerala from the Gajamela at Sonepur, Thiruvambadi Mathan Thrakan (Jagathy) happens to confront Shaktivel (Kishore) in Madurai, Tamil Nadu. Shaktivel is a cruel politician and landlord and the character of Jagathy fails to understand that he rules the place and accidentally kills his younger brother. Soon, in a fast tracked series of events, Shaktivel and his men go in search for Mathan and his people to avenge the death of his brother. Thiruvambadi Thamban follows a never ending travail of son trying to save his father from an extremely dangerous enemy.",
    "languages": "Malayalam",
    "title": "Thiruvambadi Thamban",
    "kind": "movie",
    "directors": "M. Padmakumar",
    "writers": "S. Suresh Babu",
    "producers": "Alexander John",
    "composers": "Ouseppachan",
    "cinematographers": "Manoj Pillai",
    "editors": [
        "Samjith Mohammed",
        "Rathin Radhakrishnan"
    ],
    "sound department": [
        "Ajith Abraham George",
        "Anish P. Tom"
    ],
    "visual effects": [
        "Vishakh Babu",
        "Bhuvaneswaran"
    ],
    "music department": [
        "Alex Kayyalakkal",
        "Sudeep Kumar",
        "Shweta Mohan",
        "Ouseppachan",
        "Dr. Madhu Vasudevan"
    ],
    "writer": "S. Suresh Babu",
    "director": "M. Padmakumar",
    "plot": "_Thiruvambadi Thamban_ (qv) (Jayaram) hails from a family that have been supplying elephants for temple processions for years. To add some romance to the story, Jayaram is given company by Haripriya who plays a Brahmin girl in the film. On the way back to Kerala from the Gajamela at Sonepur, Thiruvambadi Mathan Thrakan (Jagathy) happens to confront Shaktivel (Kishore) in Madurai, Tamil Nadu. Shaktivel is a cruel politician and landlord and the character of Jagathy fails to understand that he rules the place and accidentally kills his younger brother. Soon, in a fast tracked series of events, Shaktivel and his men go in search for Mathan and his people to avenge the death of his brother. _Thiruvambadi Thamban_ (qv) follows a never ending travail of son trying to save his father from an extremely dangerous enemy.::Ajeesh Madhava Vijayan"
}