{
    "id": "2568760",
    "localized title": "Theevram",
    "cast": [
        "Dulquer Salmaan",
        "Sreenivasan",
        "Vinay Forrt",
        "Vishnu Raghav",
        "Aashiq Abu",
        "Janardanan",
        "Anu Mohan",
        "Unni Mukundan",
        "Shikha Nair",
        "Chali Pala",
        "Andrea Marian Renji",
        "Amala Rose",
        "Riya Saira",
        "Ahamed Shaheen",
        "Sreekumar",
        "Sajid Yahiya"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Singapore:PG13",
        "United States:Not Rated"
    ],
    "original air date": "16 Nov 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGZiNjI2N2EtNmE2MS00MmU5LTg5MjAtYzMzOGEzYzQzNGQ4XkEyXkFqcGdeQXVyMzQ5Njc3NzU@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "2568760",
    "plot outline": "A wannabe musician seeks wild justice by plotting the perfect murder of the man who wronged him. A missing auto-rickshaw driver and unidentifiable mutilated body parts found at different leaves the Kerala Police dumbfounded.Parallel to the investigation the history of the murderer and the murdered are revealed.",
    "languages": "Malayalam",
    "title": "Theevram",
    "kind": "movie",
    "directors": "Roopesh Peethambaran",
    "writers": "Roopesh Peethambaran",
    "producers": "Ismayil",
    "composers": "Roby Abraham",
    "cinematographers": "Hari Nair",
    "editors": "Kapil Gopalakrishnan",
    "editorial department": "Don Max",
    "art directors": "Cyril Kuruvilla",
    "make up department": "R.G. Wayanadan",
    "production managers": "Alex E. Kurian",
    "assistant directors": "Tovino Thomas",
    "sound department": [
        "Harish",
        "P.C. Vishnu"
    ],
    "music department": [
        "Roby Abraham",
        "Rafeeq Ahammed",
        "Deepak Kutty",
        "Shweta Mohan",
        "Arun K. Narayanan",
        "Vineeth Sreenivasan",
        "Vijay Yesudas"
    ],
    "miscellaneous": "Sarathvinu",
    "akas": [
        "Aaththiram (India, Tamil title)",
        "Extreme (World-wide, English title)",
        "Крайний случай (Russia)"
    ],
    "writer": "Roopesh Peethambaran",
    "director": "Roopesh Peethambaran",
    "production companies": "VCI Movies",
    "distributors": [
        "LJ Films",
        "Divo"
    ],
    "other companies": "AP International",
    "plot": [
        "A missing auto-rickshaw driver and unidentifiable mutilated body parts found at different places stir up an investigation revealing the history of the auto-rickshaw driver and his murderer.",
        "A wannabe musician seeks wild justice by plotting the perfect murder of the man who wronged him. A missing auto-rickshaw driver and unidentifiable mutilated body parts found at different leaves the Kerala Police dumbfounded.Parallel to the investigation the history of the murderer and the murdered are revealed.::A T C"
    ],
    "synopsis": "The Movie opens with a crime where a young man is beaten to death with a club in front of his fiance. Then comes an investigation officer Alexander (Sreenivasan), and an assistant Ramachandran (Vinay Forrt). Alexander unlike the assistant, is an officer who doesn't believe in torturing the accused people to prove crimes. Though he is a man who even fears to witness a live postmortem, he is intelligent enough to prove crimes. He proves this one too without much problems. Parallel to this, Harsha Vardhan (Dulquer Salmaan), a man of mystery, lives lonely in a big house, and teaches music to a girl named Sophie. He one day kidnaps and brings an auto driver (Anu Mohan) and tortures him in his house cellar covered with plastic. Alex and Ramachandran take up the case and upon investigation, Alex suspects Harsha. But Harsha turns out to be quick and swift before his suspicion turns into his belief. He kills the auto driver and then eradicates every single evidence which proved him guilty and revealed the identity of the driver. Once the severed parts are found, the case heats up further and Alex realizes that it's a well planned murder, only after he finds Harsha to have left the city without any notice.The story then moves four years back. Harsha, as an aspiring young musician, struggles not only in his career, but also in his life to maintain his relationship with his lover Maya. After getting married, both of them, with their two more friends, Nimmy (Riya Saira) and Dr. Roy (Vishnu Raghav) start living together. One day, May joins a call center and gets miffed with a driver on his careless driving. Harsha leaves for Chennai, after getting his break and while he's away, the driver murders his wife and buries her severed head to avoid suspicion. But Alex finds it out and the driver is imprisoned. Harsha gets devastated by the loss of Maya and gets furious upon finding that first of all, the driver was given life imprisonment instead of death penalty, and secondly, he got freed before time. He makes a plan along with his two friends to kill the driver. Nimmy starts using his auto and befriends him. One day, while going with him, Nimmy follows Harsha's plan and the driver takes her on a route through a forest, and she suddenly jumps out. In order to stop her from running, he jumps out but is held by Harsha. A fight takes place between them in which Harsha overpowers the driver and injects him to unconsciousness.Then in the present, Nimmy and Roy are shown watching news which proves the system's failure in finding out the dead body's identity and that the case would go on with further investigations. Upon being asked by Ramachandran about what was to be their next action, Alex smiles and replies that, \"It's not Jesus Christ who has died. It's Judas. He'll have to die\", after which he is accompanied by Ramachandran through his laughter, indicating that they won't disclose anything about Harsha."
}