{
    "id": "3431756",
    "localized title": "Rakhtbeej",
    "cast": [
        "Julia Datt",
        "Tinnu Anand",
        "Mansi Dovhal",
        "Sanjay Gagnani",
        "Jeeva",
        "Rajesh Khattar",
        "Maanas",
        "Jay Shanker Pandey"
    ],
    "genres": "Thriller",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:UA::(recommended rating)",
        "United States:Not Rated"
    ],
    "original air date": "25 May 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMWNkMmYyZTctNjliMC00YWJjLWI2OTAtMGM0ZjVjMWIyZjE5XkEyXkFqcGdeQXVyNDgzNDc2OTk@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "3431756",
    "plot outline": "Rakhtbeej is the story of two men, from two different generations. Even though their worlds are different their lives keep intersecting. Abhay Jatav from humble beginnings, ends up becoming the most dreaded dacoit in UP. Ajay also from humble beginings, becomes the CEO of Dabral Group of Industries, at a very young age. Abhay knows Sarita from a long time, and Sarita is in love with Abhay. But when a simple village girl Poonam enters Ahbay's life he totally forgets about Sarita. Sanjana, Dabral's daughter is in love with Ajay from a long time. But when supermodel Priya enters his life, he is blinded by her love. Abhay goes out of his way to help Maya Singh win the village elections. But Maya Singh later backstabs Abhay. Abhay loose his friends and those dear to him and this changes his fate forever. Ajay trusts Dharam, his competitor in business and love, but Dharam backstabs him. Abhay becomes a victim of Politics, Police and Dacoits, while Ajay is the victim of business rivalry. Even though these men are from different generations, their lives resemble each others. Just like Abhay, Ajay too has to choose between his friends, love, relationships and ambition. Is Ajay related to Abhay? Will he ever know? Just because their lives are similar, will they meet with a similar fate?",
    "languages": "Hindi",
    "title": "Rakhtbeej",
    "kind": "movie",
    "directors": "Anil Ballani",
    "writers": "Vidhaan Asrani",
    "producers": "Janeshwar Shukla",
    "composers": "Satish Ajay",
    "cinematographers": "Carlton D'Mello",
    "editors": "Manan Sagar",
    "editorial department": "Shakeel Khan",
    "make up department": "Ramesh Panda",
    "assistant directors": [
        "Daise Concessao",
        "Partha Pratim"
    ],
    "visual effects": "P. Mohan",
    "casting department": "Akanksha Nehra",
    "miscellaneous": "Himanshu Jhunjhunwala",
    "akas": "Rakhtbeej (India)",
    "writer": "Vidhaan Asrani",
    "director": "Anil Ballani",
    "production companies": "Om Sai Jyot Films",
    "distributors": [
        "Ultra Media & Entertainment",
        "Worldwide Records"
    ],
    "plot": "_Rakhtbeej_ (qv) is the story of two men, from two different generations. Even though their worlds are different their lives keep intersecting. Abhay Jatav from humble beginnings, ends up becoming the most dreaded dacoit in UP. Ajay also from humble beginings, becomes the CEO of Dabral Group of Industries, at a very young age. Abhay knows Sarita from a long time, and Sarita is in love with Abhay. But when a simple village girl Poonam enters Ahbay's life he totally forgets about Sarita. Sanjana, Dabral's daughter is in love with Ajay from a long time. But when supermodel Priya enters his life, he is blinded by her love. Abhay goes out of his way to help Maya Singh win the village elections. But Maya Singh later backstabs Abhay. Abhay loose his friends and those dear to him and this changes his fate forever. Ajay trusts Dharam, his competitor in business and love, but Dharam backstabs him. Abhay becomes a victim of Politics, Police and Dacoits, while Ajay is the victim of business rivalry. Even though these men are from different generations, their lives resemble each others. Just like Abhay, Ajay too has to choose between his friends, love, relationships and ambition. Is Ajay related to Abhay? Will he ever know? Just because their lives are similar, will they meet with a similar fate?"
}