{
    "id": "5954698",
    "localized title": "Oka Romantic Crime Katha",
    "cast": [
        "Fm Babai",
        "Gayatri",
        "Anil Kalyan",
        "Manoj Nandam",
        "Bugatha Satyanarayana",
        "Swapna",
        "Samudram Venkatesh",
        "Divya Vijju"
    ],
    "genres": "Crime",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color::(HD)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjNlZmQwM2YtNmEzNC00ZWNmLTgzODYtYWE3ZmQ3ODkwOTE2XkEyXkFqcGdeQXVyNjgyNTY1MjI@._V1_SY150_CR14,0,101,150_.jpg",
    "imdbID": "5954698",
    "plot outline": "Oka Romantic Crime Katha is a story of three girls Thanmai, Anju and Swapna, who happened to be friends in a bus stop , their common meeting point. Thanmai, youngest of the three falls in love with a boy who becomes a criminal to get her love. Other girls lives also take some drastic turns due to the men in their lives. What happened to those girls comprises the story.",
    "languages": "Telugu",
    "title": "Oka Romantic Crime Katha",
    "kind": "movie",
    "directors": "Suneel Kumar Reddy",
    "writers": "Suneel Kumar Reddy",
    "producers": [
        "Suneel Kumar Reddy",
        "Ravindra Babu Yakkali"
    ],
    "cinematographers": "Sabu James",
    "editors": "Sri Guha",
    "miscellaneous": "Pulagam Chinnarayana",
    "akas": "Oka Romantic Crime Katha (India)",
    "writer": "Suneel Kumar Reddy",
    "director": "Suneel Kumar Reddy",
    "production companies": "Sravya Films",
    "distributors": "Sravya Films",
    "plot": "_Oka Romantic Crime Katha_ (qv) is a story of three girls Thanmai, Anju and Swapna, who happened to be friends in a bus stop , their common meeting point. Thanmai, youngest of the three falls in love with a boy who becomes a criminal to get her love. Other girls lives also take some drastic turns due to the men in their lives. What happened to those girls comprises the story.",
    "synopsis": "Thanmai, Anju and Swapna are three friends who commute from the same bus stop.\nThanmai, youngest of the trio belongs to a middle class family. Her father's meager earnings are not sufficient to full fill her dreams.\nShe falls in love with an orphan who is pursuing his engineering course. He starts petty crimes to earn money in order to lead a luxurious life.Anju belongs to a rich family whose parents are busy earning money. They have little time for their daughter. She is desperate to be loved and changes many partners in pursuit of true love. She is used by men for their pleasure.She realizes that she became pregnant and wanted to get rid of it. Since she is a minor doctor's refuse to conduct abortion. A broker steps in and offers his help to terminate the pregnancy by a quack.\nThe trio had to arrange money for the procedure.\nThanmai asks her boyfriend to help. He arranges the money by a chain snatching.\nAfter completion of the abortion she wishes to meet her boyfriend in their usual meeting point.\nWhile he was waiting for her to come he finds a lonely woman with ornaments on her. He tries to steal from her but she protests. He kills her in the scuffle.\nThanmai reaches there and to her horror finds her boyfriend killing a hapless woman. After much deliberations and moral dilemmas, they both decide to continue crimes to fulfill their dreams.\nSwapna is trapped by her classmate in the name of love and he blackmails her that he would upload their intimate videos in social media. She commits suicide in a desperate situation.\nThe same guy films the intimate moments of Thanmai and her boyfriend and blackmails them that he would expose them. In a desperation to resolve the situation they kill him in cold blood.\nAs no crime can be concealed for long, even their crime gets exposed. They were arrested by police. There is a huge uproar in the society to eliminate them.\nPolice out of public pressure shoots them in a fake encounter.The film gained attention due to the unique promotion by the makers. It became a box office success and several films were made on the similar genre.A sequel to the film Oka criminal prema katha released in 2014 and the third edition of the series Romantic Criminals was released in the year 2019."
}