{
    "id": "6851536",
    "localized title": "Langar",
    "cast": [
        "Ravi Kale",
        "Manava Naik",
        "Kishori Shahane",
        "Milind Shinde",
        "Pankaj Vishnu"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2U2Y2E5MzAtMjMyZC00OWRiLThlYjMtYmY5MzEyZmI2NzExXkEyXkFqcGdeQXVyNzU4NzIyMDM@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "6851536",
    "languages": "Marathi",
    "title": "Langar",
    "kind": "movie",
    "directors": "Sandeep Naware",
    "writers": "Sandeep Naware",
    "producers": "Niharika Phadtare",
    "composers": "Mandar Khare",
    "cinematographers": "Surya Mishra",
    "editors": "Mandar Khare",
    "miscellaneous": "Ganesh Gargote",
    "akas": "Langar (India)",
    "writer": "Sandeep Naware",
    "director": "Sandeep Naware",
    "production companies": [
        "Everest Entertainment",
        "Niharika Films"
    ],
    "distributors": "Shree Ganesh Marketing and Films",
    "synopsis": "'Langar' is a Marathi film that projects the life of the Waghya Murli community in Maharashtra. The story is based on a book written by renowned social reformist, Anil Awchat. The film creates awareness about the exploitation, sorrow and traditions that prevail in the Waghya Murli community. The film throws light on injustice to children from a particular community in a village, where parents offer their children to God, just to keep their vows to God. One such girl Malan who is studying in school, is offered by her father (Vinay Apte) to the service of God, much against the wish of her mother (Kishori Shahane Vij), after she attains puberty. Malan is taken away by her maternal uncle Jagan (Ravi Kale), who is himself deserted by his parents to the service of God. Deeply hurt, Malan soon forgets her family and joins the group of her uncle, aunty and others, to perform at religious functions with their folk performances entertaining the families. Men in this group are called Vaghya and women folks are called Murali. So, when Malan grows up, she is identified as 'Murali' and has no right to marry, as she is offered to the God in marriage. But, when Malan meets Yashwant (Pankaj Vishnu), he proposes to her and promises to marry her soon. Malan crosses her limits against the wish of her uncle. Yashwant, who goes to city for some legal case, fails to return. Even her Uncle proceeds to other villages in search of work. When the uncle returns, he is criticized by the villagers and unable to bear the insults, he disappears one day. Yashwant does return back after six months; but, Malan refuses to marry him and drives him back. She takes over the business of her uncle and gives birth to her child. At the end of the film, which is actually the beginning, Malan is honoured by a Social activist, at a function held in a village, to boost her bold decision."
}