{
    "id": "0055882",
    "localized title": "Dada Thakur",
    "cast": [
        "Chhabi Biswas",
        "Biswajeet Chatterjee",
        "Sulata Chowdhury",
        "Tarun Kumar"
    ],
    "genres": [
        "Biography",
        "Drama"
    ],
    "runtimes": "153",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Black and White",
    "sound mix": "Mono",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmU0MThkZmMtNmE0ZC00ZWYyLTk4OGMtNzE3OTVkYzU0N2I2XkEyXkFqcGdeQXVyODI3NzgyOTk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0055882",
    "plot outline": "The film is based closely on the life of the real-life Dada Thakur, and was made in his lifetime. Dada Thakur (Chhabi Biswas) starts his career with a hand-operated press, with his wife as his assistant. Later he is joined by Nalini Kanta Sarkar, an underground freedom-fighter. Dada Thakur brings out the newspaper Jangipur Sangbad. He campaigns against social evils and earns the ire of the ruling classes. He saves a girl, Lata, from the unwanted advances of Darpanarayan (Biswajit Chatterjee), son of the local landholder. Lata joins the ranks of freedom fighters working with Sarkar. Subsequently, a reformed Darpanarayan too becomes an ardent follower of Dada Thakur and joins the struggle for India's freedom. Dada Thakur's greatest success is when he helps an ordinary man, a petty shopkeeper, get elected as the Municipal Commissioner of Jangipur.",
    "languages": "Bangla",
    "title": "Dada Thakur",
    "kind": "movie",
    "directors": "Sudhir Mukherjee",
    "akas": "Dada Thakur (India)",
    "director": "Sudhir Mukherjee",
    "plot": "The film is based closely on the life of the real-life _Dada Thakur_ (qv), and was made in his lifetime. _Dada Thakur_ (qv) (Chhabi Biswas) starts his career with a hand-operated press, with his wife as his assistant. Later he is joined by Nalini Kanta Sarkar, an underground freedom-fighter. _Dada Thakur_ (qv) brings out the newspaper Jangipur Sangbad. He campaigns against social evils and earns the ire of the ruling classes. He saves a girl, Lata, from the unwanted advances of Darpanarayan (Biswajit Chatterjee), son of the local landholder. Lata joins the ranks of freedom fighters working with Sarkar. Subsequently, a reformed Darpanarayan too becomes an ardent follower of _Dada Thakur_ (qv) and joins the struggle for India's freedom. _Dada Thakur_ (qv)'s greatest success is when he helps an ordinary man, a petty shopkeeper, get elected as the Municipal Commissioner of Jangipur.::iakhtar33380"
}