{
    "id": "0272607",
    "localized title": "Farz",
    "cast": [
        "Sunny Deol",
        "Preity Zinta",
        "Jackie Shroff",
        "Om Puri",
        "Pooja Batra",
        "Farida Jalal",
        "Johny Lever",
        "Karan Raj Kanwar",
        "Aliya Khan",
        "Omkaar",
        "Ishwar Patel",
        "Achyut Potdar",
        "Dara Singh",
        "Mukesh Tiwari"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "DTS",
    "certificates": [
        "India:A",
        "United Kingdom:15"
    ],
    "original air date": "12 Jan 2001 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTI3ZjQzMmItMTFlNy00MzAyLWIwYmQtZmYwZDg1MmMyODdhXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0272607",
    "plot outline": "ACP Arjun Singh and his brother-in-law, Tayaji are with the police force but when Tayaji is killed on duty Arjun's family are devastated by his death. His wife Rukmani, daughter Kajal and son Rahul are shattered by his death and soon Arjun is fearful that the same person that killed his brother-in-law will come after him or his family. His new partner, Karan Singh is quite controversial in his methods of getting justice and can at time break the rules. Arjun is also angered about the fact that his daughter has developed a crush for Karan. Soon the city is being terrorized by Gawa Firozi and his brother Sikander. The two officers have to work together to capture and stop them.",
    "languages": "Hindi",
    "title": "Farz",
    "kind": "movie",
    "directors": "Raj Kanwar",
    "writers": "Sutanu Gupta",
    "producers": [
        "N.R. Pachisia",
        "Suniel S. Saini"
    ],
    "composers": "Uttam Singh",
    "cinematographers": "Ishwar Bidri",
    "editors": "Kuldip K. Mehan",
    "sound department": [
        "Vijay Angre",
        "Vikram Biswas",
        "Baylon Fonseca",
        "Suraj Jaisingh",
        "Naeem Shaikh",
        "Karnail Singh"
    ],
    "visual effects": [
        "Amit Bhandari",
        "Govardhan Vigraham"
    ],
    "stunts": [
        "James Barla",
        "Devidas Chippa"
    ],
    "camera department": [
        "Sanjeev Bidri",
        "Mohan B Varma",
        "Sureshchandra J. Yadav"
    ],
    "music department": [
        "Sunidhi Chauhan",
        "Anupama Deshpande",
        "Krishnakumar Kunnath",
        "Ram Lalwani",
        "Lata Mangeshkar",
        "Udit Narayan",
        "Sonu Nigam",
        "Anuradha Paudwal",
        "Sameer",
        "Richa Sharma",
        "Alka Yagnik"
    ],
    "writer": "Sutanu Gupta",
    "director": "Raj Kanwar",
    "distributors": [
        "Eros Worldwide",
        "Spark Worldwide"
    ],
    "plot": [
        "ACP Arjun Singh and his brother-in-law, Tayaji are with the police force but when Tayaji is assassinated on duty Arjun's family feels devastated by his death. Soon, Gawa Firozi and his brother Sikander start to terrorize the city.",
        "ACP Arjun Singh and his brother-in-law, Tayaji are with the police force but when Tayaji is killed on duty Arjun's family are devastated by his death. His wife Rukmani, daughter Kajal and son Rahul are shattered by his death and soon Arjun is fearful that the same person that killed his brother-in-law will come after him or his family. His new partner, Karan Singh is quite controversial in his methods of getting justice and can at time break the rules. Arjun is also angered about the fact that his daughter has developed a crush for Karan. Soon the city is being terrorized by Gawa Firozi and his brother Sikander. The two officers have to work together to capture and stop them.::gavin@sunny_deol2009@yahoo.com",
        "After ACP Arjun Singh's assistant Tayaji is killed in a blast by one of Criminal Gawa Firozi's bomb; the Indian police force decides to replace him with a Punjabi police officer Karan Singh. Karan Singh ways of breaking the law to bring criminals to justice are unacceptable to Arjun but he is forced to do otherwise especially when Karan arrests and kill the younger brother of Gawa, Sikandar. Karan is then promoted to Deputy Commissioner of Police and he gets married to Arjun's daughter Kajal. Shortly after Karan is abducted by Gawa but makes a drastic escape; after this he will find that he and his wife life are not the same anymore.::gavin (racktoo@hotmail.com)",
        "ACP Arjun Singh and his brother-in-law, Tayaji are honest and diligent police inspectors. Arjun Singh lives with his wife, Rukmani, a daughter, Kajal, and a son, Rahul. While on duty, Tayaji is killed while protecting a politician. This devastates Arjun Singh and all of family. Arjun Singh becomes fearful for his life, as he only has a few more years of duty before he retires. His worries increase when he is paired with a daredevil partner from Punjab Police, Karan Singh, who is known for breaking rules to bring criminals to justice. To make matters worse, Arjun finds that his daughter has a crush on Karan. He absolutely refuses to permit his daughter to meet with Karan as he wants her to marry someone outside of the police force. Meanwhile, the city is being terrorized by Gawa Firozi, and his brother Sikander. Both Karan and Arjun must act in their own way to protect the people, risking their own lives.::rAjOo (gunwanti@hotmail.com)"
    ]
}