{
    "id": "0292490",
    "localized title": "Dil Chahta Hai",
    "cast": [
        "Aamir Khan",
        "Saif Ali Khan",
        "Akshaye Khanna",
        "Preity Zinta",
        "Sonali Kulkarni",
        "Dimple Kapadia",
        "Ayub Khan",
        "Rajat Kapoor",
        "Suhasini Mulay",
        "Ahmed Khan",
        "Suchitra Pillai",
        "Anjula Bedi",
        "Rakesh Pandey",
        "Samantha Tremayne",
        "Claire",
        "Clarence",
        "Asad Dadarkar",
        "Bomi Doctor",
        "Beatrice Gibson",
        "Kannu Gill",
        "Yusuf Hussain",
        "Rio Kapadia",
        "Simran Makhija",
        "Deepak Malhotra",
        "Shail Mehta",
        "Sarah Neilson",
        "Shaina",
        "Shilpa",
        "Anand Subaya",
        "Mandala Tayde",
        "Meenakshi Verma",
        "Gordon Waddell",
        "Kerry Casey",
        "Kiran Rao"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "183",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "DTS",
        "Dolby Digital"
    ],
    "certificates": [
        "Argentina:Atp",
        "Australia:G",
        "Brazil:Livre",
        "Bulgaria:B",
        "Chile:TE",
        "Colombia:T",
        "Czechia:U",
        "Denmark:A",
        "Finland:S",
        "France:Tous publics",
        "Germany:0",
        "Greece:K",
        "Hong Kong:I",
        "Hungary:KN",
        "Iceland:L",
        "India:Unrated",
        "India:U",
        "Ireland:G",
        "Italy:T",
        "Japan:G",
        "Lithuania:V",
        "Malaysia:U",
        "Malta:U",
        "Mexico:A",
        "New Zealand:PG",
        "Nigeria:G",
        "Norway:A",
        "Peru:Apt",
        "Philippines:G",
        "Portugal:M/6",
        "Romania:A.G.",
        "Russia:0+",
        "Saudi Arabia:G",
        "Singapore:PG",
        "South Africa:A",
        "South Korea:All",
        "Spain:A",
        "Sweden:Btl",
        "Taiwan:G",
        "Thailand:G",
        "Turkey:G",
        "United Kingdom:PG",
        "United States:Not Rated",
        "Ukraine:ZA",
        "Vietnam:P"
    ],
    "original air date": "10 Aug 2001 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjRjMTYwMTYtMmRkNi00MmVkLWE0MjQtNmM3YjI0NWFhZDNmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0292490",
    "plot outline": "Three young men Akash, Sameer, and Siddharth are close friends, but their tastes and characters are completely incompatible. So when Siddharth falls in love with a much older woman, Tara, a woman who has been unsuccessful in keeping her marriage intact as well as alcohol-dependent, widens the rift between the trio, forcing them to part company. Years later, the trio will be re-united, they will be much mature and understanding, but will they still accept Siddharth love for Tara, especially when they themselves have fallen in love with women around their respective ages?",
    "languages": "Hindi",
    "title": "Dil Chahta Hai",
    "kind": "movie",
    "directors": "Farhan Akhtar",
    "writers": [
        "Kassim Jagmagia",
        "",
        "Farhan Akhtar",
        "",
        "Farhan Akhtar",
        "",
        "Farhan Akhtar",
        "",
        "Karan Vishwanath Kashyap",
        "",
        "Karan Kashyap"
    ],
    "producers": [
        "Farhan Akhtar",
        "Ritesh Sidhwani",
        "Pravin Talreja"
    ],
    "composers": [
        "Shankar Mahadevan",
        "Loy Mendonsa",
        "Ehsaan Noorani"
    ],
    "cinematographers": "Ravi K. Chandran",
    "editors": "A. Sreekar Prasad",
    "casting directors": "Zoya Akhtar",
    "production designers": "Suzanne Caplan Merwanji",
    "art directors": [
        "Kiran Khanna",
        "Yunus Pathan"
    ],
    "set decorators": "Chetana Prabhu",
    "costume designers": "Arjun Bhasin",
    "make up department": [
        "Avan Contractor",
        "Tanuja Dabir"
    ],
    "production managers": [
        "Harish Amin",
        "Inderjit Chadha",
        "Lachlan Imrie"
    ],
    "assistant directors": [
        "Zoya Akhtar",
        "Renu Bhagnani Dutt",
        "Tina Havelock Stevens",
        "Lachlan Imrie",
        "Reema Kagti",
        "Anshul Pandey"
    ],
    "art department": "Dhananjay Thorat",
    "sound department": [
        "Royston D'Lima",
        "Ajith Abraham George",
        "Stephen Gomes",
        "Nakul Kamte",
        "Ashraf Khan",
        "Sreejesh",
        "H. Sridhar"
    ],
    "visual effects": [
        "Ronojoy Chatterji",
        "Binny Padda",
        "Ravi Padda",
        "Naveen Shukla",
        "Ashwin Singh"
    ],
    "stunts": [
        "Spike Cherrie",
        "Javed Karim",
        "Gordon Waddell"
    ],
    "camera department": [
        "Arjun Singh Bhurji",
        "Franc Biffone",
        "Ayananka Bose",
        "Chris Davies",
        "Mulchand Dedhia",
        "B.V. Ravi Kiran",
        "Hardeep Sachdev",
        "Sanjay Sami",
        "Steve Byron"
    ],
    "costume departmen": "Urmila Motwani",
    "location management": "Nitin Chandrachud",
    "music department": [
        "Javed Akhtar",
        "Kavita Krishnamurthy",
        "Krishnakumar Kunnath",
        "Shankar Mahadevan",
        "Srinivas Murthy",
        "Udit Narayan",
        "Sonu Nigam",
        "Annu Poojari",
        "Shaan",
        "Srinivas",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Simrit Brar",
        "Ritchie Burton",
        "K. Gangadharan",
        "Ajit Gupta",
        "Jaswant Singh Hinduja",
        "Kassim Jagmagia",
        "Farah Khan",
        "Anshul Pandey",
        "Bimal Parekh",
        "Tejal Patni",
        "Chandan Sidhwani",
        "Ritesh Sidhwani"
    ],
    "thanks": [
        "Jivesh Bhojwani",
        "Steesha Bhojwani",
        "Deepti Datt",
        "Leela Kempinski",
        "Anupam Sharma"
    ],
    "akas": [
        "D.C.H. (India, English title)",
        "दिल चाहता है (India, Hindi title)",
        "What the Heart Wants (United States)",
        "Do Your Thing (United States)",
        "رغبات القلب (United Arab Emirates)"
    ],
    "writer": [
        "Kassim Jagmagia",
        "Farhan Akhtar",
        "Farhan Akhtar"
    ],
    "director": "Farhan Akhtar",
    "production companies": "Excel Entertainment",
    "distributors": [
        "Eros Worldwide",
        "Spark Worldwide",
        "Star Plus"
    ],
    "special effects": "Beeps",
    "other companies": [
        "Airports Authority of India, Mumbai",
        "Australian Consulate General (I)",
        "Bimal Parekh & Co.",
        "Buzz",
        "Deutsche Bank",
        "Films & Casting Temple Pvt. Ltd. Sydney",
        "Glamour Design Studio",
        "Juice Hair",
        "Light & Grips Equipment Hirers India",
        "Media Artists",
        "Prasad Film Laboratories P. Ltd.",
        "Prasad Studios, Chennai",
        "Qantas Airways",
        "Saraswat Co-operative Bank",
        "T-Series",
        "Taj Holiday Village, Goa",
        "United India Insurance Co. Ltd. (I)"
    ],
    "plot": [
        "Three inseparable childhood friends are just out of college. Nothing comes between them - until they each fall in love, and their wildly different approaches to relationships creates tension.",
        "Three young men Akash, Sameer, and Siddharth are close friends, but their tastes and characters are completely incompatible. So when Siddharth falls in love with a much older woman, Tara, a woman who has been unsuccessful in keeping her marriage intact as well as alcohol-dependent, widens the rift between the trio, forcing them to part company. Years later, the trio will be re-united, they will be much mature and understanding, but will they still accept Siddharth love for Tara, especially when they themselves have fallen in love with women around their respective ages?::Sonia",
        "'_Dil Chahta Hai_ (qv)' is the story of three friends - Akash is fun-loving, non-believer in love. Sameer is always \"ready\" for love-but does not know its true meaning. Siddharth is the more serious of the trio. He is sensitive, understanding, caring ... in short the perfect man for any girl. He falls in love with a middle-aged, slightly alcoholic divorcée Tara Jaiswal. Akash cannot understand this relationship and when he insults Siddharth's true love, Siddharth slaps him. This causes a rift between both and they go their separate ways. Subsequently Akash too realizes the meaning of true love when the vivacious, bubbly Shalini comes in his life. Same happens with Sameer when he meets Pooja. So finally we get to see how these boys become men.::Soumitra",
        "Three young men name Akash, Sameer, and Siddharth are close friends, but their tastes and characters are completely incompatible. Akash is fun-loving, non-believer in love. Sameer is always \"ready\" for love-but does not know its true meaning. Siddharth is the more serious of the trio. He is sensitive, understanding, caring - in short the perfect man for any girl. So when Siddharth falls in love with a much older woman, Tara, a woman who has been unsuccessful in keeping her marriage intact as well as alcohol-dependent, widens the rift between the trio, forcing them to part company. Years later, the trio will be re-united, they will be much mature and understanding, but will they still accept Siddharth love for Tara, especially when they themselves have fallen in love with women around their respective ages? They all believe that they are mature men now and must think maturely.::gavin@sunny_deol2009@yahoo.com",
        "The film is about three distinct characters, Akash, Sameer and Siddharth, their individual relationships and the effect that these relationships have on them. Love. One term that can hold different meanings even for close friends like Akash, Sameer and Siddharth. Welcome to a summer of their lives. So you have Akash, who has been sent by his parents to live in Sydney, he does not believe in the concept of love. Two weeks is all that he is willing to give a perfectly healthy relationship. Incidentally, he feels even two weeks is a bit too much! Sameer, like a lot of us, is in love with the idea of being in love. He wants to be in love. But Sameer has not quite understood the concept yet and tends to wear his heart on his sleeve. So this young man is looking for the perfect woman in his life... The most mature, sensitive and understanding of these three is Siddharth. Sid, as he is fondly called, seems to know the true meaning of life. According to his friends, neighbors and even the dogs, Siddharth knows it all. The women who come and change their lives are Shalini and Tara Jaiswal.::Anonymous",
        "This movie is entwined with the lives of three friends Akash Malhotra (Aamir Khan), Sameer (Saif Ali Khan), and Siddharth Sinha (Akshaye Khanna). Although their thinking and lifestyle is the same, they prove to be three very different individuals. Akash, who has been sent to live in Sydney, by his parents, does not believe in love and is experiencing romantic upheaval, but an impulsive action lands him a black eye and makes him consider having a life with the beautiful Shalini (Priety Zinta) when he sees her on the flight to Sydney, who is engaged to the charming and handsome Rohit (Ayub Khan). Sameer is a romantic, who will fall in love instantaneously, usually to have his heart broken and his valuables stolen. Sameer's parents want him to marry pretty Pooja (Sonali Kulkarni), but Sameer refuses to marry Pooja, when he learns that Pooja is in love with someone else; at the same time Sameer starts to fall in love with Pooja himself. And Siddharth is an artist, and gets attracted to a much older woman, Tara Jaiswal (Dimple Kapadia), who is also a divorcee, a mother, as well an alcoholic. Tara and Siddharth share the same artistic tendencies.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Akash, Sameer, and Sid have just graduated from college and take a trip to Goa to celebrate. At a scenic spot by the sea, they relax and vow to return there every year. Only Sid is skeptical that they will remain friends once life takes over. On their return, Sameer is arranged by his parents to marry Pooja, his parents' friends' daughter, while Akash's parents ask him to manage the family business in Sydney. Around the same time, Sid meets a new neighbor, Tara (a divorcee and much older than Sid) who lives alone and whom he helps to move in. Soon, two of the friends have fallen in love: Sameer with Pooja and Sid with Tara. Tara receives a distressing call from her ex-husband on her birthday. To cheer her up, Sid takes her out to celebrate with Akash and Sameer. After dropping her on the way back, he tells his friends that he loves her. Akash makes a disparaging remark about Tara's age, causing Sid to slap him. Akash and Sameer are both shocked, and the former leaves the night with anger.Sid leaves the town, and Akash departs for Sydney. On the flight, he runs into Shalini, a one-time acquaintance from college who agrees to show him around Sydney while there. Meanwhile, Sameer waits for Pooja to dump her much-disciplined boyfriend Subodh and eventually asks her out. Tara walks in on Sid telling his mother about his feelings and does not wish to talk with him for believing a relationship between them is possible. In Sydney, Akash is having a change of heart by falling in love with Shalini. Shalini, however, is engaged and returns to India to marry Rohit. The heartbroken Akash is asked to return home by his father. Encouraged by those around him and Shalini's uncle Mahesh, he talks to Shalini on the eve of her wedding and proposes to her. Shalini is conflicted by loyalty to Rohit's parents, who raised her after the death of her parents. Rohit's parents ask her to listen to her heart and marry Akash instead.In the present day, Sid finds Tara in an advanced stage of cirrhosis. He rushes to the hospital, but she passes away while still talking to him. Sid is devastated, but the night gave him the chance to reunite with Sameer and reconcile with Akash. Six months later, the friends return to Goa as promised, accompanied by Shalini and Pooja. At their picnic spot from earlier, Sid sees a woman in the distance who smiles at him. He approaches her and the film ends with the three couples enjoying dinner together at a restaurant."
}