{
    "id": "0302524",
    "localized title": "Ehsaas: The Feeling",
    "cast": [
        "Suniel Shetty",
        "Shabana Raza",
        "Kirron Kher",
        "Mahesh Manjrekar",
        "Rakhi Sawant",
        "Mayank Tandon",
        "Shakti Kapoor",
        "Anand Raj Anand",
        "Sunidhi Chauhan",
        "Nagesh Haldankar",
        "Kishore Nandlaskar",
        "Sanjay Narvekar",
        "Shivaji Satam",
        "Bhaskar Shetty",
        "Neeta Thakkar"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "116",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "United Kingdom:U",
        "United States:Not Rated"
    ],
    "original air date": "30 Nov 2001 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDFkYTI1ZDgtOGJhZS00MGFiLTkyNmEtMDc5NWNmNjQ4YTk3XkEyXkFqcGdeQXVyMjU4NDY1ODA@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "0302524",
    "plot outline": "Ravi Naik lives a middle-class life with his son Rohan in the country of India. He brings up his son in such strict, quiet, and disciplined atmosphere that his son starts to resent him and his mannerisms. All Ravi wants is to get Rohan to excel as an athlete and win the forthcoming athletic event, but Rohan goes through a series of operations that lead him to sustain injuries in his body, but Ravi is still bent on Rohan winning the race, so he makes him practice day and night. His immediate neighbors, Antra Pandit and her mom, are critical of the way Ravi handles his son and suggest that he adapt a more lenient view. But Ravi ignores this advice and assure to anyone interfering that the end result of his art of teaching will be good.",
    "languages": "Hindi",
    "title": "Ehsaas: The Feeling",
    "kind": "movie",
    "directors": "Mahesh Manjrekar",
    "writers": "Deepak Kulkarni",
    "producers": [
        "Pravin Shah",
        "Asif Shaikh"
    ],
    "composers": [
        "Anand Raj Anand",
        "Prajwal Anand",
        "Milind Sagar"
    ],
    "cinematographers": "Vijay Kumar Arora",
    "production designers": "Nitin Chandrakant Desai",
    "assistant directors": "Raminder Singh Suri",
    "art department": "Rajkishor Choudhary",
    "sound department": [
        "Rajendra Hegde",
        "Ajay Kumar P.B."
    ],
    "camera department": [
        "Sartaj Khan",
        "Rajeev Shrivastava"
    ],
    "music department": "Sunidhi Chauhan",
    "miscellaneous": "Remo D'Souza",
    "akas": "Ehsaas: The Feeling (India)",
    "writer": "Deepak Kulkarni",
    "director": "Mahesh Manjrekar",
    "plot": [
        "Ravi Naik lives a middle-class life with his son Rohan in the country of India. He brings up his son in such strict, quiet, and disciplined atmosphere that his son starts to resent him and his mannerisms. All Ravi wants is to get Rohan to excel as an athlete and win the forthcoming athletic event, but Rohan goes through a series of operations that lead him to sustain injuries in his body, but Ravi is still bent on Rohan winning the race, so he makes him practice day and night. His immediate neighbors, Antra Pandit and her mom, are critical of the way Ravi handles his son and suggest that he adapt a more lenient view. But Ravi ignores this advice and assure to anyone interfering that the end result of his art of teaching will be good.::gavin@sunny_deol2009@yahoo.com",
        "International athlete Ravi Naik's career fades because of his negligence. After his wife Aditi's death he single-handedly brings up their son Rohan in a disciplinary atmosphere so that Rohan can put in the best of efforts in qualifying himself to become the world's best athlete at the final competition--only to learn that Rohan is slowly drifting apart from him due to his mannerisms.::gavin (racktoo@hotmail.com)",
        "Ravi is a widower living with his son Rohan, whom he brings up strictly and trains strenuously to become a good athlete. Rohan hates Ravi for his strictness but is very close to their neighbor Antra, a widow who lives with her mother. These neighbors feel that Ravi shouldn't be so strict with Rohan. A few days before an athletic event, Rohan fractures his leg and can't take part, and Ravi savagely beats him for being so careless and nullifying all Ravi's efforts to train him. Antra and her mother along with other neighbors console Ravi which is when he tells his strict behavior to Rohan was because Ravi was a good athlete during his college days and had reached the finals, but a day before the finals a car knocked down him and his friends. Ravi got saved but the accident left him partly lame and unable to play the sport, so he wanted Rohan to achieve the success which he could not. Will Rohan do something to fulfill his father's dreams?::alex.mjacko@gmail.com",
        "After his wife Aditi's death, Ravi Naik (Sunil Shetty) must look after his only child--son Rohan--on his own. He brings him up in such a very strict, disciplined atmosphere that his son starts to resent him and his ways. His immediate neighbors, Antra Pandit (Neha) and her mom (Kirron Kher) are critical of the way Ravi handles his son, and suggest that he adapt a more lenient view. But Ravi ignores this advice. All he wants is for Rohan to excel as an athlete and win the forthcoming athletics event.::rAjOo (gunwanti@hotmail.com)"
    ]
}