{
    "id": "0362204",
    "localized title": "Supari",
    "cast": [
        "Nandita Das",
        "Uday Chopra",
        "Rahul Dev",
        "Purab Kohli",
        "Akashdeep Saigal",
        "Nauheed Cyrusi",
        "Vineesha Arora-Sarin",
        "Irrfan Khan",
        "Sanjay Batra",
        "Parmita Katkar",
        "Manipal Reddy",
        "Ajai Rohilla",
        "Supriya Karnik"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "runtimes": "142",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "20 Jun 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMWQ5NzExN2YtMTg0Yy00N2UxLTlmYWUtOWM3ODU0YzFjM2YxXkEyXkFqcGdeQXVyNTEyOTE5Mjc@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "0362204",
    "plot outline": "Aryan Pandit lives a middle-class lifestyle with his family in Nasik, India, where the entire family depend on his salesman dad's earnings. He re-locates to Bombay's St. Andrews College, has big dreams of being wealthy and driving a red Ferrari. He befriends 3 other middle-classed youth, Papad, Mushy, and Chicken. He borrows money from Matka Rajan, gambles it, loses everything, is unable to re-pay, and as a result Rajan sets his goons on him. He goes to a man named Baba for help, who in turn takes him to a Mamta Shekari, who offers to hire him as a hit man, agrees to pay him Twenty thousand Rupees for every killing, so that he can re-pay his gambling loan. Aryan reluctantly accepts, is trained by Baba to shoot a gun, and kills his first target, none other than Rajan himself. He tells his friends about his good fortune, and they too join forces with him. In all killing contracts they are provided with a photograph, the location, and are instructed to look at the photo just 15 minutes before killing the person. In this manner the friends' enjoy their new-found wealth. When Aryan's Parsi girlfriend, Dilnawaaz finds out, she wants him to quit, which he does, but his friends refuse to let go of this easy life and money. Shortly thereafter, the trio are given a contract, the location is Bhuleshwar, and shortly before the killing they look at the photograph - the photo is none other than that of Aryan. And the trio know that it is too late to back out of this particular Supari (Contract killing).",
    "languages": "Hindi",
    "title": "Supari",
    "kind": "movie",
    "directors": "Padam Kumar",
    "writers": [
        "Padam Kumar",
        "",
        "Atul Sabharwal",
        "",
        "Mushtaq Sheikh",
        "",
        "Sutapa Sikdar",
        "",
        "Anuradha Tiwari"
    ],
    "producers": [
        "Krishan Arora",
        "Meenu Aroraa",
        "Padam Kumar",
        "Rajat Nayyar"
    ],
    "composers": [
        "Vishal Dadlani",
        "Shekhar Ravjiani"
    ],
    "cinematographers": [
        "T. Ramji",
        "Velraj"
    ],
    "editors": "Sanjay Verma",
    "art directors": [
        "Pramod Guruji",
        "Vinod Guruji"
    ],
    "costume designers": "Ashley Rebello",
    "production managers": "Neeraj Maini",
    "assistant directors": [
        "Purnendu Chandra Paanda",
        "Shumandeb",
        "Manoj Shidheshwari Tiwari"
    ],
    "sound department": [
        "Alok De",
        "Rakesh Ranjan"
    ],
    "special effects": "SatyandraTyagi",
    "visual effects": [
        "Avik Banerjee",
        "Sarika Salian"
    ],
    "stunts": "Raam Shetty",
    "music department": [
        "Javed Akhtar",
        "Sunidhi Chauhan",
        "Vishal Dadlani",
        "Makrand Deshpande",
        "Hariharan",
        "Mahalakshmi Iyer",
        "Krishnakumar Kunnath",
        "Shekhar Ravjiani",
        "Sukhwinder Singh"
    ],
    "miscellaneous": [
        "Fayyaz Badruddin",
        "Sahdev Ghei",
        "Farah Khan",
        "Rajesh Malhotra",
        "Rekha Prakash"
    ],
    "akas": "Supari (India)",
    "writer": [
        "Padam Kumar",
        "Atul Sabharwal",
        "Mushtaq Sheikh"
    ],
    "director": "Padam Kumar",
    "production companies": "Lionheart Production House",
    "distributors": [
        "Worldwide Entertainment Group (WEG)",
        "Yash Raj Films"
    ],
    "plot": [
        "Four friends are embroiled in Mumbai underworld and ends up becoming killers. However they succeed in their criminal tasks but soon realizes that they have to pay a heavy price for their deeds.",
        "Aryan Pandit lives a middle-class lifestyle with his family in Nasik, India, where the entire family depend on his salesman dad's earnings. He re-locates to Bombay's St. Andrews College, has big dreams of being wealthy and driving a red Ferrari. He befriends 3 other middle-classed youth, Papad, Mushy, and Chicken. He borrows money from Matka Rajan, gambles it, loses everything, is unable to re-pay, and as a result Rajan sets his goons on him. He goes to a man named Baba for help, who in turn takes him to a Mamta Shekari, who offers to hire him as a hit man, agrees to pay him Twenty thousand Rupees for every killing, so that he can re-pay his gambling loan. Aryan reluctantly accepts, is trained by Baba to shoot a gun, and kills his first target, none other than Rajan himself. He tells his friends about his good fortune, and they too join forces with him. In all killing contracts they are provided with a photograph, the location, and are instructed to look at the photo just 15 minutes before killing the person. In this manner the friends' enjoy their new-found wealth. When Aryan's Parsi girlfriend, Dilnawaaz finds out, she wants him to quit, which he does, but his friends refuse to let go of this easy life and money. Shortly thereafter, the trio are given a contract, the location is Bhuleshwar, and shortly before the killing they look at the photograph - the photo is none other than that of Aryan. And the trio know that it is too late to back out of this particular _Supari_ (qv) (Contract killing).::rAjOo (gunwanti@hotmail.com)"
    ]
}