{
    "id": "14741550",
    "localized title": "Yuvaraja",
    "cast": [
        "Bhavna Pani",
        "Lisa Ray",
        "Shivarajkumar"
    ],
    "genres": "Drama",
    "runtimes": "147",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "02 Nov 2001 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWFmODRmM2UtMjA4OS00NmQ1LTk1NjEtN2MwNDJlMzY0NWFjXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR27,0,101,150_.jpg",
    "imdbID": "14741550",
    "plot outline": "Raju alias Yuvaraja is the youngest son of a family and a careless guy, always going around girls and enjoying with them. His womanizing habits are a source of heartburn for his father. However, his elder brother Chakri is a kickboxer and his father's favourite son, who is very fond of him. Janu, Yuvaraja's neighbour, is in love with him, but it is just one sided as Raju considers her a good friend and a source of money and cars to impress girls (Janu's father is a garage owner). He falls in love with Lovely, a rich girl, and poses as a rich guy to impress her. However, she soon finds out that Raju has lied to her. Lovely dumps Yuvaraja and insults him in front of his father. Raju's father, tired of his son's antics, kicks him out of the house and shuns him. Later, Chakri is attacked by his enemies and is bedridden, unable to take part in the kickboxing championship. Raju decides to fight for his brother and to redeem himself in his father's eyes by fighting in the championship match against Rohith, who happens to be Lovely's new boyfriend and the leader of the goons who beat Vetri earlier. Deciding to seek revenge for his brother's accident and to prove himself to his father, Yuvaraja defeats Rohith, redeems himself in front of his father's eyes and finally accepts Janu's love. Hence the film ends with a happy ending, and everyone greets Raju as Yuvaraja.",
    "languages": "Kannada",
    "title": "Yuvaraja",
    "kind": "movie",
    "directors": "Puri Jagannadh",
    "writers": "M.S. Ramesh",
    "producers": "R. Srinivas",
    "composers": "Ramana Gogula",
    "akas": "Yuvaraja (India)",
    "writer": "M.S. Ramesh",
    "director": "Puri Jagannadh",
    "production companies": "R S Productions",
    "plot": "Raju alias _Yuvaraja_ (qv) is the youngest son of a family and a careless guy, always going around girls and enjoying with them. His womanizing habits are a source of heartburn for his father. However, his elder brother Chakri is a kickboxer and his father's favourite son, who is very fond of him. Janu, _Yuvaraja_ (qv)'s neighbour, is in love with him, but it is just one sided as Raju considers her a good friend and a source of money and cars to impress girls (Janu's father is a garage owner). He falls in love with Lovely, a rich girl, and poses as a rich guy to impress her. However, she soon finds out that Raju has lied to her. Lovely dumps _Yuvaraja_ (qv) and insults him in front of his father. Raju's father, tired of his son's antics, kicks him out of the house and shuns him. Later, Chakri is attacked by his enemies and is bedridden, unable to take part in the kickboxing championship. Raju decides to fight for his brother and to redeem himself in his father's eyes by fighting in the championship match against Rohith, who happens to be Lovely's new boyfriend and the leader of the goons who beat Vetri earlier. Deciding to seek revenge for his brother's accident and to prove himself to his father, _Yuvaraja_ (qv) defeats Rohith, redeems himself in front of his father's eyes and finally accepts Janu's love. Hence the film ends with a happy ending, and everyone greets Raju as _Yuvaraja_ (qv)."
}