{
    "id": "9778022",
    "localized title": "Abhay",
    "cast": [
        "Kunal Khemu",
        "Elnaaz Norouzi",
        "Ram Kapoor",
        "Asha Negi",
        "Nidhi Singh",
        "Sandeepa Dhar",
        "Rituraj Singh",
        "Manini Mishra",
        "Namit Das",
        "Harjinder Singh",
        "Mukesh Rishi",
        "Raghav Juyal",
        "Prashant Narayanan",
        "Indraneil Sengupta",
        "Harsh Mayar",
        "Sanket Ranadive",
        "Anshuman Jha",
        "Deepak Tijori",
        "Bidita Bag",
        "Chunky Pandey",
        "Asheema Vardaan",
        "Anupriya Goenka",
        "Kiran Juneja",
        "Yashashri Masurkar",
        "Priyal Gor",
        "Manraj Singh",
        "Aayam Mehta",
        "Naved Aslam",
        "Richa Pallod",
        "Gopal Singh",
        "Nitesh Pandey",
        "Ivan Rodrigues",
        "Puneet Shukla",
        "Rahul Tarar",
        "Shubhankar Das",
        "Mayankvishwakarma",
        "Ashish Mahale"
    ],
    "genres": [
        "Crime",
        "Thriller"
    ],
    "runtimes": "35",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(HD)",
    "certificates": "India:U::(self-applied)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTllZWE5ZGQtNTFmNS00NGZiLTlkZDktOWZmNmU3ZmRhNWRjXkEyXkFqcGdeQXVyMTIzMzg0MTM2._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "9778022",
    "plot outline": "Abhay is a ZEE5 Original starring Kunal Kemmu, Ram Kapoor, Deepak Tijori, Elnaaz Norouzi, Rituraj Singh, Maninee Mishra, Sandeepa Dhar and Gopal Singh. Inspired by true events, the crime thriller revolves around Abhay Pratap Singh, a sharp investigating officer with the mind of a criminal, who can go to any extent to solve a case. Join Abhay as he sets out in the dark gruesome world of crime to save innocent lives, while dealing with his own personal demons.",
    "languages": "Hindi",
    "title": "Abhay",
    "kind": "tv series",
    "series years": "2019-",
    "akas": [
        "Abhay 2 (Germany)",
        "Abhay 2",
        "Абхай (Russia)"
    ],
    "seasons": [
        "1",
        "2"
    ],
    "writer": [
        "Srinivas Abrol",
        "Christabelle D'Souza",
        "Christabelle D'Souza"
    ],
    "production companies": [
        "Fiction Factory Productions",
        "Firefly Productions",
        "Zee5"
    ],
    "distributors": [
        "Zee5",
        "Zee5"
    ],
    "plot": [
        "_Abhay_ (qv) Pratap Singh, the gutsy cop who can outwit any criminal, is back. Only this time, he is up against some sharper and hardened evil masterminds. Join him as he sets out on the road to justice with a darker and edgier.",
        "_Abhay_ (qv) is a ZEE5 Original starring Kunal Kemmu, Ram Kapoor, Deepak Tijori, Elnaaz Norouzi, Rituraj Singh, Maninee Mishra, Sandeepa Dhar and Gopal Singh. Inspired by true events, the crime thriller revolves around _Abhay_ (qv) Pratap Singh, a sharp investigating officer with the mind of a criminal, who can go to any extent to solve a case. Join _Abhay_ (qv) as he sets out in the dark gruesome world of crime to save innocent lives, while dealing with his own personal demons."
    ],
    "synopsis": "Inspired by true events, the crime thriller revolves around Abhay Pratap Singh, a sharp investigating officer with the mind of a criminal, who can go to any extent to solve a case. Join Abhay as he sets out in the dark gruesome world of crime to save innocent lives, while dealing with his own personal demons. Abhay Season 2 is set within a year after the events of the first season, Abhay continues to hunt vile murderers and monster with his trademark ingenuity, and novel deductions, until and enigmatic criminal mastermind, with no name or past, turns his world upside down and traps him along with everyone else in a maze that will test the very fibre of Abhay's morality.\nAbhay is an eight-episode murder mystery that follows the inverted detective format of storytelling. All the cases are true crime stories which are either solved or closed. The crime is fictionalised where Abhay, solves one case after another in perfection. In season 2, we see Abhay who is now living this cultivated life of a hero with darkness within, but as our villain unravels and turns his and everybody else's world upside down... we begin to get glimpses of what Abhay keeps hidden. He plays the villain's game better than the villain could have expected but still the game does what it is meant to. The villain and his truth about our world and its corruption starts getting to Abhay, the pressure of saving the kids and his past secrets make him vulnerable, but even by the end he remains incorruptible. Join Abhay as he sets out in the dark gruesome world of crime to save innocent lives, while dealing with his own personal demons."
}