{
    "id": "0102603",
    "localized title": "Oscar",
    "cast": [
        "Peter Riegert",
        "Chazz Palminteri",
        "Joey Travolta",
        "Paul Greco",
        "Sylvester Stallone",
        "Richard Foronjy",
        "Yvonne De Carlo",
        "Don Ameche",
        "Richard Romanus",
        "Arleen Sorkin",
        "Eddie Bracken",
        "Tony Munafo",
        "Robert Lesser",
        "Art LaFleur",
        "Kurtwood Smith",
        "Vincent Spano",
        "Joycelyn O'Brien",
        "Marisa Tomei",
        "Martin Ferrero",
        "Harry Shearer",
        "William Atherton",
        "Mark Metcalf",
        "Ken Howard",
        "Sam Chew Jr.",
        "Elizabeth Barondes",
        "Ornella Muti",
        "Sal Vecchio",
        "Tim Curry",
        "Danny Goldstine",
        "Kai Wulff",
        "Linda Gray",
        "Marshall Bell",
        "Tom Grant",
        "Louis D'Alto",
        "Rick Avery",
        "Jim Mulholland",
        "Joe Dante",
        "Kirk Douglas",
        "Jim Abrahams",
        "Sam Bauso",
        "Leesa Castaneda",
        "Tino Insana",
        "Polli Magaro",
        "Sal Mazzotta"
    ],
    "genres": [
        "Comedy",
        "Crime"
    ],
    "runtimes": "109",
    "countries": "United States",
    "country codes": "us",
    "language codes": [
        "en",
        "it"
    ],
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Dolby Stereo",
    "certificates": [
        "Argentina:Atp",
        "Australia:G",
        "Brazil:10::(video rating)",
        "Finland:S",
        "France:Tous publics",
        "Germany:6",
        "Iceland:L",
        "Italy:T::(DVD rating)",
        "Japan:G",
        "Norway:7::(recommended rating)",
        "Norway:5::(cinema rating)",
        "Peru:Apt",
        "Portugal:M/12",
        "Singapore:PG",
        "Spain:T",
        "Sweden:7",
        "United Kingdom:PG",
        "United States:PG"
    ],
    "original air date": "26 Apr 1991 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjRhYjg3YWEtOTYzZS00ZWY5LWJkNmEtYWE0YmQ3NDY2OWZlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0102603",
    "plot outline": "Angelo \"Snaps\" Provolone (Sylvester Stallone) made his dying father a promise on his deathbed: he would leave the world of crime and become an honest businessman. Despite having no experience in making money in a legal fashion, Snaps sets about to keep his promise. He is faced with numerous problems: henchmen who know nothing but crime, the Police who are convinced he is hatching a master plan, and Oscar (Jim Mulholland), who just got his daughter pregnant.",
    "languages": [
        "English",
        "Italian"
    ],
    "title": "Oscar",
    "kind": "movie",
    "directors": "John Landis",
    "writers": [
        "Claude Magnier",
        "",
        "Michael Barrie",
        "Jim Mulholland"
    ],
    "producers": [
        "Leslie Belzberg",
        "Alex Ponti",
        "Joseph S. Vecchio"
    ],
    "composers": "Elmer Bernstein",
    "cinematographers": "Mac Ahlberg",
    "editors": "Dale Beldin",
    "editorial department": [
        "Donah Bassett",
        "Destiny Borden",
        "Andrew S. Eisen",
        "Michael Hofacre",
        "Bob Kaiser"
    ],
    "casting directors": "Jackie Burch",
    "production designers": "Bill Kenney",
    "art directors": "William Ladd Skinner",
    "set decorators": "Rick Gentz",
    "costume designers": "Deborah Nadoolman",
    "make up department": [
        "Ron Berkeley",
        "Frank Griffin",
        "Gary Liddiard",
        "Robert L. Stevenson",
        "Bruce Wayne",
        "Joy Zapata"
    ],
    "production managers": [
        "Paul Deason",
        "Janet L. Wattles"
    ],
    "assistant directors": [
        "Simon Barron",
        "Frank Capra III",
        "Daniel R. Suhart",
        "John Wildermuth"
    ],
    "art department": [
        "John Alvin",
        "Scott M. Anderson",
        "Larry Clark Bird",
        "Stephen M. Clark",
        "Mark Knapton",
        "Michael Kolko",
        "Sean McClanahan",
        "Luigi Mugavero",
        "Jeff O'Bannon",
        "Joseph Perugini",
        "John J. Rutchland III",
        "Mike Sasgen",
        "Lyndell Wolff"
    ],
    "sound department": [
        "James Ashwill",
        "Peter C. Barbour",
        "Kevin Bartnof",
        "James Beshears",
        "Paul Timothy Carden",
        "Richard C. Franklin",
        "Doug Hemphill",
        "Ellen Heuer",
        "Doug Jackson",
        "Chris Jenkins",
        "Nils C. Jensen",
        "Fred Judkins",
        "William B. Kaplan",
        "David Kern",
        "Mary Jo Lang",
        "Donald J. Malouf",
        "Robert Morrisey",
        "Gary Mundheim",
        "Earl Sampson",
        "Mark Smith"
    ],
    "special effects": [
        "Howard Jensen",
        "Paul Stewart"
    ],
    "visual effects": [
        "David Allen",
        "Susan Adele Colletta",
        "Paul Gentry",
        "Ed Jones",
        "Pat Repola"
    ],
    "stunts": [
        "Rick Avery",
        "Ted Barba",
        "John Branagan",
        "Charlie Brewer",
        "James J. Casino",
        "Tom Elliott",
        "Brady Michaels",
        "Stan Rodarte"
    ],
    "camera department": [
        "Tony Cosko",
        "Frank Detone Jr.",
        "C.W. Fallin",
        "Scott Fuller",
        "Domenic Giorgio",
        "Steven C. Hodge",
        "Norman G. Langley",
        "Brian LeGrady",
        "Moshe Levin",
        "Chris Moseley",
        "Kelly Murphy",
        "Patrick A. Murphy",
        "Roger Ragland",
        "Kelly Rubottom",
        "Bob Rust",
        "David Rust",
        "Phil Walker",
        "Gary Wattman",
        "Richard Kelley"
    ],
    "casting department": "Felicia Fasano",
    "costume departmen": [
        "Barbara Marko Friedman",
        "Pamela Wise",
        "Marie Boller"
    ],
    "music department": [
        "Kathy Durning",
        "Nathan Kaproff",
        "John Richards",
        "Patrick Russ",
        "Emilie A. Bernstein",
        "Tom Boyd",
        "James Thatcher",
        "Eric Tomlinson",
        "Matt Walker"
    ],
    "script department": "Kathryn Weygand",
    "transportation department": "Tom Briggs",
    "miscellaneous": [
        "Susan Agnoff",
        "Chris Debiec",
        "Patrick Fullerton",
        "Penelope Gottlieb",
        "Kim Lavery",
        "Sean McClanahan",
        "Spooky Stevens",
        "Jordan Stone",
        "Carole Wattles",
        "Michael Baumgarten",
        "Blair Clark",
        "Stan Rodarte"
    ],
    "thanks": [
        "Max Landis",
        "Rachel Landis",
        "Paul Meena"
    ],
    "akas": [
        "L'embrouille est dans le sac (France)",
        "Oscar - Vom Regen in die Traufe (Germany)",
        "Oscar ¡quita las manos! (Spain)",
        "Oscar - fingrene væk fra min datter (Denmark)",
        "Oscar, czyli 60 klopotów na minute (Poland)"
    ],
    "writer": [
        "Claude Magnier",
        "Michael Barrie",
        "Jim Mulholland"
    ],
    "director": "John Landis",
    "production companies": [
        "Joseph S. Vecchio Entertainment",
        "Silver Screen Partners IV",
        "Touchstone Pictures"
    ],
    "distributors": [
        "Buena Vista Pictures",
        "Roadshow Films",
        "Warner Bros.",
        "Warner Bros.",
        "Warner Bros.",
        "Warner Bros.",
        "Roadshow Home Video",
        "Buena Vista International",
        "Abril Vídeo",
        "Buena Vista Home Entertainment",
        "Buena Vista Home Video",
        "Divisa Home Video",
        "EuroVideo",
        "Gativideo",
        "Kino Lorber",
        "Kino Lorber",
        "Mill Creek Entertainment",
        "Touchstone Home Video",
        "WGN"
    ],
    "other companies": [
        "Carolco",
        "David Allen Productions",
        "Disney Television Studios",
        "Evergreen Recording Studios",
        "Pacific Title",
        "TAJ Soundworks",
        "Transamerica Insurance Group",
        "Varèse Sarabande"
    ],
    "plot": [
        "A gangster attempts to keep the promise he made to his dying father: that he would give up his life of crime and \"go straight\".",
        "Angelo \"Snaps\" Provolone (Sylvester Stallone) made his dying father a promise on his deathbed: he would leave the world of crime and become an honest businessman. Despite having no experience in making money in a legal fashion, Snaps sets about to keep his promise. He is faced with numerous problems: henchmen who know nothing but crime, the Police who are convinced he is hatching a master plan, and _Oscar_ (qv) (Jim Mulholland), who just got his daughter pregnant.::Murray Chapman <muzzle@cs.uq.oz.au>",
        "Summoned to his father (Kirk Douglas) as he lies dying on his deathbed, gangland mobster, Angelo \"Snaps\" Provolone (Sylvester Stallone) is forced to swear to his patriarch that he will go straight, and therefore he will die happy knowing he won't continue to bring shame to the family. His first step in becoming a more respectable businessman, Snaps arranges a meeting with some local bankers who wish to capitalize on his ill gotten wealth which he will donate in to their bank. Meanwhile, rival gangland boss. Vendetti (Richard Romanus) has grown paranoid and distrustful of Snap's recent criminal inactivity and believes he's arranging a meeting other Chicago Mobsters, and plans to have a hit put out on him. All the while, hard nosed Police lieutenant Toomey (Kirkwood) Smith who is obsessed with taking Snaps down, has two of his subordinates stakeout the Gangsters mansion from an apartment building across the street. When Snaps young accountant, Anthony Rossano (Vincent Spano) unexpectedly shows up that morning, to discuss something that is \"a matter of life and death\", it kick starts a day of farcical proportions and comedic misunderstandings.::Robert McElwaine"
    ],
    "synopsis": "In the prologue, gangster Angelo Snaps Provolone promises his dying father (Kirk Douglas) that he will give up a life of crime, and instead \"go straight\".\nA month later, Snaps awakes at his mansion and begins his important morning. He has a meeting with several prominent bankers, as he hopes to donate a large sum of cash and join the banks board of trustees, thereby having an honest job and keeping his word to his father. Anthony Rossano, Snaps's young, good-natured accountant, arrives at the mansion and tells his boss that hes in love, asks for a 250% raise, then tells Snaps the true love he speaks of is actually \"Snaps's daughter.\" Snaps is furious, does not want his daughter marrying Anthony and goes to talk to his daughter, Lisa.\nLisa is the only child of Snaps and Sofia, a spoiled daughter whose dreams of seeing the worlds great sights run into a roadblock because of her overly protective father. Wishing to move out of the house, she lies to her parents (at the suggestion of the maid, Nora) and claims to be pregnant. Snaps, believing the father to be Anthony (as he wants to marry \"Snaps's daughter\"), is shocked when Lisa says the father is Oscar, the former chauffeur who is now out of the country.\nThings get even more complicated when Anthony learns that Theresa, the woman he fell in love with, is not actually Snaps' daughter as she had claimed to be. Before Anthony can catch on, Snaps tricks him into agreeing to marry his actual daughter, Lisa, who is supposedly pregnant but without a husband. Both Lisa and Anthony are unhappy at the hasty arrangement, and the pair luck out when Lisa falls in love with someone else: Dr. Thornton Poole, Snaps' dialectician.\nMeanwhile, local police lieutenant Toomey is keeping an eye on the mansion, believing that Snaps is meeting with Chicago mobsters soon. Also watching Snaps is mob rival Vendetti, who, too, believes that Snaps is meeting Chicago mobsters. Vendetti plans a hit on Snaps in the early afternoon while Toomey plans a raid at the same time to catch Snaps red-handed.\nWhile Anthony seeks out Theresa, Snaps meets his mansion's new maid, Roxie. As it turns out, Roxie is an old flame of Snaps, and the pair talk memories and the life that never was. Theresa comes to the mansion and is revealed to be Roxie's daughter - who was actually fathered by Snaps long ago - making Snaps her dad after all. The impromptu celebration of both his daughters' engagements is cut short by the arrival of the bankers. During the meeting, Snaps senses the bankers are giving him a raw deal. The meeting is interrupted by police officers and Toomey, who is embarrassed to find no money or gangsters present on site. He leaves the mansion just in time for Vendetti's car full of armed men to crash right outside. Toomey smiles for reporters and arrests the men.\nWith no hope to actually become a banker, Snaps decides to abandon his short-lived honest ways and return to a life of crime. The final scene of the movie shows a double wedding for both his daughters. Oscar himself finally appears and objects to Lisa's marriage, but he is carried off by Snaps' men and the weddings end happily.Throughout the movie, 3 black leathered bags are seen. One is filled with $50,000 cash. Another one with $50,000 worth of jewelry. And the last one with Nora's underwear(the maid). Many times during the movie, the bags are switched around by many characters resulting in more problems for Snaps. Toomey, watching Snaps' house in search of suspicious activities, sees the bags move in and out of the house on many occasions and believes those bags are filled with drug money and that a serious deal is about to go down. In the end, the maid ends up with the jewels and the money bags while Snaps ends up with the underwear bag. A fact he is angry but relieved to find out when Toomey breaks in his house for a bust but cannot find any proofs against Snaps. It is never revealed if Snaps ever got his jewels or money back."
}