{
    "id": "0254179",
    "localized title": "Betaab",
    "cast": [
        "Shammi Kapoor",
        "Nirupa Roy",
        "Prem Chopra",
        "Sunny Deol",
        "Amrita Singh",
        "Sunder",
        "Rajeev Anand",
        "Goga Kapoor",
        "Annu Kapoor",
        "Tilak Mehta",
        "Shabnam",
        "Birbal",
        "Jugnu",
        "Rehana",
        "Mahjabeen",
        "Gabbu",
        "Sonu Nigam",
        "Narinder Singh",
        "Sitaram Sharma",
        "Kimti Anand",
        "Joginder Shelly"
    ],
    "genres": [
        "Family",
        "Romance"
    ],
    "runtimes": "162",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United Kingdom:PG"
    ],
    "original air date": "05 Aug 1983 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDE5YzE4MTMtMzMyNS00NGJiLThlOWYtNDBjZmVhOWZlMmNlXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "0254179",
    "plot outline": "Sunny owns a small livestock farm and lives a poor but happy life style with his mother, Sumitra. They wanted the farm to become up to date, so Sumitra decides to make a move abroad in order to bring new equipments for the farm, leaving Sunny in the care of the farm. One day while distributing eggs and chickens, Sunny reaches up with Roma Singh and both can get into the pettiest quarrels and they soon begins to fight and Sunny offers Roma to rebuild his farm house as a part of her punishment. Both soon realize that they are childhood lovers and attempts to rebuild that love once again, both are successful in doing so and plans to get married but there love is opposed by Roma's dad, the wealthy and famous businessman, Sardar Dinesh Singh Girji, who will do anything in his power to prevent Roma and Sunny from meeting leave alone marriage.",
    "languages": "Hindi",
    "title": "Betaab",
    "kind": "movie",
    "directors": "Rahul Rawail",
    "writers": "Javed Akhtar",
    "producers": [
        "Bikram Singh Dehal",
        "Bikram Singh Dahal"
    ],
    "composers": "Rahul Dev Burman",
    "cinematographers": "Manmohan Singh",
    "art directors": "R. Verman Shetty",
    "assistant directors": [
        "Inderjit Chadha",
        "Vishal Khanna",
        "Suresh Mudgal"
    ],
    "camera department": [
        "Nath Gupta",
        "Gagarin Mishra"
    ],
    "music department": [
        "Anand Bakshi",
        "Shabbir Kumar",
        "Lata Mangeshkar",
        "Annette Pinto"
    ],
    "miscellaneous": "Suresh Bhatt",
    "akas": [
        "बेताब (India, Hindi title)",
        "Um Amor da Infância (Brazil)"
    ],
    "writer": "Javed Akhtar",
    "director": "Rahul Rawail",
    "production companies": "Vijayta Films",
    "plot": [
        "A young man (Sunny Deol) and woman (Amrita Singh) fall in love, but face obstacles from their families.",
        "Sunny owns a small livestock farm and lives a poor but happy life style with his mother, Sumitra. They wanted the farm to become up to date, so Sumitra decides to make a move abroad in order to bring new equipments for the farm, leaving Sunny in the care of the farm. One day while distributing eggs and chickens, Sunny reaches up with Roma Singh and both can get into the pettiest quarrels and they soon begins to fight and Sunny offers Roma to rebuild his farm house as a part of her punishment. Both soon realize that they are childhood lovers and attempts to rebuild that love once again, both are successful in doing so and plans to get married but there love is opposed by Roma's dad, the wealthy and famous businessman, Sardar Dinesh Singh Girji, who will do anything in his power to prevent Roma and Sunny from meeting leave alone marriage.::gavin (gunmasterM@hotmail.com)",
        "Sumintra is a widow who lives a poor life-style in a mountainous region with an only son, Sunny Kapoor. To meet ends they operate a livestock farm and are quite contended, one day Sunny co-incidentally meets Roma Singh alias Dinky; at first both find that there are differences between them, the fight that they usually have. Until Sunny decides to punish Roma by putting her to clean up his farm, here they will realize that they are childhood sweethearts so much that they reconcile there love. Roma's wealthy dad, Sadar Dinesh Singh Giji will not permit his daughter to marry below her class and is in for a surprise that will change the lives of Sumintra and Sunny forever.::gavin (racktoo@hotmail.com)",
        "Sunny lives with his mother, Sumitra, in a small town. They also own a farm-house with a poultry business, and would like to re-locate there. Sunny decides to head out first, ensure that the place is livable and invite his mother. Upon arrival Sunny finds the place in a mess and decides to clean up and re-build. His efforts are frustrated largely due to the presence of a young woman named Roma. In order to apologize, Roma agrees to assist him, with comically disastrous results. Then they find out that they have known each other since childhood and are overjoyed and fall in love with each other. Problems arise for them when Sumitra and her Roma's dad, Sardar Dinesh Singh Girji, dislike each other and are both opposed to any marriage between the two families. Will Roma and Sunny go against their parents' wishes?::rAjOo (gunwanti@hotmail.com)",
        "The wealthy Avinash Kapoor, his wife Sumintra and Sardar Dinesh Singh Girji are not only business partners but friends. There children, Sunny and Roma alias Dinky are close to each other and aspire to get married when they are older. However, things does not seem to fall into place and Avinash became bankrupt and as a result loses all his assets, this leads to suicide leaving Sunny and Sumintra alone. Years later Sunny has now grown up and own a small livestock farm, meets Roma and after a few misunderstandings both realize that they are childhood friends and decides to get married but faith had something different in store for the young couple.::raj (krazymonster@ymail.com)"
    ]
}