{
    "id": "13427348",
    "localized title": "Marudhavelu",
    "cast": [
        "Sabitha Anand",
        "Santhana Bharathi",
        "Crane Manohar",
        "Pandu"
    ],
    "genres": "Drama",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "18 Nov 2011 (India)",
    "imdbID": "13427348",
    "plot outline": "In Rajapalayam, Marudhavelu (Kailash) is a wastrel who spends his time drinking and hanging out with his friends. After the death of his mother, Marudhavelu is pampered by his father (Ilavarasu) who is a rich and respected man. Marudhavelu and his cousin Manju (Akanksha) are in love. One night, Marudhavelu catches the village priest with a prostitute in the village temple and with his friends, he beats him up. At the village court, the priest lies that Marudhavelu was with the prostitute and the villagers start to believe it. Marudhavelu decides to find that prostitute to be declared innocent and to prove Manju that he only loves her. To find the prostitute, Marudhavelu enters the house of his village prostitute Dhanam to interrogate her. Manju who witnesses it misinterprets the situation and she is now disgusted for being in love with Marudhavelu. That night, Marudhavelu who feels distraught drinks a lot of alcohol and sneaks into Manju's bedroom to explain what really happened but Manju doesn't want to listen to him and asks for help. At the village court, Manju's family accuses Marudhavelu of attempting to rape Manju that night and Manju even confirms it leaving Marudhavelu aghast. The village head, therefore, bans Marudhavelu from the village for one year. Muthu and Shanthi, two young lovers from the village, try to elope and Muthu's family chase them. Marudhavelu comes to their rescue and the three escape by taking the bus. In Chennai, they immediately go to the registrar office for the marriage but the powerful local don Kalivardhan alias Annachi (Bangalore Swamy) arrives there with his henchmen, he kills Shanthi and kidnaps Muthu. Annachi then bribes him for his silence and Marudhavelu surprisingly takes the money but only for giving it to Shanthi's parents. The lawyer Vidya Venugopalan (Nakshatra) helps Marudhavelu lodging a complaint against Annachi for the murder of Shanthi. Vidya Venugopalan has her own reason to take revenge on Annachi: in the past, Annachi brutally killed her mother (Rekha) for being a witness of one of his crimes. In the meantime, Vidhya Venugopalan falls in love with Marudhavelu but Marudhavelu is still in love with Manju. Marudhavelu then convinces a judge to help him. In court, the judge orders the police to reexamine all the cases against Annachi and to arrest him. Marudhavelu eventually returns to his village. Manju comes to know that Marudhavelu is innocent and he only loves her. Annachi and his henchmen try to kill Marudhavelu in his village and Marudhavelu fights back. During the fight, Annachi kills Marudhavelu's father and Marudhavelu's friends then kill Annachi.",
    "languages": "Tamil",
    "title": "Marudhavelu",
    "kind": "movie",
    "directors": "R.K.R. Aathimoolam",
    "writers": "R.K.R. Aathimoolam",
    "producers": "S. Shanmuga Pandian",
    "composers": "James Vasanthan",
    "akas": "Marudhavelu (India)",
    "writer": "R.K.R. Aathimoolam",
    "director": "R.K.R. Aathimoolam",
    "production companies": "Siva Thangam Films",
    "plot": "In Rajapalayam, _Marudhavelu_ (qv) (Kailash) is a wastrel who spends his time drinking and hanging out with his friends. After the death of his mother, _Marudhavelu_ (qv) is pampered by his father (Ilavarasu) who is a rich and respected man. _Marudhavelu_ (qv) and his cousin Manju (Akanksha) are in love. One night, _Marudhavelu_ (qv) catches the village priest with a prostitute in the village temple and with his friends, he beats him up. At the village court, the priest lies that _Marudhavelu_ (qv) was with the prostitute and the villagers start to believe it. _Marudhavelu_ (qv) decides to find that prostitute to be declared innocent and to prove Manju that he only loves her. To find the prostitute, _Marudhavelu_ (qv) enters the house of his village prostitute Dhanam to interrogate her. Manju who witnesses it misinterprets the situation and she is now disgusted for being in love with _Marudhavelu_ (qv). That night, _Marudhavelu_ (qv) who feels distraught drinks a lot of alcohol and sneaks into Manju's bedroom to explain what really happened but Manju doesn't want to listen to him and asks for help. At the village court, Manju's family accuses _Marudhavelu_ (qv) of attempting to rape Manju that night and Manju even confirms it leaving _Marudhavelu_ (qv) aghast. The village head, therefore, bans _Marudhavelu_ (qv) from the village for one year. Muthu and Shanthi, two young lovers from the village, try to elope and Muthu's family chase them. _Marudhavelu_ (qv) comes to their rescue and the three escape by taking the bus. In Chennai, they immediately go to the registrar office for the marriage but the powerful local don Kalivardhan alias Annachi (Bangalore Swamy) arrives there with his henchmen, he kills Shanthi and kidnaps Muthu. Annachi then bribes him for his silence and _Marudhavelu_ (qv) surprisingly takes the money but only for giving it to Shanthi's parents. The lawyer Vidya Venugopalan (Nakshatra) helps _Marudhavelu_ (qv) lodging a complaint against Annachi for the murder of Shanthi. Vidya Venugopalan has her own reason to take revenge on Annachi: in the past, Annachi brutally killed her mother (Rekha) for being a witness of one of his crimes. In the meantime, Vidhya Venugopalan falls in love with _Marudhavelu_ (qv) but _Marudhavelu_ (qv) is still in love with Manju. _Marudhavelu_ (qv) then convinces a judge to help him. In court, the judge orders the police to reexamine all the cases against Annachi and to arrest him. _Marudhavelu_ (qv) eventually returns to his village. Manju comes to know that _Marudhavelu_ (qv) is innocent and he only loves her. Annachi and his henchmen try to kill _Marudhavelu_ (qv) in his village and _Marudhavelu_ (qv) fights back. During the fight, Annachi kills _Marudhavelu_ (qv)'s father and _Marudhavelu_ (qv)'s friends then kill Annachi."
}