{
    "id": "1461683",
    "localized title": "Janala",
    "cast": [
        "Shankar Chakraborty",
        "Arindra Rai Chaudhuri",
        "Swastika Mukherjee",
        "Tapas Pal",
        "Indraneil Sengupta"
    ],
    "genres": "Drama",
    "runtimes": "107",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDg0MjUyNTQtNWRmYi00M2QzLTljYWYtOTNhOTZlNzlhZDNkXkEyXkFqcGdeQXVyNjA0ODg1OTQ@._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "1461683",
    "plot outline": "Janala tells the story about a man, Bimal, who decides to give a little back to his old school despite the fact he has very little money himself. As a child Bimal had a favourite corner classroom where he used to sit and daydream out of a broken window, and so when he finds himself back in his old school he feels compelled to replace the window. Bimal ends up using his fiancee Meera's savings - money she put aside for the child they're expecting - without telling her. Unexpectedly when he presents the window to the authorities it is rejected, and matters only get worse when Meera also seems to lose trust in Bimal.",
    "languages": "Bangla",
    "title": "The Window",
    "kind": "movie",
    "directors": "Buddhadev Dasgupta",
    "writers": "Buddhadev Dasgupta",
    "producers": [
        "Mahesh Ramanathan",
        "Rajesh Sawhney"
    ],
    "composers": "Biswadep Dasgupta",
    "cinematographers": "Sunny Joseph",
    "editors": "Amitava Dasgupta",
    "production designers": [
        "Subrata Chakraborty",
        "Shubroto Chakroborty"
    ],
    "production managers": [
        "Surajit Dasgupta",
        "Sandeep Singh"
    ],
    "sound department": "Anup Mukhyopadhyay",
    "akas": "The Window (World-wide, English title)",
    "writer": "Buddhadev Dasgupta",
    "director": "Buddhadev Dasgupta",
    "production companies": "Reliance Big Pictures",
    "distributors": "Reliance Big Pictures",
    "plot": [
        "Bimal decides to contribute financially to his old school despite not having much money himself. He uses his fiance Meera's savings for this purpose which ends up creating a rift between the two.",
        "_Janala_ (qv) tells the story about a man, Bimal, who decides to give a little back to his old school despite the fact he has very little money himself. As a child Bimal had a favourite corner classroom where he used to sit and daydream out of a broken window, and so when he finds himself back in his old school he feels compelled to replace the window. Bimal ends up using his fiancee Meera's savings - money she put aside for the child they're expecting - without telling her. Unexpectedly when he presents the window to the authorities it is rejected, and matters only get worse when Meera also seems to lose trust in Bimal.::DDA PR"
    ]
}