{
    "id": "1625856",
    "localized title": "Badrinath",
    "cast": [
        "Allu Arjun",
        "Tamannaah Bhatia",
        "Prakash Raj",
        "Kelly Dorji",
        "Brahmanandam",
        "Tanikella Bharani",
        "Dharmavarapu Subramanyam",
        "M.S. Narayana",
        "Pragathi",
        "Sudha",
        "Sayaji Shinde",
        "Geetha Singh",
        "Kovai Sarala",
        "Venu Madhav",
        "Raghu Babu",
        "Krishna Bhagavan",
        "Rao Ramesh",
        "Master Bharath",
        "Joy Badlani",
        "Ashwini Kalsekar",
        "Rajan Kapur",
        "Rakesh Varre"
    ],
    "genres": [
        "Action",
        "Drama",
        "Romance"
    ],
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "Dolby Digital",
        "DTS"
    ],
    "certificates": [
        "Australia:MA15+",
        "Brazil:16",
        "Canada:14+::(Quebec)",
        "China:17",
        "Germany:18",
        "Germany:16",
        "Hong Kong:IIB",
        "India:UA",
        "India:A::(theatrical rating)",
        "India:UA",
        "Indonesia:D::(TV rating)",
        "Italy:VM14",
        "Japan:R18+",
        "Malaysia:18",
        "Mexico:C",
        "New Zealand:R18",
        "Singapore:NC-16::(DVD)",
        "Singapore:R21",
        "United Kingdom:15",
        "United Kingdom:18",
        "United States:Not Rated"
    ],
    "original air date": "10 Jun 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2FjOWViNjYtMjRmMi00NDFkLWI1ZTktNmIyN2ExMDU3YTlmXkEyXkFqcGdeQXVyNDY5MTUyNjU@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1625856",
    "plot outline": "Bheeshma Narayan (Prakash Raj) is a religious guru who prepares an army for the protection of all the ancient Hindu temples from terrorists. Of all the valiant and talented warriors in this elite army, Badrinath (Allu Arjun) is one who is groomed by Bheeshma Narayan and wishes to make Badri his successor. Once, a group of terrorists attacked Amarnath Temple and killed some devotees, Badri fought and killed those criminals, saving both the temple and the devotees. Meanwhile Alakananda (Tamanna), who is a staunch agnostic due to certain circumstances, along with her family is visiting Badrinath Temple, to which Badri is appointed as the protector. Her grandfather explains to Badri that she is in danger as Sarkar (Kelly Dorjee), a dreaded don, is trying to force her marriage with his son. On the request of her grandfather, Badri helps Alaknanda to gradually believe in God's existence. Eventually Alakananda falls deeply in love with Badri, unbeknownst to him, and is not willing to lose him at any cost. Sarkar and his men follow Alaknanda to Badrinath, and try to kidnap her. Although Badri manages to save her, he is heavily injured and goes under medication. Meanwhile Bheeshma Narayan is shocked upon seeing Alakananda's affectionate behaviour towards Badri when he lay injured. As it is a strict rule that only an unmarried man must be the next guru who would lead the elite warriors, Bheeshma Narayan becomes highly suspicious that Badri is in love with Alakananda, which is not the real situation. Badri promises Alakananda that he would bring her back to Badrinath Temple for success in her love, unaware that he is the object of her love in the first place. As per the promise, Badri goes to Bellary to free Alakananda from the clutches of Sarkar, who is planning to fix the marriage, and escort Alaknanda back to the holy shrine. He fights with all the goons and escorts her to Badrinath. Sarkar vows revenge on Badri as Sarkar's son is severely hurt in the process by Badri. Subsequently Sarkar leads his goons to Badrinath and destroys Bheeshma Narayan's ashram. Feeling that Badri is the real traitor and loves Alakananda, Bheeshma Narayan orders Badri to vacate Badrinath Temple. Meanwhile Alakananda is being taken away by Sarkar's men, and Alakananda proposes to Badri to which he rejects as he has dedicated his life to his guru. After seeing Alakananda's pure love for Badri, Bheeshma Narayan is moved and orders Badri to bring her back and marry her. Following his guru's orders, Badri saves Alakananda and finally marries her. In the end, Bheeshma Narayan asks them to hand over one of their children so that he can make him his successor to which they agree happily.",
    "languages": "Telugu",
    "title": "Badrinath",
    "kind": "movie",
    "directors": "V.V. Vinayak",
    "writers": [
        "Chinni Krishna",
        "Chinni Krishna",
        "",
        "Rajendra Kumar",
        "",
        "V.V. Vinayak"
    ],
    "producers": [
        "Allu Aravind",
        "Madhu B.",
        "Ivano Fucci",
        "Rengarajan Jaiprakash"
    ],
    "composers": "M.M. Keeravani",
    "cinematographers": "Ravi Varman",
    "editors": "Gautham Raju",
    "editorial department": [
        "Nalin Bade",
        "M.A. Maalik",
        "Chota K. Prasad",
        "D. Vinay",
        "Loren White"
    ],
    "art directors": "Anand Sai",
    "make up department": "Vidyadhar Bhatte",
    "production managers": [
        "Raju G.G.K.",
        "Bathula Nageswarrao",
        "Chintha Ramakrishna Reddy"
    ],
    "assistant directors": [
        "Bhaskar Bandi",
        "Ramesh Murthy Bonam",
        "Reddy Hanumanth",
        "K. Vijay Kumar",
        "Satti Phanikumar",
        "Koppineedi Pullarao",
        "Thota Ramakrishna",
        "Pradeep Vikram"
    ],
    "art department": "Nayeem Mohammed",
    "special effects": [
        "Makuta",
        "Nayeem Mohammed",
        "Nayeem Mohammed",
        "Vidya Sagar Sarigala"
    ],
    "visual effects": [
        "Dorababu Achanta",
        "Adel Adili",
        "Arun Kumar Akavaram",
        "Ashok Alladi",
        "Srinivasraju Alluri",
        "Sanjay Baghel",
        "Prabhakar Balli",
        "Cgtrix",
        "Ramesh Chollangi",
        "Pete Draper",
        "Phani Vihari Gantala",
        "Mohamadreza Ghorbani",
        "Hamid Hadidi",
        "Raveesh Kali",
        "Chandra Sekhar Kamuju",
        "Dondeti Koti Reddy",
        "Ashwin Kumar",
        "Ranjan Kumar",
        "Makuta",
        "Nayeem Mohammed",
        "Nayeem Mohammed",
        "Jayasimha Nomula",
        "Murali Manohar Reddy Penubadi",
        "Raghu Puduri",
        "Baseer Qureshi",
        "Pari Rajulu",
        "Kaithapulla Ramakrishna",
        "E. Ramesh",
        "Gadiraju Ramesh",
        "Sandeep Rayaprolu",
        "Nikita Saini",
        "Akil Sheikh",
        "Addanki Subbaiah",
        "Rushikesh Swarge",
        "Anil Telikepalli",
        "Pavan Veeramaneni",
        "Mithun Velluri",
        "Rahul Venugopal",
        "Chandu Vojjala",
        "Mohammad Yousefi"
    ],
    "stunts": [
        "Yannick Ben",
        "Lakshman Chella",
        "Ram Chella",
        "Peter Hein",
        "Remi Imbert",
        "Raimundo Querido"
    ],
    "camera department": [
        "Deval Samanta",
        "Harish Sandhu",
        "Bobby Sanivarapu"
    ],
    "animation department": [
        "Nayeem Mohammed",
        "Kaithaplla Ramakrishna",
        "Kaithapulla Ramakrishna",
        "Vidya Sagar Sarigala"
    ],
    "location management": "Michele Saragoni",
    "music department": [
        "Sravana Bhargavi",
        "Chandrabose",
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Jassie Gift",
        "Anuj Gurwara",
        "Chaitra H.G.",
        "Madhan Karky",
        "M.M. Keeravani",
        "Geetha Madhuri",
        "Shankar Mahadevan",
        "Chaitanya Prasad",
        "Veturi Sundara Ramamurthy",
        "Revanth",
        "Baba Sehgal",
        "Anantha Sriram"
    ],
    "miscellaneous": [
        "Raju G.G.K.",
        "Peter Grainger",
        "Siva Kiran",
        "Manoj Rai",
        "Prem Rakshith",
        "Swapnil Rane",
        "Eluru Sreenu",
        "Raju Sundaram",
        "Pony Verma"
    ],
    "thanks": [
        "Siva Akula",
        "K.V. Guhan",
        "Gopal Reddy S."
    ],
    "akas": [
        "Badrinath One and Only... (India, Malayalam title)",
        "Sangharsh Aur Vijay (India, Hindi title)",
        "Запретные желания (Russia)",
        "Sangharsh Aur Vijay",
        "Badrinaath"
    ],
    "writer": [
        "Chinni Krishna",
        "Chinni Krishna",
        "Rajendra Kumar"
    ],
    "director": "V.V. Vinayak",
    "production companies": [
        "Geetha Arts",
        "ODU Movies",
        "Redakh Arts"
    ],
    "distributors": [
        "Geeta Film Distributors",
        "Geetha Arts",
        "Supreme Movies",
        "Supreme Movies",
        "Aditya Video"
    ],
    "special effects companies": "Makuta",
    "other companies": [
        "Aditya Music",
        "EFX",
        "Rainbow, Ramoji Film City",
        "Working Tittle"
    ],
    "plot": [
        "Badri, a warrior and the protector of _Badrinath_ (qv) temple, finds himself in troubled waters after an agnostic woman falls for him and his mentor suspects him of loving her back.",
        "Bheeshma Narayan (Prakash Raj) is a religious guru who prepares an army for the protection of all the ancient Hindu temples from terrorists. Of all the valiant and talented warriors in this elite army, _Badrinath_ (qv) (Allu Arjun) is one who is groomed by Bheeshma Narayan and wishes to make Badri his successor. Once, a group of terrorists attacked Amarnath Temple and killed some devotees, Badri fought and killed those criminals, saving both the temple and the devotees. Meanwhile Alakananda (Tamanna), who is a staunch agnostic due to certain circumstances, along with her family is visiting _Badrinath_ (qv) Temple, to which Badri is appointed as the protector. Her grandfather explains to Badri that she is in danger as Sarkar (Kelly Dorjee), a dreaded don, is trying to force her marriage with his son. On the request of her grandfather, Badri helps Alaknanda to gradually believe in God's existence. Eventually Alakananda falls deeply in love with Badri, unbeknownst to him, and is not willing to lose him at any cost. Sarkar and his men follow Alaknanda to _Badrinath_ (qv), and try to kidnap her. Although Badri manages to save her, he is heavily injured and goes under medication. Meanwhile Bheeshma Narayan is shocked upon seeing Alakananda's affectionate behaviour towards Badri when he lay injured. As it is a strict rule that only an unmarried man must be the next guru who would lead the elite warriors, Bheeshma Narayan becomes highly suspicious that Badri is in love with Alakananda, which is not the real situation. Badri promises Alakananda that he would bring her back to _Badrinath_ (qv) Temple for success in her love, unaware that he is the object of her love in the first place. As per the promise, Badri goes to Bellary to free Alakananda from the clutches of Sarkar, who is planning to fix the marriage, and escort Alaknanda back to the holy shrine. He fights with all the goons and escorts her to _Badrinath_ (qv). Sarkar vows revenge on Badri as Sarkar's son is severely hurt in the process by Badri. Subsequently Sarkar leads his goons to _Badrinath_ (qv) and destroys Bheeshma Narayan's ashram. Feeling that Badri is the real traitor and loves Alakananda, Bheeshma Narayan orders Badri to vacate _Badrinath_ (qv) Temple. Meanwhile Alakananda is being taken away by Sarkar's men, and Alakananda proposes to Badri to which he rejects as he has dedicated his life to his guru. After seeing Alakananda's pure love for Badri, Bheeshma Narayan is moved and orders Badri to bring her back and marry her. Following his guru's orders, Badri saves Alakananda and finally marries her. In the end, Bheeshma Narayan asks them to hand over one of their children so that he can make him his successor to which they agree happily.",
        "Badri, a warrior and the protector of _Badrinath_ (qv) temple, tries to revive Alakananda's faith in God, thus leading to battles between him and her cruel uncle, Sarkaar. In this entire process, Badri's Guru begins to doubt that he is in love with Alakananda, who loves Badri. Meanwhile, Sarkaar's wife wants Alakananda's marriage to get fixed with her son Munna, who would torture her, since Alakananda had insulted Sarkaar's wife in public. Strange situations arrive, and thus leading everyone to think: Can Badri protect Alakananda's life? Will Alakananda be married to the evil Sarkaar 's son, and whether Badri's Guru will accept Badri or not? A few more questions like this for the rest of the story, as well as the action packed climax of the film as well.::Prashast Singh",
        "In the modern time, when the temples have become unsafe for people, Guru Bhishma Narayan prepares an army of warriors to safeguard various temples of India. Among them all, Badri, the most talented and skilled warrior, takes up the responsibility of the protection of _Badrinath_ (qv) temple. However, one day, there arrives Alakananda, who doesn't believe in God due to a dark past. Badri, on her grandfather's insistence, takes on to revive Alakananda's faith in God. Meanwhile, her cruel uncle Sarkaar's wife wants Alakananda's marriage to get fixed with her son, who would then torture her, since she had publicly insulted her. Unaware of all the dangers, Badri continues to help Alakananda, thus leading his Guru to doubt him. What happens further is quite important to form the crux of the film's plot.::Prashast Singh",
        "A young and fearless warrior is groomed by a spiritual master to become his successor and lead the elite army trained for protection of the temples from destructive forces. However, when the warrior falls in love, his master begins to doubt his commitment to the cause. How will this conflict be resolved?::Shrinivas G. Kulkarni"
    ],
    "synopsis": "Badri, a warrior and the protector of Badrinath temple, tries to revive Alakananda's faith in God, thus leading to battles between him and her cruel uncle, Sarkaar. In this entire process, Badri's Guru begins to doubt that he is in love with Alakananda, who loves Badri. Meanwhile, Sarkaar's wife wants Alakananda's marriage to get fixed with her son Munna, who would torture her, since Alakananda had insulted Sarkaar's wife in public. Strange situations arrive, and thus leading everyone to think: Can Badri protect Alakananda's life? Will Alakananda be married to the evil Sarkaar 's son, and whether Badri's Guru will accept Badri or not? A few more questions like this for the rest of the story, as well as the action packed climax of the film as well."
}