{
    "id": "1655607",
    "localized title": "Singam",
    "cast": [
        "Suriya",
        "Anushka Shetty",
        "Prakash Raj",
        "Vivek",
        "Radha Ravi",
        "Aachi Manorama",
        "Nassar",
        "Vijayakumar",
        "Nizhalgal Ravi",
        "Yuvarani",
        "Ajay Ratnam",
        "Adithya Menon",
        "Bose Venkat",
        "Delhi Kumar",
        "Thyagu",
        "Pandu",
        "Janaki Sabesh",
        "Crane Manohar",
        "Krishna Pillai",
        "Cell Murugan",
        "Besant Ravi",
        "Kaajal Pasupathi",
        "Prema Priya"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ta",
        "tcy",
        "en"
    ],
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:MA15+",
        "Canada:13+::(Quebec)",
        "India:UA",
        "New Zealand:M",
        "Singapore:PG",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "28 May 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDgyMjQ1MmEtZGY4YS00YWM1LWJmNTEtNzc2Y2Y2MTgzMjUzXkEyXkFqcGdeQXVyODk1OTg3MTI@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "1655607",
    "plot outline": "Sub-Inspector Durai Singam lives a fairly wealthy lifestyle in Nallore along with his parents and a sister. He uses the powers vested in him wisely and well, and is, therefore, respected by everyone. He meets with and falls in love with Kavya Mahalingam but faces strong opposition from her Chennai-based businessman father, who does not approve of him. Before things could be sorted out, the High Court directs an influential gangster, Mayil Vaaganam, to report to Durai. The former initially refuses to attend, but relents and attempts to vainly use goon power to intimidate Durai and instead ends up humbled and humiliated. Upon the latter's return to Chennai, he ensures Durai gets transferred there and prepares a plan to terrorize and humiliate not only Durai but also his friends and family with impunity.",
    "languages": [
        "Tamil",
        "Tulu",
        "English"
    ],
    "title": "Singam",
    "kind": "movie",
    "directors": "Hari",
    "writers": "Hari",
    "producers": [
        "K.E. Gnanavelraja",
        "S.R. Prabhu",
        "S.R. Prakashbabu",
        "Mahesh Ramanathan"
    ],
    "composers": "Devi Sri Prasad",
    "cinematographers": "Priyan",
    "editors": "V.T. Vijayan",
    "assistant directors": "John Albert",
    "sound department": "M. Ravi",
    "visual effects": [
        "Anoop Chandran",
        "Manicn",
        "P. Mohan",
        "Velmurugan Rajamani",
        "K.V. Sanjit",
        "Sivaramakrishnan",
        "Srirengaraj",
        "Sathishkumar Vadivelu"
    ],
    "camera department": "Venkat Srinivasan",
    "music department": [
        "Benny Dayal",
        "Lahiru Jay",
        "Singer Megha",
        "Na. Muthukumar",
        "Devi Sri Prasad",
        "Priyadarshini",
        "Suchitra Ramadurai",
        "Baba Sehgal",
        "Shaan",
        "Megha Sriram",
        "Tippu",
        "Manicka R. Vinayagam",
        "Viveka"
    ],
    "thanks": "Lahiru Jay",
    "akas": "Львиное сердце (Russia)",
    "writer": "Hari",
    "director": "Hari",
    "production companies": [
        "Reliance Big Pictures",
        "Reliance Entertainment",
        "Studio Green"
    ],
    "distributors": [
        "Ayngaran Video",
        "Lotus Films",
        "Studio Green",
        "Sun Pictures",
        "Sun NXT",
        "Sun TV"
    ],
    "other companies": "Sony Music India",
    "plot": [
        "Honest police officer Durai _Singam_ (qv) locks horns with big-time extortionist Mayil Vaaganam.",
        "Sub-Inspector Durai _Singam_ (qv) lives a fairly wealthy lifestyle in Nallore along with his parents and a sister. He uses the powers vested in him wisely and well, and is, therefore, respected by everyone. He meets with and falls in love with Kavya Mahalingam but faces strong opposition from her Chennai-based businessman father, who does not approve of him. Before things could be sorted out, the High Court directs an influential gangster, Mayil Vaaganam, to report to Durai. The former initially refuses to attend, but relents and attempts to vainly use goon power to intimidate Durai and instead ends up humbled and humiliated. Upon the latter's return to Chennai, he ensures Durai gets transferred there and prepares a plan to terrorize and humiliate not only Durai but also his friends and family with impunity.::rAjOo (gunwanti@hotmail.com)",
        "A powerful criminal is ordered by the High Court to report to a well-respected sub-inspector of police. Feeling insulted and humiliated, the criminal has the SI transferred to his home territory in order to exact revenge upon him, by not only terrorising him, but by destroying the life of his loved ones. How will the SI deal with this menace?::Santhosh"
    ],
    "synopsis": "In Thiruvanmyor Chennai, the powerful don and extortionist Mayil Vaanganam feigns a heart attack to draw in his rival Sundar, whom he believes is rising up to his power. Sundar and his men break into the hospital where Mayil awaits them. Mayil slashes Sundar's throat with a sword and his men retreat. Narration explains that Mayil makes living off threatening and blackmailing company owners and makes sure to stay hidden from the law and avoid arrest.Further south in the city of Thoothikudi, sub inspector Durai Singam thwarts a temple robbery in his home village Nallur. His best friend and colleague, the buffoonish constable Ezhrumalai gives chase to an escaped fugitive in a rock quarry only to get injured. Ezhrumalai meets back with Singam after he solves a family dispute, in which Singam demonstrates pride and loyalty to the village folk which he sings about after a soccer match.Afterwards, wealthy buisnessman Mahalingam and his daughters Kavya and Divya arrive in Thoothikudi to visit their grandparents. Ezhrumalai visits Singam's family: Singam's father Soundrapandi, his mother Kalyani, his grandmother and his sister Dhanalakshmi and her kids. Ezhrumalai is tasked with transporting criminals to jail but gets dragged away by one who escapes. Later that night, many villagers flee upon seeing a tiger. Singam sees a person in a costume and slaps her, revealing it to be Kavya. He warns her not to pull such a prank again and Kavya feels insulted. The next day, she, Divya, one of her friends and her houseworker Palani go to the temple to prank Singam. Before they can chuck him with a stone Singam apologizes for the misunderstanding and Kavya begins to have feelings for him.In Thiruvanmyor, Mayil extorts a rich father in exchange for his son's life. Back in Nallur Ezhrumalai prepares a biriyani made from a goat he stole from the farmer Madhasami. Madhasami confronts him and Singam leaves. Ezhrumalai gives Madhasami a goat and retreats, revealing it to be a dog instead. Kavya later visits Singam to help find her missing necklace. When he deduces how she lost it she further admires him. Kavya later pretends to loose her phone and creates a fake cut on her arm to feign mugging all in order to catch Singam's attention. Singam finds out that she has been lying and confronts her, to which she admits she has feelings for him. Singam reciprocates but Mahalingam and Soundrapandi get into a fight after the former insults policemen, whom Mahalingam does not like.Mayil continues to threaten land owners and proceeds to threaten an elderly one who has taken an unlawful bribe from the Revaneu Department. Mayil and his brother Vaigundham threaten to frame the man for rape and murder if he refuses to pay them a share. The man commits suicide but not before writing a farewell email to his children in America mentioning Mayil by name. Kavya, Divya and their grandfather visit a theater where they are harassed by a group of goons. They turn to Singam for help, who brutally beats the goons up.Because of the suicide, Mayil comes in as a suspect and has to head to Nallur to sign a condition bail. Vaigundam assigns their friend Harbour Shanmugan who is stationed in Thuthikoodi to sign in his place. Shanmugans men attempt to sign the bail but Singam busts them and confronts Shanmugan. Singam demands that Mayil arrives in Thoothikudi as soon as possible and threatens to get a warrant to arrest him otherwise. Mayil arrives in Thoothikudi and angrily confronts Singam for dragging him all the way from his home and even threatens to kill him. The villagers attack Mayil's vehicles and riot in response. Singam has Mayil seal the bail and sends him off, leaving him humiliated. Mayil swears to get him back.Not to long after, Singam is transferred to Thiruvamyor as the new inspector, which he finds out is because of Mayil's influence. Mayil confronts him at his new station and promises to make his job and life miserable. Over the next few days Mayil's men harass the station and cause trouble in the city, but Singam is unable to take action since they bend rules and merely bug him. Singam tells Kavya that he wishes to resign if Mayil keeps troubling him. Kavya tells him that Singam of all people shouldn't give up on establishing justice no matter how hard it seems, and that his family and people wouldn't respect him if he cowered. Singam retaliates and starts arresting Mayil's men one by one even if they don't break any laws and frames them for crimes. Assisant commissioner Rajendran is angered at Singam's insubordination and confronts him, but Singam kicks him out of the station. Mayil is infuriated at Singam's retaliation. Vaigundham confronts Singam and is met with arrest for destroying a government F.I.R although Singam tore it apart.Singam confronts Mayil in his house and makes it clear that he won't surrender to him ever. After finding out he has a large network of contacts Singam believes he is doing something else illegal other than extortion. Kavya further interacts with Singam however Mahalingam has found out and strongly disapproves of their relationship. Singam also has Ezhrumalai transferred to Chennai after he flunks a smuggling case in Thoothikudi. Singam finds Mahalingam acting suspiciously and finds out that Mayil has kidnapped Divya for money. Singam realizes that this is how he extorts the public. After the exchange is made Singam further investigates Mayil and is promoted as the new assistant commissioner and leader of the anti-kidnapping force. Singam tracks down and arrests a lot of Mayil's contacts and troops to prevent any more abductions. After Vaigundam attempts to draw Singam into a trap and arrest him, Singam kills Vaigundam leading to Mayil shooting Kavya. Kavya is admitted into the hospital and is alright, but Mayil murders Singam's friend Ravi who worked with him since he came to central Chennai. Mayil threatens to kill everyone Singam loves.Singam later recieves support from Mayil's friend, the home minster of Tamil Nadu Ramnathan, who knows nothing of Mayils neferious activities. Singam manages to expose Rajendran, who's been working for Mayil to support his family. Rajendran lies to the press that Mayil kidnapped his daughter and Mayil is forced to tell Ramnathan that he gives politicians money to support their activities in that manner. Ramnathan is infuriated and orders Mayil's arrest. Mayil's house is searched through and has a warrant placed on him.Mayil kidnaps Karnatika's home minister's daughter and tells Singam that if he doesn't get out of India safely that she will suffer. Singam tracks him to a farming village and shoots the girl to force Mayil into letting her go. Singam fights Mayil at a fishing harbor and wounds him. He tells Mayil that he won't arrest nor kill him, but leave him be. Since all of Chennai is against him and he can't do anything about it. Mayil arms himself and looks for Singam who sees him coming. Singam believed he could arrest him if he regretted his actions but since he doesn't, Singam shoots Mayil dead.Singam is congratulated for his bravery and initiative, but Singam decides to resign his job and follow his true passion and run his family's store in Thoothikudi. Ramnathan visits Singam, revealing that the resignation wasn't entirely true and that Singam has been assigned to investigate dangerous weapon smuggling in Thoothikudi. When he finds out why it's happening he is to take action and put a stop to it."
}