{
    "id": "1736647",
    "localized title": "Sakthi",
    "cast": [
        "N.T. Rama Rao Jr.",
        "Ileana D'Cruz",
        "Pooja Bedi",
        "Sonu Sood",
        "Jackie Shroff",
        "Manjari Fadnnis",
        "Nassar",
        "Mohammad Ali",
        "Prabhu",
        "M.S. Narayana",
        "Krishna Bhagavan",
        "S.P. Balasubrahmanyam",
        "Manju Bhargavi",
        "Sayaji Shinde",
        "Brahmanandam",
        "Venu Madhav",
        "Prudhviraj",
        "Srinivasa Reddy",
        "Pragathi",
        "Pavitra Lokesh",
        "Dharmavarapu Subramanyam",
        "Chandra Sekhar"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Fantasy",
        "Thriller"
    ],
    "runtimes": "161",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": [
        "India:A",
        "India:UA::(video)",
        "Singapore:NC-16",
        "United States:Not Rated"
    ],
    "original air date": "01 Apr 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2NiOWUzMjUtNjA2Mi00ZjIyLThlMmEtMjZhMzRmMDQ3ZThhXkEyXkFqcGdeQXVyNTgxODY5ODI@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1736647",
    "plot outline": "Aishwarya is on a road trip without her father's permission. Unknown to her, she has a diamond known as \"Jwalamukhi\". Few bad guys from Egypt are after Aishwarya and the diamond as both of them are the key to destroying India. Between comes Shakti, a guide for Aishwarya and co, and tries to earn money from her for every small thing but soon turns out to be her protector. Watch the rest of the movie to know how Shakti stops Egyptians from destroying India.",
    "languages": "Telugu",
    "title": "Sakthi",
    "kind": "movie",
    "directors": "Meher Ramesh",
    "writers": [
        "Meher Ramesh",
        "",
        "Meher Ramesh",
        "",
        "Satyanand"
    ],
    "producers": [
        "C. Aswani Dutt",
        "Priyanka Dutt"
    ],
    "composers": "Mani Sharma",
    "cinematographers": "Sameer Reddy",
    "editors": "Marthand K. Venkatesh",
    "art directors": "Anand Sai",
    "assistant directors": [
        "Jennifer Alphonse",
        "L.P. Rama Rao"
    ],
    "visual effects": [
        "Madhusudhana Rao Avisa",
        "Vamsi Ayyagari",
        "Bhaskarponnala",
        "Laxman Singh Bhati",
        "Amarjyoti Borah",
        "Vivek Gaur",
        "Milind Kharade",
        "Zarvan Kotwal",
        "S Kumar",
        "Prakash Kumararajan",
        "Thou Mangang",
        "Prashant Nair",
        "P.T. Njanasundaran",
        "Anupam Pal",
        "Raghava",
        "Munna Kumar Rahi",
        "Rakesh",
        "Rohit Rane",
        "Mrinal Ranjan",
        "Manas Sahoo",
        "Mazdiar Santoke",
        "Sathiyakumar",
        "Joydip Sen",
        "Mansi Shah",
        "Gaurvendra Singh",
        "Sridharan",
        "Tatampudi SrinivasaRaju",
        "Yatin Tamhane",
        "Sachin Vishwas"
    ],
    "stunts": "Stun Shiva",
    "music department": [
        "Javed Ali",
        "Jonnavithula",
        "N.C. Karunya",
        "Malavika",
        "Suchitra Ramadurai",
        "Ranjith",
        "Rita",
        "Ramajogayya Sastry",
        "Chinmayee Sripada",
        "Hemachandra Vedala"
    ],
    "script department": [
        "J.K. Bharavi",
        "D.S. Kannan",
        "Thota Prasad",
        "Satyanand",
        "Veerendranath Yandamoori"
    ],
    "miscellaneous": [
        "J.K. Bharavi",
        "Siva Kiran",
        "Brinda Master",
        "Thota Prasad",
        "Prem Rakshith",
        "Raju Sundaram",
        "Vishal Tyagi",
        "Veerendranath Yandamoori"
    ],
    "akas": [
        "Ek Tha Soldier (India, Hindi title)",
        "Сила Шакти (Russia)"
    ],
    "writer": [
        "Meher Ramesh",
        "Meher Ramesh",
        "Satyanand"
    ],
    "director": "Meher Ramesh",
    "production companies": "Vyjayanthi Movies",
    "distributors": [
        "Ficus",
        "Vyjayanthi Movies",
        "Vyjayanthi Movies"
    ],
    "other companies": "Aditya Music",
    "plot": [
        "While on a trip, a guide starts protecting the central minister's daughter from some Egyptians who want her and a holy diamond in their custody.",
        "Aishwarya is on a road trip without her father's permission. Unknown to her, she has a diamond known as \"Jwalamukhi\". Few bad guys from Egypt are after Aishwarya and the diamond as both of them are the key to destroying India. Between comes Shakti, a guide for Aishwarya and co, and tries to earn money from her for every small thing but soon turns out to be her protector. Watch the rest of the movie to know how Shakti stops Egyptians from destroying India.::abhiramreddy48",
        "Embedded with fierce action and historical fantasy, this action thriller combines mythology with modern-day reality, through the twists and turns in the life of Shakthi, who works as a guide. He meets with Aishwarya, the vivacious daughter of Central Union Home Minister, Raya while working as a tour guide and after a few sparks, the youngsters fall in love. However, there are closely held secrets in the family history of both Aishwarya and Shakthi, that combine together to take them on a dangerous adventure that could impact all of humanity. Will the young couple succeed in overcoming seemingly insurmountable odds to unite?::Shrinivas G. Kulkarni"
    ],
    "synopsis": "Faqtooni, an Egyptian woman, vows to seek revenge after the death of her husband Mukthar, and trains her sons, Bashim and Raakha. After several years, Bashim is told to capture Aishwarya, the daughter of the central union home minister Mahadevraya, along with the Jwalamukhi Diamond her father possesses. Aishwarya, on the other hand, wants to go on a trip with her friends but her father doesn't allow her to leave due to security reasons and instead arranges for security to make sure she doesn't leave. However, she manages to leave but not before unknowingly packing the Jwalamukhi diamond in her bag while taking cash from the vault. She randomly decides to go to Jaipur, where she decides to watch a film but her friend Tommy is bullied by some thugs. They're rescued by a man named Shakti, who fights off all the goons but demands extra money for saving them. Aishwarya starts to hate him, and in the meanwhile, Mahadevaraya comes to know that Aishwarya has escaped. He tries to convince Jackie to give him the Rudra Trident in exchange for his entire wealth, but he doesn't comply. Two police officers are assigned to find Aishwarya by all means.Shakti turns out to be a tourist guide who accompanies Aishwarya and her friends wherever they want to go. From the deserts of Rajasthan to the mountains of Jammu and Kashmir, their hatred only keeps elevating until a prank attempt by Aishwarya goes wrong, causing Shakti to rescue her. She falls for him, but soon Bashim's men kidnap her, causing Shakti to fight them off and rescue Aishwarya. Before leaving the lodge where they were staying, they click a picture with Satthi, the manager and then leave for Haridwar. After their departure, Bashim arrives there to ask about Aishwarya, but Satthi doesn't tell anything. However, that picture they clicked together reveals the truth. Satthi is forced to call Shakti's assistant to ask where they're heading to. After knowing the next stop would be Haridwar, Bashim stabs both Satthi and his wife to death. Mahadevaraya returns to India and is shocked to find the Jwalamukhi missing. His wife believes Aishwarya to have taken it accidentally along with the money. Fearing that the diamond might not getting purified now, he heads to Haridwar to meet a sage who has been helping him with this matter. On the other hand, Shakti and Aishwarya arrive in Haridwar, and while changing clothes, the Jwalamukhi slips out of Aishwarya's bag and falls into Shakti's hands while he's taking a dip into the river water. The sage realizes it from a distance that the Jwalamukhi has been cleansed and Aishwarya's protector has arrived. Mahadevaraya is pleased to hear this and the two police officers inform him that Aishwarya is in Haridwar but has left.While leaving Haridwar, she proposes Shakti, who declines. On their way, they're attacked by Bashim and his armed goons. However, in a twist, Shakti is revealed to be an undercover agent named Shakti Swaroop who had been accompanying Aishwarya in order to make sure she's safe. Armed and backed up by his force, Shakti and Bashim engage in a huge shootout resulting in a lot of destruction and Bashim arrested. Shakti finds the Jwalamukhi lying on the road after falling from his box and picks it up. On the other hand, Jackie goes to meet Faqtooni and demands a huge sum in exchange for the Rudra Trident. Aishwarya is taken to her parents and apologizes. However, she denies knowing about any diamond. Officer Siva calls Shakti in his chamber to ask him about who gave him the permission for the undercover operation. He reveals that while attacking a terrorist group hiding in a hotel, he found out that Aishwarya was their target, and thus he went to her home to check the security arrangements. He saw her fleeing away and knew the terrorists would follow her, due to which he followed her as a guide. Upon realizing Bashim has been captured by the police, Faqtooni sends her elder son Raakha to India to save him. It is then revealed that Shakti is Siva's son, and Aishwarya confesses her love for him to his mother while visiting his home to take her belongings. Shakti too reciprocates and his parents approve of their love. The Jwalamukhi slips into the flower basket, which is taken by Shakti and his parents who ask Aishwarya to accompany them to the temple as it's Shakti's birthday. On the other hand, Jackie is contacted by Faqtooni's brother Jaffer, informing him that she's ready to pay any price for the Rudra Trident. He decides to call him later, and then meets Avatar, the new security specialist who locks the trident safely.While praying, the diamond rolls towards Shakti, who picks it up and Siva tells Aishwarya that it's the same diamond box her father was looking for. Shakti opens it and the diamond begins to glow when Aishwarya touches it. Siva informs Mahadevaraya, who tells him to bring the diamond along with his daughter to Hampi. On the other hand, Raakha arrives in India and invades the prison. Shakti, while informing officer Raghu about the diamond and him leaving for Hampi with the chief, learns that the prison has been attacked and immediately rushes there while Raakha kills the guards, rescues Bashim and now heads to stop Siva from taking away the diamond. Shakti then arrives at the prison to learn it from Raghu that the brothers are after the diamond. Raakha attacks the officers and almost defeats Shakti, who ends up touching the Jwalamukhi and suddenly punches Raakha hard, leaving him injured. Shakti's parents and Aishwarya then go to Hampi, where Bashim attacks them but is killed after a fight by Shakti, with the sword of the temple's protector. Realizing the protector has arrived, the sage and Aishwarya's parents arrive there, and recognize him as the protector, following which a flashback unfolds.27 years ago, Mahadevaraya'a father Vijayraya was a royal king who was extremely generous and had the blessings of god which gave him the power that whenever he touched the stone, it used to shine brightly emitting light. He reveals that apart from the 18 Shakti Peeths there is a secret one which protects India and only their family knows of it. There was a protector named Rudra who guarded it. After every 27 years, they must go to the Shakti Peeth where the protector will perform several spiritual rites which must be compulsorily performed. While performing them, Faqtooni's husband Mukhtar came to destroy their temple and Shakti Peeth. He kidnapped Rudra's servant Basava and pregnant wife, and challenged Rudra for a fight as the others prayed. Rudra bravely confronted them all, beheading Mukhtar but soon got stabbed by Janaki Verma \"Jackie\" who sought money from Mukhtar and also killed Vijayaraya and his wife. He managed to steal the Rudra Trident and flee. Rudra's wife dies after delivering their kid, whom Rudra blessed and handed over to Basava, who was forced by circumstances to send the boy away via water. It is then revealed that Siva and his wife are not Shakti's real parents and they adopted him when they went to pray for a child and found him in the Tungabhadra River. An aged Basava who lost his sanity after losing Shakti is delighted to meet him, who is told that the Eclipse is arriving and the Egyptians are planning to destroy the temple again. Mahadevaraya also tells him to bring the Rudra Trident from Jackie in Dubai. Arriving there, Shakti tricks Avatar into giving him all the details about the lock surrounding the trident.Jackie then escapes along with the trident, only to be attacked by Shakti who kills his men, Jaffer and then Jackie himself. He returns to India with the trident but is on the way betrayed and shot down by Mahadevaraya's partner who's revealed to have been on Faqtooni's side. Mahadevaraya stabs him to death but is himself knocked unconscious by Raakha who's now hard to be defeated. Aishwarya and the sage are taken to perform the rites, where the destruction started by Raakha causes Shakti to get revived and come there to rescue everyone. A fight ensues, and Shakti continues to kill the goons and battle Raakha while also performing the rites at the same time. Faqtooni is thrown into a deep hole and Raakha is killed by getting stabbed in the eyes who were actually of his father, Mukhtar. After performing the rites, Shakti puts back the trident and once the process is over, all the enemies get disappeared. Mahadevaraya regains consciousness, while Shakti, Aishwarya and the saint walk out with the Jwalamukhi diamond."
}