{
    "id": "1783377",
    "localized title": "Sri Rama Rajyam",
    "cast": [
        "Akkineni Nageshwara Rao",
        "Nandamuri Balakrishna",
        "Nayanthara",
        "Srikanth",
        "Meka Srikanth",
        "Vindu Dara Singh",
        "Sai Kumar",
        "K.R. Vijaya",
        "Sana",
        "Murali Mohan",
        "Brahmanandam",
        "Balaiah M.",
        "Sudha",
        "Jayasudha",
        "Raghunatha Reddy",
        "Jhansi",
        "Hema",
        "Nagineedu",
        "Siva Parvathi",
        "Rallapalli",
        "Sameer",
        "Subbaraya Sarma"
    ],
    "genres": [
        "Drama",
        "Fantasy"
    ],
    "runtimes": "172",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "17 Nov 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDAxYWY5NzAtNTJjMi00NmFlLTlhM2QtZTMxMmYzOGU1ZTRlXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1783377",
    "plot outline": "Lord Rama's life is one of perfect adherence to dharma (righteousness) despite harsh tests of life and time. Sri Rama Rajyam movie explains how poet Valmiki, the author of the epic Ramayana narrates the script in general. The movie further showcases the incidents in Lord Rama's life and how his journey goes on after he saves Sita from Raavana and also highlights the main principle's of Ramayama and Lord Rama i.e. How An Ideal Son, An Ideal Brother, An Ideal Husband and An Ideal Emperor should be. The film starts with the arrival of Rama and Sita to Ayodhya after vanquishing Ravan in Lanka. Rama is now the king of Ayodhya. Under his rule the people are happy and prosperous. Just when everything seems to be going fine, a comment by a washer man makes Rama to send Sita away into the forest. From here the real story of Sri Rama Rajyam begins. Sita is given shelter by Sage Valmiki. He keeps her identity a secret and looks after her as his own daughter. Sita gives birth to Lava and Kusha. Valmiki imparts knowledge to them and also teaches them how to use weapons (Artha Vidya). They also study Ramayana and Valmiki asks them to preach the story across the length and breadth of Ayodhya. At this juncture, Rama plans to conduct Ashwamedha Yagnam for the welfare of the people.",
    "languages": "Telugu",
    "title": "Sri Rama Rajyam",
    "kind": "movie",
    "directors": "Bapu",
    "writers": "Mullapudi Venkata Ramana",
    "producers": [
        "Thandava Krishna",
        "Yalamanchili Saibabu",
        "Saibaba Yalamanchali"
    ],
    "composers": "Ilaiyaraaja",
    "cinematographers": [
        "Raju P.R.K.",
        "Raju R.K."
    ],
    "editors": "Krishna Rao G.G.",
    "art directors": [
        "Kiran Kumar Manne",
        "Raveendar",
        "Ravindra"
    ],
    "assistant directors": "Kakarla Srinivasu",
    "sound department": [
        "Akula Bhaskar",
        "Radhakrishna Eskala",
        "J.R. Ethiraj",
        "Shadab Rayeen"
    ],
    "visual effects": [
        "Konduru Achiraju",
        "Adel Adili",
        "Nayeem Akhtar",
        "G. Alokhnath",
        "Manidhar Areti",
        "Rajeshsai Athmuri",
        "Madhusudhana Rao Avisa",
        "Prabhakar Balli",
        "Balaji Chanda",
        "Michael Cliett",
        "Ramaiah Debbati",
        "Ramaiah Debbati",
        "M.S. Deepraj",
        "Pete Draper",
        "Aneel Laxman Ganji",
        "Phani Vihari Gantala",
        "Chandra Sekhar Kamuju",
        "Vijay Babu Kokkiligadda",
        "Rama Rao Kuchi",
        "Sriram Namana",
        "Arun Pawar",
        "Velmurugan Rajamani",
        "Naresh Sattenapalli",
        "Yugandhar Tammareddy",
        "Srinath Tammina",
        "Anil Telikepalli",
        "Venkat Vadisetti",
        "Pavan Veeramaneni",
        "Mithun Velluri",
        "Naresh Yalla"
    ],
    "casting department": "Sayed Ashfaque",
    "costume departmen": "Binita Shamdasani",
    "music department": [
        "Anitha",
        "S.P. Balasubrahmanyam",
        "K.S. Chithra",
        "Shreya Ghoshal",
        "Jonnavithula",
        "Keerthana",
        "Sriram Parthasarathy",
        "Surabhi Sravani",
        "Tippu",
        "Vennelakanti"
    ],
    "miscellaneous": [
        "Edida Raja",
        "Sunitha"
    ],
    "akas": "Рамараджья (Russia)",
    "writer": "Mullapudi Venkata Ramana",
    "director": "Bapu",
    "production companies": "Sri Saibaba Movies",
    "distributors": [
        "Blue Sky Cinema",
        "Amazon Prime Video",
        "Amazon Prime Video",
        "Sun TV"
    ],
    "special effects": [
        "EFX",
        "Makuta",
        "Orange Media",
        "Pixelloid"
    ],
    "other companies": [
        "AP International",
        "Aditya Music",
        "Anand Cine Services",
        "EFX",
        "National Litho Printers",
        "Ramoji Film City",
        "Whacked Out Media",
        "Whacked Out Media"
    ],
    "plot": [
        "After getting exiled by Lord Rama, Sita gives birth to Lava and Kusa. Under Sage Valmiki's guidance, the boys set out to preach the Ramayana in Ayodhya but a shocking truth awaits them there.",
        "Lord Rama's life is one of perfect adherence to dharma (righteousness) despite harsh tests of life and time. _Sri Rama Rajyam_ (qv) movie explains how poet Valmiki, the author of the epic Ramayana narrates the script in general. The movie further showcases the incidents in Lord Rama's life and how his journey goes on after he saves Sita from Raavana and also highlights the main principle's of Ramayama and Lord Rama i.e. How An Ideal Son, An Ideal Brother, An Ideal Husband and An Ideal Emperor should be. The film starts with the arrival of Rama and Sita to Ayodhya after vanquishing Ravan in Lanka. Rama is now the king of Ayodhya. Under his rule the people are happy and prosperous. Just when everything seems to be going fine, a comment by a washer man makes Rama to send Sita away into the forest. From here the real story of _Sri Rama Rajyam_ (qv) begins. Sita is given shelter by Sage Valmiki. He keeps her identity a secret and looks after her as his own daughter. Sita gives birth to Lava and Kusha. Valmiki imparts knowledge to them and also teaches them how to use weapons (Artha Vidya). They also study Ramayana and Valmiki asks them to preach the story across the length and breadth of Ayodhya. At this juncture, Rama plans to conduct Ashwamedha Yagnam for the welfare of the people.::Shiv"
    ],
    "synopsis": "Lord Rama along with his wife Sita,brother Lakshmana,Hanuman and others,returns to Ayodhya,his kingdom,after terminating the evil king Ravana.They receive a grand welcome.Sita was also prgnant at that time.\nAfter living happily for a few days a situation arises where Rama had to send Sita to the forest due to a remark made by a washerman.As Rama always abided by the rules that made their kingdom,he had no other choice.He asks his brothers to take the kingdom as he wanted his wife not the crown.As they were not in a position to do so,Rama,yielding to the rules,most unwillingly asks Lakshmana to leave Sita near the hermitage of Valmiki in the forest.Sita,not knowing all this follows him to the forest.But after learning the reason she broke into tears fainted.Valmiki,who has just completed writing Ramayana received her well.\nShe gave birth to twins Lava and Kusha who were brought up without knowing their identity.They were taught all the vedas including Ramayana and the usage of magical weapons.They go to Ayodhya on an occasion and perform their songs infront of the people and also Rama.But he did not know that they were his own sons.\nLord Rama holds Ashwamedha yagna and sets loose a horse which was controlled by Lakshmana.Lava and Kusha stop the horse when it reaches their area,makes Lakshmana faint using their skills,tie the horse waiting for Rama to come.When he arrives they were enchanted by his charm.He,initially did not want to fight with kids but he was forced to do so.Hanuman sees them when the fight is about to fight and informs Sita,who was in the middle of a ritual.She rushes to stop the fight and succeeds in doing so.Valmiki also reaches there.The children learn the truth about their parents Finally she hands them to Rama over and calls the earth,her mother to receive her and goes into the earth.Lava and Kusha are made the kings of the kingdom.In the final scene,Rama is shown ending his avatar(incarnation) and joining Sita,who is nothing but Goddess Lakshmi."
}