{
    "id": "1814619",
    "localized title": "Aashiqui.In",
    "cast": [
        "Shubhi Ahuja",
        "Amit Dhamija",
        "Preeti Gandwani",
        "Tiya Gandwani",
        "Kalpesh",
        "Kamal Malik",
        "Ishaan Singh Manhas",
        "Dheeraj Miglani",
        "Pooja Mulye",
        "Ankita Srivastava"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "109",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "Dolby Digital",
        "Dolby SR"
    ],
    "certificates": [
        "India:U",
        "Singapore:PG"
    ],
    "original air date": "21 Jan 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWZiMmU2ZjAtNmFlYS00ZmQ0LTg2MDItM2RkYTc0NTNhNDYzXkEyXkFqcGdeQXVyMjE0MDY2Nzk@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "1814619",
    "plot outline": "Cyrus and April meet randomly online and they start getting close but they never reveal their true identities. But patience runs out and they finally decide to meet. Somehow April manages to find out his true identity but Cyrus fails to do so. April thinks that Cyrus is too good for her and tries to sulk away in the fear of rejection whereas Cyrus looks for her everywhere as she was the only one who could understand him as a friend and as a lover. Will Cyrus and April finally meet? Will Cyrus accept April for what she really is? Will April find the courage to be herself and claim the life she's always wanted?",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Aashiqui.In",
    "kind": "movie",
    "directors": "Shankhadeep",
    "writers": [
        "Shankhadeep",
        "",
        "Shankhdeep"
    ],
    "producers": [
        "Amit Chheda",
        "Shashikant Chheda"
    ],
    "composers": [
        "Nitin Gupta",
        "Nitin Kumar Gupta",
        "Prem Haria"
    ],
    "cinematographers": [
        "Bharat R. Parthsarathy",
        "Bharat Parthsarthi"
    ],
    "editors": "Fazal Husain",
    "assistant directors": "Abhishek Anil Tiwari",
    "music department": [
        "Bittu",
        "Sunidhi Chauhan",
        "Kunal Ganjawala",
        "Nitin Gupta",
        "Jojo",
        "Kalyani",
        "Amit Kumar",
        "Mukesh",
        "Neha Rajpal",
        "Shaan",
        "Sukhwinder Singh"
    ],
    "akas": "Aashiqui.In (India)",
    "writer": [
        "Shankhadeep",
        "Shankhdeep"
    ],
    "director": "Shankhadeep",
    "plot": [
        "A dark-complexioned waitress develops an on-line relationship a hunk in her school.",
        "Cyrus and April meet randomly online and they start getting close but they never reveal their true identities. But patience runs out and they finally decide to meet. Somehow April manages to find out his true identity but Cyrus fails to do so. April thinks that Cyrus is too good for her and tries to sulk away in the fear of rejection whereas Cyrus looks for her everywhere as she was the only one who could understand him as a friend and as a lover. Will Cyrus and April finally meet? Will Cyrus accept April for what she really is? Will April find the courage to be herself and claim the life she's always wanted?::amit chheda",
        "Dark-complexioned April (Ankita Shrivastava) lives a wealthy & idyllic lifestyle with her widowed restaurant-owner father (Amit Dhamija), who re-marries a woman, Mona (Sharmila Joshi) with two daughters, Saniya (Shubhi Ahuja) and Taniya (Priti Gandwani). Shortly thereafter her father suddenly passes away, and Mona starts abusing her. Years later, April now works as a waitress, also attends college at Finolex Academy and has a close friend in Raj Malhotra (Dheeraj Miglani). Using an identity of Cinderella, that was meant for her step-sister, she develops an on-line relationship with an unknown male named Prince who wants to meet her. While Mona wants her to work and give up on her education and even tears up her scholarship, the staff at the restaurant encourage her to go to college, and she not only does so but also attends a contest dressed up as Cinderella. Events then will lead her to be attracted to the school hunk-swimmer, Cyrus, who dislikes waitresses and has a steady girlfriend in Sonia Bajaj (Tiya Gandwani). Watch what happens when Saniya and Taniya both team up with Sonia to humiliate April.::rAjOo (gunwanti@hotmail.com)",
        "Cyrus and April meet randomly online and they start getting close but they never reveal their true identities. But patience runs out and they finally decide to meet. Somehow April manages to find out his true identity but Cyrus fails to do so. April thinks that Cyrus is too good for her and tries to sulk away in the fear of rejection whereas Cyrus looks for her everywhere as she was the only one who could understand him as a friend and as a lover - Will Cyrus and April finally meet? Will Cyrus accept April for what she really is? Will April find the courage to be herself and claim the life she's always wanted?::amit chheda"
    ]
}