{
    "id": "1851988",
    "localized title": "Ko",
    "cast": [
        "Jiiva",
        "Ajmal Ameer",
        "Karthika Nair",
        "Piaa Bajpai",
        "Prakash Raj",
        "Kota Srinivasa Rao",
        "Sona Heiden",
        "Jagan",
        "Pattimandram Raja",
        "Achyuth Kumar",
        "Bose Venkat",
        "Imman Annachi",
        "D.R.K. Kiran",
        "Kadhal Kannan",
        "Kaajal Pasupathi",
        "Suriya",
        "Karthi",
        "Tamannaah Bhatia",
        "Abbas",
        "Harris Jayaraj",
        "Anjali",
        "Peter Hein",
        "Anuja Iyer",
        "Jai",
        "Rima Kallingal",
        "R. Kannan",
        "Madhan Karky",
        "Krish",
        "Atharvaa Murali",
        "Narain",
        "Jayam Ravi",
        "Rail Ravi",
        "M. Sasikumar",
        "Shiva",
        "Sanjana Singh",
        "Bharath Srinivasan",
        "D. Suresh",
        "Ganesh Venkatraman",
        "John Vijay"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "128",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Malaysia:U",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "22 Apr 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTIxNTk5ODktMTJmOS00NWMxLTk2NDItMjFiYTM5ZDA1MGQxXkEyXkFqcGdeQXVyODE0NjUxNzY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "1851988",
    "plot outline": "Fresh and enthralling, this contemporary action thriller follows the adventures of Ashwin (Jiiva), a hardworking committed photographer working for a Tamil daily 'Dina Anjali'. His passion for coming out with pictures that speak and tell the truth, makes him a star in his office. Two lady journalists working in the same paper Renuka (Karthika), the investigative reporter and Saro (Piaa), who covers the entertainment section, develop a soft corner for him. Meanwhile, Tamil Nadu assembly elections are underway and the fight is basically between two corrupt politicians, Chief Minister Yogeswaran (Prakash Raj) and opposition leader, Kota (Kota Sreenivasa Rao) seem to be the main players. They will do anything to come to power, including bribing the electorate and inciting violence and criminal activity. Suddenly, due to Renuka's writing and Ashwin's scoop photos, a third force led by youth, Vasanthan (Ajmal) who believes in clean politics, emerges. Just before elections, while addressing a huge youth rally a bomb goes off at the election campaign meeting of Vasanthan, killing Saro. Ashwin and the general public are convinced that it is the handiwork of the traditional politicians, and go all out to support Vasanthan, who wins the elections and becomes the youngest Chief Minister. At this point, there is a mysterious and thrilling twist to the tale, which pays credence to the adage, power corrupts and absolute power corrupts absolutely. How will Ashwin ensure that the state is in safe hands?",
    "languages": "Tamil",
    "title": "Ko",
    "kind": "movie",
    "directors": "K.V. Anand",
    "writers": [
        "K.V. Anand",
        "D. Suresh",
        "A.N. Balakrishnan",
        "",
        "K.V. Anand",
        "D. Suresh",
        "A.N. Balakrishnan",
        "",
        "D. Suresh",
        "A.N. Balakrishnan"
    ],
    "producers": [
        "James",
        "Jayaraman",
        "Elred Kumar"
    ],
    "composers": "Harris Jayaraj",
    "cinematographers": "Richard M. Nathan",
    "editors": "Anthony",
    "editorial department": [
        "Pankaj Halder",
        "Raja Pandiyen",
        "S. Raghunath Varma"
    ],
    "art directors": "D.R.K. Kiran",
    "assistant directors": "Premnath",
    "sound department": "A.S. Laxmi Narayanan",
    "visual effects": [
        "Gautam Kumar Jayaseelan",
        "Kumaran",
        "Azhagu Raj Pandian",
        "Purushothaman",
        "Harihara Suthan",
        "Srinivasan Velayutham"
    ],
    "stunts": "Peter Hein",
    "camera department": "Ariel Crnic Ladegård",
    "location management": "Tor Kristian Liseth",
    "music department": [
        "Tippu Ekhaambarresh",
        "Haricharan",
        "Hariharan",
        "Naresh Iyer",
        "Bombay Jayashri",
        "Emcee Jezz",
        "Kabilan",
        "Madhan Karky",
        "Krish",
        "Shweta Mohan",
        "Sriram Parthasarathy",
        "Sayonara Philip",
        "Vijay Prakash",
        "Prashanthini",
        "Aalap Raju",
        "Ranina Reddy",
        "Solar Sai",
        "Sricharan",
        "Srik",
        "Chinmayee Sripada",
        "Priya Subramanaiam",
        "Pa. Vijay",
        "Viveka"
    ],
    "thanks": [
        "Sigmund Elias Holm",
        "Suriya"
    ],
    "akas": [
        "Rangam (India, Telugu title)",
        "The Real Leader (India, Hindi title)",
        "Большая игра (Russia)"
    ],
    "writer": [
        "K.V. Anand",
        "D. Suresh",
        "A.N. Balakrishnan"
    ],
    "director": "K.V. Anand",
    "production companies": "R.S. Infotainment",
    "distributors": [
        "Ayngaran International",
        "Red Giant Movies",
        "Bhavani DVD",
        "Kalaignar Tv"
    ],
    "special effects": "Pixion",
    "other companies": [
        "Aditya Music",
        "Sony Music"
    ],
    "plot": [
        "Ashwin, a famous photographer, works with Renuka, an investigative journalist. When one of their colleagues, Saro, gets killed during a political meet, Ashwin and Renuka decide to investigate.",
        "Fresh and enthralling, this contemporary action thriller follows the adventures of Ashwin (Jiiva), a hardworking committed photographer working for a Tamil daily 'Dina Anjali'. His passion for coming out with pictures that speak and tell the truth, makes him a star in his office. Two lady journalists working in the same paper Renuka (Karthika), the investigative reporter and Saro (Piaa), who covers the entertainment section, develop a soft corner for him. Meanwhile, Tamil Nadu assembly elections are underway and the fight is basically between two corrupt politicians, Chief Minister Yogeswaran (Prakash Raj) and opposition leader, _Ko_ (qv)ta (_Ko_ (qv)ta Sreenivasa Rao) seem to be the main players. They will do anything to come to power, including bribing the electorate and inciting violence and criminal activity. Suddenly, due to Renuka's writing and Ashwin's scoop photos, a third force led by youth, Vasanthan (Ajmal) who believes in clean politics, emerges. Just before elections, while addressing a huge youth rally a bomb goes off at the election campaign meeting of Vasanthan, killing Saro. Ashwin and the general public are convinced that it is the handiwork of the traditional politicians, and go all out to support Vasanthan, who wins the elections and becomes the youngest Chief Minister. At this point, there is a mysterious and thrilling twist to the tale, which pays credence to the adage, power corrupts and absolute power corrupts absolutely. How will Ashwin ensure that the state is in safe hands?::Santhosh"
    ],
    "synopsis": "The movie opens with a scene of a bank robbery in progress. The actions of the robbers during the gateway is photographed by Ashwin (Jeeva). After a chase, the injured Ashwin loses his camera to the robbers but managed to retrieve the memory card. His brave actions are broadcasted in the local TV channels and earns him praises from his colleagues and media friends.Ashwin is a press photographer for Dina Anjal, a Tamil daily. He comes across Renuka (Karthika), who earlier caused him to fall and lose his camera during the chase . Then, there is also Saro (Piaa Bajpai) who is Ashwin's close friend and colleague. She secretly has a crush on him.Two politicians, Yogeswaran (Prakash Raj) who is the Chief Minister and his opponent Alavandhan (Kota Sreenivasa Rao). Both of them are competing to gain control of the state. Their antics and wrong-doings are exposed by Ashwin and Renuka, causing them to run into trouble with both the political figures. Then there is Vasanthan Perumal (Ajmal Ameer) , a youth who is trying to gain the confidence of the people to change the state. He was saved by Ashwin once when he was attacked by goons. His efforts to gain the people's confidence are futile as he could not displace any ot the two strongmen. Meanwhile, Ashwin falls in love with Renuka.A bomb explodes at Vasanthan's political rally and scores of people including Saro are killed and many of Vasanthan's comrades are seriously injured. This incident changes the political scenario, Many people started to support Vasanthan's party. Renuka discovers a link between Ashwin and Vasanthan. A flashback reveals that both Ashwin and Vasanthan are college mates. Ashwin admits that he is secretly helping Vasanthan in his political ambitions. Later, Vasanthan's party wins in the elections and he is elected the Chief Minister.Meanwhile, Ashwin suspects elements of foul play in Saro's death. With a footage of the scene after the blast which was recorded by a dead TV cameraman and assisted by a media friend (editor Anthony), he discovered that Saro was stomped to death by a man. He finds out that Saro's killer and the gang leader of the bank robbers are both the same person (Bose Venkat).Ashwin then goes to meet Vasanthan with the evidence. He is shocked to see the killer in the CM's office. He tries to tell Vasanthan but he is calmed down and Vasanthan sends the killer out. It is then revealed that the killer is a leader of a Naxalite movement and they are the ones who robbed the bank. Then, Ashwin tails the killer to his hideout. Unknown to him, Vasanthan has ordered police commandos to surround the Naxalite's hideout and take them down.Ashwin arrives at the hideout and realises the presence of the commandos. He forces his way into a house which is the hideout. A shoot-out ensues between the Naxalites and the commandos. The Naxal leader is then shot. The Naxal leader then realised that he was set up by Vasanthan. Ashwin gets a doctor to treat the leader and at the same time, the leader reveals shocking truths to Ashwin. Vasanthan planned the bomb blast himself. When Saro discovered the bomb, she alerted Vasanthan but was beaten up by him and later killed. The motive of the bomb blast is to gain the sympathy of the civilians and the Naxals had helped Vasanthan.Vasanthan later arrived at the terrorists' hideout. He asked the other Naxalite terrorists to kill Ashwin but he ended up killing all of them after a fierce fight. Then, Ashwin confronted Vasanthan. Both of them get engaged in a free-for-all and get hurt. Ashwin then steps on a landmine.Vasanthan pleads to Ashwin not to reveal the truth to the media.( The conversation earlier between Ashwin and the Naxal leader was being watched by Renuka via 3G and she was preparing the headline reports.) Vasanthan tells Ashwin that if the truth is revealed then the people will sure lose their faith in the youths completely.Ashwin then releases the landmine and jumps off the window. The landmine explodes and Vasanthan is killed. Ashwin then urges Renuka to delete the headline reports. She was reluctant but after pleads from Ashwin she deletes it. She prepares a new report stating the death of Vasanthan.Ashwin and Renuka reveal the truth to the editor and submits their resignation letters. The editor rejects their resignation and both of them continue to work at the daily while Vasanthan's friends who are elected ministers rule the state."
}