{
    "id": "1948150",
    "localized title": "Singham",
    "cast": [
        "Ajay Devgn",
        "Prakash Raj",
        "Sudhanshu Pandey",
        "Kajal Aggarwal",
        "Sonali Kulkarni",
        "Sachin Khedekar",
        "Meghna Vaidya",
        "Suchitra Bandekar",
        "Suhasini Deshpande",
        "Agasthya Dhanorkar",
        "Anant Jog",
        "Ankur Nayyar",
        "Hari Bala",
        "Besant Ravi",
        "Hariharasudhan Balasubramani",
        "Jayant Sawarkar",
        "Vineet Sharma",
        "Sana Amin Sheikh",
        "Harish Shetty",
        "Pradeep Velankar",
        "Naushaad Abbas",
        "Ravindra Berde",
        "Devidas Chippa",
        "Vikas Kadam",
        "Neeraj Khetrapal",
        "Govind Namdeo",
        "Kishore Nandlaskar",
        "Vijay Patkar",
        "Ashok Samarth",
        "Ashok Saraf",
        "Murali Sharma",
        "Sharad Vittal Shetty"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "runtimes": "143",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "mr",
        "gu",
        "tcy",
        "en"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:M",
        "Canada:PG::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:G::(Quebec)",
        "India:UA",
        "Ireland:12A",
        "Netherlands:12",
        "New Zealand:M",
        "Norway:11::(cinema rating)",
        "Singapore:PG",
        "South Africa:13",
        "South Korea:15",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated",
        "United States:TV-14::(Netflix)",
        "United Arab Emirates:16+::(self-applied)"
    ],
    "original air date": "22 Jul 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTA2NTAyNTMyMDdeQTJeQWpwZ15BbWU3MDEyMTY1ODU@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1948150",
    "plot outline": "Following charges of corruption, Colva's (Goa) Police Inspector Rakesh Kadam kills himself, leaving a devastated wife, Megha, and son, Nitin. She takes it upon herself to canvas support that her husband was framed by a gangster, Jaykant Shikre, and vainly insists on a CBI Inquiry. When the High Court requires Jaykant, on unrelated charges, to present himself at Shivgad Police Station, which is located at the borders of Maharashtra and Karnataka, he refuses to do so, and the local Inspector Bajirao Singham, who has recently fallen in love with stunning Kavya Bhosle, summons him. An enraged Jaikant does appear along with an army of goons, but is no match for Bajirao, who has support from the entire community. Humbled and humiliated, Jaykant returns to Goa, and ensures Bajirao gets transferred there. It is here he not only plans to use an army of goons, his control and influence over politicians and senior police officers to plan the ultimate vengeance with impunity but also contest and win the local elections.",
    "languages": [
        "Hindi",
        "Marathi",
        "Gujarati",
        "Tulu",
        "English"
    ],
    "title": "Singham",
    "kind": "movie",
    "directors": "Rohit Shetty",
    "writers": [
        "Hari",
        "",
        "Yunus Sajawal",
        "",
        "Sajid",
        "",
        "Farhad Samji"
    ],
    "producers": [
        "Sada Bhuvad",
        "Rohit Chaudhury",
        "Mahesh Ramanathan",
        "Krishanu Sarbabhowm",
        "Dhiraj Shah"
    ],
    "composers": [
        "Ajay Gogavale",
        "Atul Gogavale",
        "Amar Mohile"
    ],
    "cinematographers": "Dudley",
    "editors": "Steven H. Bernard",
    "editorial department": [
        "Rahul Bhadve",
        "Tushar Jadhav",
        "Rohit Karkera",
        "Debakriti Kundu",
        "Nitin Minz",
        "Dilip Kumar Sah",
        "Makarand Surte"
    ],
    "casting directors": "Bhupesh Ramkrishna Joshi",
    "art directors": "Narendra Rahurikar",
    "costume designers": [
        "Vikram Phadnis",
        "Navin Shetty"
    ],
    "production managers": [
        "Rashid Ali Khan",
        "K.S. Ravindran",
        "Shyam Rawat",
        "Raju Yadav"
    ],
    "assistant directors": [
        "Krishna Ananthan",
        "Surender Dhavle",
        "Vidhi Ghodgaonkar",
        "Amit Naikar",
        "Megha Namdev",
        "Sushwanth Prakash",
        "Sneha Shetty",
        "Kapil Singh",
        "Rajiv Verma"
    ],
    "art department": [
        "Swapnil Bhalerao",
        "Sukant Gantayat",
        "Gautam Jadhav",
        "Narendra Rahurikar",
        "Tajamul Shaikh"
    ],
    "sound department": [
        "Subir Kumar Das",
        "Anup Dev",
        "Dipesh Sharma",
        "Shankar Singh",
        "Gunjan Srivastava"
    ],
    "special effects": [
        "Agnelo D'Souza",
        "Vishal Phuria"
    ],
    "visual effects": [
        "Wasim Ali",
        "Navneet Arora",
        "Vaishali Awaghade",
        "Vishal Bansal",
        "Rahul Bhatli",
        "Yatin Bhave",
        "Halder Dipansu",
        "Nelson Dsouza",
        "Marchila Dutta",
        "Gsanjeevandreason",
        "Sumit Singh Jaswal",
        "Jay Joshi",
        "Pratik Kalbende",
        "Rahul Kallankandy",
        "Vilas Kankuntla",
        "Chandan Kar",
        "Imran Khan",
        "Zain Khan",
        "Ashutosh Khandelwal",
        "Anup Kumar",
        "Umesh Kumar",
        "Raghunathan Kunal",
        "Pranab Lahkar",
        "Gokul Mahajan",
        "Vaibhav Laxman Mahajan",
        "Intekhab Mahmood",
        "Feroz Mallick",
        "Vishram Mondkar",
        "Kapil More",
        "Panchal Narendra",
        "Ganesh Navgane",
        "Anupam Pal",
        "Sujata Pandit",
        "Bhavesh Patel",
        "Amit Patil",
        "Naveen Paul",
        "Uppu Pavanrajesh",
        "Rajiv Raghunathan",
        "Tuhin Rana",
        "Sheveta Raut",
        "Viresh Raut",
        "Anil Rawat",
        "Bhaskar Reddy",
        "Ranadheer Reddy",
        "Dhanendra Sahu",
        "Sumit Sarkar",
        "Tushar Shah",
        "Anuj Sharma",
        "Ashutosh Sharma",
        "Shwet Suman Sharma",
        "Yogesh Sharma",
        "Chandrakant Shenoy",
        "Shraddha",
        "Shubham.Gupta",
        "Abhishek Singh",
        "Kanwaljeet Singh",
        "Shaikh Sohel",
        "Dinesh Solanki",
        "Jitendra Soni",
        "Balakrishna P. Subaiah",
        "Meera Sukhathankar",
        "Harihara Suthan",
        "Vivek Tekale",
        "Viral Thakkar",
        "Prashant Thakur",
        "Vinay Thakur",
        "Sudhir Trivedi",
        "Ashok Uchil",
        "Kumar Umesh",
        "Shraddha Uppu",
        "Vinod Vyas",
        "Jitendra Yadav"
    ],
    "stunts": [
        "Rajesh Kannan",
        "Jai Singh Nijjar",
        "Rohit Shetty",
        "Sharad Vittal Shetty"
    ],
    "camera department": [
        "Raju Ansari",
        "Falgunee Bhusan",
        "Navin Gadkari",
        "Srinivas Gundala",
        "Avinash Gupta",
        "Hardik Joshi",
        "Mahendra Samanta",
        "Rajan Sohani"
    ],
    "casting department": "Kruti Popat",
    "costume departmen": [
        "Hari Goswami",
        "Siraj Khan",
        "Suryakant Lokam"
    ],
    "music department": [
        "Salil Amrute",
        "Aditya Bedekar",
        "Subir Kumar Das",
        "Kunal Ganjawala",
        "Shreya Ghoshal",
        "Ajay Gogavale",
        "Swanand Kirkire",
        "Dipesh Sharma",
        "Richa Sharma",
        "Sukhwinder Singh"
    ],
    "miscellaneous": [
        "Ganesh Acharya",
        "Rohini Bhandari",
        "Ankit Bhatia",
        "Devashish Chainani",
        "Mithun D'Souza",
        "Parag Desai",
        "Vikas Kadam",
        "Ajay Kanojiya",
        "Prasad Karve",
        "Aneesh Mohan",
        "Ashish R. Mohan",
        "Avinash Rajan",
        "Ashish Ranglani",
        "Dhairya Roy"
    ],
    "akas": [
        "Singam tamil (India, Tamil title)",
        "Сингам (Russia)"
    ],
    "writer": [
        "Hari",
        "Yunus Sajawal",
        "Sajid"
    ],
    "director": "Rohit Shetty",
    "production companies": "Reliance Entertainment",
    "distributors": [
        "Entertainment One",
        "Reliance Entertainment"
    ],
    "special effects companies": "Pixion Studio",
    "other companies": [
        "Big Music and Home Entertainment",
        "T-Series",
        "Universal Communications"
    ],
    "plot": [
        "A truly honest police officer is transferred to a town controlled by a gangster he has humiliated. The gangster believes he can use good power to bring down this officer who made him look foolish and weak.",
        "Following charges of corruption, Colva's (Goa) Police Inspector Rakesh Kadam kills himself, leaving a devastated wife, Megha, and son, Nitin. She takes it upon herself to canvas support that her husband was framed by a gangster, Jaykant Shikre, and vainly insists on a CBI Inquiry. When the High Court requires Jaykant, on unrelated charges, to present himself at Shivgad Police Station, which is located at the borders of Maharashtra and Karnataka, he refuses to do so, and the local Inspector Bajirao _Singham_ (qv), who has recently fallen in love with stunning Kavya Bhosle, summons him. An enraged Jaikant does appear along with an army of goons, but is no match for Bajirao, who has support from the entire community. Humbled and humiliated, Jaykant returns to Goa, and ensures Bajirao gets transferred there. It is here he not only plans to use an army of goons, his control and influence over politicians and senior police officers to plan the ultimate vengeance with impunity but also contest and win the local elections.::rAjOo (gunwanti@hotmail.com)",
        "Rakesh Kadam, a truly honest inspector of Goa (Colva) police kills himself as he could not live with the thought that people disgrace him of being a tainted police officer. He was framed in a corruption case as Kadam was proving to be a major blockade to gangster operations in Goa city. His wife Megha (Sonali Kulkarni) takes it upon herself to fight against the odds. Meanwhile, Jaykant Shikre (Prakash Raj), a notorious gangster, takes on Megha and accuses her of trying to clear her husband's name while flaunting his good side during media interactions. Shikre is ill-famous for dacoity, extortion, kidnapping, killings, land grabbing, and other related oppression. Another valiant, charismatic, and self-disciplined police inspector Bajirao _Singham_ (qv) (Ajay Devgan) who operates in his unique style - solves cases conventionally without summoning people to his police station in Shivgad. He becomes very popular in his village and simultaneously falls in love with stunning Kavya Bhosle (Kajal Agarwal). And, a heartwarming love story unfolds between the two. In a High Court directive wherein Shikre was told to present himself, for a different case, at Shivgad police station, but he refuses to do so as the village is located very far on the borders of Maharashtra and Karnataka. Although, self-styled Bajiroa summoned him and enraged Jaikant travels all the way to the police station where he was received uncongenially like a small-time thug. Devastated and humiliated with the insult in front of his army of goons, Shikre ensures inspector Bajirao gets transferred to the city as to wreak vengeance on him. Shikre challenges his ethics and beliefs - an attempt to belittle him after being transferred to Goa (Colva) police station. Bajirao is shattered up to the extent that he wanted to leave the job and go back to his village Shivgad. And, that is where Kavya jumps in and convinces him to stand-up against Jaikant Shikre and his dreadful goon gang. Megha has been meeting with ministers, high-rank police officials and vainly insists on CBI inquiry into her husband's case, however, she gets nothing but disappointment. The news breaks out of Shikre contesting local elections and he wins. Bajirao never misses any opportunity to set Shikre up, but to no avail since corrupted senior police officials, bureaucrats, and ministers have never lent any support to weed out gangsters like Jaikant. Bajirao is the only inspector after Kadam who stood up sternly against him. Justice has been denied in Goa city since Jaikant's rise to power until one-day Bajirao with entire Goa police force rose to the occasion, launched an offensive against Jaikant Shikre and he was killed few hours before his oath-taking ceremony as minister. Inspector Rakesh Kadam gets clean chit posthumously and was praised for his role in the eradication of crime from the city.This powerful action-emotional drama is one of the finest works of Rohit Shetty and Team.::Javid Ali",
        "Bajirao _Singham_ (qv) is an honest cop in small town of Shivgadh with a respectful family.Jaikanth Shikre a corrupt politician in Goa has to present himself in Shivgadh for a case related matter but sends his proxy which _Singham_ (qv) does not accept.Jaikanth Shikre arrives in Shivgadh to defame _Singham_ (qv) but gets insulted by _Singham_ (qv) and villagers._Singham_ (qv) is soon transferred to Goa with powerful contacts of Jaikanth where he tortures him like anything and sees the police in the region are helpless due to his power._Singham_ (qv) decides to fight back and Jaikanth fears for his life.::alex.mjacko@gmail.com"
    ]
}