{
    "id": "2032530",
    "localized title": "Shabri",
    "cast": [
        "Isha Koppikar",
        "Raj Arjun",
        "Manish Wadhwa",
        "Pradeep Singh Rawat",
        "Zakhir Hussain",
        "Vijay Kadechkar",
        "Sanjay Kulkarni",
        "Datta Sonawane",
        "Vimal Mhatre",
        "Kishore Nandlaskar",
        "Niraj Kumar",
        "Ragesh Asthana",
        "Parvez Khan",
        "Chandan Pethkar",
        "Archana Thavre",
        "Pravesh Mishra",
        "Urmila Matondkar",
        "Shridhar Tanaji Patil"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "runtimes": "98",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "mr",
        "en"
    ],
    "color info": "Color",
    "certificates": "Singapore:NC-16",
    "original air date": "26 Aug 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMmNkNGM4YWEtNjg5ZS00Njc1LTg5Y2MtNTA2ZjE5YWRmNDA4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "2032530",
    "plot outline": "Shabri lives an impoverished lifestyle along with her mother; alcoholic father; and younger brother, Bandya. She is the sole earner in her family and embittered at the manner in which life has treated her. She not only chastises Bandya for spending too much time on the street with a goon, Murad, instead of focusing in his studies but also her father. Things take a turn for the worst when Bandya is arrested by Inspector Khare and tortured in the police station. When Shabri goes to see him, Khare attempts to molest her, but she manages to escape. The next day Bandya is found dead allegedly on the grounds that he tried to escape from police custody. Refusing to believe this 'version', Shabri takes a knife and goes to confront Khare. It is this confrontation that will result in Khare's death with his own service revolver, resulting in a manhunt from Vikhroli to Bhendi Bazar, and she will be compelled to seek Murad's help to go in hiding. But things are only to worsen when a heavily pressured Murad decides to enlist the assistance of Kisnya Bhau, the brother of gangster, Rajdharbhau, resulting in more danger for not only Shabri but also her parents.",
    "languages": [
        "Hindi",
        "Marathi",
        "English"
    ],
    "title": "Shabri",
    "kind": "movie",
    "directors": "Lalit Marathe",
    "writers": "Lalit Marathe",
    "producers": [
        "Sada Bhuvad",
        "Sheel Nimbalkar",
        "Anku Pande",
        "Mahesh Ramanathan",
        "Ram Gopal Varma"
    ],
    "composers": "Raju Singh",
    "cinematographers": "Amit Roy",
    "editors": "Avinash Walzade",
    "editorial department": [
        "Pranav Mistry",
        "Rahul Purav"
    ],
    "art directors": "Satish Chipkar",
    "costume designers": [
        "Ashish Dwyer",
        "Reza Shariffi"
    ],
    "production managers": [
        "Sachin Bhintade",
        "Karunesh"
    ],
    "assistant directors": [
        "Kumar Gaurav",
        "Arsalaan Khan"
    ],
    "art department": "Durgaprasad Mahapatra",
    "sound department": [
        "Alok De",
        "Abhijit Deo",
        "Harjeet Singh"
    ],
    "visual effects": [
        "Aziz Merchant",
        "Tuhin Rana"
    ],
    "camera department": [
        "Duleep Regmi",
        "Dhananjay Singh"
    ],
    "location management": "Ravi Davande",
    "music department": "Pritesh Mehta",
    "miscellaneous": [
        "Amole Gore",
        "Sachin Suresh Gurav",
        "Nitin Narendra Sethi Jain",
        "Suresh Kurpad",
        "Farooq Malgundkar",
        "Meenakshi Pandey"
    ],
    "akas": "Shabri (India)",
    "writer": "Lalit Marathe",
    "director": "Lalit Marathe",
    "production companies": "Factory",
    "distributors": [
        "Factory",
        "Reliance Entertainment"
    ],
    "other companies": "Glamsham.com",
    "plot": [
        "An impoverished woman faces off against gangsters as well as the police after her brother is killed.",
        "_Shabri_ (qv) lives an impoverished lifestyle along with her mother; alcoholic father; and younger brother, Bandya. She is the sole earner in her family and embittered at the manner in which life has treated her. She not only chastises Bandya for spending too much time on the street with a goon, Murad, instead of focusing in his studies but also her father. Things take a turn for the worst when Bandya is arrested by Inspector Khare and tortured in the police station. When _Shabri_ (qv) goes to see him, Khare attempts to molest her, but she manages to escape. The next day Bandya is found dead allegedly on the grounds that he tried to escape from police custody. Refusing to believe this 'version', _Shabri_ (qv) takes a knife and goes to confront Khare. It is this confrontation that will result in Khare's death with his own service revolver, resulting in a manhunt from Vikhroli to Bhendi Bazar, and she will be compelled to seek Murad's help to go in hiding. But things are only to worsen when a heavily pressured Murad decides to enlist the assistance of Kisnya Bhau, the brother of gangster, Rajdharbhau, resulting in more danger for not only _Shabri_ (qv) but also her parents.::rAjOo (gunwanti@hotmail.com)"
    ]
}