{
    "id": "2056715",
    "localized title": "Teecha Baap Tyacha Baap",
    "cast": [
        "Makarand Anaspure",
        "Mrunal Deshpande",
        "Mrinmayee Godbole",
        "Anand Ingle",
        "Abhijit Kelkar",
        "Shruti Marathe",
        "Arun Nalawade",
        "Sachin Pilgaonkar",
        "Kishor Pradhan",
        "Uma Sardeshmukh",
        "Abhishek Sethiya",
        "Jayawant Wadkar",
        "Jaywant Wadkar"
    ],
    "genres": "Comedy",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "06 Oct 2011 (India)",
    "imdbID": "2056715",
    "plot outline": "Monica Deshmukh (25 years) daughter of Vikrant Deshmukh a super disciplined, man of principles, falls in love with Neil Phaterphekar (26 years) a chef by profession. Being a doting father, for whom Monica is the apple of his eye, Vikrant Deshmukh has to ensure that she marries not just into a suitable family but into the best family possible, and so he decides to personally visit Neil's house and meet his family. Neil's father Shashi Phaterphekar, an eccentrically open-minded Goan, on the other hand is a happy-go- lucky soul who loves his fish meals and lives by one philosophy 'live life to the fullest.' Teecha Baap Tyacha Baap revolves around these two polar families and their interaction at the Phaterphekar house over three days. With incredibly comical twists and turns in their love story; will Monica and Neil be able to convince their parents? Will the disciplined Vikrant Deshmukh ever accept his unconventional counterpart Shashi Phaterphekar as his daughter's father in law? And will the mystery around Canada Pai be ever uncovered? Who is Janaki Kamat or Mrs. Bandekar? Teecha Baap Tyacha Baap is a fun-filled roller coaster ride that will definitely tickle your funny bone, and keep you coming back for more.",
    "languages": "Marathi",
    "title": "Teecha Baap Tyacha Baap",
    "kind": "movie",
    "directors": "Atul Kale",
    "producers": [
        "Arun Rangachari",
        "Vivek Rangachari"
    ],
    "editorial department": "Rony Jadhav",
    "assistant directors": "Saurabh Gaikwad",
    "sound department": "Shamim Sharfuddin Shaikh",
    "visual effects": "Arup Sinha",
    "music department": "Vidyadhar Bhave",
    "akas": "Teecha Baap Tyacha Baap (India)",
    "director": "Atul Kale",
    "production companies": "DAR Motion Pictures",
    "plot": [
        "Monica and Neil decide to get married, but will the differences between their parents create a problem.",
        "Monica Deshmukh (25 years) daughter of Vikrant Deshmukh a super disciplined, man of principles, falls in love with Neil Phaterphekar (26 years) a chef by profession. Being a doting father, for whom Monica is the apple of his eye, Vikrant Deshmukh has to ensure that she marries not just into a suitable family but into the best family possible, and so he decides to personally visit Neil's house and meet his family. Neil's father Shashi Phaterphekar, an eccentrically open-minded Goan, on the other hand is a happy-go- lucky soul who loves his fish meals and lives by one philosophy 'live life to the fullest.' _Teecha Baap Tyacha Baap_ (qv) revolves around these two polar families and their interaction at the Phaterphekar house over three days. With incredibly comical twists and turns in their love story; will Monica and Neil be able to convince their parents? Will the disciplined Vikrant Deshmukh ever accept his unconventional counterpart Shashi Phaterphekar as his daughter's father in law? And will the mystery around Canada Pai be ever uncovered? Who is Janaki Kamat or Mrs. Bandekar? _Teecha Baap Tyacha Baap_ (qv) is a fun-filled roller coaster ride that will definitely tickle your funny bone, and keep you coming back for more.::Anonymous"
    ]
}