{
    "id": "2091384",
    "localized title": "Panjaa",
    "cast": [
        "Pawan Kalyan",
        "Sarah Jane Dias",
        "Anjali Lavania",
        "Jackie Shroff",
        "Atul Kulkarni",
        "Brahmanandam",
        "Mohammad Ali",
        "Subbaraju",
        "Adivi Sesh",
        "Jhansi",
        "Tanikella Bharani",
        "Paruchuri Venkateswara Rao",
        "Sampath Raj",
        "Joy Badlani",
        "Dayanand Reddy",
        "Srinivasan Shivakar",
        "Amit Tiwari"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "156",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:A",
        "Singapore:NC16",
        "United Kingdom:18",
        "United States:Not Rated"
    ],
    "original air date": "09 Dec 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGI4ZWZmMTgtMDY1Yy00NTVhLWFmYTktN2VkMzMyZDA5MGIzXkEyXkFqcGdeQXVyNDY5MTUyNjU@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2091384",
    "plot outline": "Jai, an orphan, is taken in and nurtured into a hitman by a gangster named Bhagwan. When not busy kicking the hell out of rival gangs, he escapes his lovelorn life by running a nursery with his pal Chotu. Meanwhile, Jai runs into a Greenpeace activist Sandhya and sparks fly between the duo. When Jai couldn't bear Munna's manic activities, he confronts him. Bhagawan, father of Munna is enraged and is hell bent on revenge. An ultimate face-off between loyalty and morals ensues.",
    "languages": "Telugu",
    "title": "Panjaa",
    "kind": "movie",
    "directors": "Vishnuvardhan",
    "writers": [
        "Vishnuvardhan",
        "",
        "Rahul Koda",
        "Vishnuvardhan",
        "Abburi Ravi",
        "",
        "Abburi Ravi",
        "",
        "Prasad Rishi"
    ],
    "producers": [
        "Prasad Devineni",
        "Nagesh Muntha",
        "Neelima Tirumalasetti",
        "Shobu Yarlagadda"
    ],
    "composers": "Yuvan Shankar Raja",
    "cinematographers": "P.S. Vinod",
    "editors": "A. Sreekar Prasad",
    "editorial department": [
        "A. Babu",
        "Bhuvan Srinivasan"
    ],
    "art directors": "Sunil Babu",
    "costume designers": "Anu Vardhan",
    "assistant directors": [
        "Akshay Akkineni",
        "Suman Chikkala",
        "Prasad Rishi",
        "Srinivasan Shivakar",
        "Vamsidhar",
        "Rohin Venkatesan"
    ],
    "art department": [
        "Ashokan",
        "Khushbu Doshi",
        "Ravi Jakkula",
        "Raju Mahale",
        "Vaishnavi Reddy",
        "Seenu",
        "Sundar"
    ],
    "sound department": "A.S. Laxmi Narayanan",
    "visual effects": [
        "Arun Kumar Akavaram",
        "Srinivasraju Alluri",
        "Sanjay Baghel",
        "Vanapalli Bhaskararao",
        "Jayadeep Chandran",
        "Bujji Gandi",
        "Srinivas Janapati",
        "Trinadha Rao Kolli",
        "Umesh Namdev",
        "Vijayakumar Paluri",
        "Vinod Kumar Puppala",
        "Kaithapulla Ramakrishna",
        "Swapnil Sargade",
        "Sathishkannuri",
        "Mayank Shekhar",
        "Dhirendra Singh",
        "Dinesh Singh",
        "Dhiraj Subbaiah",
        "Chirag Tripathy",
        "Harsha Vardhan",
        "Aman Vashishtha"
    ],
    "stunts": [
        "Sham Kaushal",
        "Amritpal Singh",
        "Paramjeet Singh"
    ],
    "camera department": [
        "Phani Acharya",
        "Praveen Anumolu",
        "Dinesh",
        "Mahalingam Dinesh",
        "Ravivarman Neelamegam",
        "Srinivasan Venkatesh"
    ],
    "animation department": [
        "Vanapalli Bhaskararao",
        "Nayeem Mohammed",
        "Kaithapulla Ramakrishna"
    ],
    "costume departmen": "Sruti Harihara Subramanian",
    "music department": [
        "Brahmanandam",
        "Chandrabose",
        "Haricharan",
        "Priya Hemesh",
        "Pawan Kalyan",
        "Shweta Pandit",
        "Yuvan Shankar Raja",
        "Ramajogayya Sastry",
        "Hemachandra Vedala"
    ],
    "miscellaneous": [
        "Pulagam Chinnarayana",
        "Dinesh",
        "Sruti Harihara Subramanian",
        "Kalyan",
        "Geeta Kapoor",
        "Firoz A. Khan",
        "Nixon"
    ],
    "akas": "Когти (Russia)",
    "writer": [
        "Vishnuvardhan",
        "Rahul Koda",
        "Vishnuvardhan"
    ],
    "director": "Vishnuvardhan",
    "production companies": [
        "Arka Mediaworks",
        "Sanghamitra Arts"
    ],
    "distributors": [
        "Blue Sky Cinema",
        "Leo Entertainment",
        "Leo Media and Entertainment Group",
        "Shree Rama Creations",
        "Siri Media",
        "Siri Media",
        "Sri Venkateswara Films",
        "Bhavani DVD",
        "BlueSky Cinemas",
        "New Volga Videos",
        "Sun NXT"
    ],
    "special effects": "Firefly Creative Studio",
    "other companies": [
        "Aditya Music",
        "Prime Focus"
    ],
    "plot": [
        "Ordered by his boss to take out a former gang member who has switched sides, a hitman takes the rival gang leader's son hostage, unaware of the violent mayhem his own boss' son will ignite.",
        "Jai, an orphan, is taken in and nurtured into a hitman by a gangster named Bhagwan. When not busy kicking the hell out of rival gangs, he escapes his lovelorn life by running a nursery with his pal Chotu. Meanwhile, Jai runs into a Greenpeace activist Sandhya and sparks fly between the duo. When Jai couldn't bear Munna's manic activities, he confronts him. Bhagawan, father of Munna is enraged and is hell bent on revenge. An ultimate face-off between loyalty and morals ensues.::FilmSchool Reject",
        "Fast-paced and fiery, this multi-layered crime thriller follows the fluctuating fortunes in the life of Jaidev, an orphan who is adopted by Bhagwaan, a gangster and grows up to become his most trusted employee. Jaidev shields Bhagwaan from all his enemies, but when he acts against Bhagwaan's psychopathic son, their relationship breaks down. Also, when Jaidev meets and falls in love with a gentle environmentalist, he begins to wish for a peaceful and happy life. How will Jaidev's future unfold? Will he succeed in leaving behind a life of violence or will his past come back to haunt him?::Shrinivas G. Kulkarni"
    ],
    "synopsis": "Jai (Pawan Kalyan) is an accomplished hitman and the most trusted aide of Bhagavan (Jackie Shroff), the supreme don of Kolkata. Jai remains loyal to him as he helped in seeking revenge with the people who raped his mother and sister when he came to Kolkata in his childhood after his father's death. They share a business rivalry with Kulkarni (Atul Kulkarni), who aims to overthrow Bhagavan. Things are smooth until Bhagwan's son Munna (Adivi Sesh) returns to India. He is a psychotic and highly impulsive youngster. He has his eyes on club dancer Jahnavi (Anjali Lavania), but she rejects him as she adores Jai. Meanwhile, Jai comes across Sandhya (Sarah-Jane Dias), a soft-spoken environmentalist and tree lover. A mutual admiration for each other leads to a romantic involvement between the two. Munna, however, continues to go crazy about Jahnavi, and a tragedy ensues.Sabhapathi (Paruchuri Venkateswara Rao) works for Bhagavan. Munna mistreats Sabhapathi, but Bhagavan does not care. Sabhapathi joins Kulkarni's gang to protect himself. Jai kidnaps Sampath's (Sampath Raj) son. Munna kills Sampath's son due to laughter over Jahnavi loving Jai. Munna confronts Jahnavi at Jai's apartment and brutally murders her. Jai kills Munna by throwing him from his flat. This scene is seen by Guravayya (Tanikella Bharani), an associate of Bhagavan who is an informer to Kulkarni. He reports this to Bhagavan to get rid of Jai.Jai is forced to decide whether to retaliate or leave Kolkata completely. He chooses to leave out of loyalty to Bhagavan and heads to Palasa, Sandhya's village where her brother Ashok (Subbaraju) is a valiant, kindhearted cop. He comes across S. I. Paparayudu (Brahmanandam), and he solves the problems of the village by cleverly using Paparayudu. Jai cannot hide the truth from Sandhya anymore. He tells her about his life in Kolkata and that he made it look like that Paparayudu solved the village's problems. Since Jai told the truth, Sandhya still loves him.On the other hand, Bhagavan cannot rest until he seeks out Jai for revenge. Firstly, he kills Chotu (Ali), Jai's best friend and associate. Meanwhile, Sandhya gets kidnapped and taken to Kolkata. In a fit of rage at losing Chotu and Sandhya, Jai returns to Kolkata and starts hunting his rivals. He goes to Kulkarni's house with heavy ammunition and kills everyone except Kulkarni, as Jai promised him that he would not kill him. Kulkarni dies in his attempt to kill Jai. Later, Jai kills Guruvayya, as he gets information that the latter was responsible for this saga. At last, Jai reaches Bhagavan, who kidnapped Sandhya. Although Jai tells Bhagavan that Munna killed Jahnavi, Bhagavan still believes that Jai should not have murdered Munna. After an emotional sequence, Jai shoots Bhagavan in his chest as the latter shoots Sandhya. Sandhya survives, but Bhagavan dies. Jai unites with Sandhya, and they both start a new and happy life."
}