{
    "id": "2186943",
    "localized title": "Mambattiyan",
    "cast": [
        "Prashanth",
        "Meera Jasmine",
        "Mumait Khan",
        "Prakash Raj",
        "Vadivelu",
        "Vijayakumar",
        "Kota Srinivasa Rao",
        "Kalairani",
        "Riyaz Khan",
        "Aravinth",
        "Manobala",
        "Hema"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Singapore:PG13",
        "United States:Not Rated"
    ],
    "original air date": "01 Sep 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzc0NjQ4YWUtZjJmYi00NzlkLWIyZTgtZTVhMDgxOTViMzQ1XkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "2186943",
    "plot outline": "\"A landlord (Kota Srinivasa Rao) rules a village in western Tamil Nadu. When he is opposed by Mambattiyan's father (Vijayakumar), the 'jameen' kills him. Coming to know of this, Mambattiyan (Prashanth) kills the influential person and those in support of him. A group of youngsters in the village join hands with Mambattiyan. They lead a life in a forest. By robbing the rich and distributing the wealth to the poor, Mambattiyan becomes the local Robin Hood. Meanwhile, police forces led by DIG Ranjith (Prakash Raj) go from pillar to post to nab Mambattiyan. This is the start of a cat and mouse game between the two. Also, Mambattiyan has romance in the form of Kannathal (Meera Jasmine) and Sornam (Mumaith Khan). When Sornam raises a green flag that means she needs him to come an officer in disguises realizes this and reports it to prakash raj. so one by one all of his gang members die. prasath tells bullet an informer of mambattiyan to tell kannathal that they can go to another country. at the end the bullet shoots him because whoever captures mambattiyan gets a rewards of money and land so meera jasmine hits him and he dies then meera dies too. at the end prakash raj is sad that the whole village is crying and he takes prasanth's chain.\"",
    "languages": "Tamil",
    "title": "Mambattiyan",
    "kind": "movie",
    "directors": "B. Thyagarajan",
    "writers": "B. Thyagarajan",
    "producers": "B. Thyagarajan",
    "composers": "S. Thaman",
    "cinematographers": "Shaji Kumar",
    "editors": "Don Max",
    "editorial department": [
        "K. Sasi Kumar",
        "Shyjith Kumaran",
        "Raghuraman"
    ],
    "make up department": "Avinash Pawar",
    "production managers": "Nitin Upadhyaya",
    "assistant directors": [
        "Nitin Upadhyaya",
        "Appu k Sami"
    ],
    "visual effects": "Anoop Chandran",
    "music department": "Paul Praveen Kumar",
    "miscellaneous": "Nitin Upadhyaya",
    "writer": "B. Thyagarajan",
    "director": "B. Thyagarajan",
    "plot": "\"A landlord (Kota Srinivasa Rao) rules a village in western Tamil Nadu. When he is opposed by _Mambattiyan_ (qv)'s father (Vijayakumar), the 'jameen' kills him. Coming to know of this, _Mambattiyan_ (qv) (Prashanth) kills the influential person and those in support of him. A group of youngsters in the village join hands with _Mambattiyan_ (qv). They lead a life in a forest. By robbing the rich and distributing the wealth to the poor, _Mambattiyan_ (qv) becomes the local Robin Hood. Meanwhile, police forces led by DIG Ranjith (Prakash Raj) go from pillar to post to nab _Mambattiyan_ (qv). This is the start of a cat and mouse game between the two. Also, _Mambattiyan_ (qv) has romance in the form of Kannathal (Meera Jasmine) and Sornam (Mumaith Khan). When Sornam raises a green flag that means she needs him to come an officer in disguises realizes this and reports it to prakash raj. so one by one all of his gang members die. prasath tells bullet an informer of mambattiyan to tell kannathal that they can go to another country. at the end the bullet shoots him because whoever captures mambattiyan gets a rewards of money and land so meera jasmine hits him and he dies then meera dies too. at the end prakash raj is sad that the whole village is crying and he takes prasanth's chain.\""
}