{
    "id": "2327425",
    "localized title": "मोरया",
    "original title": "Morya",
    "cast": [
        "Subodh Bhave",
        "Sameer Dharmadhikari",
        "Sumaydh Gaikwad",
        "Sunil Godse",
        "Avdhoot Gupte",
        "Maushmi Hadkar",
        "S. Joshi",
        "Spruha Joshi",
        "Vignesh Joshi",
        "Santosh Juvekar",
        "Chinmay Mandlekar",
        "Vimal Mhatre",
        "Vijay Nikam",
        "Janardhan Parab",
        "Supriya Pathare",
        "Sachin Pilgaonkar",
        "Dilip Prabhavalkar",
        "Sunil Ranade",
        "Kranti Redkar",
        "Pushkar Shrotri",
        "Shekhar Shukla",
        "Pari Telang",
        "Avinash Thakur",
        "Ganesh Yadav"
    ],
    "genres": "Drama",
    "runtimes": "116",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "Singapore:PG13",
    "original air date": "19 Aug 2011 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjA5NTgxNzkyMl5BMl5BanBnXkFtZTcwOTg0MzIyOA@@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "2327425",
    "plot outline": "It was in 1893 when Lokmanya Balgangadhar Tilak gave a public form to the celebration of the festival of Ganpati which made it a genuinely people's festival. He saw in the festival, a way of uniting people for a common cause with the aim to bring about political consciousness under the guise of a religious celebration, with freedom for India being the ultimate goal. In the metro city of Mumbai, there are two adjoining chawls ie 'GaneshChawl' and 'KhatavChawl'. Being situated in the prime locations they have been celebrating the Ganeshotsav with splendor and devotion since the past 40 years. Being the arch rivals that they are, each competes with the other, every year and does their utmost, to prove they're the best. However, this year will be their last opportunity as the entire locality is being purchased by a builder for re-development, and the following year there would be only one Community Ganesh Festival. Each faction pulls out all stops to prove their supremacy.",
    "languages": "Marathi",
    "title": "Morya",
    "kind": "movie",
    "directors": "Avadhoot Gupte",
    "writers": "Sachin Dharekar",
    "producers": [
        "Avadhoot Gupte",
        "Atul Kamble",
        "Hemendra Kulkarni"
    ],
    "composers": "Avdhoot Gupte",
    "cinematographers": "Rahul Jadhav",
    "editors": [
        "Faisal Mahadik",
        "Imran Mahadik"
    ],
    "editorial department": "Manish Bhogte",
    "assistant directors": [
        "Vishal Chawan",
        "Vishal Devrukhkar"
    ],
    "art department": [
        "Ramesh Andhale",
        "Abhijit Khatu"
    ],
    "sound department": [
        "Sandeep Madhkholkar",
        "Tushar Pandit",
        "Dipesh Sharma"
    ],
    "camera department": "Kiran Gunjal",
    "miscellaneous": "Ganesh Gargote",
    "akas": "मोरया (India, Hindi title)",
    "writer": "Sachin Dharekar",
    "director": "Avadhoot Gupte",
    "production companies": [
        "Everest Entertainment",
        "A Square Entertainment"
    ],
    "plot": [
        "The Ganesh Chaturti festival has the potential to unite communities but divides them when it gets overly commercialized and competitive.",
        "It was in 1893 when Lokmanya Balgangadhar Tilak gave a public form to the celebration of the festival of Ganpati which made it a genuinely people's festival. He saw in the festival, a way of uniting people for a common cause with the aim to bring about political consciousness under the guise of a religious celebration, with freedom for India being the ultimate goal. In the metro city of Mumbai, there are two adjoining chawls ie 'GaneshChawl' and 'KhatavChawl'. Being situated in the prime locations they have been celebrating the Ganeshotsav with splendor and devotion since the past 40 years. Being the arch rivals that they are, each competes with the other, every year and does their utmost, to prove they're the best. However, this year will be their last opportunity as the entire locality is being purchased by a builder for re-development, and the following year there would be only one Community Ganesh Festival. Each faction pulls out all stops to prove their supremacy.::Everest Entertainment",
        "In the heart of Mumbai Ganesh festival takes place with lot of devotion and enjoyment.For the last 40 years two rival Chawls Ganesh Chawl and Khatav Chawl are celebrating the festival individually .But this year will be the last opportunity to celebrate the festival as a builder has taken over the locality for re development and in future there will be only one common festival for both the Chawls.::alex.mjacko@gmail.com",
        "Ganesh Galli led Manya and Khatau Chawl led by Sameer are two groups who have rivalry with each other but during the festive seasons it gets more violent where Kamat Kaka becomes peace maker between the two.Few days before the Ganpati festival they find that respective Chawl's will be demolished and a tower will come up so it will be the last for one of the Mandal's .Manya and Sameer ask for solution from Kamat Kaka who suggests to celebrate a common festival from next here but the young blood's aren't ready for it.In order to keep their Mandal alive for coming years Manya and Sameer's gang compete with each other in such a way that politicians play their part which leads to riots of Hindu and Musim thus hampering the Ganpati festival.::alex.mjacko@gmail.com"
    ],
    "synopsis": "It was in 1893 when Lokmanya Balgangadhar Tilak gave a public form to the celebration of the festival of Ganpati which made it a genuinely people's festival. He saw in the festival, a way of uniting people for a common cause with the aim to bring about political consciousness under the guise of a religious celebration, with freedom for India being the ultimate goal. In the metro city of Mumbai, there are two adjoining chawls ie 'GaneshChawl' and 'KhatavChawl'. Being situated in the prime locations they have been celebrating the Ganeshotsav with splendor and devotion since the past 40 years. Being the arch rivals that they are, each competes with the other, every year and does their utmost, to prove they're THE BEST. However, this year will be their last opportunity as the entire locality is being purchased by a builder for re-development, and the following year there would be only one Community Ganesh Festival. Each faction pulls out all stops to prove their supremacy. Huge Donations, Fabricated Stories, Smart Marketing through Press & Media, Lavani Performances, Celebrity Film Stars visits etc and the works are done, until things take an ugly turn. The humble beginning of this sacred celebration takes a diverse path, lets see how in MORAYA. Moraya, throws open several questions ?Are the values still imbibed in the masses, while celebrating Ganeshotsav with great gusto ? Does the Ganeshotsav honestly act as an inspiration to the scores of youth ?. Is it a ground for political strategies and a ladder for personal political career..? Is the environment considered friendly where tons of POP and colours get into the sea each year? the amount spent by corporation(more than 6 crores) to clean the sea and on arrangements, can't it be used for the needy? Is global warming genuinely considered?"
}