{
    "id": "3173944",
    "localized title": "Shyloo",
    "cast": [
        "Ganesh",
        "Bhama",
        "Suchendra Prasad",
        "Rangayana Raghu"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Romance"
    ],
    "runtimes": "152",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "certificates": "India:UA",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTczYWM4N2YtMDFhNC00ZjE5LWFiY2ItYWM0YzhhZDIxNDk3XkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "3173944",
    "plot outline": "The film starts with an imprisoned Manja recalling his love for Shyloo since childhood that becomes more intense as they grow older. Though Shyloo's mother assures Manja of getting them married, she changes her mind and arranges for Shyloo to marry a rich family boy. Infuriated, Manja threatens to kill her. He is arrested by the police and given a 30-days prison sentence. Shyloo's mother arranges the marriage a day before his release and Manja escapes from prison. As the police officer Bhaskar and a constable Ramaiah catch Manja and handcuff him, Shyloo too goes along with them as they decide to get married after he is released from prison. On their way, they encounter adventures that include an elephant chasing them and losing their way thereby reaching Kerala. From there, their journey continues, with Bhaskar becoming infuriated with Manja as he is not able to celebrate Deepavali with his family. A parallel story reveals Bhaskar's annoyed wife Sudha and her brothers troubling Bhaskar to come to their hometown to celebrate Deepavali. However, Bhaskar soon develops a soft corner for Manja as he saves him from a freak bus accident. The four go back together to their hometown and Manja is sent to prison while Shyloo stays over for a night at the officer's house. Next day, his wife has come back from her hometown and accuses Bhaskar of cheating on her. Bhaskar hits her and goes away. While on their way, a body was found on the train tracks which turns out to be Shyloo who had been killed by Bhaskar's in-laws after suspecting their relationship. Manja is heartbroken and dies under an on-coming train.",
    "languages": "Kannada",
    "title": "Shyloo",
    "kind": "movie",
    "directors": "S. Narayan",
    "producers": "K. Manju",
    "composers": [
        "Ishaan Dev",
        "Jassie Gift"
    ],
    "cinematographers": "Jagadish Waali",
    "akas": "Shyloo (India)",
    "director": "S. Narayan",
    "plot": [
        "Manja who has been sentenced to 30 days in prison escapes just a day before his sentence officially ends after hearing that his sweetheart, _Shyloo_ (qv), is about to be married off to a rich guy.",
        "The film starts with an imprisoned Manja recalling his love for _Shyloo_ (qv) since childhood that becomes more intense as they grow older. Though _Shyloo_ (qv)'s mother assures Manja of getting them married, she changes her mind and arranges for _Shyloo_ (qv) to marry a rich family boy. Infuriated, Manja threatens to kill her. He is arrested by the police and given a 30-days prison sentence. _Shyloo_ (qv)'s mother arranges the marriage a day before his release and Manja escapes from prison. As the police officer Bhaskar and a constable Ramaiah catch Manja and handcuff him, _Shyloo_ (qv) too goes along with them as they decide to get married after he is released from prison. On their way, they encounter adventures that include an elephant chasing them and losing their way thereby reaching Kerala. From there, their journey continues, with Bhaskar becoming infuriated with Manja as he is not able to celebrate Deepavali with his family. A parallel story reveals Bhaskar's annoyed wife Sudha and her brothers troubling Bhaskar to come to their hometown to celebrate Deepavali. However, Bhaskar soon develops a soft corner for Manja as he saves him from a freak bus accident. The four go back together to their hometown and Manja is sent to prison while _Shyloo_ (qv) stays over for a night at the officer's house. Next day, his wife has come back from her hometown and accuses Bhaskar of cheating on her. Bhaskar hits her and goes away. While on their way, a body was found on the train tracks which turns out to be _Shyloo_ (qv) who had been killed by Bhaskar's in-laws after suspecting their relationship. Manja is heartbroken and dies under an on-coming train.::Girish"
    ]
}