{
    "id": "0140348",
    "localized title": "Mahanadhi",
    "cast": [
        "Kamal Haasan",
        "Sukanya",
        "Poornam Vishwanathan",
        "Mahanadhi Shobana",
        "Cochin Hanifa",
        "S.N. Lakshmi",
        "Tulasi",
        "Mahanadhi Shankar",
        "Rajesh",
        "Thalaivasal Vijay",
        "Sangeetha",
        "Mohan Ram",
        "Mohan Natarajan"
    ],
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtimes": "162",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:U",
        "United Kingdom:PG"
    ],
    "original air date": "14 Jan 1994 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNWU4OWZjOTEtNGUyMy00YTFmLWFhNDYtMmQ1NjYyOTk1YTU5XkEyXkFqcGdeQXVyODEzOTQwNTY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0140348",
    "plot outline": "Krishna (Kamal Haasan) is a rich widower living in a rural village Tirunageswaram with his mother-in-law and children. He accidentally meets Dhanush (Hanifa) a businessman from the city who invites him to invest in his business to quickly multiply his earnings. Krishna aspires for an urban lifestyle and sells his property in the village and entrusts all the money to Dhanush, who is actually a broker of a bigger businessman in the city. Krishna is soon cheated by Dhanush and lands in jail for defrauding the public who invested in his company. Krishna meets fellow prisoner Panchapakesan, whose daughter Yamuna (Sukanya) turns out to be his prospective bride. Krishna suffers in jail while his children are separated. Dhanush sells the daughter Kaveri to a brothel in Calcutta while the son Bharani joins a band of street performers. Back after a three-year jail term, Krishna traces his children, finds Dhanush, kills him and his boss.",
    "languages": "Tamil",
    "title": "Mahanadi",
    "kind": "movie",
    "directors": "Santhana Bharathi",
    "writers": [
        "Kamal Haasan",
        "",
        "Kamal Haasan",
        "",
        "Kamal Haasan",
        "",
        "Ra Ki Rangarajan"
    ],
    "producers": "K.R. Gangadharan",
    "composers": "Ilaiyaraaja",
    "cinematographers": "M.S. Prabhu",
    "assistant directors": "Cheran",
    "stunts": "Vikram Dharma",
    "music department": [
        "S.P. Balasubrahmanyam",
        "K.S. Chithra",
        "Kamal Haasan",
        "Ilaiyaraaja",
        "S. Janaki",
        "Mahanadhi Shobana",
        "Vaali"
    ],
    "akas": [
        "Maha Nadhi (India, Tamil title)",
        "Mahanadi (United States)",
        "The Great River (World-wide, English title)"
    ],
    "writer": [
        "Kamal Haasan",
        "Kamal Haasan",
        "Kamal Haasan"
    ],
    "director": "Santhana Bharathi",
    "production companies": "Sri Amman Creations",
    "distributors": [
        "London Tamil Home Video",
        "Sri Amman Creations"
    ],
    "plot": [
        "An innocent man is framed in a financial scam and imprisoned. After his release, he learns that his daughter was sold into prostitution and he struggles to free her.",
        "Krishna (Kamal Haasan) is a rich widower living in a rural village Tirunageswaram with his mother-in-law and children. He accidentally meets Dhanush (Hanifa) a businessman from the city who invites him to invest in his business to quickly multiply his earnings. Krishna aspires for an urban lifestyle and sells his property in the village and entrusts all the money to Dhanush, who is actually a broker of a bigger businessman in the city. Krishna is soon cheated by Dhanush and lands in jail for defrauding the public who invested in his company. Krishna meets fellow prisoner Panchapakesan, whose daughter Yamuna (Sukanya) turns out to be his prospective bride. Krishna suffers in jail while his children are separated. Dhanush sells the daughter Kaveri to a brothel in Calcutta while the son Bharani joins a band of street performers. Back after a three-year jail term, Krishna traces his children, finds Dhanush, kills him and his boss.",
        "Krishnaswami (Kamal Haasan) lives a comfortable life in a village with his children and mother-in-law. Lured by the greed to make more money, Krishnaswami falls an easy prey to the trap set by Dhanush (Hanifa). Krishnaswami starts a chit fund with Dhanush as his partner who runs off with the money, leaving Krishnaswami to face the wrath of the depositors. He is proved guilty and sent to jail. His young children are looked after by his mother-in-law but as time passes by, they fall into bad days. Their only source of comfort is Yamuna (Sukanya), whose father (Poornam Viswanathan) happens to be the cell-mate of Krishnaswami. The old lady dies and Krishnaswami's children are left to fend for themselves. The daughter is forced into prostitution by Dhanush while the boy joins a road-side circus. On being released from jail, Krishnaswami alongwith Yamuna and her father try to trace out the children. While the son is located easily, the search for daughter takes them to the brothels in Calcutta city. Framed in a murder case by Dhanush, Krishnaswami decides to take the law into his hands and kills Dhanush and his accomplice.",
        "Kamal Haasan plays a simple-minded widower, whose attempt at Chit Fund management with a crooked pimp lands him in jail. While his own existence is made miserable by fellow convicts and corrupt wardens, his family disintegrates without a breadwinner. Upon his release, he has reconstruct his family while struggling to resist the temptation for vengeance.::Joyojeet Pal"
    ],
    "synopsis": "Krishna (Kamal Haasan) is a widower living by the Cauveri river basin having two kids and a mother-in-law to support. He is conned by an urban con man (Haneefa). His mother-in-law also searches for a suitable bride for him so he can re-marry and live peacefully. However, instead of a simple life in the small-town Trichi, he starts a finance company in Chennai placing his faith in this conman. The money through public deposits are looted by the conman and Krishna is sent to jail.When Krishna comes out he finds that the conman has disintegrated his family totally by selling his daughter to a Calcatta based prostitute and his son gets lost and lives among the road-side nomads. He finds his son easily. However, he has much difficulty finding his daughter from the Sonagachi red-light slums.Once he reaches back home, the moaning of his 16 year old daughter who has suffered forced prostitution makes his blood boil and he sets out to kill the conman and his motivator, a politician. When the police arrive at the scene Krishna has no other option other than to chop off his hand with which the bad politician hangs for dear life at the edge of a high rise building. Krishna serves another jail term and finally gets united with his family.True to the analogy behind the story, a man's life is like a river which flows from ups (falls) and downs (streams) and settles down in a plain."
}