{
    "id": "0186840",
    "localized title": "Avalude Ravukal",
    "cast": [
        "Seema",
        "Ravi Kumar",
        "M.G. Soman",
        "Sukumaran",
        "Bahadur",
        "Kaviyoor Ponnamma",
        "Sankaradi",
        "Usharani",
        "Karan",
        "Thoppil Bhasi",
        "Kamal Haasan",
        "Janardanan",
        "Meena",
        "Kuthiravattam Pappu",
        "I.V. Sasi",
        "Sathaar",
        "Sridevi"
    ],
    "genres": "Drama",
    "runtimes": "144",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "ta",
        "hi"
    ],
    "color info": "Black and White",
    "certificates": [
        "India:A",
        "United States:Not Rated"
    ],
    "original air date": "03 Mar 1978 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzg5OGVhOGItMGNmMC00YjY5LTliZGQtYjQyMTNjNjQ5NGNlXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR23,0,101,150_.jpg",
    "imdbID": "0186840",
    "plot outline": "Raji loses her parents early in life leaving the responsibility of bringing up her younger brother Sudhakaran (Master Raghu) on her shoulders. Circumstances force her to a life of a sex worker. She begins living with a slum dweller (Meena) with a cycle-rickshaw driver Damu (Kutiravattom Pappu) working as her 'agent.' Babu who stayed in a nearby hostel takes a fancy to Raji and she begins to visit him almost regularly. Babu's friend Jayan, a drunkard, attempts to approach Raji but is prevented by Babu. News spreads about Babu's relationship with Raji. Sudhakaran is a regular visitor to his teacher Chandran's room. One day a beggar steals Chandran's wrist watch through an open window. Sudhakaran is arrested by the police. He is beaten up by the cops. Sudhakaran dies after his release from police custody. The real thief is arrested and Chandran repents for what he had done. But Raji refuses to pardon him and rejects the support offered by him. Karunakaran (Bahadur) decides to conduct the marriage of his son Babu with Radha (Usha Rani), daughter of Damodaran (Sankaradi) and brother of his wife Lakshmi (Kaviyoor Ponnamma). Karunakaran, accompanied by Damodaran and Radha, reach Babu's hostel and are shocked to see Raji in his room. They came to know about Babu's relations with Raji. Radha gets married to another man. Jayan dies of liver related complications. On his death bed he advises Babu not to abandon Raji whose love for him is pure, though 'impure' in the eyes of the society. Raji gets gang raped but Chandran's timely help saves her life. Lakshmi comes to the town to meet Babu and Raji. She takes pity on Raji when she comes to know about her past and the circumstances that led her to become a sex worker. Lakshmi accepts her as her daughter-in-law and takes her home.",
    "languages": [
        "Malayalam",
        "Tamil",
        "Hindi"
    ],
    "title": "Avalude Ravukal",
    "kind": "movie",
    "directors": "I.V. Sasi",
    "writers": "Sherif",
    "producers": [
        "S. Pavamani",
        "Ramachandran"
    ],
    "composers": [
        "Guna Singh",
        "A.T. Ummer"
    ],
    "cinematographers": "Vipindas",
    "editors": "K. Narayanan",
    "music department": [
        "S. Janaki",
        "Bichu Thirumala",
        "K.J. Yesudas"
    ],
    "akas": [
        "Her Nights (India, Hindi title)",
        "Avalin Iravugal (India, Tamil title)"
    ],
    "writer": "Sherif",
    "director": "I.V. Sasi",
    "production companies": "Murali Movies",
    "distributors": "Sitara Pictures",
    "plot": [
        "A young woman, forced into prostitution by circumstances, is surrounded by admirers and even inspires the kind of love that is completely unconditional.",
        "Raji loses her parents early in life leaving the responsibility of bringing up her younger brother Sudhakaran (Master Raghu) on her shoulders. Circumstances force her to a life of a sex worker. She begins living with a slum dweller (Meena) with a cycle-rickshaw driver Damu (Kutiravattom Pappu) working as her 'agent.' Babu who stayed in a nearby hostel takes a fancy to Raji and she begins to visit him almost regularly. Babu's friend Jayan, a drunkard, attempts to approach Raji but is prevented by Babu. _News_ (qv) spreads about Babu's relationship with Raji. Sudhakaran is a regular visitor to his teacher Chandran's room. One day a beggar steals Chandran's wrist watch through an open window. Sudhakaran is arrested by the police. He is beaten up by the cops. Sudhakaran dies after his release from police custody. The real thief is arrested and Chandran repents for what he had done. But Raji refuses to pardon him and rejects the support offered by him. Karunakaran (Bahadur) decides to conduct the marriage of his son Babu with Radha (Usha Rani), daughter of Damodaran (Sankaradi) and brother of his wife Lakshmi (Kaviyoor Ponnamma). Karunakaran, accompanied by Damodaran and Radha, reach Babu's hostel and are shocked to see Raji in his room. They came to know about Babu's relations with Raji. Radha gets married to another man. Jayan dies of liver related complications. On his death bed he advises Babu not to abandon Raji whose love for him is pure, though 'impure' in the eyes of the society. Raji gets gang raped but Chandran's timely help saves her life. Lakshmi comes to the town to meet Babu and Raji. She takes pity on Raji when she comes to know about her past and the circumstances that led her to become a sex worker. Lakshmi accepts her as her daughter-in-law and takes her home.::B. VIJAYAKUMAR (The Hindu - _News_ (qv)paper)"
    ]
}