{
    "id": "0953306",
    "localized title": "Anwar",
    "cast": [
        "Nauheed Cyrusi",
        "Surya Dwivedi",
        "Pankaj Jha",
        "Manisha Koirala",
        "Siddharth Koirala",
        "Sanjay Mishra",
        "Rajpal Naurang Yadav",
        "Sudhir Pandey",
        "Kashish Duggal Paul",
        "Vijay Raaz",
        "Yashpal Sharma",
        "Naval Shukla",
        "Sharat Sonu",
        "Hiten Tejwani",
        "Lalit Tiwari",
        "Prithvi Zutshi"
    ],
    "genres": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "144",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Singapore:NC16",
        "United Kingdom:12"
    ],
    "original air date": "12 Jan 2007 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODU4NDZiMWQtM2FiYy00MThhLWE4NjUtYmNiOWUwY2ZmMjc5XkEyXkFqcGdeQXVyMjUyMjg1OTM@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "0953306",
    "plot outline": "Anwar is a Muslim who lives a middle-class lifestyle in Lucknow, India, along with his mom, brother, and Bhabhi, Suraiya. Anwar is doing a research on ancient Hindu Mandirs. They rent out a room to a poor widow and her attractive daughter, Mehru. Anwar falls in love with her. Anwar is certain of Mehru's love for him, but is shocked when he finds out that she has eloped with Udit, his Hindu friend, who is about to immigrate to America. He informs her mother, who in turn calls upon her nephew and other kith and kin, to locate Mehru. They do locate the couple abroad a bus, Udit is killed, while Mehru is beaten and ultimately hangs herself. A guilt-ridden Anwar takes shelter in an ancient Mandit in Dholpur and his bag, which contained drawings of Mandirs and notes on 'Lord Krishna', 'Devi Maa Meera', and 'Mehru'. This bag ends up with the Police and they believe that Anwar is a terrorist who is planning to detonate bombs in sacred Hindu temples. The place is surrounded by Police, politicians who are anxious to win the Hindu vote, the media, and a huge crowd who are here to see the show. Anwar contemplates his life and gets visits from 3 people. The first is an extremist Imam, who tells him to kill himself rather than surrender; the second is Police Superintendent Ashok Tiwari, who wants him to surrender quickly so that he can be with his ailing wife and young daughter; and the third is media-person, Anita, who wants a live interview so that she can establish her credibility with her boss. Set amongst post 9-11 scenario, amidst the craze for Valentine's day, Britney Spears, Osama Bin Laden, George W. Bush, and the American way of life, Anwar must now examine his options - the question is what will he ultimately decide?",
    "languages": "Hindi",
    "title": "Anwar",
    "kind": "movie",
    "directors": "Manish Jha",
    "writers": [
        "Priyamvad",
        "",
        "Manish Jha"
    ],
    "producers": [
        "Kiran Shahi",
        "Rajesh Kumar Singh",
        "Sunil Singh"
    ],
    "composers": [
        "Pankaj Awasthi",
        "Ghungroo",
        "Mithun Sharma"
    ],
    "cinematographers": "Kartik Vijay",
    "editors": "Amitabh Shukla",
    "editorial department": [
        "Shakeel Khan",
        "Kunal Moitra"
    ],
    "art directors": "Dipankar Mondal",
    "costume designers": [
        "Isha Ahluwalia",
        "Darshan Jalan"
    ],
    "make up department": "Dhananjay Prajapati",
    "assistant directors": [
        "Faiza Ahmad Khan",
        "Arghya Lahiri",
        "Kajal Naskar",
        "Rishab Seth",
        "Meghna Sethy"
    ],
    "art department": [
        "Bhaskar Mukherjee",
        "Samir Raut"
    ],
    "sound department": "Alok De",
    "stunts": "Mehmood Bakshi",
    "camera department": [
        "Nikhil Idurkar",
        "Akbar Ali Sheikh"
    ],
    "music department": [
        "Pankaj Awasthi",
        "Hasan Kamal",
        "Sayeed Qadri",
        "Shilpa Rao",
        "Roop Kumar Rathod",
        "Shyam Ravindran",
        "Dharam Sarthi",
        "Bobby Shrivastava",
        "Megha Sriram",
        "Kshitu Tare"
    ],
    "thanks": "Shaailesh R Singh",
    "akas": "Художник Анвар (Russia)",
    "writer": [
        "Priyamvad",
        "Manish Jha"
    ],
    "director": "Manish Jha",
    "production companies": [
        "Dayal Creations",
        "Cenchurion Films"
    ],
    "other companies": "Saregama HMV",
    "plot": "_Anwar_ (qv) is a Muslim who lives a middle-class lifestyle in Lucknow, India, along with his mom, brother, and Bhabhi, Suraiya. _Anwar_ (qv) is doing a research on ancient Hindu Mandirs. They rent out a room to a poor widow and her attractive daughter, Mehru. _Anwar_ (qv) falls in love with her. _Anwar_ (qv) is certain of Mehru's love for him, but is shocked when he finds out that she has eloped with Udit, his Hindu friend, who is about to immigrate to America. He informs her mother, who in turn calls upon her nephew and other kith and kin, to locate Mehru. They do locate the couple abroad a bus, Udit is killed, while Mehru is beaten and ultimately hangs herself. A guilt-ridden _Anwar_ (qv) takes shelter in an ancient Mandit in Dholpur and his bag, which contained drawings of Mandirs and notes on 'Lord Krishna', 'Devi Maa Meera', and 'Mehru'. This bag ends up with the Police and they believe that _Anwar_ (qv) is a terrorist who is planning to detonate bombs in sacred Hindu temples. The place is surrounded by Police, politicians who are anxious to win the Hindu vote, the media, and a huge crowd who are here to see the show. _Anwar_ (qv) contemplates his life and gets visits from 3 people. The first is an extremist Imam, who tells him to kill himself rather than surrender; the second is Police Superintendent Ashok Tiwari, who wants him to surrender quickly so that he can be with his ailing wife and young daughter; and the third is media-person, Anita, who wants a live interview so that she can establish her credibility with her boss. Set amongst post 9-11 scenario, amidst the craze for Valentine's day, Britney Spears, Osama Bin Laden, George W. Bush, and the American way of life, _Anwar_ (qv) must now examine his options - the question is what will he ultimately decide?::rAjOo (gunwanti@hotmail.com)"
}