{
    "id": "12415570",
    "localized title": "Khurchi Samrat",
    "cast": [
        "Kishori Ambiye",
        "Makarand Anaspure",
        "Vijay Chavan",
        "Chetan Dalvi",
        "Bal Dhuri",
        "Surekha Kudachi",
        "Usha Naik",
        "Rutuja Patil",
        "Vilas Rakte",
        "N. Relekar",
        "Shanta Tambe"
    ],
    "genres": "Comedy",
    "runtimes": "129",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "01 Oct 2010 (India)",
    "imdbID": "12415570",
    "plot outline": "Khurchi Samrat Is A Marathi Comedy Movie Starring Makarand Anaspure, Kishori Ambiye And Chetan Dalvi In Prominent Roles. An Ambitious Villager Faces Challenges When He Tries To Become A Politician While Fulfilling His Mother's Dream.",
    "languages": "Marathi",
    "title": "Khurchi Samrat",
    "kind": "movie",
    "directors": "Dattaram Tawde",
    "producers": "Raju Pachghare",
    "akas": "Khurchi Samrat (India)",
    "director": "Dattaram Tawde",
    "distributors": "Ultra Movie Parlour",
    "plot": [
        "_Khurchi Samrat_ (qv) Is A Marathi Comedy Movie Starring Makarand Anaspure, Kishori Ambiye And Chetan Dalvi In Prominent Roles. An Ambitious Villager Faces Challenges When He Tries To Become A Politician While Fulfilling His Mother's Dream.",
        "_Khurchi Samrat_ (qv) Is A Marathi Comedy Movie Starring Makarand Anaspure, Kishori Ambiye And Chetan Dalvi In Prominent Roles. An Ambitious Villager Faces Challenges When He Tries To Become A Politician While Fulfilling His Mother's Dream.",
        "Paro a Devdasi along with her husband performs from village to village for all kinds of functions for living they have things going well for them but our worried as they are childless since years.Soon they are blessed with a baby boy whom they name Malhar they want him to be a cop but Malhar is only interested in politics and day dreams about it.Aabasaheb and Doke belong two different parties and share a rivalry Malhar quits his job and plays his tricks with Aabasaheb and Doke to enter politics.Aabasaheb's daughter Sheetal falls in love with Malhar and is very much aware of his tricks Sheetal and supports him as she finds him a true politician while Malhar plays his games sweetly in both side of politics to fulfill his dream of being a minister.::alex.mjacko@gmail.com"
    ]
}