{
    "id": "1279105",
    "localized title": "Ramaa: The Saviour",
    "cast": [
        "Sahil Khan",
        "Tanushree Dutta",
        "Meghan Jadhav",
        "Koushtuv Ghosh",
        "Ananya",
        "Ishita Panchal",
        "Arjun Nandwani",
        "Zankhi Pabari",
        "Taleb Ibrahim",
        "Ketan Karande",
        "Altaf Hussain",
        "Anand",
        "Gurpreet Kaur Chadha",
        "Dalip Singh",
        "Brian Dowcan"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Drama",
        "Family",
        "Fantasy"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "original air date": "12 Nov 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWRkNzhlNTEtYjllNi00Yjc1LWFiZWMtMTgyNmVjODE0NmY1XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "1279105",
    "plot outline": "Snobbish Komal (Ananya Shukla) and her brother, Kunal (Koustov Ghosh); Sameer (Arjun Nandwani) - who is always ready for a snack; and siblings of smart class monitor Riddhi (Ishita Panchal): Rohan (Meghan) and Sanj (Zankhi Pabari) - play a recently released video game 'The Last Battle' on TV. Shortly thereafter, they will be magically and mysteriously transported back in time to a prehistoric island - and will have to fend for themselves against wild animals, deadly gem-seekers, and an ageless, armed and fierce entity called Kaali (Taleb Ibrahim).",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Ramaa: The Saviour",
    "kind": "movie",
    "directors": "Hadi Abrar",
    "writers": [
        "Kumaar",
        "",
        "Reshu Nath",
        "",
        "Krupasagar Sridharan"
    ],
    "producers": [
        "Abdul Aziz Barudgar",
        "Kulthep Narula"
    ],
    "composers": [
        "Suhas Shetty",
        "Siddhartth"
    ],
    "cinematographers": "Sejal Shah",
    "editors": "Kabir Shukla",
    "editorial department": [
        "Ankit Garg",
        "Debakriti Kundu",
        "Nitin Minz"
    ],
    "art directors": "Shree Kumar Nair",
    "make up department": "Cherag Bambboat",
    "assistant directors": [
        "Abeer Abrar",
        "Abir Abrar",
        "Sunil Kumar Sundaram",
        "Nihal Satpute",
        "Mayank Sharma",
        "Pratap Singh Solanki"
    ],
    "sound department": [
        "Shantanu Akerkar",
        "Devabrot Chaliha",
        "Alok De"
    ],
    "visual effects": [
        "Shukla Amit",
        "Badarinathchinimilli",
        "Neil Cunningham",
        "Soumen Das",
        "Nitin Jadhav",
        "Abrez Mohammed",
        "Achal Muchhala",
        "Himesh Nagda",
        "Tuhin Rana",
        "Shubham Singh Rathore",
        "Maheshwar Shukla",
        "Prashant Kumar Singh"
    ],
    "stunts": [
        "Peter Hein",
        "Alex Martin"
    ],
    "camera department": [
        "Devendra Dash",
        "Chandan Kachhawa",
        "Pranav Raval"
    ],
    "costume departmen": "Bushra Pagarkar",
    "music department": [
        "Aparna",
        "Koushtuv Ghosh",
        "George Joseph",
        "Amit Kumar",
        "Krishnakumar Kunnath",
        "Armaan Malik",
        "Shweta Pandit",
        "Rachel Singh",
        "Dilip Singhania",
        "Suraj"
    ],
    "miscellaneous": [
        "Pankaj Hurne",
        "Vasudevan Kothandath",
        "Jayesh Shikarkhane"
    ],
    "akas": [
        "Wybawca zwany Rammem (Poland)",
        "Ramaa wybawca (Poland)"
    ],
    "writer": [
        "Kumaar",
        "Reshu Nath",
        "Krupasagar Sridharan"
    ],
    "director": [
        "Hadi Abrar",
        "Hadi Abrar"
    ],
    "production companies": "God Willing Entertainment",
    "distributors": [
        "V One Entertainment",
        "Star Plus"
    ],
    "other companies": "Benetone Films",
    "plot": [
        "While playing a video game on TV, school-children are mysteriously transported to a prehistoric island.",
        "Snobbish Komal (Ananya Shukla) and her brother, Kunal (Koustov Ghosh); Sameer (Arjun Nandwani) - who is always ready for a snack; and siblings of smart class monitor Riddhi (Ishita Panchal): Rohan (Meghan) and Sanj (Zankhi Pabari) - play a recently released video game 'The Last Battle' on TV. Shortly thereafter, they will be magically and mysteriously transported back in time to a prehistoric island - and will have to fend for themselves against wild animals, deadly gem-seekers, and an ageless, armed and fierce entity called Kaali (Taleb Ibrahim).::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Ramaa: the Saviour is a fast-paced, edge-of-your seat jungle adventure film with a central cast of children. It's a story of six kids - Rohan, Riddhi, Kunal, Komal ,Sameer and Saanjh. Rohan and Riddhi are siblings studying in a public school with Sameer, while Kunal and Komal study in an international school. They face each other in a dance competition where they each try to beat the other, but the competition ends in a tie. As their prize, these 6 kids become first to play a newly launched video game, \"The Last Battle.\"While playing the game, the game room starts flickering and before any one can realize, the kids find themselves on a life boat in the middle of the Ocean. Before they can even decide what to do next, sharks attack them, but the kids manage to escape and they end up on an isolated island. Exploring the island, the children run into a spot of trouble. Riddhi is attacked by giant creature of a man, Vali (The Great Khali), who is almost twice the size of anyone else. But she is rescued by a young man, Ramaa (Sahil Khan) who has been living in this jungle, all alone, all his life. As Ramaa comes to know these children, and learns more about the outside world, and as the children, bickering amongst themselves and yet working together, learn more about Ramaa's world, they are all unaware that danger has already arrived. Danger arrives in the form of a boat commanded by Kali with a small army of mercenaries, and a brilliant and beautiful scientist assistant - Samara (Tanushree Dutta).1800 gaming years ago, Vali and Kali were the two brothers maintaining the balance between Good and Evil in the World. Vali was the protector of the island and representative of the Good, the Kind and the Generous, and the scales were tilted in his favor. He was stronger than his brother Kali. Kali, the evil lord, hated this. He wanted to be all evil and all-powerful. So he attempts to change the world to suit himself, and Vali was betrayed by his own brother.And now, Kali has come to the island on the trail of a treasure which he knows is buried near the mouth of an old river on this island. The problem is that they don't know this island, and they don't know where the river is. And since the river has dried up, finding it is all the harder. Fortunately for them, and unfortunately for everyone else, Kali and his gang stumble upon one of the kids, Kunal, and take him hostage, and from him, learn out about Ramaa.Ramaa and the kids come to their friend's rescue, resulting in Kali demanding Ramaa to show him the way to the river, or else. How will Ramaa get the children out of the gaming world and send them back to the real world? What is the treasure that Kali after? Why has Samara chosen to be on the side of the evil Kali? Will Ramaa prove his worth to Vali, who has laid such a noble responsibility on him. Will Ramaa, with the help off the six kids and Samara, punish the evil Kali?"
}