{
    "id": "1322257",
    "localized title": "Jhootha Hi Sahi",
    "cast": [
        "John Abraham",
        "Paakhi A. Tyrewala",
        "Raghu Ram",
        "Manasi Scott",
        "Alishka Varde",
        "Anaitha Nair",
        "George Young",
        "Omar Khan",
        "Abheek Sinha",
        "Madhavan",
        "Nandana Sen",
        "Imran Khan",
        "Riteish Deshmukh",
        "Abhishek Bachchan",
        "Wendy Albiston",
        "Delia Antal",
        "Kiyani Aziz",
        "Prashant Chawla",
        "Fran Cooper",
        "Aaisha Dutt",
        "Edward Lewis French",
        "Benjamin Greenacre",
        "Muhith Hakim",
        "Lee Nicholas Harris",
        "Phoenix James",
        "Richard Knight",
        "Ashwin Kumar",
        "Dimple Kumar",
        "Siddharth Kumar",
        "Andrew McEwan",
        "Mike Parish",
        "Gino Picciano",
        "Raman Rai",
        "Danielle Victoria Sambrook",
        "Aditya Singh",
        "Jonathan Warde",
        "Chris Wilson"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "142",
    "countries": [
        "India",
        "United Kingdom"
    ],
    "country codes": [
        "in",
        "gb"
    ],
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:M",
        "Canada:PG::(British Columbia)",
        "Canada:PG::(Ontario)",
        "India:U",
        "Singapore:NC-16",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)"
    ],
    "original air date": "22 Oct 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjBmZmU4YTAtM2U2Yy00OGE2LTk4N2YtMTllZjI5N2I5ZjIwXkEyXkFqcGdeQXVyMTY3MjM0ODQ@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "1322257",
    "plot outline": "London-based Siddharth Arya gets a number of telephone calls from three suicidal males in one night. Subsequently, he is approached by Suhana Malik from 'Dost India' and requested to volunteer his time every night counseling East Indians from killing themselves. Siddharth, who stammers in presence of attractive women, but not on the phone, agrees to do so - much to the chagrin of his Air-Hostess girlfriend, Krutika. One of his callers is a distraught female, Mishka, who wants to kill herself as she has been jilted by her long-time boyfriend, Kabir. Siddharth not only talks her out of it but also convinces her to make new friends. Both meet at the bookstore that he manages with his friends but he refuses to divulge his identity. Both continue to meet and are drawn towards one another - but not for long - as soon Krutika will demand an explanation, as well as Kabir will attempt to re-enter Mishka's life.",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Jhootha Hi Sahi",
    "kind": "movie",
    "directors": "Abbas Tyrewala",
    "writers": [
        "Pakhi",
        "",
        "Paakhi A. Tyrewala"
    ],
    "producers": [
        "Khalil Bachooali",
        "Crispin Buxton",
        "Tejaswita Desai",
        "Sanjeev Goenka",
        "Firuzi Khan",
        "Madhu Mantena Varma",
        "Apurv Nagpal",
        "Yogiraj Shetty",
        "Abbas Tyrewala"
    ],
    "composers": "A.R. Rahman",
    "cinematographers": "Manoj Lobo",
    "editors": [
        "Antara Lahiri",
        "Shan Mohammed"
    ],
    "editorial department": [
        "Gaurav Gupte",
        "Rohit Karkera",
        "Debakriti Kundu",
        "Nitin Minz"
    ],
    "casting directors": [
        "Saloni Jain",
        "Kerry Koprivlenska",
        "Gilly Poole"
    ],
    "production designers": "David Bryan",
    "art directors": "Prashant Laharia",
    "set decorators": "Fran Cooper",
    "costume designers": "Debbie Scott",
    "make up department": [
        "Ricci-Lee Berry",
        "Elena Diaz",
        "Lisa Grimwade",
        "Alison Hanken",
        "Bea Millas",
        "Susana Mota",
        "Shreya Patel",
        "Shyam Reddy",
        "Wakana Yoshihara"
    ],
    "production managers": [
        "Sada Bhuvad",
        "Shiva Chandra",
        "Simon Cullen",
        "Deepak Gawade",
        "Benjamin Greenacre",
        "Jayaraj Hejmady",
        "Sanjay Kumar Sahu"
    ],
    "assistant directors": [
        "Brashna Agha",
        "James Chambers",
        "Madhavi Deshpande",
        "Simon Downes",
        "Henry Jay Gordon",
        "Benjamin Greenacre",
        "Saloni Jain",
        "Chetana Kowshik",
        "Beatrice Manning",
        "Andrew McEwan",
        "Uditanshu Mehta",
        "Paul Mindel",
        "Raman Prasher",
        "Ananya Rane",
        "Nickie Sault",
        "Nick Simmonds",
        "Craig Topham",
        "Jhonny Zurita"
    ],
    "art department": [
        "Caroline Bailey",
        "Jonnie Elf",
        "Alexandra Hayes",
        "Douglas Ingram",
        "Mike Malik",
        "Abinash Kumar Pandit",
        "Christian Passerotti",
        "Beck Rainford",
        "Simon Ribchester",
        "Shailaja Sharma"
    ],
    "sound department": [
        "Sajjan Choudhary",
        "Boloy Kumar Doloi",
        "Marius Emil Stanescu",
        "Shijomon George",
        "Hitendra Ghosh",
        "Anish John",
        "Ashok Kumar",
        "Rhitwik Raj Pathak",
        "Amala Popuri",
        "Hemant Rao",
        "Renganaath Ravee",
        "Vengurlekar Rohan",
        "Vivek Sachidanand",
        "K.J. Singh",
        "Karnail Singh",
        "Aravind Vijayakumar",
        "Varun Visoi",
        "Julian Willson"
    ],
    "visual effects": [
        "Neil Cunningham",
        "Nelson Dsouza",
        "Josephnixon",
        "Sudhakar Kankanampati",
        "Suryakant Mahunta",
        "Aziz Merchant",
        "Achal Muchhala",
        "Himesh Nagda",
        "Sujit Nandurdikar",
        "Paresh Navlakha",
        "Kunjan Oza",
        "Vishal Parmar",
        "Prasad Patel",
        "Satya Reddy",
        "Sohel Rodrigues",
        "Abhishek Singh",
        "Yashmit Singh",
        "Sridharan",
        "TarunGupta",
        "Anuj Upadhyay",
        "Karthikeyan Karuppasamy"
    ],
    "stunts": [
        "Gary Arthurs",
        "Ben Dimmock",
        "Rick English",
        "Javed Karim",
        "Julian Spencer"
    ],
    "camera department": [
        "Malini Dasari",
        "Mike Drury",
        "Rob Hart",
        "Chad Gordon Higgins",
        "Maajid Khan",
        "James Lewis",
        "Cassius McCabe",
        "Ginger McCarthy",
        "Glen Milner",
        "Soumyajit Nandy",
        "Kevin Pereira",
        "David Raedeker",
        "Sam Rawlings",
        "Kamlesh Sadrani",
        "Sujit Sen",
        "Garth Sewell",
        "Charlie Wall",
        "Marc Woodcock",
        "Paul Worley"
    ],
    "casting department": [
        "Briony Barnett",
        "Naila Mughal",
        "Aadore Mukherjee",
        "Magda Sobolewska",
        "Venetia Suchdev"
    ],
    "costume departmen": [
        "Sheara Abrahams",
        "Tim Aslam",
        "Kirti Kolwankar",
        "Lucy McGill",
        "Soizic Quentin de Coupigny"
    ],
    "location management": [
        "James Baker",
        "Joshua Benedetti",
        "Philip Lobban"
    ],
    "music department": [
        "Pallikonda Adrushta Deepak",
        "Javed Ali",
        "Rashid Ali",
        "Kazimir Boyle",
        "Shreya Ghoshal",
        "Hentry Kuruvilla",
        "Sonu Nigam",
        "K.J. Singh",
        "Chinmayee Sripada",
        "Abbas Tyrewala",
        "Srinidhi Venkatesh",
        "Vinayak Vijayan",
        "Vijay Yesudas"
    ],
    "script department": [
        "Afshan Hussain",
        "Raman Prasher"
    ],
    "transportation department": "Bruce Patel",
    "miscellaneous": [
        "Brashna Agha",
        "Jyoti Agrawal",
        "Nancy Nisa Beso",
        "Crispin Buxton",
        "David Devine",
        "Scott Eaton",
        "Saloni Jain",
        "Maajid Khan",
        "Alnoor Merchant",
        "Anshul Mohan",
        "Sez Niederer",
        "Natasha Phelan",
        "Sonny Singh",
        "Taranveer Singh",
        "Pippa Suren",
        "Sheetal Vinod Talwar"
    ],
    "thanks": [
        "Meghana Badola",
        "Karan Johar",
        "Ronnie Screwvala",
        "Ratna Pathak Shah",
        "Manmohan Shetty",
        "Sheetal Vinod Talwar"
    ],
    "akas": [
        "0-800-Love (United Kingdom)",
        "Ложь во спасение (Russia)"
    ],
    "writer": [
        "Pakhi",
        "Paakhi A. Tyrewala"
    ],
    "director": "Abbas Tyrewala",
    "production companies": [
        "1-800-Love",
        "Big Bang Media",
        "Saregama India",
        "Telltale Films"
    ],
    "distributors": [
        "Mind Blowing Films",
        "Viva Entertainment",
        "Viva Entertainment"
    ],
    "other companies": [
        "Helicopter Film Services",
        "Kodak",
        "Mediacom 24-7",
        "Rapid Talent"
    ],
    "plot": [
        "A suicidal woman's \"final\" call mistakenly connects her to a man who gives her something to live for.",
        "London-based Siddharth Arya gets a number of telephone calls from three suicidal males in one night. Subsequently, he is approached by Suhana Malik from 'Dost India' and requested to volunteer his time every night counseling East Indians from killing themselves. Siddharth, who stammers in presence of attractive women, but not on the phone, agrees to do so - much to the chagrin of his Air-Hostess girlfriend, Krutika. One of his callers is a distraught female, Mishka, who wants to kill herself as she has been jilted by her long-time boyfriend, Kabir. Siddharth not only talks her out of it but also convinces her to make new friends. Both meet at the bookstore that he manages with his friends but he refuses to divulge his identity. Both continue to meet and are drawn towards one another - but not for long - as soon Krutika will demand an explanation, as well as Kabir will attempt to re-enter Mishka's life.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Movie Plot and Climax Fully Revealed\nThe movie starts with Sid(Siddharth Arya) that's played by ( [Link=nm1303433] ) (Living in London) having a night nap on his couch, when a call wakes him up. The caller claims to be about to giving away his life, and asks Sid to stop him. Sid convinces him to not to suicide. Two more calls follow. Both of them also claiming to commit suicide. Sid takes them as prank calls and ignores them.\nThe next morning Sid visits to his best friend Omar's home, played by Raghu Ram, and tells him about the calls. Both of them trying to guess who would have been the prankster, fail to come to a solid conclusion. While coming out from their book store they meet Suhana Malik (Nandana Sen), a member from a NGO named Dost India. She tells them about the calls Sid got the last night. Suhana describes Dost India as a night time NGO working for care and support of suicidal Indians living in London. She tells them that Sid's mobile number was mistakenly printed on their advertisement pamphlets, and the calls last night were from the people who were actually going to commit suicide. Sid's jaw falls open as he realizes the gravity of the situation. Suhana asks him to be a member of Dost India and attend to the calls if he receives any. Firstly trying to back he eventually joins in, and so starts his new life. Sid starts getting calls regularly and he responds quite well saving many lives in process. Omar too thinks that he is doing a great job and says that he is really proud of him.\nOne usual night Sid receives another anonymous call of a girl who is just on the verge of eating a box sleeping pills. Sid pleads and convinces her to just stay with him on line. The speechless telephonic conversation takes place for nearly 15-16 hours in which time the girl falls asleep and when she wakes up she finds Sid still on line just for her to say good morning. Sid tells Omar about this call that really scared him. The same day the girl calls back and asks for the guy who talked to her last time. Sid tells her that was him. Girl apologies and tells her name as Mishka (Pakhi Tyrewala), but Sid doesn't reveal his identity.\nSteadily their conversation becomes a daily routine and it goes to an extent where everyone starts noticing it. Sid lack of attention toward her present girl friend Krutika, an air hostess makes her impatient, but that doesn't stop him from his new found interest. Mishka tells him about her past relationship that how her ex boyfriend Kabir(Madhavan) cheated on her. She tells him that she still loves him and wants him back. Mishka gives Sid a virtual name \"Fidato\". Fidato asks her to move on and start making new friends. One fine day Mishka while searching for a book Fidato asked her to read lands up in Sid's and Omar's book store. As soon as Mishka asks for the book and tells her name, Sid realizes who she is and behave insanely in front of her. Mishka takes the book and leaves. She tells Fidato about the book store incident and the nut guy.\nSid decides to approach Mishka and asks her for a coffee. Mishka firstly reluctant remembers what Fidato had told her about making new friend and eventually agrees. Mishka and Sid start looking each other regularly and eventually she falls for him. Sid asked by his friends invites Mishka to Omar's home for a dinner. Incidentally Krutika's flight gets canceled and she drops by Omar's home. She confronts to be Sid's girlfriend in front of Mishka that makes Mishka really upset. Shattered once again, she is supported by Fidato and he asks her to give Sid another chance. She agrees and starts seeing Sid again.\nAll statrs going well untill, one night Sid takes her with all his friends at a local party where they also come across Kabir who appears to be jealous of Mishka's new found life and friends. The very same night Sid confronts to be in love with her. Mishka overjoyed with happiness calls Fidato to tell her how much she loves Sid. Fidato who saw everything falling in place decides to end his fake identity and only be Sid from now on. Much to his bad luck he simultaneously gets a call from a teenager named Ankur who has consumed a bottle of sleeping pills and is on the verge of dying. Fidato tracks his location from a car reversing siren that he came across sometime earlier in Mishka's Neighborhood. He asks Mishka whether she know anyone by that name in her neighborhood. She tells him she does. Fidato asks her to rush to him and call the emergency services. Ankur is rescued and taken o the hospital. Meanwhile Sid/Fidato comes running down to her place. Mishka realizes Sid/Fidato's true identity. Sid apologizes but with no success. Meanwhile Kabir meets a car accident and the hospital authorities inform Mishka. Kabir apologizes and begs her to forgive him. He tells her that he loves her and wants her back more than anything. Realizing the end of their relation, Sid stops forcing Mishka. Sid pays a visit to the boy he saved (Ankur). There he sees the two of them together. A simple philosophical line from Ankur urges him to go to Mishka and ask her give him another chance. Kabir gets physical with him, but Mishka asks Kabir to stop as he, Sid meant nothing to him. They plan to move to Paris.\nSid heartbroken and sad gives up. While driving to the airport Kabir and Mishka get into a quarrel about their relationship. While Kabir wants them to be lovers , Mishka denies and tells her to be her friend. Suddenly Mishka realizes the missing thing in her life and realizes that it was due to Sid that she was alive, she was happy and she started enjoying her life once again. She asks Kabir to stop the car as she wants go back to Sid. Angry and disgruntled Kabir leaves, abandoning her in middle of a road. Mishka calls up Sid, and tells him to get to her in ten minutes, or else they would be apart forever. Sid realizing his only chance dashes to reach her. With some dramatic action sequences and hanging down by a bridge he gets to her. Everything gets settled peacefully, and thus comes to an end to movie. They lived Happily Ever After :)Written By Akshay Dhar ( aki.dhar26@gmail.com )"
}