{
    "id": "13439686",
    "localized title": "Ochayee",
    "cast": [
        "Santhana Bharathi",
        "'Ganja' Karuppu",
        "Shakeela",
        "Thamarai"
    ],
    "genres": "Drama",
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "15 Oct 2010 (India)",
    "imdbID": "13439686",
    "plot outline": "The film begins with the ruffian Mokkasamy (Dhaya) killing the village big-wig Nagarasu in Madurai. In the past, Periyamaayan (Rajesh) was the father of the young Mokkasamy who had lost his mother at a very young age. To care of Mokkasamy, Periyamaayan decided to re-marry to a much younger woman but she then ill-treated Mokkasamy and disallowed intimacy with Periyamaayan. When Periyamaayan came to know about his second wife's extramarital affair with a stranger, Periyamaayan killed them both and was jailed, leaving his son alone. Therefore, Mokkasamy was struggling with no money and he did odd jobs. Karutha Pandi (Thiravi Pandian), a local rowdy with a golden heart, took Mokkasamy under his wing and considered Mokkasamy like his own son. Many years later, after coming out of jail, Periyamaayan returns to his village and he is astonished to see his son Mokkasamy being arrested by the police. A constable told about his wife's illicit affair with Nagarasu to Mokkasamy thus an infuriated Mokkasamy killed Nagarasu. Karutha Pandi then bails Mokkasamy out of jail. Aandi Thevar (Santhana Bharathi), the village big-wig and Nagarasu's ally, urges to take revenge on Mokkasamy. One day, the mother of Ochayee (Thamarai) dies and Periyamaayan brings Ochayee at his home. Mokkasamy, who became a misogynist after his stepmother's affair, spends his time humiliating and insulting his childhood sweetheart Ochayee. Thereafter, he falls in love with Ochayee. Karutha Pandi advises Mokkasamy to become a responsible man and to find a decent job. In the meantime, Aandi Thevar is killed by his mentally ill son and the villagers blame Mokkasamy for killing him, hence the police encounter Karutha Pandi and his henchmen. Mokkasamy, who is hiding from the police, marries Ochayee in a hurry with the blessings of Periyamaayan and the two plan to escape from the village. The couple in an autorickshaw is then hit by a lorry and they are killed in the accident.",
    "languages": "Tamil",
    "title": "Ochayee",
    "kind": "movie",
    "directors": "O. Aasaithambi",
    "writers": "O. Aasaithambi",
    "producers": "Thiraviya Pandian",
    "composers": "Jeevaraja",
    "cinematographers": "Jayan",
    "akas": "Ochayee (India)",
    "writer": "O. Aasaithambi",
    "director": "O. Aasaithambi",
    "production companies": "Aachi Kizhavi Thirai Koodam",
    "plot": "The film begins with the ruffian Mokkasamy (Dhaya) killing the village big-wig Nagarasu in Madurai. In the past, Periyamaayan (Rajesh) was the father of the young Mokkasamy who had lost his mother at a very young age. To care of Mokkasamy, Periyamaayan decided to re-marry to a much younger woman but she then ill-treated Mokkasamy and disallowed intimacy with Periyamaayan. When Periyamaayan came to know about his second wife's extramarital affair with a stranger, Periyamaayan killed them both and was jailed, leaving his son alone. Therefore, Mokkasamy was struggling with no money and he did odd jobs. Karutha Pandi (Thiravi Pandian), a local rowdy with a golden heart, took Mokkasamy under his wing and considered Mokkasamy like his own son. Many years later, after coming out of jail, Periyamaayan returns to his village and he is astonished to see his son Mokkasamy being arrested by the police. A constable told about his wife's illicit affair with Nagarasu to Mokkasamy thus an infuriated Mokkasamy killed Nagarasu. Karutha Pandi then bails Mokkasamy out of jail. Aandi Thevar (Santhana Bharathi), the village big-wig and Nagarasu's ally, urges to take revenge on Mokkasamy. One day, the mother of _Ochayee_ (qv) (Thamarai) dies and Periyamaayan brings _Ochayee_ (qv) at his home. Mokkasamy, who became a misogynist after his stepmother's affair, spends his time humiliating and insulting his childhood sweetheart _Ochayee_ (qv). Thereafter, he falls in love with _Ochayee_ (qv). Karutha Pandi advises Mokkasamy to become a responsible man and to find a decent job. In the meantime, Aandi Thevar is killed by his mentally ill son and the villagers blame Mokkasamy for killing him, hence the police encounter Karutha Pandi and his henchmen. Mokkasamy, who is hiding from the police, marries _Ochayee_ (qv) in a hurry with the blessings of Periyamaayan and the two plan to escape from the village. The couple in an autorickshaw is then hit by a lorry and they are killed in the accident."
}