{
    "id": "13439928",
    "localized title": "Tiruppur",
    "cast": [
        "Kadhal Dhandapani",
        "Prabha",
        "Mahanadi Shankar"
    ],
    "genres": "Drama",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "10 Sep 2010 (India)",
    "imdbID": "13439928",
    "plot outline": "The film begins with Kesavan (Udhai), after serving a prison sentence, being on a train back home to Palani and he reminisces about his past. Aadhi (Prabha), Kesavan, Perumal (Sarvamathi) and Seenu (Padmakumar) were best friends living in Palani. Aadhi lived with his widow mother and worked in a small workshop while Kesavan lived with his wealthy family and he was jobless. One day, Kesavan scolded Aparanji (Unni Maya) at the hospital for not doing her job well but later, he felt guilty for insulting her and wanted to apologize. Thereafter, he came to know that Aparanji was a medical student who was on an educational trip in Palani and they eventually befriended. Aadhi, Perumal and Seenu urged Kesavan to express his love. Kesavan then accommodated Aparanji and her college mates in his house. Kesavan was still afraid of expressing his love but Aparanji finally came to know about it and she gave him a love letter before going to her native town Tiruppur. The four friends arrived in Pollachi to attend their friend's wedding and Kesavan met Aparanji before the function. At a jewellery shop, Kesavan bought bangles for his lover with his friend Aadhi and a police inspector (Mahanadi Shankar) suspected him of stealing his wife's bangles. The situation degenerated as Aadhi beat the police inspector up and Aparanji's father Subramani (Kadhal Dhandapani) had witnessed the fight. At the wedding function, Kesavan gifted Aparanji the bangles. Subramani who has seen it insulted him and challenged Kesavan to come to his hometown Tiruppur. In Tiruppur, Aadhi challenged Subramani in his house that his friend Kesavan will marry Aparanji but their first attempt failed as Thirthagiri (Tiruppur Selvaraj) intervened. Later, Subramani explained to the four friends that the gangster Thirthagiri wanted him to give his daughter to his brother but Subramani refused. Subramani wanted Kesavan to save Aparanji from Thirthagiri by marrying her. Thereafter, the four friends and Aparanji were arrested by the vengeful police inspector and he took them to Thirthagiri's factory. The five managed to escape from Thirthagiri's henchmen. After getting separated, the friends who had defeated Thirthagiri's henchmen got together and they had a brutal fight with Thirthagiri. When Thirthagiri tried to kill Kesavan with a machete, Aadhi sacrificed his life and died. A vengeful Kesavan then killed Thirthagiri. Back to the present, Kesavan arrives in Palani and he meets his lover Aparanji and his two friends.",
    "languages": "Tamil",
    "title": "Tiruppur",
    "kind": "movie",
    "directors": "M.C. Duraisamy",
    "writers": "M.C. Duraisamy",
    "producers": "R. Dharmaraj",
    "composers": "C.D. Shaju",
    "akas": "Tiruppur (India)",
    "writer": "M.C. Duraisamy",
    "director": "M.C. Duraisamy",
    "production companies": "Friends Production",
    "plot": "The film begins with Kesavan (Udhai), after serving a prison sentence, being on a train back home to Palani and he reminisces about his past. Aadhi (Prabha), Kesavan, Perumal (Sarvamathi) and Seenu (Padmakumar) were best friends living in Palani. Aadhi lived with his widow mother and worked in a small workshop while Kesavan lived with his wealthy family and he was jobless. One day, Kesavan scolded Aparanji (Unni Maya) at the hospital for not doing her job well but later, he felt guilty for insulting her and wanted to apologize. Thereafter, he came to know that Aparanji was a medical student who was on an educational trip in Palani and they eventually befriended. Aadhi, Perumal and Seenu urged Kesavan to express his love. Kesavan then accommodated Aparanji and her college mates in his house. Kesavan was still afraid of expressing his love but Aparanji finally came to know about it and she gave him a love letter before going to her native town _Tiruppur_ (qv). The four friends arrived in Pollachi to attend their friend's wedding and Kesavan met Aparanji before the function. At a jewellery shop, Kesavan bought bangles for his lover with his friend Aadhi and a police inspector (Mahanadi Shankar) suspected him of stealing his wife's bangles. The situation degenerated as Aadhi beat the police inspector up and Aparanji's father Subramani (Kadhal Dhandapani) had witnessed the fight. At the wedding function, Kesavan gifted Aparanji the bangles. Subramani who has seen it insulted him and challenged Kesavan to come to his hometown _Tiruppur_ (qv). In _Tiruppur_ (qv), Aadhi challenged Subramani in his house that his friend Kesavan will marry Aparanji but their first attempt failed as Thirthagiri (_Tiruppur_ (qv) Selvaraj) intervened. Later, Subramani explained to the four friends that the gangster Thirthagiri wanted him to give his daughter to his brother but Subramani refused. Subramani wanted Kesavan to save Aparanji from Thirthagiri by marrying her. Thereafter, the four friends and Aparanji were arrested by the vengeful police inspector and he took them to Thirthagiri's factory. The five managed to escape from Thirthagiri's henchmen. After getting separated, the friends who had defeated Thirthagiri's henchmen got together and they had a brutal fight with Thirthagiri. When Thirthagiri tried to kill Kesavan with a machete, Aadhi sacrificed his life and died. A vengeful Kesavan then killed Thirthagiri. Back to the present, Kesavan arrives in Palani and he meets his lover Aparanji and his two friends."
}