{
    "id": "13439960",
    "localized title": "Puzhal",
    "cast": [
        "Kadhal Dhandapani",
        "Hemachandran",
        "Manobala",
        "Ponnambalam"
    ],
    "genres": "Drama",
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "03 Sep 2010 (India)",
    "imdbID": "13439960",
    "plot outline": "John (Hemachandran), Muthupandi (Mano) and Ameer (Murali) who are youth and from different backgrounds enter Puzhal Central Prison on charges of murder and they immediately become good friends. The jail warden Pottu and gangster Arumaidoss smuggle paan and alcohol while Anbu's son (Kadhal Sukumar) smuggles mobile phones. Several flashbacks tell the story of the three youth and how they landed in jail. Muthupandi lived with his widowed mother, despite being poor, Muthupandi studied in an engineering college. Muthupandi and the village belle Ponni (Aswatha) fell in love with each other. One day, his mother could not pay his college fees, so she begged the college chairman (Ponnambalam) to help her but he forced her to have sex with him. When Muthupandi came to know about it, he was shocked, his mother then apologized to him for the matter and committed suicide by self-stabbing. To save his mother's dignity, Muthupandi surrendered to the police for killing her. Whereas, Ameer was a sales representative and lived with his parents and elder sister Nisha (Sonam Singh). Nisha fell in love with a married man and decided to elope with him, but Ameer stopped them and he changed the married man's mind. Ameer then strangled his sister to death by anger. Whilst John was a kabaddi player and was in love with Rita (Archana Sharma) but she married her uncle David. A saddened John discovered that David was infected with HIV and John interrupted the couple's first night, and killed David. Back to the present, the cellmate of the youngsters is brutally raped by Arumaidoss and he commits suicide by slitting his throat. John, Muthupandi and Ameer took revenge by beating up Pottu and Arumaidoss, they then murder Arumaidoss. After this incident, Anbu (Kadhal Dhandapani), a local bigwig, frees his son and the three boys on bail and recruits them as his henchmen. One day, Anbu who is involved in land grabbing forces an orphanage to give him their land. John, Muthupandi and Ameer who cannot tolerate it fight against Anbu and his henchmen. During the fight, David's brother tries to kill John with a machete. Muthupandi and Ameer get between them, therefore the three friends get stabbed by him and die.",
    "languages": "Tamil",
    "title": "Puzhal",
    "kind": "movie",
    "directors": "Azhagu Rajasundaram",
    "writers": "Azhagu Rajasundaram",
    "producers": "T. Tamil Amudhan",
    "composers": "Nallathambi",
    "akas": "Puzhal (India)",
    "writer": "Azhagu Rajasundaram",
    "director": "Azhagu Rajasundaram",
    "production companies": "Classic Movies",
    "plot": "John (Hemachandran), Muthupandi (Mano) and Ameer (Murali) who are youth and from different backgrounds enter _Puzhal_ (qv) Central Prison on charges of murder and they immediately become good friends. The jail warden Pottu and gangster Arumaidoss smuggle paan and alcohol while Anbu's son (Kadhal Sukumar) smuggles mobile phones. Several flashbacks tell the story of the three youth and how they landed in jail. Muthupandi lived with his widowed mother, despite being poor, Muthupandi studied in an engineering college. Muthupandi and the village belle Ponni (Aswatha) fell in love with each other. One day, his mother could not pay his college fees, so she begged the college chairman (Ponnambalam) to help her but he forced her to have sex with him. When Muthupandi came to know about it, he was shocked, his mother then apologized to him for the matter and committed suicide by self-stabbing. To save his mother's dignity, Muthupandi surrendered to the police for killing her. Whereas, Ameer was a sales representative and lived with his parents and elder sister Nisha (Sonam Singh). Nisha fell in love with a married man and decided to elope with him, but Ameer stopped them and he changed the married man's mind. Ameer then strangled his sister to death by anger. Whilst John was a kabaddi player and was in love with Rita (Archana Sharma) but she married her uncle David. A saddened John discovered that David was infected with HIV and John interrupted the couple's first night, and killed David. Back to the present, the cellmate of the youngsters is brutally raped by Arumaidoss and he commits suicide by slitting his throat. John, Muthupandi and Ameer took revenge by beating up Pottu and Arumaidoss, they then murder Arumaidoss. After this incident, Anbu (Kadhal Dhandapani), a local bigwig, frees his son and the three boys on bail and recruits them as his henchmen. One day, Anbu who is involved in land grabbing forces an orphanage to give him their land. John, Muthupandi and Ameer who cannot tolerate it fight against Anbu and his henchmen. During the fight, David's brother tries to kill John with a machete. Muthupandi and Ameer get between them, therefore the three friends get stabbed by him and die."
}