{
    "id": "13479432",
    "localized title": "Aaravadhu Vanam",
    "cast": [
        "Ansiba",
        "Vidhya Mohan",
        "Bose Venkat"
    ],
    "genres": "Drama",
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "30 Jul 2010 (India)",
    "imdbID": "13479432",
    "plot outline": "A few months ago in a remote village named Aaravadhu Vanam, the villagers strongly condemned inter-caste marriages and strictly followed the caste system. The village bigwig Dharma (Bose Venkat) wanted to marry his college-going relative Malar (Vidhya Mohan) whereas the ruffian Puli (Bhushan) who had no family carried out crimes wearing a lion mask. Malar became curious about Puli, she then fell in love with him and she even kissed him one day. One week before her marriage with Dharma, Malar declared her love to Puli and Puli scolded her for being senseless to fall in love with a wastrel with no future. The day of the marriage, she left the wedding hall and went on to meet Puli but Puli brought her back to the wedding hall. Malar's father and his henchmen insulted Puli. Consumed with anger, Puli changed his mind and he swore to marry her. The two ran away from the henchmen, and when they arrived in Chennai, Puli is stuck by a car. Malar admitted him to the hospital in Chennai and Dharma came to support her. Puli was diagnosed with mental illness and Malar took care of her at the hospital, but a year later, Puli vanished. Back to the present, Dharma is still in love with Malar and wants to marry her at any cost. Dharma was the one who put Puli in a random container lorry and he even corrupted a police officer to declare him as dead. Malar finally accepts to marry Dharma. In the meantime, Puli returns to his village and has a brutal fight with Dharma and his henchmen. Puli is eventually killed by Dharma and Dharma marries Malar the next day as he planned. Just after the marriage, Malar reveals to Dharma that she knows that he has killed her lover and she suddenly dies. Dharma then discovers that all the villagers are dead except him and he finds that their marriage food was poisoned. After this incident, Dharma became a lunatic and he lived alone in the empty village. The film ends with Dharma dying.",
    "languages": "Tamil",
    "title": "Aaravadhu Vanam",
    "kind": "movie",
    "directors": "R. Bhuvanesh",
    "writers": "R. Bhuvanesh",
    "producers": "S.M. Thiyagarajan",
    "composers": "R. Haribabu",
    "editors": "Zian Sreekanth",
    "akas": "Aaravadhu Vanam (India)",
    "writer": "R. Bhuvanesh",
    "director": "R. Bhuvanesh",
    "production companies": "MPG Films International",
    "plot": "A few months ago in a remote village named _Aaravadhu Vanam_ (qv), the villagers strongly condemned inter-caste marriages and strictly followed the caste system. The village bigwig Dharma (Bose Venkat) wanted to marry his college-going relative Malar (Vidhya Mohan) whereas the ruffian Puli (Bhushan) who had no family carried out crimes wearing a lion mask. Malar became curious about Puli, she then fell in love with him and she even kissed him one day. One week before her marriage with Dharma, Malar declared her love to Puli and Puli scolded her for being senseless to fall in love with a wastrel with no future. The day of the marriage, she left the wedding hall and went on to meet Puli but Puli brought her back to the wedding hall. Malar's father and his henchmen insulted Puli. Consumed with anger, Puli changed his mind and he swore to marry her. The two ran away from the henchmen, and when they arrived in Chennai, Puli is stuck by a car. Malar admitted him to the hospital in Chennai and Dharma came to support her. Puli was diagnosed with mental illness and Malar took care of her at the hospital, but a year later, Puli vanished. Back to the present, Dharma is still in love with Malar and wants to marry her at any cost. Dharma was the one who put Puli in a random container lorry and he even corrupted a police officer to declare him as dead. Malar finally accepts to marry Dharma. In the meantime, Puli returns to his village and has a brutal fight with Dharma and his henchmen. Puli is eventually killed by Dharma and Dharma marries Malar the next day as he planned. Just after the marriage, Malar reveals to Dharma that she knows that he has killed her lover and she suddenly dies. Dharma then discovers that all the villagers are dead except him and he finds that their marriage food was poisoned. After this incident, Dharma became a lunatic and he lived alone in the empty village. The film ends with Dharma dying."
}