{
    "id": "13690270",
    "localized title": "Gundragovi",
    "cast": [
        "Neenasam Ashwath",
        "Navyashree",
        "Satya"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "29 Oct 2010 (India)",
    "imdbID": "13690270",
    "plot outline": "In Gundragovi movie protagonist Kummi (Sathya) is a ruffian. He is a vagabond - a person with no earthy ties (meaning of Gundragovi). He is with four friends in the village. The gang steals properties like hen, coconuts, vessels and their business is to drink stomach full of arrack and sleep like idiots. They have no work to do and they are pooh-poohed by the villagers. Kummi is feared for his muscle power but he is good at heart.For such a careless and useless guy Kummi finds a child abandoned. He picks the child and when he finds the police siren he puts the child in the hands of Madhu (Navyasri). Baffled with this Madhu inevitably brings the child to the home and gives the required food. The very next day she traces Kummi and handover the child. Kummi gets a job as protector.",
    "languages": "Kannada",
    "title": "Gundragovi",
    "kind": "movie",
    "directors": "Taresh Raj",
    "producers": "T.N. Gopala",
    "composers": "Phoenix Raja",
    "akas": "Gundragovi (India)",
    "director": "Taresh Raj",
    "plot": "In _Gundragovi_ (qv) movie protagonist Kummi (Sathya) is a ruffian. He is a vagabond - a person with no earthy ties (meaning of _Gundragovi_ (qv)). He is with four friends in the village. The gang steals properties like hen, coconuts, vessels and their business is to drink stomach full of arrack and sleep like idiots. They have no work to do and they are pooh-poohed by the villagers. Kummi is feared for his muscle power but he is good at heart.For such a careless and useless guy Kummi finds a child abandoned. He picks the child and when he finds the police siren he puts the child in the hands of Madhu (Navyasri). Baffled with this Madhu inevitably brings the child to the home and gives the required food. The very next day she traces Kummi and handover the child. Kummi gets a job as protector."
}