{
    "id": "13690306",
    "localized title": "Yaksha",
    "cast": [
        "Atul Kulkarni",
        "Nana Patekar",
        "Yogesh"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "28 Oct 2010 (India)",
    "imdbID": "13690306",
    "plot outline": "In Yaksha movie Yogish plays Yaksha Raj Pulikeshi, a college student. But Yaksha is more interested in reading about underworld dons. He takes a liking to Poonja, (Atul Kulkarni) an underworld don. He makes much effort to become his assistant because he wants to be 'powerful' like him. He joins his gang and becomes the don's favourite as well. He begins to do the dirty job for the don and kills many opponents. When his mother, brother and grandfather come to know that Yaksha is working for a don, they are upset. Yaksha had wrongly informed them that he worked in a coffee shop. But there is an hidden truth. Yaksha is not working for the don. He has joined him only to eliminate him. The flashback reveals the true story of Yaksha and his father Pulikeshi.",
    "languages": "Kannada",
    "title": "Yaksha",
    "kind": "movie",
    "directors": "Ramesh Rao",
    "producers": "T.P. Siddaraju",
    "composers": "Anoop Seelin",
    "miscellaneous": "Sangeetha Gururaj",
    "akas": "Yaksha (India)",
    "director": "Ramesh Rao",
    "plot": "In _Yaksha_ (qv) movie Yogish plays _Yaksha_ (qv) Raj Pulikeshi, a college student. But _Yaksha_ (qv) is more interested in reading about underworld dons. He takes a liking to Poonja, (Atul Kulkarni) an underworld don. He makes much effort to become his assistant because he wants to be 'powerful' like him. He joins his gang and becomes the don's favourite as well. He begins to do the dirty job for the don and kills many opponents. When his mother, brother and grandfather come to know that _Yaksha_ (qv) is working for a don, they are upset. _Yaksha_ (qv) had wrongly informed them that he worked in a coffee shop. But there is an hidden truth. _Yaksha_ (qv) is not working for the don. He has joined him only to eliminate him. The flashback reveals the true story of _Yaksha_ (qv) and his father Pulikeshi."
}