{
    "id": "1496832",
    "localized title": "Paiyaa",
    "cast": [
        "Karthi",
        "Tamannaah Bhatia",
        "Milind Soman",
        "Jagan",
        "Omar Lateef",
        "Sonia",
        "Arpit Ranka",
        "Jasper",
        "A.R. Manikandan"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Drama",
        "Romance"
    ],
    "runtimes": "152",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Canada:PG::(Ontario)",
        "Canada:G::(Quebec)",
        "India:U",
        "Malaysia:U",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "02 Apr 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2FlNDM2YjItZTg3My00NTA1LTg3MjItZTQ4Mjk4NTM0MzczXkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "1496832",
    "plot outline": "Karthi (Shiva), an engineering graduate with an attitude, is on the look out for a job. He does not seem to be much serious in seeking employment while his friends try their best to settle him. He spots Tamannah (Charu) in a bus stop and it is love at first sight. He finds her on a couple of occasions later and in fact misses an interview in her pursuit. Destiny seems to have something good waiting for him and he gets to spend the most beautiful phase of his life, giving her a ride in the car while waiting to pick the owner of the car at the railway station. Life takes an exciting turn from this point for Karthi who accepts to drop her in Mumbai and thus begins Paiyaa's journey of romance, action and emotions on a highway with a few turns, some with caution and some without.",
    "languages": "Tamil",
    "title": "Paiyaa",
    "kind": "movie",
    "directors": "N. Linguswamy",
    "writers": [
        "N. Linguswamy",
        "",
        "Brindha Sarathy"
    ],
    "producers": [
        "N. Subash Chandrabose",
        "N. Linguswamy"
    ],
    "composers": "Yuvan Shankar Raja",
    "cinematographers": "Madhie",
    "editors": "Anthony",
    "editorial department": [
        "N.P.K. Gokul",
        "Rajasekaran.Ks"
    ],
    "art directors": "Rajeevan",
    "assistant directors": [
        "Ritesh mohanty",
        "Vijay"
    ],
    "sound department": [
        "Alagiakoothan",
        "Geeta Gurappa",
        "Nagavenkatakumar",
        "Ramji Soma"
    ],
    "visual effects": [
        "Thulasi Ram",
        "Saravanan Shanmugam"
    ],
    "stunts": "Kanal Kannan",
    "music department": [
        "Bhanuka Fernando",
        "Haricharan",
        "Na. Muthukumar",
        "Rahul Nambiar",
        "Yuvan Shankar Raja",
        "Saindhavi",
        "Malin Samarasekara",
        "Ramji Soma"
    ],
    "akas": [
        "Awara (India, Hindi title)",
        "Погоня (Russia)"
    ],
    "writer": [
        "N. Linguswamy",
        "Brindha Sarathy"
    ],
    "director": "N. Linguswamy",
    "production companies": "Thirupathi Brothers",
    "distributors": [
        "Cloud Nine Movies",
        "Amazon Prime Video",
        "Kalaignar Tv",
        "Zee Cinema"
    ],
    "other companies": "Think Music",
    "plot": [
        "Shiva, an engineering graduate, is not serious about his job or future even when his friends advise him about life. He falls in love with a girl he saw at a bus stop and finally gets to ride with her in a car.",
        "Karthi (Shiva), an engineering graduate with an attitude, is on the look out for a job. He does not seem to be much serious in seeking employment while his friends try their best to settle him. He spots Tamannah (Charu) in a bus stop and it is love at first sight. He finds her on a couple of occasions later and in fact misses an interview in her pursuit. Destiny seems to have something good waiting for him and he gets to spend the most beautiful phase of his life, giving her a ride in the car while waiting to pick the owner of the car at the railway station. Life takes an exciting turn from this point for Karthi who accepts to drop her in Mumbai and thus begins _Paiyaa_ (qv)'s journey of romance, action and emotions on a highway with a few turns, some with caution and some without.::Sadiq khan"
    ],
    "synopsis": "The film follows the journey of two strangersa jobless carefree man, living in Bangalore, and a woman with whom he has fallen in love. Upon the woman's request, he drives her to Mumbai, while a group of gangsters follow them, planning to kidnap the woman. Meanwhile, the man also has a past in the city and he goes there to sort it out."
}