{
    "id": "1629391",
    "localized title": "Tere Bin Laden",
    "cast": [
        "Ali Zafar",
        "Pradhuman Singh",
        "Piyush Mishra",
        "Nikhil Ratnaparkhi",
        "Chirag Vohra",
        "Sugandha Garg",
        "Rahul Singh",
        "Chinmay Mandlekar",
        "Rajendra Sethi",
        "Seema Bhargava",
        "Barry John",
        "Masood Akhtar",
        "Indivar Bhatia",
        "Akash Dhar",
        "Armen Grayg",
        "Badrul Islam",
        "Harry Josh",
        "Jay Parkash",
        "Vakshay Verma"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "95",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "ur",
        "en",
        "pa",
        "ar"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Singapore:PG",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "16 Jul 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTg0NDM4NjcyMF5BMl5BanBnXkFtZTcwMzA1NTI3Mw@@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "1629391",
    "plot outline": "\"Tere Bin Laden\" is a tongue-in-cheek comedy about an ambitious young news reporter from Pakistan who is desperate to migrate to the US in pursuit of the American dream. His repeated attempts to immigrate are shot down as his visa is always rejected. But when things couldn't look worse he comes across an Osama bin Laden look alike. Ali then hatches a scheme to produce a fake Osama video and sell it to news channels as a breakthrough scoop! Unfortunately there are serious ramifications as the White House gets involved and dispatches a overzealous secret agent on Ali's trail.",
    "languages": [
        "Hindi",
        "Urdu",
        "English",
        "Punjabi",
        "Arabic"
    ],
    "title": "Tere Bin Laden",
    "kind": "movie",
    "directors": "Abhishek Sharma",
    "writers": [
        "Mohammad Ahmad",
        "",
        "Abhishek Sharma"
    ],
    "producers": [
        "Pooja Shetty Deora",
        "Aarti Shetty",
        "Tarlok Singh"
    ],
    "composers": [
        "Dhruv Dhalla",
        "Shankar Mahadevan",
        "Loy Mendonsa",
        "Ehsaan Noorani"
    ],
    "cinematographers": "Santhosh Thundiyil",
    "editors": [
        "Chandan Arora",
        "Suresh Pai"
    ],
    "editorial department": [
        "Manish Bhogte",
        "Vasudevan Kothandath",
        "Debakriti Kundu",
        "Nitin Minz",
        "Prakash Nikharge"
    ],
    "production designers": [
        "Sunil Nigvekar",
        "Rajvir Singh"
    ],
    "make up department": "Vikram Gaikwad",
    "production managers": [
        "Indivar Bhatia",
        "Harjeet Dogra",
        "Jitesh Upade"
    ],
    "assistant directors": [
        "Masum Ali",
        "Kunal Gupta",
        "Swapna Kurup"
    ],
    "art department": "Nida Shaikh",
    "sound department": [
        "Debajit Changmai",
        "Sajjan Choudhary",
        "Boby John",
        "Rahul Karpe",
        "Sameer Patra",
        "George Shijomon",
        "Varun Visoi"
    ],
    "special effects": "Vishal Tyagi",
    "visual effects": [
        "Shruti Banta",
        "Debasish Borah",
        "Gokul Chandran",
        "Manoj Gohil",
        "Indraneel Guha",
        "Pankaj Kalbende",
        "Amit Patil",
        "Naveen Paul",
        "Uppu Pavanrajesh",
        "Rajiv Raghunathan",
        "Tuhin Rana",
        "Sheveta Raut",
        "Ranadheer Reddy",
        "Anuj Sharma",
        "Chandrakant Shenoy",
        "Ashwin Singh",
        "Gaurvendra Singh",
        "Shaikh Sohel",
        "Sanjot Sonalkar",
        "Balakrishna P. Subaiah",
        "Viral Thakkar",
        "Rohit Sardesai"
    ],
    "stunts": [
        "Parvez Shaikh",
        "Ashraf Stuntindia"
    ],
    "camera department": "George Thomas",
    "casting department": "Sayed Ashfaque",
    "costume departmen": "Diksha Anand Moitra",
    "music department": [
        "Suraj Jagan",
        "Akriti Kakar",
        "Shankar Mahadevan",
        "Anusha Mani",
        "Jaideep Sahni",
        "Master Saleem",
        "Jaspreet Singh",
        "Abhijit Vaghani",
        "Ali Zafar",
        "Raman Dandyan"
    ],
    "script department": "Ankur Tewari",
    "miscellaneous": [
        "Aditi Anand",
        "Riyaz Balooch",
        "Ankit Bhatia",
        "Abhijit Chawathe",
        "Vasudevan Kothandath",
        "Devashish Makhija",
        "Avinash Rajan",
        "Manish Tyagi"
    ],
    "thanks": [
        "Karan Johar",
        "Shekhar Kapur",
        "Anurag Kashyap",
        "Manmohan Shetty"
    ],
    "akas": "Без Ладена (Russia)",
    "writer": [
        "Mohammad Ahmad",
        "Abhishek Sharma"
    ],
    "director": "Abhishek Sharma",
    "production companies": [
        "Narsimha Enterprises",
        "Walkwater Media"
    ],
    "distributors": [
        "Cinergy Independent Film Services",
        "Star Plus",
        "Walkwater Media"
    ],
    "special effects companies": "Tyagi Guns and Special Effects",
    "other companies": "Light n Light",
    "plot": [
        "A reporter casts a fake Bin Laden to act in his video message to America, so he can immigrate there.",
        "\"_Tere Bin Laden_ (qv)\" is a tongue-in-cheek comedy about an ambitious young news reporter from Pakistan who is desperate to migrate to the US in pursuit of the American dream. His repeated attempts to immigrate are shot down as his visa is always rejected. But when things couldn't look worse he comes across an Osama bin Laden look alike. Ali then hatches a scheme to produce a fake Osama video and sell it to news channels as a breakthrough scoop! Unfortunately there are serious ramifications as the White House gets involved and dispatches a overzealous secret agent on Ali's trail.::Anonymous",
        "After being rejected & even deported from legally entering the United States of America, Karachi-based Danka TV _News_ (qv) Reporter, Ali Hassan, then faces more humiliation at the hands of his boss, Majeed Khan, when he ham-handles the Chief Minister's speech. He is then assigned to cover a cock-crowing contest in a small village, gets to witness the winner, Noora, who resembles Osama Bin Laden. Not giving up hope of relocating abroad, he contacts Lashkar-E-Amreeka's Jamalbhai, who demands a considerable sum of money for a fake passport. Ali and his cameraman, Gul, then attempt to locate Osama, and upon failing to do so, decide to create a fake video featuring Noora. They partner with a desperate radio host/mimicry artiste; an Arabic-speaking co-worker, Lateef; a make-up artiste, Zoya; and con a naive Noora to face the camera, enhance his looks - and set off a hilarious/perilous chain of events - hoping to raise enough cash to immigrate.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Ali Hassan (Ali Zafar) is a reporter with Danka TV, a downmarket local TV channel in Karachi, Pakistan. He is keen to migrate to the US for a better life and wants to work for an American news channel. He gets a chance to fly to the US, but ruins it on board while filming his own audition. He recites the words \"Hijack\" and \"Bomb\" too many times; thus scaring his fellow passengers and flight crew. As soon as he reaches the United States, he is deported. Furthermore, because of this incident his visa application is rejected six times in seven years. While covering a local event for his channel, he comes across an Osama Bin Laden look-alike, Noora (Pradhuman Singh), and hits upon an idea to make a fake Osama tape. He manages to convince his assistant Gul (Nikhil Ratnaparkhi) about the merits of his plan. With help from his travel agent's assistant Zoya (Sugandha Garg) and a local radio jockey Qureshi (Rahul Singh), he is able to make the tape by tricking Noora into unknowingly posing as Bin Laden. He then sells the tape to the owner of his channel, hoping to raise money for a new false identity, a new passport and a renewed attempt at getting the elusive US visa. However, the gravity of their action strikes them when the US Government takes the tape seriously and gets involved, as do the Pakistani intelligence agencies. Noora, too, comes to know about the trick played upon him and goes into hiding in his house.Ali decides to defuse the situation by making another tape in which Osama would be declaring ceasefire with US. He manages to convince Noora and Qureshi. During the shooting of the tape in Danka TV studio, Noora unwittingly detonates a grenade, which kills his beloved prize rooster. Depressed, Noora runs away from the location with the Osama-makeup still on, forcing Ali and his team to follow suit. They manage to get hold of Noora and try to convince him for another shoot. Meanwhile, the FBI team, led by Ted Wood (Barry John) and Usman (Chinmay Mandlekar), head of the Pakistani intelligence agency tracks down the location of Ali and his team. The police arrests Noora, Ali and his team. Ted is delirious that he could at last catch Osama bin Laden. However, during the interrogation, the truth is revealed and to save Ted's face, Ali convinces him about his idea of making a tape of Osama declaring ceasefire. The film ends with US accepting the offer of ceasefire and Ted getting elected as Defence Secretary. Ali is, at last, able to make it to the US and Noora too changes his lifestyle, marries Zoya and helps her with the daily routine in her beauty parlor. Usman is shown to be admitted in a mental hospital as he tries to tell the truth to the world."
}