{
    "id": "1636842",
    "localized title": "Virsa... Back to the Roots",
    "original title": "Virsa",
    "cast": [
        "Arya Babbar",
        "Aman Dhaliwal",
        "Andrew Duvall",
        "Aparna Sharma",
        "Gulshan Grover",
        "Kanwaljeet Singh",
        "Mehreen Raheel",
        "Nouman Ijaz",
        "Poonam Mehndiratta",
        "Roobie",
        "Aishveryaa Nidhi",
        "Alex",
        "Karandeep Singh",
        "Miranda O'Hare",
        "Drashti Mehta",
        "Jessica Bell",
        "Adam Browner",
        "Alice Burrell",
        "Hannah Burrell",
        "Martin Curtis",
        "Hayley de la Motte",
        "Cyrus Dubash",
        "Jennifer Foo",
        "Claudine Haber",
        "Peter Hannah",
        "Karen Harper",
        "Jayaraj",
        "Jade Joyce",
        "Ahsan Khan",
        "Naseer Ali Khan",
        "Aldo Hody Kinson",
        "Abby Martin",
        "Nathan Oliver",
        "Leila Rosemary",
        "Adelaide Seeney",
        "Amanpreet Singh",
        "Harwinder Singh",
        "Sukhjinder Singh",
        "Nazarath Stevenso",
        "Paul Stewart",
        "Midhi Thakker",
        "Mithun Thakker",
        "Preity Üpala"
    ],
    "genres": "Drama",
    "runtimes": "133",
    "countries": [
        "India",
        "Pakistan"
    ],
    "country codes": [
        "in",
        "pk"
    ],
    "language codes": "pa",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Philippines:16+::(self-applied)",
        "Singapore:NC16"
    ],
    "original air date": "07 May 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODM2ZGE4NDQtZjJjNy00MzU1LWIxY2EtNTk5MGE2ZmUxZWU5XkEyXkFqcGdeQXVyMzc0NzU5MTc@._V1_SY150_CR83,0,101,150_.jpg",
    "imdbID": "1636842",
    "plot outline": "Jogindar Singh Grewal deeply regrets his decision to re-locate to Australia to live with his son, Ranvir, who treats him like a servant, makes him work at the restaurant, which he obtained by marrying Jennifer, even though he was already married to Harjinder Kaur. His greed even alienates him from his friend, Nawaz Ali, who he blames for Jennifer's accidental death. Now Ranvir is the President of Punjab Association and will have to face-off against his rebellious daughter, Meet, who is all set to elope with Sam; while his irresponsible son, Yuvraj, is waiting to spring some more unexpected shocks and surprises on this family.",
    "languages": "Punjabi",
    "title": "Virsa",
    "kind": "movie",
    "directors": "Pankaj Batra",
    "writers": [
        "Pankaj Batra",
        "",
        "Arun Behl",
        "",
        "Amanullah Khan"
    ],
    "producers": [
        "Jawad Ahmad",
        "Amandeep S. Bindra",
        "Jyotish Chugani",
        "Yassh Desai",
        "Vikram Khakhar",
        "Amanda Khan",
        "Amanullah Khan"
    ],
    "composers": "Jawad Ahmad",
    "cinematographers": "Krishna Ramanan",
    "editors": "Kathikuloth Praveen",
    "editorial department": [
        "Swaroop Reghu",
        "Dilip Singh"
    ],
    "production designers": "Ranjit Singh",
    "art directors": "Harbhajan Singh",
    "production managers": [
        "Darshan Mehta",
        "Jigar Suchak"
    ],
    "assistant directors": "Swaroop Reghu",
    "art department": [
        "Seema Desai",
        "Jasmin Oza"
    ],
    "sound department": [
        "Wasim Ahmad Ansari",
        "Sher Khan"
    ],
    "costume departmen": "Karina Archie",
    "music department": [
        "Fuad Ahmad",
        "Jawad Ahmad",
        "Rahat Fateh Ali Khan",
        "Farha Anwar",
        "Sahir Ali Bagga",
        "Amanda Khan",
        "Richa Sharma"
    ],
    "akas": "Virsa... Back to the Roots (India, English title)",
    "writer": [
        "Pankaj Batra",
        "Arun Behl",
        "Amanullah Khan"
    ],
    "director": "Pankaj Batra",
    "production companies": [
        "B4U Television Network",
        "Geo Films",
        "One World Entertainment Productions",
        "Wize Mindz Entertainment Productions"
    ],
    "distributors": "Geo Films",
    "plot": [
        "An elderly male is abused by his wealthy son, while the latter has to deal with his own greed, and out-of-control children.",
        "Jogindar Singh Grewal deeply regrets his decision to re-locate to Australia to live with his son, Ranvir, who treats him like a servant, makes him work at the restaurant, which he obtained by marrying Jennifer, even though he was already married to Harjinder Kaur. His greed even alienates him from his friend, Nawaz Ali, who he blames for Jennifer's accidental death. Now Ranvir is the President of Punjab Association and will have to face-off against his rebellious daughter, Meet, who is all set to elope with Sam; while his irresponsible son, Yuvraj, is waiting to spring some more unexpected shocks and surprises on this family.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Virsa is the story of Nawaz Ali and Ranvir Singh Grewal and their families. Nawaz Ali hails from Lahore in Pakistan and Ranvir Singh Grewal belongs to a village, Jakopur, in Punjab, India. About 20 years ago, both of them migrated to Sydney, Australia, in search of work, where they met and became the best of friends. Gradually, their hard work paid off. Ranvir opened an Indian restaurant, which became a runaway success. Nawaz Ali opened a shop opposite Ranvirs restaurant. It did well and he could manage to lead a comfortable life but he was not as successful as Ranvir.\nNawaz Ali was very grounded in his culture and values and this helped him to remain level-headed and not get carried away by the comforts of life in Australia. He never lost sight of what was morally and ethically right and stood by his Asian values.On the other hand, Ranvir got carried away by his success. He felt that he was superior to the other Indians and Asians who were not as successful as he. He found merit in all things associated with the white folks their lifestyle, their values and culture, their behaviour and mannerisms and looked down upon his Indian upbringing and values. He had no more use for ethics and morality. He became very conscious of his money, status and reputation. The difference in outlook and behaviour drive the two friends apart until they reach a point where Ranvir stops talking to Nawaz. However, Nawaz still cares for his friend and tries to keep their friendship alive.As the film opens, Ranvir and Nawaz are well settled in Australia with their respective families. Nawaz has one son, Amaan Ali and Ranvir has a son, Yuvraj, and a daughter, Meet. Amaan and Yuvraj are roughly the same age and best buddies since childhood, despite the rift between their fathers. However, the difference in the thinkings of the two fathers is reflected in the personalities of their sons.Amaan is a sensible, level-headed young man. He is strongly grounded in and comfortable with his Asian identity. However, he is contemporary in his outlook. He does a fine balance of sticking to his values even as he adapts to the society around him and its mores and traditions. \nYuvraj is the exact opposite of Amaan. Due to Ranvirs indulgent attitude, Yuvraj grows up to be a rich, spoilt brat. He also feels closer to the white folks than to the Asians around him. He has no idea of Indian culture or values, no ethics and no morals. He loves women, booze, drugs...Yuvrajs sister, Meet, is quite like him in her values, upbringing and behaviour. She is going steady with a white young man but is not sure how her father will react to this development. However, she also has a special relationship with Amaan. Nothing is said but she instictively feels that she can always depend on his help, that he will always be there for her. Amaan too feels an instinctive pull towards her but waits for the right time to tell her of his love for her.Ranvir feels that the people in his village look down upon him because they feel that he is not a good son, since his father, Sardar Joginder Singh, lives here all alone. Sardarji wants to stay in Punjab, till his last breath. Ranvir cons Sardarji into going with him. In Australia, however, things are very different. The cost of living is high and labour is expensive. Ranvir enlists Sardarjis help for his restaurant. Gradually, Sardarjis status becomes no more than that of a paid servant.One night, at a party, Yuvraj meets Mahi. Mahi has come from Punjab to Sydney for her studies. She is a modern day young Indian woman, contemporary but with a solid foundation in Indian values and culture. She is beautiful, sexy, intelligent and confident. As they fall in love, she tries to reform him and for some time, it seems as though he will sort his life out. But old habits die hard. Yuvraj gradually falls back into his old ways and Mahi is unable to stop him. Will Ranvir ever see Nawazs point of view and will they ever be friends again? Will Sardarji remain a prisoner to his sons whims or will he rebel against him and return to Punjab? Will Yuvraj ever understand ethics and morality? Will Mahi return to Yuvraj? Will Ranvir accept a white boyfriend for Meet? And Amaan, who loves Meet will he ever tell her about his love?As Virsa answers these and other questions, it makes a strong statement about remaining true to ones values, culture and upbringing even as we constantly adapt and adjust to the society around us. It explores ways of addressing the identity conflicts of immigrant Asians in Western societies so that the succeeding generations can benefit from the best facets of both the cultures."
}