{
    "id": "1651934",
    "localized title": "Porki",
    "cast": [
        "Darshan Thoogudeep",
        "Pranitha",
        "Avinash",
        "Devaraj",
        "Dharma",
        "Sadhu Kokila",
        "Tennis Krishna",
        "Srujan Lokesh",
        "Manoj",
        "Sharan",
        "Chitra Shenoy",
        "Sangeeta Shetty",
        "Shobharaj",
        "Subhash",
        "Ashish Vidyarthi"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "154",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:MA15+",
        "India:A",
        "India:UA",
        "Malaysia:18",
        "Singapore:M18",
        "United Kingdom:X"
    ],
    "original air date": "28 Jan 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjIxODM1ODYxNV5BMl5BanBnXkFtZTgwNzUwMjk4NTE@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "1651934",
    "plot outline": "Dattu, a gangster, enters the gang of Ali bhai, and starts to work for him. Meanwhile, he falls for a girl named Anjali, who also falls for him. But as she realizes that Dattu is a gangster, she asks him to quit these violent activities for her love. But Dattu himself refuses and says that he loves her, and can't fulfill her wish. But love continues between them. Meanwhile, Ali bhai gets kidnapped by the police, but the gang rescues him by threatening the officer. They feel relieved but what they don't realize is that there's an undercover cop in their gang - they have no idea who he could be. No one has an idea about this mystery and the cop's motive. But when they come to know who's the cop, they are left shocked. To find out who's the cop and how does he fulfill his responsibility, watch this action packed film Porki.",
    "languages": "Kannada",
    "title": "Porki",
    "kind": "movie",
    "directors": "M.D. Sridhar",
    "writers": "Puri Jagannadh",
    "producers": "Dattatreya Bachhe Gowda",
    "composers": "V. Harikrishna",
    "cinematographers": "Krishnakumar",
    "editors": "P.R. Soundarraj",
    "music department": [
        "Ajith Abraham George",
        "Paul Praveen Kumar"
    ],
    "akas": "Porki (India)",
    "writer": "Puri Jagannadh",
    "director": "M.D. Sridhar",
    "production companies": "KCN Films",
    "plot": [
        "A young undercover cop weeds out the mafia.",
        "Dattu, a gangster, enters the gang of Ali bhai, and starts to work for him. Meanwhile, he falls for a girl named Anjali, who also falls for him. But as she realizes that Dattu is a gangster, she asks him to quit these violent activities for her love. But Dattu himself refuses and says that he loves her, and can't fulfill her wish. But love continues between them. Meanwhile, Ali bhai gets kidnapped by the police, but the gang rescues him by threatening the officer. They feel relieved but what they don't realize is that there's an undercover cop in their gang - they have no idea who he could be. No one has an idea about this mystery and the cop's motive. But when they come to know who's the cop, they are left shocked. To find out who's the cop and how does he fulfill his responsibility, watch this action packed film _Porki_ (qv).::Prashast Singh"
    ],
    "synopsis": "Dattu, a gangster, enters the gang of Ali bhai, and starts to work for him. Meanwhile, he falls for a girl named Anjali, who also falls for him. But as she realises that Dattu is a gangster, she asks him to quit these violent activities for her love. But Dattu himself refuses and says that he loves her, and can't fulfil her wish. But love continues between them. Meanwhile, Ali bhai gets kidnapped by the police, but the gang rescues him by threatening the officer. They feel relieved but what they don't realise is that there's an undercover cop in their gang - they have no idea who he could be. No one has an idea about this mystery and the cop's motive. But when they come to know who's the cop, they are left shocked. To find out who's the cop and how does he fulfil his responsibility, watch this action packed film Porki."
}