{
    "id": "1796580",
    "localized title": "Orr Eravuu",
    "cast": [
        "Sathish G.",
        "Asha",
        "Vani Bhojan",
        "Anand Chandrasekar",
        "Srijith P.S.",
        "Ajai R.",
        "K. Hari Shankar",
        "Haresh Narayan",
        "Krishna Sekhar"
    ],
    "genres": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "1.78 : 1",
    "sound mix": "DTS",
    "certificates": "India:UA",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTdlY2M5OGEtNjBiOC00NTc5LWEyOTUtMjA4YzcyOWFmMmZkXkEyXkFqcGdeQXVyNTc2MzcyMDI@._V1_SY150_CR55,0,101,150_.jpg",
    "imdbID": "1796580",
    "plot outline": "Orr Eravuu is the first Viewpoint film made in India. This film also has the distinction, where the Cinematographer Sathish G., himself has handled the camera and also played the role of Protagonist. The story travels along with Protagonist from Chennai to Munnar where he goes to solve a case of a house believed to be haunted, belonging to a businessman Anand Chandrasekar. Nakulan Ponnusamy (Sathish G.) owning Silver Chord Services spends one full night in the haunted house and conducts his sophisticated paranormal investigation. In between his investigation, Nakul finds that three other investigators belonging to Seventh Sense Para-psychology team also had come to the house for investigation. This, he gets to know through a camcorder left behind by the team. Nakul is found dead under mysterious circumstances in the house. Daisy, a reporter in a Television Program Metro Crimes analyzes Nakul's death.",
    "languages": "Tamil",
    "title": "Orr Eravuu",
    "kind": "movie",
    "directors": [
        "Haresh Narayan",
        "Krishna Sekhar",
        "K. Hari Shankar"
    ],
    "writers": [
        "K. Hari Shankar",
        "Haresh Narayan",
        "Krishna Sekhar"
    ],
    "producers": [
        "K. Hari Shankar",
        "K. Venkat Prabu Shankar"
    ],
    "composers": "K. Venkat Prabu Shankar",
    "cinematographers": "Sathish G.",
    "editors": "K. Hari Shankar",
    "assistant directors": [
        "Kamal M.",
        "Srijith P.S.",
        "Lokesh Rajendran",
        "Dinesh Ravichandran"
    ],
    "music department": [
        "Sam C.S.",
        "Sathish"
    ],
    "akas": [
        "Eraaa (India, Tamil title)",
        "The Night (World-wide, English title)"
    ],
    "writer": [
        "K. Hari Shankar",
        "Haresh Narayan",
        "Krishna Sekhar"
    ],
    "director": [
        "Haresh Narayan",
        "Krishna Sekhar",
        "K. Hari Shankar"
    ],
    "production companies": "Shankar Bros.",
    "plot": [
        "A Paranormal Investigator's one night experience of his 19th and last case in a haunted house at Munnar.",
        "_Orr Eravuu_ (qv) is the first Viewpoint film made in India. This film also has the distinction, where the Cinematographer Sathish G., himself has handled the camera and also played the role of Protagonist. The story travels along with Protagonist from Chennai to Munnar where he goes to solve a case of a house believed to be haunted, belonging to a businessman Anand Chandrasekar. Nakulan Ponnusamy (Sathish G.) owning Silver Chord Services spends one full night in the haunted house and conducts his sophisticated paranormal investigation. In between his investigation, Nakul finds that three other investigators belonging to Seventh Sense Para-psychology team also had come to the house for investigation. This, he gets to know through a camcorder left behind by the team. Nakul is found dead under mysterious circumstances in the house. Daisy, a reporter in a Television Program Metro Crimes analyzes Nakul's death.::9CC"
    ]
}