{
    "id": "2327333",
    "localized title": "Ideachi Kalpana",
    "cast": [
        "Bhargavi Chirmuley",
        "Mahesh Kothare",
        "Shridhar Tanaji Patil",
        "Sachin Pilgaonkar",
        "Ashok Saraf",
        "Nirmiti Sawant"
    ],
    "genres": "Comedy",
    "runtimes": "175",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "31 Dec 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzM2MTk1MTQyM15BMl5BanBnXkFtZTcwNTk1OTM3Nw@@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "2327333",
    "plot outline": "Jayram is an upcoming struggling actor who is slated for greatness or at least his sister Jaywanti thinks so. Her husband Manohar is a lawyer. But he is a fraud. One has to count the fingers of ones hand after shaking hands with him. He has not contested a single case in the court of law. He prefers out of court settlements. Jayram is hit by a car driven by Priti. Priti's brother Mahesh Thakur is the commissioner of Police. Since she had taken her brother's car the hit and run case becomes that of the Commissioner.",
    "languages": "Marathi",
    "title": "Ideachi Kalpana",
    "kind": "movie",
    "directors": "Sachin Pilgaonkar",
    "writers": "Kshitij Zarapkar",
    "producers": "Sachin Pilgaonkar",
    "composers": [
        "Avdhoot Gupte",
        "Sachin Pilgaonkar"
    ],
    "cinematographers": "Rahul Jadhav",
    "editors": "Faisal Mahadik",
    "assistant directors": "Suvahhdan Angre",
    "sound department": "Justin Jose",
    "visual effects": [
        "Nilesh Posnak",
        "Meera Sukhathankar"
    ],
    "camera department": "Dhananjay Singh",
    "miscellaneous": [
        "Pep Figueiredo",
        "Pradnya Sumati Shetty"
    ],
    "akas": "Ideachi Kalpana (India)",
    "writer": "Kshitij Zarapkar",
    "director": [
        "Sachin Pilgaonkar",
        "Sachin Pilgaonkar"
    ],
    "production companies": [
        "Sushriya Chitra",
        "Everest Entertainment"
    ],
    "plot": "Jayram is an upcoming struggling actor who is slated for greatness or at least his sister Jaywanti thinks so. Her husband Manohar is a lawyer. But he is a fraud. One has to count the fingers of ones hand after shaking hands with him. He has not contested a single case in the court of law. He prefers out of court settlements. Jayram is hit by a car driven by Priti. Priti's brother Mahesh Thakur is the commissioner of Police. Since she had taken her brother's car the hit and run case becomes that of the Commissioner.::Everest Entertainment",
    "synopsis": "Jayram is an upcoming struggling actor who is slated for greatness or at least his sister Jaywanti thinks so. Her husband Manohar is a lawyer. But he is a fraud. One has to count the fingers of ones hand after shaking hands with him. He has not contested a single case in the court of law. He prefers out of court settlements. Jayram is hit by a car driven by Priti. Priti's brother Mahesh Thakur is the commissioner of Police. Since she had taken her brother's car the hit and run case becomes that of the Commissioner. To solve the issue the commissioner comes to the hospital but by then Manohar has decided to sue the owner of the car for 50 lakh rupees. Jayram is actually fine but Manohar convinces him that he should play along with his plan and remain in the hospital till the case ends. Thakur and Manohar end in a face off in a non existent case. Priti though decides to tell Jayram that her brother is not involved in any of this and falls in love with him in the process. Manohar leaks the news to the press and Jayram reads about it in the newspaper. He now wants to tell Priti the truth. He escapes from the hospital and goes to the Commissioner's bungalow. Jayram does not meet Priti but he and the Commissioner come face to face. Now does the Commisioner arrest Jayram ? Does Manohar succeed in getting 50 lakhs? Does Manohar go to jail for embelling a fraud and involving Jayram in it ? What happens to Jayram and Priti's love ? Does the Commisior accept defeat at the hands of the fraudsters?"
}