{
    "id": "4321914",
    "localized title": "Mandhira Punnagai",
    "cast": [
        "Ammu",
        "Dhananjayan",
        "Meenakshi",
        "Karu Pazhaniappan",
        "Naglan Ponnusamy",
        "Rishi Raj",
        "Thambi Ramaiah",
        "Santhanam",
        "Srikanth"
    ],
    "genres": "Thriller",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "19 Nov 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzYzYmY0NWYtNDZmNy00NmQ5LWFmYTctZGY4ZGMxNTlhYTUxXkEyXkFqcGdeQXVyMzYxOTQ3MDg@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4321914",
    "languages": "Tamil",
    "title": "Mandhira Punnagai",
    "kind": "movie",
    "directors": "Karu Pazhaniappan",
    "writers": "Karu Pazhaniappan",
    "producers": "Karthic Nagarajan",
    "composers": "Vidyasagar",
    "cinematographers": "Ramnath Shetty",
    "editors": "Raja Mohammad",
    "editorial department": "Bvr Shivakumar",
    "visual effects": "Harihara Suthan",
    "akas": "Mandhira Punnagai (India)",
    "writer": "Karu Pazhaniappan",
    "director": "Karu Pazhaniappan",
    "production companies": "Indira Pictures",
    "distributors": [
        "Indira Pictures",
        "Hotstar",
        "Star VijayTV"
    ],
    "plot": "A socially dysfunctional architect has some major issues to work through if he wants to sustain a relationship.",
    "synopsis": "The film tells the story of an architect Kathir (Karu Pazhaniappan), who is talented but also forthright in his dealings, whether in office his personal life. He doesn't have any girlfriends or many friends, whether at work or in personal life. When he is asked to design a spanking new showroom for Honda Dealership, Nandhini (Meenakshi), one of the employees there meets Kathir in connection with the new design and falls in love with his forthrightness unbeknownst to him. He doesn't pay much attention to Meenakshi's overtures initially, perhaps influenced by his troubled childhood. He is approached by Shankar (Rishi), Nandhini's colleague who happens to like her, to find out what it is that attracts her to Kathir, for which Kathir drags Shankar to Nandhini's house and asks him to convey his love for Nandhini himself. This increases Nandhini's attraction towards Kathir's straightforward attitude. Gradually, Kathir starts to like her but at the same time, he also fears that she is cheating on him and tries to kill her. He goes to the police station confessing his crime that he killed her. When the police come to find the body in his apartment, they are unable to find the body. Kathir's friend Manmadha Naidu (Thambi Ramaiah) says that last night, Kathir was talking to himself and breaking all the things in a fit of anger (When Kathir saw Nandhini sleeping with Srikanth, he got angry and broke all the things imagining himself as killing Nandhini). Kathir had a troubled childhood where his mother eloped after her illegal affair with his father's friend came to light, and his father committed suicide after finding out about the affair at the same time, which made him view things in a different light. In the end, Nandhini claimed that she planned things to make him reform, but Kathir, in anger, says he celebrates people dying. Later, Kathir receives a call that Nandhini had committed suicide. He immediately goes to the hospital and finds out that she didn't commit suicide, and she gave him a shock to make him realize the wrongdoings. The film ends with Nandini and Kathir uniting and a reflection of Kathir's father giving acceptance."
}