{
    "id": "6774886",
    "localized title": "Kari Chirathe",
    "cast": [
        "Duniya Vijay",
        "Sharmiela Mandre",
        "Yagna Shetty",
        "Rangayana Raghu",
        "Jai Jagdeesh"
    ],
    "genres": [
        "Action",
        "Romance"
    ],
    "runtimes": "138",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "03 Sep 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDI0NjFiM2YtM2QyNC00MjFkLWEwOWQtMjhkNjM1ODllMGNiXkEyXkFqcGdeQXVyMzU0ODc1MTQ@._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "6774886",
    "plot outline": "Mada (Vijay), an innocent boy from a middle-class family, wants to build a palatial house and then get married and treat her like a queen. His dreams are shattered when circumstances force him to take on politician Kanchi Kote (Rangayana Raghu) and expose all his misdeeds. Irritated by the turn of events, the politician sends his henchmen to kill Mada. The brutal attack makes him lose his memory and he goes mad in despair. To complicate matters, Bharathi (Yagna Shetty) falls in love with him but he marries Shruthi (Sharmila Mandre). Watch the full movie Kari Chirathe online, only on Eros Now.",
    "languages": "Kannada",
    "title": "Kari Chirathe",
    "kind": "movie",
    "directors": "K. Madesh",
    "composers": "Sadhu Kokila",
    "music department": "Singer Megha",
    "akas": "Kari Chirathe (India)",
    "director": "K. Madesh",
    "plot": "Mada (Vijay), an innocent boy from a middle-class family, wants to build a palatial house and then get married and treat her like a queen. His dreams are shattered when circumstances force him to take on politician Kanchi Kote (Rangayana Raghu) and expose all his misdeeds. Irritated by the turn of events, the politician sends his henchmen to kill Mada. The brutal attack makes him lose his memory and he goes mad in despair. To complicate matters, Bharathi (Yagna Shetty) falls in love with him but he marries Shruthi (Sharmila Mandre). Watch the full movie _Kari Chirathe_ (qv) online, only on Eros Now."
}