{
    "id": "7045506",
    "localized title": "Sati Behula",
    "cast": [
        "Ashok Bhattacharya",
        "Arun Bir",
        "Siddharth Dhawan",
        "Hemamalini",
        "Madhumita",
        "Sweta Mishra",
        "Arpita Mukherjee",
        "Bhagyashree Patwardhan",
        "Rajesh Sharma",
        "Koushik Singha"
    ],
    "genres": "Fantasy",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTlkMTRmZTQtZDQyNy00ZjQ5LTgyOGEtNzg5N2Y3Yzk1OGUxXkEyXkFqcGdeQXVyNzgzNDAzMTA@._V1_SY150_CR17,0,101,150_.jpg",
    "imdbID": "7045506",
    "plot outline": "'Sati Behula' is the story of the powers of Ma Manasa, the goddess of snakes. Savitri is a devoted wife who wanders around with her handicapped husband and doesn't leave him despite of problems. Savitri narrates the story of Behula to her husband and tells him how a devoted wife can bring her dead husband back to life. Chand Saudagar is a businessman who refuses to offer his obeisance to goddess Manasa. Bishahar, a sage and devotee of Manasa kills six sons of Chand on their wedding night with snake bites. Lakhinder the seventh son of Chand is also bitten by Kaal Nagin on his wedding night and dies. But his devoted wife Behula doesn't give up and reaches heaven and brings her husband back to life. She promises Manasa that she'll make her father-in-law offer obeisance to her and she keeps her promise. Savitri also brings her handicap husband back to life and gets him cured with the power of her prayers.",
    "languages": "Bangla",
    "title": "Sati Behula",
    "kind": "movie",
    "directors": "Manoj Kumar",
    "producers": "Shrimati Nirmola Singha",
    "composers": "Uday Singh",
    "cinematographers": "Tushar Bibhute",
    "akas": "Sati Behula (India)",
    "director": "Manoj Kumar",
    "production companies": "Angel Digital.",
    "plot": "'_Sati Behula_ (qv)' is the story of the powers of Ma Manasa, the goddess of snakes. Savitri is a devoted wife who wanders around with her handicapped husband and doesn't leave him despite of problems. Savitri narrates the story of Behula to her husband and tells him how a devoted wife can bring her dead husband back to life. Chand Saudagar is a businessman who refuses to offer his obeisance to goddess Manasa. Bishahar, a sage and devotee of Manasa kills six sons of Chand on their wedding night with snake bites. Lakhinder the seventh son of Chand is also bitten by Kaal Nagin on his wedding night and dies. But his devoted wife Behula doesn't give up and reaches heaven and brings her husband back to life. She promises Manasa that she'll make her father-in-law offer obeisance to her and she keeps her promise. Savitri also brings her handicap husband back to life and gets him cured with the power of her prayers."
}