{
    "id": "8921800",
    "localized title": "Neeyum Naanum",
    "cast": [
        "Bala Ganapathi William",
        "Jasmine Michael",
        "K.K. Khanna",
        "Arun Kumaran",
        "Khavitha Thangarajan",
        "Rathey Ram",
        "Kaameshaa Ravindran",
        "Sathiya",
        "Suhan"
    ],
    "genres": "Romance",
    "runtimes": "136",
    "countries": "Malaysia",
    "country codes": "my",
    "language codes": "ta",
    "color info": "Color",
    "certificates": "Malaysia:P13",
    "original air date": "20 Sep 2018 (Malaysia)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGU5ZDNkNmUtYWNlNy00YjA1LWI0NDYtN2QzYTk0ZWQ2MWNiXkEyXkFqcGdeQXVyOTA0ODgwMzY@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "8921800",
    "plot outline": "Karthik is a photographer by profession together with his another two friends Arun & Viki. One fine day, he came across Oviya who is after her break-up. Karthik falling in love with her. When their love started to develop, Karthik noticed some strange behavior with Oviya. The story develops with the worsening of Oviya's strange behavior. At another track Karthik's friend Viki started to like Oviya's sister Madhavi, who is a divorced. What happens to Viki's love plot is another sub plot in the movie. At one point, Kathik get to know the reason for Oviya's strange behavior. What happens to Oviya, and what happens in the end is the journey of Neeyum Naanum.",
    "languages": "Tamil",
    "title": "Neeyum Naanum",
    "kind": "movie",
    "directors": "Bala Ganapathi William",
    "producers": [
        "Juswans Kaur",
        "Krishnakumaran Munian",
        "H.K. Network",
        "Harbhajan Jit Singh"
    ],
    "composers": "Varmman Elangkovan",
    "cinematographers": [
        "Soma Kanthan",
        "Soma Khanthan"
    ],
    "editors": "Ramses Rao",
    "editorial department": "Elson Tomas",
    "sound department": [
        "Kevin",
        "Elson Tomas"
    ],
    "director": "Bala Ganapathi William",
    "production companies": [
        "BGW Studios",
        "HK Network",
        "Warriors Entertainment"
    ],
    "distributors": [
        "BGW Studios",
        "BGW Studios"
    ],
    "other companies": "Elpraga Pascapenerbitan",
    "plot": [
        "Karthik is a photographer by profession together with his another two friends Arun and Viki. One fine day, he came across Oviya who is after her break-up. Karthik falling in love with her.",
        "Karthik is a photographer by profession together with his another two friends Arun & Viki. One fine day, he came across Oviya who is after her break-up. Karthik falling in love with her. When their love started to develop, Karthik noticed some strange behavior with Oviya. The story develops with the worsening of Oviya's strange behavior. At another track Karthik's friend Viki started to like Oviya's sister Madhavi, who is a divorced. What happens to Viki's love plot is another sub plot in the movie. At one point, Kathik get to know the reason for Oviya's strange behavior. What happens to Oviya, and what happens in the end is the journey of _Neeyum Naanum_ (qv)."
    ]
}