{
    "id": "0119690",
    "localized title": "Mojo",
    "cast": [
        "Ian Hart",
        "Ewen Bremner",
        "Aidan Gillen",
        "Martin Gwynn Jones",
        "Hans Matheson",
        "Andy Serkis",
        "Ricky Tomlinson",
        "Harold Pinter",
        "Kenneth Bryans",
        "Paul Ebsworth",
        "Kate Lynn Evans",
        "Jason Cheater",
        "Al Fiorentini",
        "Shend",
        "Milly Gregory",
        "James Hunter",
        "Mke Watts",
        "Dave Lagnado",
        "Damian Hand",
        "Tim Chimes",
        "David Baukham",
        "Alexander Armstrong",
        "Che Grant"
    ],
    "genres": "Drama",
    "runtimes": "90",
    "countries": "United Kingdom",
    "country codes": "gb",
    "language codes": "en",
    "color info": "Color::(Technicolor)",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Dolby Digital",
    "certificates": "United Kingdom:15",
    "original air date": "17 Oct 1997 (Italy)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjhkNzFlYzMtNDJlZi00MDI3LWJkODItMTlhMTdjNzAxMmFmXkEyXkFqcGdeQXVyMzU0NzkwMDg@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0119690",
    "plot outline": "London in the fifties: a young singer is the star in a night club and is the owner's protegé. The latter has also a son, Baby, who, thanks to his father's morbid attentions is considered a halfwit by everybody. An old gay gangster has Baby's father horribly killed since he wants the singer's attentions all for himself.",
    "languages": "English",
    "title": "Mojo",
    "kind": "movie",
    "directors": "Jez Butterworth",
    "writers": [
        "Jez Butterworth",
        "",
        "Jez Butterworth",
        "",
        "Tom Butterworth"
    ],
    "producers": [
        "Eric Abraham",
        "Steve Butterworth",
        "Paul Cowan",
        "George Faber",
        "Nick Marston"
    ],
    "composers": "Murray Gold",
    "cinematographers": "Bruno de Keyzer",
    "editors": "Richard Milward",
    "editorial department": [
        "Robert Laycock",
        "Asha Radwan"
    ],
    "production designers": "Hugo Luczyc-Wyhowski",
    "art directors": "Richard Bridgland",
    "costume designers": "Pam Tait",
    "make up department": "Marilyn MacDonald",
    "assistant directors": [
        "Barrie McCulloch",
        "Mick Ward"
    ],
    "art department": [
        "Noel Cowell",
        "Darren Hayward",
        "Douglas Ingram",
        "Gary Underwood",
        "Jo Underwood",
        "Linda Wilson"
    ],
    "sound department": [
        "Colin Chapman",
        "Steve Hancock",
        "Julian Pinn",
        "John Taylor",
        "Peter Gleaves",
        "Tim Partridge"
    ],
    "stunts": [
        "Steve Dent",
        "Chrissy Monk"
    ],
    "camera department": [
        "Jack Collins",
        "Tim Fleming",
        "Alan Grayley"
    ],
    "costume departmen": "Jo Underwood",
    "location management": "Dee Gregson",
    "music department": "Mark Tucker",
    "miscellaneous": "Ryan Green",
    "akas": [
        "Моджо (Bulgaria, Bulgarian title)",
        "Soho (Italy)"
    ],
    "writer": [
        "Jez Butterworth",
        "Jez Butterworth",
        "Tom Butterworth"
    ],
    "director": "Jez Butterworth",
    "production companies": [
        "British Broadcasting Corporation (BBC)",
        "British Screen Productions",
        "Mojo Films",
        "Portobello Pictures"
    ],
    "distributors": "Channel Four Films",
    "other companies": [
        "Film Finances",
        "Lee Lighting",
        "Sapex Scripts"
    ],
    "plot": [
        "The sexual rivalries over a new, potentially great rock'n'roll singer between a nightclub owner and a local gangster cause unrest and eventually lead to murder.",
        "London in the fifties: a young singer is the star in a night club and is the owner's protegé. The latter has also a son, Baby, who, thanks to his father's morbid attentions is considered a halfwit by everybody. An old gay gangster has Baby's father horribly killed since he wants the singer's attentions all for himself.::Salvatore Santangelo <pappagone2@libero.it>"
    ],
    "synopsis": "Set entirely within the seedy Atlantic club, Silver Johnny - a young and talented performer on the road to fame and fortune is held back by his Jealous, and protective manager Ezra, owner of the night club and father to a psychotic, un-loved son, Baby. As Silver Johnny progresses up the ladder to stardom, local gangster/entrepreneur Sam Ross begins to take interest, and the only way to remove opposition (Ezra) appeared to be sawing him in half, kidnapping Silver Johnny and leaving the clubs' fate in a state of limbo.Discovered the next morning by Ezra's second in command and highly ambitious associate Mickey, announces that Ross intends to take over the Atlantic Club, setting the stage for major power struggles; \"He's been fucking cut in half. He's in two bins...\"Terrified by this potential threat of extermination by Ross and his gang, the fellow associates under the now deceased Ezra, (Potts, Sweets, Skinny and Baby) begin to loose their nerve and try to convince themselves its Mickey's idea of a joke; \"Its Mickey's joke, its Mickey's morning joke!\" When this turns out to be false the Atlantic Club gang set themselves to be prepared for what could be their final night; with just an old cutlass as the only defence mechanism along with an old Derringer, the group start to argue amongst themselves and even consider joining Ross or simply leaving.As the day wears on, oblivious to the situation, people begin to gather outside the club waiting for the doors to open. Sweating it out inside, the small group of four have to break the tragic news to Baby (Boss' son) of his father's grizzling death - but takes the news in a dreamlike, distant manner. Uneasy about Baby's mental stability the Atlantic gang begin to become restless - especially about their catering. Arguments break out over frivolous matters, (Uncle Tommy) and the group finally settle to envisage just what their rivals are doing at that very moment.In the climax of the fast paced story, Skinny checks downstairs to see if the coast in clear for the gang to have a little space, rather than being cooped up in a single room and finds, hanging from the ceiling... Silver Johnny. In shire panic Skinny calls for help only to find Baby with the Derringer, who shoots. Utterly perplexed and with a bullet in his head, Skinny calls for assistance. Mickey, Potts and Sweets enter and attempt to cover the wound and to calm Skinny down - whilst Baby wanders around aimlessly... Silver Johnny is lowered to the floor, and tragically, Skinny dies. Unable to save Skinny's life, Mickey breaks down from his figure of authority and status, and kneels beside his friends body."
}