{
    "id": "0244549",
    "localized title": "Inspector Balram",
    "cast": [
        "Mammootty",
        "Murali",
        "Kiran Kumar",
        "M.G. Soman",
        "Urvashi",
        "Geetha",
        "Manjula",
        "Kalpana",
        "V.K. Sriraman",
        "Raghu",
        "Jagadish",
        "Johny",
        "Vincent",
        "Kunchan",
        "Ramu",
        "M.S. Thrippunithara",
        "Ragini",
        "Kollam Thulasi",
        "Vineeth Kumar",
        "Augustine",
        "Shanawas",
        "Kanakalatha",
        "Malasia Bhaskar",
        "Baby Anu",
        "Master Vineeth"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "143",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "hi"
    ],
    "color info": "Color",
    "sound mix": "Mono",
    "certificates": "India:A",
    "original air date": "26 Apr 1991 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjljOTM3YjEtOGJiMy00NmNkLWE0YmMtNzE2ZThiNThmMGU0XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0244549",
    "plot outline": "Kannur-based Circle Inspector Balram is married to Seetha, and has a daughter, Amrtha. He faces a lot of hostility, was suspended from work, and even imprisoned, due to his honesty. While apprehending criminals, Seetha is killed, and Balram entrusts Amritha to some nuns, who also run a school. Then D'Cruz Pereira is arrested with the assistance of the owner of Krishna Jewellers, Krishna Mathur, but is subsequently released. Shortly thereafter there are violent clashes between Muslims and Hindus, and taking advantage of this, he ransacks Krishna's shop, and kills him. Krishna's daughter, Preethi, approaches the Police for assistance, and is even willing to bribe them, albeit in vain. When Balram finds out, he decides to assist her not realizing that he will be up against his very own department, corrupt politicians, Indira Shankar - aka Delhi's Dulabribai, and international criminal don, Sayed Mohammad Shah.",
    "languages": [
        "Malayalam",
        "Hindi"
    ],
    "title": "Inspector Balram",
    "kind": "movie",
    "directors": "I.V. Sasi",
    "writers": [
        "T. Damodaran",
        "",
        "Mohan Nair"
    ],
    "producers": "Liberty Basheer",
    "composers": "Shyam",
    "cinematographers": "J. Williams",
    "editors": "K. Narayanan",
    "art directors": [
        "I.V. Sathish Babu",
        "I.V. Satheeshbabu"
    ],
    "akas": "Police ki jung (India, Hindi title)",
    "writer": [
        "T. Damodaran",
        "Mohan Nair"
    ],
    "director": "I.V. Sasi",
    "production companies": "Liberty Productions",
    "distributors": "Liberty Release",
    "plot": [
        "_Inspector Balram_ (qv) is wrongly suspended and jailed when he sincerely fights against the atrocities of influential dons. After the mafia kills his wife, he takes the law into his hands.",
        "Kannur-based Circle _Inspector Balram_ (qv) is married to Seetha, and has a daughter, Amrtha. He faces a lot of hostility, was suspended from work, and even imprisoned, due to his honesty. While apprehending criminals, Seetha is killed, and Balram entrusts Amritha to some nuns, who also run a school. Then D'Cruz Pereira is arrested with the assistance of the owner of Krishna Jewellers, Krishna Mathur, but is subsequently released. Shortly thereafter there are violent clashes between Muslims and Hindus, and taking advantage of this, he ransacks Krishna's shop, and kills him. Krishna's daughter, Preethi, approaches the Police for assistance, and is even willing to bribe them, albeit in vain. When Balram finds out, he decides to assist her not realizing that he will be up against his very own department, corrupt politicians, Indira Shankar - aka Delhi's Dulabribai, and international criminal don, Sayed Mohammad Shah.::rAjOo (gunwanti@hotmail.com)"
    ]
}