{
    "id": "13099072",
    "localized title": "Vardhana",
    "cast": [
        "Chikkanna",
        "Harsha",
        "Neha Patil",
        "Petrol Prasanna",
        "Padmaja Rao",
        "Shobhraj"
    ],
    "genres": "Action",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "10 Mar 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGU1ZjcwODQtMmU0Ny00ODcyLWE0ZmUtNDAxZjE1Y2RhYTc2XkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "13099072",
    "plot outline": "Harsha Tries To Impress Kavya And Get Married To Her As His Mom Would Have Asked Him To Marry Her. But Kavya Wants To Love And Marry Don. Harsha Lies Saying He Is Also A Don Known As Forget Harsha And Is Involved In Underworld Activities. Harsha Along With His Friend Chikka's Help Created Scenarios In Front Of Kavya To Prove He Is A Don. Cops Will Arrest Harsha When He Gets Caught Accidentally In Ding Raja A Local Don Case. Harsha Proves His Innocence In This Murder Case And Comes Out. By This Time Neha Would Get To Know His Real Character And Says Need Vardhana And Harsha. Harsha Gets Shocked When He Gets To Know She Got To Know About Vardhana. Now Who Is Vardhana? Why Is He Living As Harsha? Watch This Comedy Action Movie To Get To Know About VARDHANA.",
    "languages": "Kannada",
    "title": "Vardhana",
    "kind": "movie",
    "directors": "Nagendra Urs",
    "producers": "K. Sudhakar",
    "composers": "Mathews Manu",
    "akas": "Vardhana (India)",
    "director": "Nagendra Urs",
    "plot": "Harsha Tries To Impress Kavya And Get Married To Her As His Mom Would Have Asked Him To Marry Her. But Kavya Wants To Love And Marry Don. Harsha Lies Saying He Is Also A Don Known As Forget Harsha And Is Involved In Underworld Activities. Harsha Along With His Friend Chikka's Help Created Scenarios In Front Of Kavya To Prove He Is A Don. Cops Will Arrest Harsha When He Gets Caught Accidentally In Ding Raja A Local Don Case. Harsha Proves His Innocence In This Murder Case And Comes Out. By This Time Neha Would Get To Know His Real Character And Says Need _Vardhana_ (qv) And Harsha. Harsha Gets Shocked When He Gets To Know She Got To Know About _Vardhana_ (qv). Now Who Is _Vardhana_ (qv)? Why Is He Living As Harsha? Watch This Comedy Action Movie To Get To Know About VARDHANA."
}