{
    "id": "13176170",
    "localized title": "Shwethaa",
    "cast": [
        "Yashwanth Bijur",
        "H.G. Dattatreya",
        "Jayasheela Gowda",
        "Praveen Laksh",
        "Akshatha Marla",
        "Srinivasa Prabhu",
        "Vishnu Prasad",
        "Manjunatha Reddy",
        "Hrudaya Shiva",
        "Geeta Sree",
        "Kiran Vati"
    ],
    "genres": "Drama",
    "runtimes": "105",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "21 Jun 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDhiYzIwYzQtZjg3OC00Y2QwLWIxZGUtNmY4NWQwNDRhZmI0XkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SY150_CR62,0,101,150_.jpg",
    "imdbID": "13176170",
    "plot outline": "Shwethaa and three of her friends, who are para psychology students, go to an old, haunted bungalow to shoot for their project report about the existence of evil spirits. Shwethaa finds a dybbuk box, which has ancient satanic symbols etched on it, in the bungalow and brings it back to her place, unaware that it has a malicious demon living in side it. She fails to open the box on various occasions but, one night, the box opens on its own. Will Shwethaa be able to see what lives inside the box? What happens next?",
    "languages": "Kannada",
    "title": "Shwethaa",
    "kind": "movie",
    "directors": "Rajesh R. Balipa",
    "writers": "Hrudaya Shiva",
    "producers": "P.M. Ramachandra Reddy",
    "composers": "Kiran Ravindranath",
    "akas": "Shwethaa (India)",
    "writer": "Hrudaya Shiva",
    "director": "Rajesh R. Balipa",
    "production companies": "S R Y Productions",
    "plot": [
        "A para-psychology student brings home a peculiar looking box with satanic symbols etched on it, that unleashes a world of dangers with it.",
        "_Shwethaa_ (qv) and three of her friends, who are para psychology students, go to an old, haunted bungalow to shoot for their project report about the existence of evil spirits. _Shwethaa_ (qv) finds a dybbuk box, which has ancient satanic symbols etched on it, in the bungalow and brings it back to her place, unaware that it has a malicious demon living in side it. She fails to open the box on various occasions but, one night, the box opens on its own. Will _Shwethaa_ (qv) be able to see what lives inside the box? What happens next?"
    ]
}