{
    "id": "13243538",
    "localized title": "Mumbai",
    "cast": [
        "Kaddipudi Chandru",
        "Neenasam Chaswa",
        "Darling Krishna",
        "Kote Prabhakar",
        "Bullet Prakash",
        "Rangayana Raghu",
        "Teju",
        "Ashish Vidyarthi"
    ],
    "genres": "Drama",
    "runtimes": "147",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "26 Jan 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTE5NDFlYzMtNjJkYy00YjFjLTgwZGEtZWI1NGZlNWIzODJkXkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "13243538",
    "plot outline": "Krishna the protagonist works in a bar as cashier who eventually meets a girl beside his house and starting with small fights and humour he falls in love with her. Alongside he is constantly helping an orphanage and has a special bondage with blind kids. Later on due to some problem which occurs in the orphanage, the situation forces him to move to Mumbai which leads him to the underworld. Rest of the story revolves around the thrilling action with the underworld, the orphanage and his love interest.",
    "languages": "Kannada",
    "title": "Mumbai",
    "kind": "movie",
    "directors": "S.R. Ramesha",
    "producers": "Ramu",
    "director": "S.R. Ramesha",
    "production companies": "Ramu Films",
    "plot": [
        "A bar accountant falls in love with his neighbour. But their love doesn't seem a bed of roses with many impediments that lead the two lovebirds to _Mumbai_ (qv). Baddies, revenge, action and melodrama make for the rest of the film.",
        "Krishna the protagonist works in a bar as cashier who eventually meets a girl beside his house and starting with small fights and humour he falls in love with her. Alongside he is constantly helping an orphanage and has a special bondage with blind kids. Later on due to some problem which occurs in the orphanage, the situation forces him to move to _Mumbai_ (qv) which leads him to the underworld. Rest of the story revolves around the thrilling action with the underworld, the orphanage and his love interest."
    ]
}