{
    "id": "4307132",
    "localized title": "G Kutta Se",
    "cast": [
        "Rajveer Ankur Singh",
        "Neha Chauhan",
        "Vibha Tyagi",
        "Nitin Pandit",
        "Sandeep Goyat",
        "Rashmi Somvanshi",
        "Parth Sharma",
        "Sunita Huda",
        "Anu Sharma",
        "Mangat Ram",
        "Pawan Goyal",
        "Lakshaya Dhull",
        "Monika Misra",
        "Sumant Agarwal",
        "Anmol Changa",
        "Neha Chauhan",
        "Priyanka Chauhan",
        "Priyanka Chauhan",
        "Vibha Dikshit",
        "Amit Vaishisht"
    ],
    "genres": "Drama",
    "runtimes": "104",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "bgc",
        "hi"
    ],
    "color info": "Color",
    "certificates": "India:A",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTQ4MDJmOTUtMDZhZS00MzYwLTk1N2QtYWNlNjdhZTY5OWRlXkEyXkFqcGdeQXVyNTA3MjQ3OTI@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "4307132",
    "plot outline": "The way male is breaking the very natural balance since ages. By suppresing female, by objectifying female, by dehumanizing female, by silencing female or by threatening female, how the male hegemony has called for an ironical response become a matter of research for the makers of G Kutta Se. The disgrace male brings to human existence by disgracing the very existence of female becomes the matter of concern for the makers of film G Kutta Se. Director Rahul Dahiya and his team nowhere seem defensive or suggestive. Rather, their approach is vary brave. They have called a spade a spade.",
    "languages": [
        "Haryanvi",
        "Hindi"
    ],
    "title": "G Kutta Se",
    "kind": "movie",
    "directors": "Rahul Dahiya",
    "writers": [
        "Rahul Dahiya",
        "",
        "Rahul Dahiya",
        "",
        "Danish Raza",
        "",
        "Danish Raza"
    ],
    "producers": [
        "Danish Raza",
        "Danish Raza",
        "Sharib Raza",
        "Surabhi Sharma",
        "Vinod Sharma"
    ],
    "composers": [
        "Peter Broderick",
        "Anjo John",
        "Machinefabriek"
    ],
    "cinematographers": [
        "Alok Shrivastav",
        "Sachin Singh"
    ],
    "editors": [
        "Sandeep Singh Bajeli",
        "Lokesh Malik",
        "Pranay Nillay"
    ],
    "art directors": "Ambika Acharya",
    "assistant directors": [
        "Prerna Malik",
        "Amit Pandya",
        "Shashank Shinghal",
        "Harinder Singh",
        "Mayank Tyagi"
    ],
    "art department": "Navjot Singh",
    "sound department": "Tenny",
    "miscellaneous": "Parull Gossain",
    "akas": [
        "Khatak (India, Hindi title)",
        "G - A Wanton Heart"
    ],
    "writer": [
        "Rahul Dahiya",
        "Rahul Dahiya",
        "Danish Raza"
    ],
    "director": "Rahul Dahiya",
    "production companies": [
        "Full Frame Entertainment Private Limited",
        "SFE International"
    ],
    "distributors": "Runaway-Luminosity Distribution",
    "plot": [
        "Set in the badlands of Haryana, known for high rates of female foeticide, _G Kutta Se_ (qv) explores the murky world of sexual transgression and honour killings in India.",
        "The way male is breaking the very natural balance since ages. By suppresing female, by objectifying female, by dehumanizing female, by silencing female or by threatening female, how the male hegemony has called for an ironical response become a matter of research for the makers of _G Kutta Se_ (qv). The disgrace male brings to human existence by disgracing the very existence of female becomes the matter of concern for the makers of film _G Kutta Se_ (qv). Director Rahul Dahiya and his team nowhere seem defensive or suggestive. Rather, their approach is vary brave. They have called a spade a spade.",
        "In a small village not too far from Delhi, three lives explode around taboos of love and lust. Diksha, still just a girl, is caught unguarded on camera, smirching the \"honour\" of her parents. Kiran, in love with the wrong boy, becomes the target of another man's lustful vengeance, \"dishonouring\" her family. And Virender, a young man cruising the streets at will, enjoys all the acts society forbids women, protecting or destroying their \"honour\"as he wills. Set in the badlands of Haryana, known for high rates of female foeticide, G explores the murky world of sexual transgression and honour killings in India."
    ],
    "synopsis": "Virender is a young man at home on the streets. He wanders as he pleases through the terrain of his life- village alleys, highways, homes of his relatives - through the days. At night he encounters lust in different forms. Sometimes vicariously, listening to his friend describe how he felt up a sleeping sister-in-law. Other times during a chance encounter with a woman on the run from her husband. Virender can mess around without fear. He knows that in his world, men are in charge of women's lives, their bodies and their honour.\nThere is just one limit even Virender is afraid of breaching, with his uncle's daughter Kiran. In the small village of Haryana where they live, a romance between the same caste group, even the same village, is held strictly taboo. But even as Virender limits himself to fantasies of college-going Kiran, she is exploring her own sexuality dangerously, through a romance with Dheer, who lives in her village and is hence her \"caste-brother\". Trapped in the middle of these currents and rapid but uneven change is young Diksha, Virender's sister, still just a girl. When a video of Diksha is circulated on mobile phones, her family is dishonoured in their village, sparking off a chain of grisly events and retribution. Set in the lawless terrain of Haryana, a state in northern India known for its low sex ratio, where courtyards and colleges are as firmly policed as bodies, G dwells on the daily humilations and acts of violence around love, lust and honour faced by women in this part of India."
}