{
    "id": "5323640",
    "localized title": "Singam 3",
    "cast": [
        "Suriya",
        "Anushka Shetty",
        "Shruti Haasan",
        "Thakur Anoop Singh",
        "Imman Annachi",
        "Sarath Babu",
        "Chaams",
        "Nitu Chandra",
        "Janaki Ganesh",
        "Olamilekan Akanbi Jason",
        "V. Jayaprakash",
        "Krish",
        "Delhi Kumar",
        "Nassar",
        "Priya",
        "Radha Ravi",
        "Andrea Marian Renji",
        "Radhika Sarathkumar",
        "Nitin Sathya",
        "Sharat Saxena",
        "Robo Shankar",
        "Soori",
        "Suman",
        "Sumithra",
        "Vijayakumar",
        "Yuvarani"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ta",
        "te"
    ],
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:14A::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:13+::(Quebec)",
        "France:Tous publics",
        "India:U",
        "Ireland:15A",
        "Malaysia:P13",
        "New Zealand:M",
        "Norway:12",
        "Singapore:PG13",
        "United Kingdom:12A",
        "United Kingdom:15::(withdrawn)",
        "United Kingdom:12A",
        "United States:Not Rated",
        "United Arab Emirates:G"
    ],
    "original air date": "09 Feb 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDZmNmVkYTgtYjFhZC00ZWRiLWJjOTItMzgwYzk3MDAzZDQzXkEyXkFqcGdeQXVyOTA0NTIzNzU@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5323640",
    "plot outline": "Following the prequel, Duraisingam is transferred to Mangalore to investigate the death of the commissioner. In that process he gets involved with Australian toxic waste dealing mafia. Also Duraisingam discovers that Australian mafia is involved in this. The rest of the story is how Duraisingam catches the culprit though he face many work pressures and political pressures",
    "languages": [
        "Tamil",
        "Telugu"
    ],
    "title": "Singam 3",
    "kind": "movie",
    "directors": "Hari",
    "writers": "Hari",
    "producers": [
        "K.E. Gnanavelraja",
        "Sanjay Singh",
        "Jithin Thorai"
    ],
    "composers": "Harris Jayaraj",
    "cinematographers": "Priyan",
    "editors": "V.T. Vijayan",
    "editorial department": [
        "K. Sasi Kumar",
        "Sasi Kumar"
    ],
    "production managers": "Malik Streams",
    "assistant directors": [
        "Claranceraja",
        "Venkatesh Babu Krishnasamy"
    ],
    "sound department": [
        "M. Ravi",
        "Renjith Venugopal"
    ],
    "visual effects": "Dwaraganathbabu",
    "stunts": [
        "Anbariv",
        "Kanal Kannan"
    ],
    "camera department": [
        "Anand",
        "Nutakki Anoop",
        "Hayath Basha",
        "N. Bharathwaj",
        "Charlestead",
        "P. Govindaraj",
        "Gautam Kumar Jayaseelan",
        "Vishnu Kanth",
        "P. Karthick",
        "S. Karthick",
        "Satish Kumar",
        "Padmanathan M.",
        "Umashankar M.",
        "K. Nirmal Venkatesh",
        "Prashanth",
        "Swathik Raj",
        "Sudhakar",
        "Venkatesan",
        "Christye Xavier"
    ],
    "music department": "Sanjay Chandrasekhar",
    "akas": [
        "Si 3 (India, Tamil title)",
        "S3 the Movie (India, English title)",
        "S3 (India, Tamil title)",
        "Yamudu 3 (India, Telugu title)",
        "Si3 (India, Tamil title)"
    ],
    "writer": "Hari",
    "director": "Hari",
    "production companies": [
        "Aadnah Arts",
        "Pen Movies",
        "Studio Green"
    ],
    "distributors": [
        "Ayngaran International",
        "Pen Movies",
        "Amazon Prime Video",
        "Amazon Prime Video",
        "Hotstar",
        "Sun TV",
        "Zee Cinema"
    ],
    "other companies": "Eros Music",
    "plot": [
        "Uncompromising police chief Durai Singam battles against a criminal operation dealing in deadly toxic waste.",
        "Following the prequel, Duraisingam is transferred to Mangalore to investigate the death of the commissioner. In that process he gets involved with Australian toxic waste dealing mafia. Also Duraisingam discovers that Australian mafia is involved in this. The rest of the story is how Duraisingam catches the culprit though he face many work pressures and political pressures::krishna vamsi"
    ],
    "synopsis": "It's only been a few months since officer Durai Singam arrested Danny, and Singam is called into Vishakapatnam, Andra Pradesh by it's Home Minister to solve the long pending murder case of Commissioner Ramakrishna as the new Deputy Commissioner of Police. When Singam arrives in Vizag he's attacked at the train station by the goon Gun Ravi, who works for Vizag's most powerful don and buisness owner Madasudhana Reddy. Singam defeats Ravi's men and Ravi is scolded by Reddy for assaulting a police officer unnecessarily. Singam heads to Vizag's police station and meets Inspector Subbo Rao, officer Srinivas, and Constable Veeram. Veeram used to live in Thoothikudi and is a big fan of Singam, confirming that Bhai and Danny are currently in prison while Thangaraj has been killed. Veeram asks Singam about his marriage but the other officers are confused since he stated he was unmarried. Singam tells Veeram that he and his wife Kavya are divorced, which is later revealed as a cover to keep her protected. Kavya also visits the station and Singam pretends not to no her. Singam is also visited by Vidya, a fangirl who asks for his autograph at the train station. When Vidya makes frequent visits to Singam it bugs him and he dismisses her. Veeram and Vidya become friends in their common interests.Reddy calls his higher authority Vittal Prasad, a buisnessman stationed in Sydney, Australia who ships wastage from medical and electronic companies in exchange for free steal supplies for his company Vittal Steals. Vittal confronts his friend Steve for signing an oppositional agreement against him and beats up his wife in retaliation. Vittal calls his father, the Aviation Minister Ram Prasad to investigate Durai Singam when he gets update of his presence by Reddy. Back in Vizag, Singam fights a group of Reddy's men who threaten a custom's officer for blocking Reddy's shipment containers from Australia. Singam calls Reddy himself and covers the attack claiming to be his secret ally, and begins to investigate the case and inquires Ramakrishna's family. The commissioner's wife states that he attended a murder call and was killed on that night. She sends Singam away when he tries to talk to her daughters, stating that Krisharaj, the assistant commissioner touched them innappropriatly when he came to inquire. Krishnaraj also told Singam earlier that he had no knowledge of Ramakrishna calling him. A confused Singam hires a hacker named Murili to hack into the cell company's network and find that a call took place for a few seconds during the Commissioner's murder to a man named Mallaya. Vidya later pays visit to Singam claiming to be a student for a police academy and simply wishes to learn from him.A constable in the station falls sick mysteriously. After investigation, Singam, Subbo, and Srinivas find that the medicine tablet was sold without a permit under Reddy's authority and that the medicine originates from Australia. Singam pays visit to Bheemli Selvam, one of Reddy's men who authorized the attack at the train station. Suspecting him of murdering the Commissioner Singam searches his house and finds Australian money and a firearm. Reddy calls Singam and assures him that Selvam is permitted to have them. Vittal is also informed of the arrest by Rajeev Krishna, who works with Reddy and owns Vizag Scraps company. Veeram and Srinivas show Singam an article written about him being a corrupt extortionist threatening Reddy, written by an author Agni who's revealed to be Vidya. Vidya is actually a journalist hired to write a thrilling story in Vizag and she chooses to portray Singam as such. Singam's family and Home Minister Ramnathan are confused by the article and Reddy suggests to Singam to keep his head down. Singam is called and informed that the same people who killed the commissioner also murdered security guards around the same time as found by a forensic officer. Singam pays visit to Mallaya, Ramakrishna's driver who confirms that Reddy baited Ramakrishna to the harbor and shot him. He never told anyone since he was caught and threatened with death to him and his family. Murili also confirms that the phone company had the call history on that night erased. Singam deduces that somebody other than Reddy helped him murder the commissioner.The next day, Singam sends the entire force of Vizag to arrest every suspected criminal in the city including a great deal of Reddy's men. After shooting Selvam, Vidya begins to regret writing about Singam in the way she did. Reddy initially tolerates Singam's arrests but becomes suspicious when he takes too many of his men. Singam also confronts inspector Prakash and Krishnaraj who were involved in covering Ramakrishna's murder. Reddy calls Singam about his activity in which he reveals his true intentions. Singam later confronts Vidya for tricking him and has her arrested to pay a fine. She decides to leave Singam be afterwards. The police also identify the unnamed visitor to the station a few days ago from the funeral footage, as a local school teacher. Singam interrogates the teacher, who confirms that he knows of the cause. Weeks before Ramakrishna was killed, his grandchildren as well as 32 students died from a smog attack from the local dump which was burning trash. Singam heads to the city dumps and finds Australian medicine, hospital wastage and electronic components. Singam puts the events that have passed together and realizes that Reddy makes living off of importing Australian waste into Vizag and has killed Ramakrishna to protect it, and deduces that Reddy is working with someone in Australia to help him. Reddy, Rajeev, and Vittal all find out about his revelation and Reddy sends Ravi to kill Singam and the school teacher. Singam arrives at the harbor to inspect the wastage containers and is ambushed by Reddy's men. Ravi kills the teacher and Singam arrives to late. Vittal calls him anonymously with Reddy and Rajeev on the line and threatens to kill Singam's family if he continues with the case.The next day Singam decides he must get to the bottom of who Reddy's boss is. He starts with chasing down and arresting Ravi. He barges into Reddy's house and arrests him for all that he's done but he's only sentenced to two weeks of prison. Singam is also given permission to visit Australia to find Reddy's boss. He sends a drone into a steal company to find out who runs the buisness and confirms that Vittal is the man by searching Reddy's phone contacts. He books an appointment with Vittal pretending he doesn't know who he really is and tells him straight to his face that he'll find the man who threatened his family. Singam leaves Australia immediatly and Vittal fails to capture him. When Singam returns he finds Reddy paroled for Ramakrishna's murder when three of his goons claim to be responsible and that their supposed motivation was Ramakrishna attempting to rape one of their wives. Singam is disgusted by Reddy's action and is threatened by Reddy that he'll take his job and his life. Singam is also suspended by the CBI for speaking out of turn when they critisize him for being an extortionist and for his visit to Australia to confront Vittal. Additionally, Ramakrishna's wife blames him for her husband's defaming.Singam works to clean up the mess and continue to arrest wrongdoers on Reddy's part and campaigns against Reddy's influence and corruption in Vizag, including arresting the goons who paroled him. Singam frames Reddy for attempted assault on his own men and sends him on the run. When Singam tells Kavya that he can't let go of the case yet and Veeram finds out that Singam is still married. Vittal gets wind of Singam's rise in power and heads to India to confront him. Vittal tells Singam to stay out of his way, and Singam responds by intercepting Reddy and having Subbu shoot him since Reddy started a riot in Ram Prasad's favor six years earlier, which killed Subbu's son. Singam reveals Vittal's containers to the press and threatens to give all evidence away to the public if Vittal doesn't pay him visit. Singam angrily scolds Vittal on how his buisness has hurt people but decides to give him another chance for his employee's sake. Vittal leaves humiliated and gathers Reddy's remaining men to retaliate. At an unknown point, he dumps 400 more containers of garbage into the state's coast. Vidya attempts to make amends for her actions and help Singam with his case by interviewing Vittal while Singam visits Thoothikudi with Kayva to attend her grandmother's funeral. Singam is followed by Rajeev who's on the same flight and arrests him. In exchange for Rajeev's release, Vittal captures and drugs Vidya. Singam sends Rajeev by car to Vizag and keeps his cell location stationed in Thoothikudi with Murlili's help. Singam finds a vehicle belonging to Vittal's men and traces it to a hospital. Singam rescues Vidya who has to recover from a coma. On the way home that night, Vittal's men bomb Vizag station and attempt to kill Singam, injuring Srinivas who is sent to the hospital.The last straw, Singam finds government authorities and shows them all the evidence and events connecting Reddy, Vittal, and the wastage imports. Overriding influence of the ministers including Ram Prasad, Singam gets an arrest warrant and goes after Vittal who's on the run. Murili traces Vittal by cell signal to a highway leading to Telengara. Singam chases Vittal, who has escorts on the road while riding a container truck. Vittal gets past security in the airport despite having his passport blocked. Singam stops the plane to Malaysia from taking off. He arrests Vittal in the plane and takes him into custody. Vittal escapes into a nearby forest where Singam fights and shoots him dead. Srinivas and Vidya recover in the aftermath and Ram Prasad is fired. Six months later, Kavya is pregnant and Singam is called in by Ramnathan for another case."
}