{
    "id": "5501124",
    "localized title": "लपाछपी",
    "original title": "Lapachhapi",
    "cast": [
        "Aparna Ambawane",
        "Vikram Gaikwad",
        "Anil Gawas",
        "Dhanashree Khandkar",
        "Sachin More",
        "Usha Naik",
        "Hrudaynath Rane",
        "Pooja Sawant"
    ],
    "genres": [
        "Drama",
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:15::(self-applied)",
        "United Arab Emirates:A::(self-applied)"
    ],
    "original air date": "14 Jul 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWUxNjVlODgtZTE5ZC00ODBkLTk3YmEtYmYyNzJkNWViNTZmXkEyXkFqcGdeQXVyNjc0NTgxNzc@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "5501124",
    "plot outline": "Tushar and his pregnant wife Neha are forced to leave the city after their creditors attack Tushar.Bahurao driver of Tushar tells him to come along with his village fro a change until things settle down in the city.Tushar and Neha reach the village which has nothing around rather then sugarcane fields.Bahurao's wife Tulsabai is very caring towards Neha but feels that Tulsabai is not whom she claims as sometimes she becomes violent towards her to be.Neha soon starts to see kids playing in the fields and outside the house who disappears suddenly,she also comes across a transistor which has a voice of a women playing with kids.",
    "languages": "Marathi",
    "title": "Lapachhapi",
    "kind": "movie",
    "directors": "Vishal Furia",
    "writers": [
        "Archana Kelkar Deshmukh",
        "",
        "Vishal Furia",
        "",
        "Vishal Kapoor",
        "",
        "Vishal Kapoor"
    ],
    "producers": [
        "Aroona Bhat",
        "Deepak Joshi",
        "Jitendra Patil",
        "S. Ramachandran"
    ],
    "composers": [
        "Tony Deori Basumatary",
        "Utkarsh Umesh Dhotekar",
        "Ranjan Patnaik"
    ],
    "cinematographers": "Chandan Kowli",
    "editors": "Dinesh Poojari",
    "production managers": "Khalid Khan",
    "assistant directors": "Rohit Mandge",
    "camera department": [
        "Anirudh Nakhare",
        "Dharmendra Yadav"
    ],
    "miscellaneous": [
        "Vizual Junkies",
        "Raj Solanki"
    ],
    "akas": "लपाछपी (India, Hindi title)",
    "writer": [
        "Archana Kelkar Deshmukh",
        "Vishal Furia",
        "Vishal Kapoor"
    ],
    "director": "Vishal Furia",
    "production companies": "Midas Touch Movies",
    "plot": [
        "A new-born Indian baby... An age-old horror practice and the fact how evil are certain human practices",
        "Tushar and his pregnant wife Neha are forced to leave the city after their creditors attack Tushar.Bahurao driver of Tushar tells him to come along with his village fro a change until things settle down in the city.Tushar and Neha reach the village which has nothing around rather then sugarcane fields.Bahurao's wife Tulsabai is very caring towards Neha but feels that Tulsabai is not whom she claims as sometimes she becomes violent towards her to be.Neha soon starts to see kids playing in the fields and outside the house who disappears suddenly,she also comes across a transistor which has a voice of a women playing with kids.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Tushar and his pregnant wife Neha, a young couple is forced to leave the city and hide in a rural village of their driver Bhaurao when Tushar was attacked and beaten by debt collectors. She discovers things are not what they seem in the village and the driver's family. They are forced to live in the farmhouse of Bhaurao's brother where the story of the late brother and his late wife slowly comes to light. It is also revealed how the deaths of those two are related to the deaths of three of Bhaurao's sons as well as the first wife of Bhaurao's fourth son. Neha slowly starts to unravel the tangled web of deceit, murder, female infanticide and traditional beliefs. There are a few plot twists along the way as well.There are only four main characters including Bhaurao's wife Tulasa. The story proceeds through flashbacks and vivid daydreams experienced by Neha as they live in the farmhouse. It begins with her meeting the three kids of Bhaurao and Tulasa. She also realizes that the fourth son was already married when he went to the city for work and married there again thus revealing him engaging in Polygamy. Meanwhile Tushar leaves Neha in the care of Tulasa despite Neha's wishes to the contrary. He goes off to the city to try and settle his financial dues with the goons from the debt collector. Neha is intrigued and at the same time mesmerized by the different behavior exhibited by Tulasa towards her son's first wife. Things finally come to a head when Neha insists on leaving the place and demands to Tushar to take her away."
}