{
    "id": "6148156",
    "localized title": "Vikram Vedha",
    "cast": [
        "Madhavan",
        "Vijay Sethupathi",
        "Shraddha Srinath",
        "Kathir",
        "Varalaxmi Sarathkumar",
        "Prem Kumar",
        "Hareesh Peradi",
        "Achyuth Kumar",
        "Vivek Prasanna",
        "Rajkumar",
        "Manikandan",
        "Gowri Lakshmi",
        "Gorge Vijay",
        "Kevin Augustine",
        "E. Karthik",
        "E. Ramdoss",
        "Baby Vaishnavi",
        "R. Amarendran",
        "Satya",
        "Sugunthan",
        "J.K. Abhay",
        "Akash",
        "Ashok",
        "Babu",
        "Mozammel Hoshen Chowdhury",
        "Gopi",
        "Gaurav Kalai",
        "Kutta",
        "Vijay Muthu",
        "Siva"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "147",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:M",
        "Canada:14A::(British Columbia)",
        "Canada:14A::(Ontario)",
        "Canada:13+::(Quebec)",
        "France:Tous Public",
        "India:UA",
        "Japan:Unrated",
        "Malaysia:18",
        "New Zealand:M",
        "Norway:18::(self-applied)",
        "Singapore:NC16",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated",
        "United Arab Emirates:15+"
    ],
    "original air date": "21 Jul 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2FiMTFmMzMtZDI2ZC00NDQyLWExYTUtOWNmZWM1ZDg5YjVjXkEyXkFqcGdeQXVyODIwMDI1NjM@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "6148156",
    "plot outline": "A badass cop Vikram leads a special task force formed to eliminate a kickass Vedha's gang running amok on the streets of Chennai, making a mockery of Law and Order. An encounter planned by a Vikram's friend Simon, kills Vedha's trusted aides and brings him out of hiding. Vedha lays his clutch on Vikram and engages in a disturbing mind game of sorts which results in a quest to reveal the truth behind that fateful encounter..",
    "languages": "Tamil",
    "title": "Vikram Vedha",
    "kind": "movie",
    "directors": [
        "Gayatri",
        "Pushkar"
    ],
    "writers": [
        "Manikandan",
        "",
        "Gayatri",
        "",
        "Pushkar"
    ],
    "producers": [
        "Chakravarthy Ramachandra",
        "S. Sashikanth"
    ],
    "composers": "Sam C.S.",
    "cinematographers": "P.S. Vinod",
    "editors": "Richard Kevin",
    "production designers": [
        "Gopi Prasannaa",
        "Vinoth Rajkumar"
    ],
    "art directors": [
        "Kiran",
        "Vinoth Rajkumar",
        "Shanuka Shehan"
    ],
    "production managers": [
        "Muthuramalingam",
        "P. Rangaraj"
    ],
    "sound department": [
        "Sankaran A.S.",
        "Hari Haran",
        "Balakesavan Shanmugam",
        "Avikal Shrivastava",
        "K.C. Sidharthan",
        "Ghatam Siva",
        "Narayanan Sp",
        "Sachin Sudhakaran",
        "Balu Thankachan"
    ],
    "visual effects": "Raju Purushothaman",
    "stunts": "Dhilip Subbarayan",
    "camera department": [
        "Mukeswaran",
        "K. Senthil Prabhu",
        "R.S. Raja",
        "V. Rakku",
        "T.R. Tamilselvan",
        "Arun Kumar Y."
    ],
    "music department": [
        "Pallikonda Adrushta Deepak",
        "Atanas Babaleski",
        "F.A.M.E.'S. Project",
        "Shakthisree Gopalan",
        "Georgi Hristovski",
        "Swagatha Krishnan",
        "Pradeep Kumar",
        "Hentry Kuruvilla",
        "Bohemia Junction Limited",
        "M.L.R Karthikeyan",
        "V.M. Mahalingam",
        "Mukesh",
        "Abin Pushpakaran",
        "Anirudh Ravichander",
        "Jim Satya",
        "Shivam",
        "Kumaran Sivamani",
        "Sujith Sreedhar",
        "Balu Thankachan",
        "Sethu Thankachan",
        "Shashaa Tirupati"
    ],
    "miscellaneous": [
        "Kalyan",
        "Nikhil Murugan",
        "Gopi Prasannaa"
    ],
    "thanks": [
        "D. Kannan",
        "Nassar",
        "Anirudh Ravichander",
        "Vignesh Shivan",
        "Dinesh Subbarayan",
        "Ravi Varman"
    ],
    "akas": [
        "ヴィクラムとヴェーダ (Japan, Japanese title)",
        "Викрам Ведха (Russia)"
    ],
    "writer": [
        "Manikandan",
        "Gayatri",
        "Pushkar"
    ],
    "director": [
        "Gayatri",
        "Pushkar"
    ],
    "production companies": [
        "Think Music",
        "Y Not Studios"
    ],
    "distributors": [
        "AP International",
        "Atmus Entertainment",
        "Night Ed Films",
        "Parasakthi Films",
        "Trident Arts",
        "Goldmine Tele Films",
        "Zee Tamil"
    ],
    "special effects": "Prism & Pixels",
    "other companies": [
        "AP International",
        "Think Music"
    ],
    "plot": [
        "Vikram, a no-nonsense police officer, accompanied by Simon, his partner, is on the hunt to capture Vedha, a smuggler and a murderer. Vedha tries to change Vikram's life, which leads to a conflict.",
        "A badass cop Vikram leads a special task force formed to eliminate a kickass Vedha's gang running amok on the streets of Chennai, making a mockery of Law and Order. An encounter planned by a Vikram's friend Simon, kills Vedha's trusted aides and brings him out of hiding. Vedha lays his clutch on Vikram and engages in a disturbing mind game of sorts which results in a quest to reveal the truth behind that fateful encounter..::PipingHotViews",
        "A special police squad, lead by Vikram, is after a crime lord, Vedha, and aren't above using illegal methods themselves in their pursuit. Then out of the blue Vedha turns himself in. Things get more complicated when it turns out that Vikram's wife is Vedha's lawyer.::grantss"
    ],
    "synopsis": "Vikram is a brave and honest police inspector who is decisive about right and wrong. Vedha is a criminal who understands the grey shades between good and evil. Vikram leads an encounter unit formed to eliminate Vedha. In one encounter, the squad kills some of Vedha's henchmen, framing the death of a criminal killed by Vikram to avoid further inquiry. When Santhanam, one of the youngest members in the unit, is nervous about this, Vikram calms him by saying that he sleeps peacefully, knowing that the men he shot were criminals. As the unit plans another encounter, Vedha enters the police station and surrenders. When Vikram interrogates Vedha, he offers to tell him a story.The story relates how Vedha became a gangster and drug smuggler. Vedha warns his younger brother Vignesh, called Pulli due to his arithmetic skills, to stay away from crime, but Pulli is forced by a rival gangster, Ravi, to carry drugs. When Pulli is caught by the police, he confesses, and Ravi is arrested. On his boss Sangu's orders, Ravi assaults Pulli, leaving a permanent mark on his hand. Vedha asks Vikram if he should kill Ravi or Sangu. Vikram replies that Ravi was an instrument; Sangu was the real culprit. Vedha says the answer is correct, implying that he killed Sangu. Vedha's lawyer, who turns out to be Vikram's wife Priya, intervenes and bails him out.Vikram realises that the unarmed person he shot was Pulli, based on the mark in his hand. Worried that Vedha might try to kill his colleague and best friend Simon, Vikram rushes to save him. He finds him and Chandra, Pulli's girlfriend, shot dead. Surendhar, the superintendent of police, dismisses it as a failed encounter. Priya refuses to divulge Vedha's whereabouts to Vikram, testing their marriage. Angered by this, Vikram raids Vedha's tenements and manages to capture him. Vedha requests Vikram to listen to another story.The second story starts with Pulli, now an adult, offering to launder Vedha's income investing it in shares. Vedha's boss Cheta invests five million rupees in this venture. However, Chandra is supposedly kidnapped, and the money is missing. Chandra returns and reveals that she stole the money to start a new life but came back because she loves Pulli. Vedha returns the money to Cheta, who orders him to kill Chandra. Vedha asks Vikram if he should respect Cheta and carry out the order or disobey him and support Pulli, resulting in a gang war. Vikram replies that he should support Pulli, to which Vedha agrees. Realising that Pulli's innocence causes Vikram to stumble momentarily. Vedha attacks and subdues Vikram, telling him to investigate Simon and Pulli's deaths.Vikram begins his investigation, finally discovering that Ravi was the mastermind behind Pulli's death and informs Vedha, who brings Ravi to an abandoned factory. Vikram arrives to find Ravi beaten up by Vedha, who then tells Vikram the third and final story. Vedha had sent Pulli and Chandra to Mumbai. He noticed that only his men, not Cheta's, are being targeted and eliminated by the police. Based on Ravi's confession, Vedha says that Simon was paid by Ravi to kill his men. Vedha asks Vikram if Simon was right, since he became corrupt to pay for his critically ill son's medical procedure. Vedha kills Ravi and escapes before Vikram can answer.Surendhar and the unit arrive. He castigates Vikram for letting Vedha escape again. Vikram slowly realises that the entire unit had also been paid by Ravi. Surendhar reveals that Ravi paid them to kill Vedha and that Chandra's abduction was intended to get Pulli out of Mumbai, which would lure Vedha out of hiding. The guilt-ridden Simon had gone to save Chandra, but the unit killed both of them. As the unit prepares to kill Vikram, Vedha reappears and saves him. A gunfight ensues, and Vikram disables his colleagues, who were mere pawns, but kills Surendhar. Vikram asks Vedha if he should let him go for saving his life or kill him since he is a criminal. The film ends with a standoff between them."
}