{
    "id": "6209546",
    "localized title": "Allama",
    "cast": [
        "Dhananjaya",
        "Meghana Raj",
        "Lakshmi Gopalaswamy",
        "Sanchari Vijay",
        "Suman Jadugar",
        "Dhanajay Kumar",
        "Prasanna Shetty"
    ],
    "genres": [
        "Drama",
        "History",
        "Musical"
    ],
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "United States:Not Rated",
    "original air date": "26 Jan 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTgyOWEwOWItMTczNS00OTRkLThmMDItMmMxMmM5MTBiMjYyXkEyXkFqcGdeQXVyMzU0ODc1MTQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "6209546",
    "plot outline": "Allama, the son of a temple dancer Neelalochane , has divine gift of playing Maddale. His quest for knowledge takes him on a journey that enables him to overcome each of his sentiments - his longing for his mother, his obsession with Maddale, the guru who fails him, the temptations offered by persistent Maya and finally the realization of self. After meeting his guru Animishayya, Allama becomes Prabhu, a master of monotheistic and non-dualistic philosophy. His influences on Basavanna and others, help consolidate the Veerashaiva movement. He questions and ridicules the social evils, rituals, superstitions, idol worship, caste system and inequalities among humans. He foresees a violent upsurge in Kalyana and after advising Basavanna and others to find their final solace, starts on his final journey to Shrishaila and becomes one with the nature in the true spirit of his concept of Bayalu - the space.",
    "languages": "Kannada",
    "title": "Allama",
    "kind": "movie",
    "directors": "T.S. Nagabharana",
    "producers": "Shri Hari Khoday L",
    "art directors": "Shashidhara Adapa",
    "sound department": [
        "Pranav Madhav Abhyankar",
        "Swarup Joshi"
    ],
    "music department": "Bapu Padmanabha",
    "miscellaneous": "Madan Harini",
    "akas": "Allama (India)",
    "director": "T.S. Nagabharana",
    "production companies": "Yajaman Enterprises",
    "plot": [
        "Story of the rebellious thinker _Allama_ (qv), also known as _Allama_ (qv) Prabhu.",
        "_Allama_ (qv), the son of a temple dancer Neelalochane , has divine gift of playing Maddale. His quest for knowledge takes him on a journey that enables him to overcome each of his sentiments - his longing for his mother, his obsession with Maddale, the guru who fails him, the temptations offered by persistent Maya and finally the realization of self. After meeting his guru Animishayya, _Allama_ (qv) becomes Prabhu, a master of monotheistic and non-dualistic philosophy. His influences on Basavanna and others, help consolidate the Veerashaiva movement. He questions and ridicules the social evils, rituals, superstitions, idol worship, caste system and inequalities among humans. He foresees a violent upsurge in Kalyana and after advising Basavanna and others to find their final solace, starts on his final journey to Shrishaila and becomes one with the nature in the true spirit of his concept of Bayalu - the space."
    ]
}