{
    "id": "6296236",
    "localized title": "Running Shaadi",
    "cast": [
        "Arsh Bajwa",
        "Taapsee Pannu",
        "Richa Meena",
        "Amit Sadh",
        "Inder Pal Singh",
        "Brijendra Kala",
        "Aakash Arora",
        "Kirron Arya",
        "Saahir Banwait",
        "Arvinder Bhatti",
        "Shikha Malhotra",
        "Neeta Mohindra",
        "Prakriti Nautiyal",
        "Gyan Ranjan",
        "Abhishek Sharma",
        "Pratyush Uday"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "114",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "certificates": [
        "Belgium:KT/EA",
        "Canada:PG::(British Columbia)",
        "India:UA",
        "United Kingdom:12A"
    ],
    "original air date": "17 Feb 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGFiZDlkZjYtMDEzMy00NDYxLWI0YzItMDc3YTYyM2YyMDVhXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "6296236",
    "languages": "Hindi",
    "title": "Running Shaadi",
    "kind": "movie",
    "directors": "Amit Roy",
    "writers": [
        "Navjot Gulati",
        "",
        "Navjot Gulati",
        "",
        "Amit Roy",
        "",
        "Amit Roy"
    ],
    "producers": [
        "Shivaji Dasgupta",
        "Ashutosh Goswami",
        "Ronnie Lahiri",
        "Shoojit Sircar"
    ],
    "composers": [
        "Abhishek",
        "Akshay",
        "Sandeep Madhavan",
        "Keegan Pinto",
        "Anupam Roy",
        "Anjana Ankur Singh"
    ],
    "cinematographers": "Anas Ali Khan",
    "editors": "Nipun Gupta",
    "editorial department": [
        "Rahul Purav",
        "Shubham Singh"
    ],
    "casting directors": "Tanushree Sharma",
    "production designers": [
        "Santosh Prajapati",
        "Rajinder Sharma"
    ],
    "costume designers": "Veera Kapur Ee",
    "make up department": "Lucky Sahu",
    "assistant directors": [
        "Varun Khanna",
        "Amey Nadkarni",
        "Rahul K. Upadhyay"
    ],
    "sound department": [
        "Bigyna Dahal",
        "Subhashree Das",
        "Manoj M. Goswami",
        "Santosh Gupta",
        "Gokul K.R.",
        "P.M. Satheesh",
        "Sudesh Sidhu",
        "Aravind Vijayakumar"
    ],
    "visual effects": [
        "Lyndon Crasto",
        "Aziz Merchant",
        "Himanshu Sharma"
    ],
    "camera department": [
        "Prakashchandra",
        "Tauseef S."
    ],
    "music department": [
        "Sebastian Andrade",
        "Tanveer Ghazi",
        "Hamsika Iyer",
        "Labh Janjua",
        "Sonu Kakkar",
        "Anas Ali Khan",
        "Bappi Lahiri",
        "Raghav Mehta",
        "Jubin Nautiyal",
        "Kalpana Patowary",
        "Keegan Pinto",
        "Sukanya Purayastha",
        "Sanam Puri",
        "Anupam Roy",
        "Sonal Sehgal",
        "Shailender Singh Sodhi Shellee",
        "Manoj Yadav"
    ],
    "script department": "Tauseef Shakir",
    "miscellaneous": [
        "Sameer Chopra",
        "Dilip Dighe",
        "Abhishek Jain",
        "Fatema Nagree",
        "Amish Shah",
        "Jigar Shah",
        "Raedita Tandan"
    ],
    "thanks": "Puneet Malik",
    "akas": [
        "Runningshaadi.com (India, English title)",
        "Свадебный забег (Russia)"
    ],
    "writer": [
        "Navjot Gulati",
        "Navjot Gulati",
        "Amit Roy"
    ],
    "director": "Amit Roy",
    "production companies": "Crouching Tiger Motion pictures",
    "distributors": "Reliance Big Entertainment",
    "plot": "Two friends, Ram Bharose and tech genius Cyberjeet, create a website that helps lovers to elope. The site is an instant hit; young couples line up for the opportunity to escape strict families and run away with the ones they love.",
    "synopsis": "The story revolves around three characters - Ram Bharose, Sarabjeet, and Nimmi. Nimmi is the daughter of a bridal shop owner. Bharose works in a shop named 'Singh & Singh' and his friend Sarabjeet (aka Cyberjeet) dreams of creating another Facebook. A flashback to their school days shows Nimmi getting pregnant by an acquaintance, and she ends up asking her close friend Bharose for help. Cyberjeet helps her by creating a fake school application for a sports tournament which Nimmi uses as an excuse to go out of the town for a night. Then Bharose poses as her husband and helps Nimmi to get an abortion.Time passes by and Bharose loses his job at Singh's shop due to a disagreement with him. During this time Bharose's uncle has set Bharose's marriage with his friend's daughter, Neha.One evening Bharose and Cyberjeet are having tea at a stall where they witness a man being beaten up for eloping with his girlfriend. Upon witnessing this incident, Bharose and Cyberjeet brainstorm a website which will help needy couples to elope.They successfully help 49 couples to elope and wait to help the 50th couple as their platinum achievement. Nimmi drops by and says that the doctor who had performed her abortion had visited her father's shop. Her father finds out about the abortion and he decides to fix her marriage. She says that she needs Bharose's help in eloping with her friend Shunty who had gotten her pregnant.Bharose decides to help Nimmi and plans her elopement even after repeated warnings from Cyberjeet. After everything goes according to their plan, Nimmi informs Bharose that she planned to run away with Bharose and not Shunty. She admits to lying and blames Bharose for ignoring her repeatedly.Bharose now completely shocked asks Nimmi to return home. She says that she has already written a letter addressing her parents and they must be looking for her. They end up at Nimmi's aunt's house, but Nimmi's family finds her there and begin shooting at her. Nimmi gets hurt in this episode and Bharose brings her to a hospital. After that they travel to Dalhousie, but her family reaches this place while looking for her when Nimmi posts her location online.They plan to go to Patna where Bharose's uncle lives. Bharose meets his to-be-bride, Neha, in Patna. She reveals to him that she has a boyfriend and wishes to marry him but her father is against their marriage. Bharose and team find an opportunity. They convince Neha and her boyfriend to comply with their plan to get hitched.Finally Neha's marriage day arrives. However, Neha's boyfriend and Cyberjeet end up at a police station. Nimmi tries to help Neha run away, but Neha's family finds her and brings her back to the mandap. Bharose goes to the bathroom and finds a man whom he had helped to elope. This man helps him with Neha's elopement.In the end, Bharose gets tired of running along with Nimmi and he decides to confront her family and get married with their consent."
}