{
    "id": "6406830",
    "localized title": "Bandookya",
    "cast": [
        "Amol Bagul",
        "Nilesh Borse",
        "Namdeo Murkute",
        "Atisha Naik",
        "Shashank Shende"
    ],
    "genres": [
        "Drama",
        "Family"
    ],
    "runtimes": "121",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "India:A",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZmUxMjY5Y2YtOTM0OC00ZmY3LTgwMTYtNzNjMjBhMDYxODk5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "6406830",
    "plot outline": "Bandookya is a film based on reality. Our life is bounded by many social norms arising from the society in which we live our life according to those norms. Similarly many lives bounded by societal norms are tortured which are not even noticed. While going through all this, our eyes are focused on such a social subject. This subject enfolds the reality, the severity of all those Tribes existing beyond our literary community. The question is when we are not even aware about their presence, then how can we understand their struggle for living. Bandookya is a film focusing on this social question. At the time of marriage, a specific amount of dowry is decided for the bridegroom, which he has to give to the bride's parents. If he is not capable to give the amount, a fixed time period is given to him and if he fails to give the amount in that specific period then the bride's father can mortgage her for the amount and the community court decides on this matter. Thus, it is a film, portraying the grave reality and also the sufferers of the decision of the community court i.e. Avlya and Tolak along with Avlya's mother. Bandookya is a portrait of those backward genuine people firm with their thoughts. The effective scenes, the language, the subtle acting, entertainment and yet having a power to provoke social change is 'Bandookya'.",
    "languages": "Marathi",
    "title": "Bandookya",
    "kind": "movie",
    "directors": "Rahul Manohar Chaudhari",
    "producers": "Nilesh Borse",
    "cinematographers": "Krishna Soren",
    "editors": "Nitesh Rathod",
    "editorial department": "Natasha Tendulkar",
    "assistant directors": "Amit Koli",
    "camera department": "Durjey Soni",
    "miscellaneous": [
        "Mahesh Killekar",
        "Gurunath Patil"
    ],
    "director": "Rahul Manohar Chaudhari",
    "production companies": "Varsha Cine vision",
    "distributors": "Sunshine Studios",
    "plot": "_Bandookya_ (qv) is a film based on reality. Our life is bounded by many social norms arising from the society in which we live our life according to those norms. Similarly many lives bounded by societal norms are tortured which are not even noticed. While going through all this, our eyes are focused on such a social subject. This subject enfolds the reality, the severity of all those Tribes existing beyond our literary community. The question is when we are not even aware about their presence, then how can we understand their struggle for living. _Bandookya_ (qv) is a film focusing on this social question. At the time of marriage, a specific amount of dowry is decided for the bridegroom, which he has to give to the bride's parents. If he is not capable to give the amount, a fixed time period is given to him and if he fails to give the amount in that specific period then the bride's father can mortgage her for the amount and the community court decides on this matter. Thus, it is a film, portraying the grave reality and also the sufferers of the decision of the community court i.e. Avlya and Tolak along with Avlya's mother. _Bandookya_ (qv) is a portrait of those backward genuine people firm with their thoughts. The effective scenes, the language, the subtle acting, entertainment and yet having a power to provoke social change is '_Bandookya_ (qv)'."
}