{
    "id": "6721424",
    "localized title": "Mugulu Nage",
    "cast": [
        "Ganesh",
        "Achyuth Kumar",
        "Ashika Ranganath",
        "Nikitha Narayan",
        "Amulya",
        "Apoorva Arora",
        "Anant Nag",
        "Dharmanna Kadur",
        "Niharika",
        "Meghashri",
        "Chandan Achar",
        "Prasad Vasista",
        "Sagar",
        "Manjunath Hegde",
        "Pippa Hughes",
        "Shivananda Kota",
        "Prabhakar Kunder",
        "Srinivasa Prabhu",
        "Rangayana Raghu"
    ],
    "genres": "Romance",
    "runtimes": "157",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:U",
        "Singapore:PG"
    ],
    "original air date": "01 Sep 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWNlYTdjMDQtYjFhZS00YWZlLWFlZTUtZTA0ZmViMDg0MTZhXkEyXkFqcGdeQXVyNTQ2ODA0NDQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "6721424",
    "plot outline": "Pulkesh is a normal man who is smiling character. He stays in Mysuru with his father who is a history teacher, his mother who is a housewife and an art lover and his sister who goes to college. The very odd and interesting thing about Pulkesh is that he has never cried since he was born. With a lot of events and turns, the story runs with a lot of interesting aspects such as how life takes your decisions at times when things go out of hand, emotions and love keeps you grounded, laughter, emotions of youngsters, mobile, technology, art, music, fight, the wants and need of girls, expectations of parents, social problems and morals. Mugulu Nage becomes complete with love being the core of all these emotions.",
    "languages": "Kannada",
    "title": "Mugulu Nage",
    "kind": "movie",
    "directors": "Yograj Bhat",
    "writers": "Yograj Bhat",
    "producers": [
        "Sanat Kumar",
        "Syed Salam"
    ],
    "composers": "V. Harikrishna",
    "cinematographers": "Sugnan",
    "editors": "Suresh Armugam",
    "art directors": "Ravi Santhehaklu",
    "costume designers": [
        "Arundathi Anjanappa",
        "Shantaram"
    ],
    "assistant directors": [
        "Praveen Kumar G",
        "Praveen Kumar",
        "Amol Patil",
        "Mohan Singh"
    ],
    "visual effects": [
        "Dwaraganathbabu",
        "Talla om sai Prakash Reddy"
    ],
    "stunts": "Vikram",
    "camera department": [
        "Raju Bidarakote",
        "Lokesh Gowda"
    ],
    "music department": "Paul Praveen Kumar",
    "writer": "Yograj Bhat",
    "director": "Yograj Bhat",
    "production companies": "S S Films",
    "distributors": "Mysore Talkies",
    "plot": [
        "Pulakeshi chooses to smile through his pain and refuses to emote for tough situations, until three different women enter into his life at different phases to teach him the true meaning of love and life.",
        "Pulkesh is a normal man who is smiling character. He stays in Mysuru with his father who is a history teacher, his mother who is a housewife and an art lover and his sister who goes to college. The very odd and interesting thing about Pulkesh is that he has never cried since he was born. With a lot of events and turns, the story runs with a lot of interesting aspects such as how life takes your decisions at times when things go out of hand, emotions and love keeps you grounded, laughter, emotions of youngsters, mobile, technology, art, music, fight, the wants and need of girls, expectations of parents, social problems and morals. _Mugulu Nage_ (qv) becomes complete with love being the core of all these emotions.",
        "Pulkesh is a very usual guy with an always smiling character. He stays in Mysuru with his father who is a history teacher, his mother who is an housewife also an art lover and his sister who goes to college. The very odd and interesting thing about Pulkesh is that he has never cried from the time he was born."
    ]
}