{
    "id": "7128254",
    "localized title": "Goutham Nanda",
    "cast": [
        "Gopichand",
        "Catherine Tresa",
        "Mukesh Rishi",
        "Chandramohan",
        "Sachin Khedekar",
        "Nikitin Dheer",
        "Ajay",
        "Tanikella Bharani",
        "Pippa Hughes",
        "Vennela Kishore",
        "Hansika Motwani",
        "Vidyullekha Raman",
        "Niko Rusakov",
        "Seetha"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "28 Jul 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2U1ZGQ2MGUtYzhhNC00NTg4LWEyODEtODY4YzNiNGUwMzNiXkEyXkFqcGdeQXVyMzYxOTQ3MDg@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "7128254",
    "languages": "Telugu",
    "title": "Goutham Nanda",
    "kind": "movie",
    "directors": "Sampath Nandi",
    "writers": "Sampath Nandi",
    "producers": [
        "Sahni Bob",
        "Ravi Davande",
        "Bhagawan J.",
        "J. Pulla Rao"
    ],
    "composers": "S. Thaman",
    "cinematographers": "Soundar Rajan",
    "art directors": "Brahma Kadali",
    "costume designers": "Mawle Ashwin",
    "make up department": "Shrikant P. Desai",
    "assistant directors": [
        "K.S.K. Chaitanya",
        "Kailash Choudhary"
    ],
    "visual effects": [
        "Kailash Choudhary",
        "Vishwa Prakash Dhanalakota",
        "Raghu Puduri",
        "Madhu Kiran Tumpala"
    ],
    "stunts": "Sooryeah Yaalla",
    "camera department": [
        "Tom Lebaric",
        "SujathaSiddharth"
    ],
    "casting department": "Amit Arora",
    "music department": [
        "Nakash Aziz",
        "Ramya Behra",
        "Neeraja Kona",
        "Sri Krishna",
        "Divya Kumar",
        "Ramajogayya Sastry",
        "Sony",
        "M.L. Sruthi",
        "S. Thaman"
    ],
    "miscellaneous": "Vijaynag Yarlagadda",
    "akas": "Gowtham Nanda (India, Telugu title)",
    "writer": "Sampath Nandi",
    "director": "Sampath Nandi",
    "production companies": "Sri Balaji Cine Media",
    "plot": "The son of a billionaire decides to take an extreme step by leaving behind his riches and swapping his life with a depressed techie look-alike who wants to be a billionaire.",
    "synopsis": "Gautham Ghattamaneni (Gopichand) is the only son of Ghattamaneni Vishnu Prasad (Sachin Khedekar), the 5th richest billionaire in the world. He does not have any emotions and leads a luxurious life in Bangalore, Karnataka. Mugdha (Catherine Tresa) daughter of Vishnu Prasad's business partner Mudra (Mukesh Rishi), she is deeply in love with Gautham.In a party, a waiter (Tanikella Bharani) spills the drink on his shirt, which angers Gautham and slaps the waiter and insults him calling him a low life to which the waiter replies that he is a spoiled brat and asks if he really knows himself. That question intrigues Gautham leading him to realize that he does not have any individual identity without his father. In an attempt to end his life he crashes his car into another person, who turns out to be Nanda Kishore (portrayed by Gopichand again).Both of them reveal their stories to each other. Nanda is from lower middle-class family living in a slum in Hyderabad with his parents (Chandra Mohan & Seetha) and sister along with his love interest Spoorthi (Hansika Motwani). Nanda's aspirations to develop an app fail, due to which his father sends him off to Bangalore to get a job. But he chooses to end his life (where he meets Gautham Ghattamaneni) which would enable his family to claim insurance. Now Gautham is also fed-up with opulent lifestyle and wants to feel the emotions of living in poverty. So, both of them decide to exchange their lives for a month which would expose them to experience the lifestyle they have been craving for, after which Gautham Ghattamaneni would be introduced to the world as the sole heir of his father's wealth. They spend a night in a hotel learning about each other and fitting into each other's shoes to begin their new lives.Goutham starts off rough, with some words from Nanda's father for not taking up a job and returning home but living with Nanda's family, he experiences all the emotions he has been longing for and helps them by being a better son than Nanda could ever be. Whereas, Nanda has the perfect beginning, with the exception of few questions from his staff.Meanwhile, Mudra and Gautham's Chief of Security Gowda (Nikitin Dheer) plan to kill Gautham. After a failed attempt to kill Nanda (who they think is Gowtham), they realize that Goutham had switched places with Nanda and plan to finish him off him in Hyderabad. After several failed attempts at killing Goutham, Gautham realizes that Nanda is trying to kill him even though his family (Nanda's family) is collateral damage. When confronted about the same Nanda confesses that he had joined hands with Mudra and Gowda when he found out that the duo was trying to kill him.Confused, Goutham tries to understand how money could make a person turn against his family. Nanda frames Gautham by publicly murdering their slum's corporater's son but Gautham escapes the cops and confronts Nanda in the presence of his family (Gautham's family) who manipulated by Nanda (whom they think is Gautham) fail to recognize that Nanda is in Gautham's place and hand Gautham over to the cops. Gautham escapes the cops with Mugdha's who knows that he Gautham help when they try to encounter him. A fight breaks out between Gautham, Nanda, Gowda, and Mudra which leads to the death of Mudra and Gowda followed by another fight in which Nanda ends up dead.At the end of the movie, Gautham is introduced as the legal heir to his father's wealth and surprisingly he donates the entire wealth to a charity and when asked for an autograph he signs Gautham Nanda."
}