{
    "id": "7308686",
    "localized title": "Anaan",
    "cast": [
        "Prarthana Behere",
        "Suyog Gorhe",
        "Veena Jagtap",
        "Yatin Karyekar",
        "Sukhada Khandkekar",
        "Prajakta Mali",
        "Uday Nene",
        "Omkar Shinde",
        "Rajendra Shisatkar",
        "Shilpa Tulaskar"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNWJjMjRiODUtOTg1ZC00MjFjLWEwN2UtM2E4NjM5MTZhYmFiXkEyXkFqcGdeQXVyNzk4OTY2MzY@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "7308686",
    "languages": "Marathi",
    "title": "Anaan",
    "kind": "movie",
    "directors": "Rajesh Kushte",
    "writers": [
        "Hemant Bhatia",
        "",
        "Mukesh Jadhav",
        "",
        "Rajesh Kushte"
    ],
    "producers": [
        "Hemant Bhatia",
        "Raunaq Bhatia",
        "Kailash Chumbhale",
        "Radheya Malpani",
        "Shivkumar Sharma"
    ],
    "composers": [
        "Durgesh Khot",
        "Saurabh Shetye"
    ],
    "editors": "Sejal Painter",
    "sound department": "Dj Swap India",
    "camera department": "Imran Firoz Khan",
    "miscellaneous": [
        "Sahil Kajale",
        "Kartikee Yadav"
    ],
    "akas": "Anaan (India)",
    "writer": [
        "Hemant Bhatia",
        "Mukesh Jadhav",
        "Rajesh Kushte"
    ],
    "director": "Rajesh Kushte",
    "production companies": "Rohan Theatres",
    "plot": "Neel, believed to be a sin child, is brought up by Vasudha. Although while growing up she develops physical and emotional queerness, Unaware of her real identity, Neel is helped by a group of students to discover her real self.",
    "synopsis": "India has always been a haven for mystical and ethnic nuances and lifestyles, India has encouraged all kinds of mysterious & mystical ideologies. ANAAN explores this mystery of the unimaginable, unbelievable and unthinkable life which is mystifying, rare and could be shocking.\nVasudha a traditional singer on her way back from a show shockingly meets an isolated infant crying and left out in a desolated temple. As she is attending the infant, few tribal's attack her with the intention to kill the infant. Some how Vasudha and her associate Narayan are able to save the child in the car they were travelling and escape from those demonic humans...Who kept shouting the child is a Sin.\nAs they are travelling Vasudha gets to have a close look at the child and she is shocked to see that the child is physically different from a normal child.Vasudha realises that this child needs special care and she decides to keep the child and treat it as a blessing of god in her lonely life.\nShe names the child Neel, as the child grows the physical difference in the child develops into emotional and psychological queerness.Neel develops into a fully developed gorgeous young girl and a charming dancer, but she feels strange about her identity her affinities and relations as she grows.\nVasudha accepts it and tells her that time and god will reveal her life page by page, but Narayan is skeptical and a bit negative of the queerness of Neel, her dancing talents attract a group of youngsters YUVRAJ, KIRS, JAY & VICKY. Kris has come from Germany to do research on Indian art form and she wants to also do a show as her presentation.\nWhile doing their research they realise that lord Shiva is the originator of all the art forms so they decide to perform a ballet on Lord Shiva. But which aspect of Shiva as he is unfathomable here in the tribal region.\nThe tribal leader Daaji gets information that the sin child which escaped from his attack 21 years ago is living in Bharada, he sets out to finish the sin child forever, here Yuvraj & Kris also reach the same show where Neel is performing, Daaji makes an attempt to kill Neel who is the sin child. But presence of Yuvraj and his friends doesn't allow him to succeed.\nNarayan is able to safely escape with Neel from that scene. But Yuvraj feels that their research has come to final stage and Neel is the performer who could\ntake Lord Shiva's Concept to a higher level.\nBut how to find Neel From her all the characters cross each other paths and lives and Neels true and real self gets revealed gradually and she too realises who she is in true essence. Daaji vows that he will kill Neel anyhow.\nAnd the film moves with Music, Dance, Romance, Infatuation, lethal attraction and gruesome killings.Neel, Yuvraj, Kris, Vasudha, Narayan, Jai, Vicky are all thrust into this musical mystical soul searching drama..........called ANAAN."
}