{
    "id": "7469726",
    "localized title": "Shaadi Mein Zaroor Aana",
    "cast": [
        "Rajkummar Rao",
        "Kriti Kharbanda",
        "K.K. Raina",
        "Alka Amin",
        "Vipin Sharma",
        "Govind Namdeo",
        "Navni Parihar",
        "Nayani Dixit",
        "Manoj Pahwa",
        "Neha d Bhriguvanshi",
        "Karanvir Sharma",
        "Abhijeet Singh",
        "Ashish Kapoor",
        "Mahesh Chandra Deva",
        "Ajitesh Gupta",
        "Shailendra Kumar",
        "Rohit Raj Singh",
        "Vivek Yadav"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "137",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:PG",
        "Germany:6",
        "India:UA",
        "Singapore:PG",
        "United Arab Emirates:PG-15"
    ],
    "original air date": "10 Nov 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODFkMDRjMWQtNDllMC00NjMwLWFlYzQtMWY5YWFkM2Y1NzhlXkEyXkFqcGdeQXVyNzkxOTEyMjI@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "7469726",
    "plot outline": "Satyendra aka Sattu (Rajkummar Rao) and Aarti (Kriti Kharbanda) meet for a proposed arranged marriage and fall in love in the process. On the night of their marriage, an unexpected turn of events turns their world upside down. Set in the backdrop of India's civil services, Shaadi Mein Zaroor Aana explores the challenges that Satyendra and Aarti face as a middle-class couple in India.",
    "languages": "Hindi",
    "title": "Shaadi Mein Zaroor Aana",
    "kind": "movie",
    "directors": "Ratnaa Sinha",
    "writers": "Kamal Pandey",
    "producers": [
        "Manju Bachchan",
        "Vinod Bachchan",
        "Gaurav Gupta",
        "Kaleem Khan",
        "Deepak Mukut",
        "Yogiraj Shetty"
    ],
    "composers": "Anand Raj Anand",
    "cinematographers": "Suresh Beesaveni",
    "editors": "Ballu Saluja",
    "editorial department": [
        "Deep Majithia",
        "Rajiv Manahalli",
        "Venugopal Rao",
        "Dillip Kumar Routray",
        "Gagan Sachdeva",
        "Saim Shaikh"
    ],
    "casting directors": "Rahat Ali Khan",
    "art directors": [
        "Arup Adhikary",
        "Durga Mantoo Gupta",
        "Pradeep Singh"
    ],
    "costume designers": [
        "Neharika Juneja",
        "Sagarikaa Pillai"
    ],
    "production managers": [
        "Abhishek Gupta",
        "Anoop Jaiswal",
        "Sonu Kuntal",
        "Sengupta Lipi"
    ],
    "assistant directors": [
        "Siddheshwar Ekambe",
        "Ajeet Kumar",
        "Vikas Singh",
        "Vivek Yadav"
    ],
    "art department": "Gaurav Jaiswal",
    "sound department": [
        "Nageshwar Rao Choudhary",
        "Kunal Dhabade",
        "Vitthal Gore",
        "Santosh Gupta",
        "Utsav Mistry",
        "Sujit Shingare",
        "Manav Shrotriya"
    ],
    "visual effects": "Varinder Salaria",
    "camera department": [
        "Srinivas Beesaveni",
        "Divy Jain",
        "Wasim Khan",
        "Amit Singh",
        "Neeraj A. Singh"
    ],
    "casting department": "Vivek Yadav",
    "music department": [
        "Shafqat Amanat Ali",
        "Anand Raj Anand",
        "Shakeel Azmi",
        "Krishna Bansal",
        "Krishna Barua",
        "Gaurav Behl",
        "Shivangi Bhayana",
        "Yasser Desai",
        "Aditya Dev",
        "Fazilpuria",
        "Kaushik Guddu",
        "Asees Kaur",
        "Rashid Khan",
        "Kumaar",
        "Arko Pravo Mukherjee",
        "Zain-Saim Raees",
        "Mayur Sahani",
        "Rajkumar Sengupta",
        "Aakanksha Sharma",
        "Himanshu Shirlekar",
        "Arijit Singh",
        "Jyotica Tangri",
        "Asit Tripathy",
        "Kunaal Vermaa",
        "Mr. Xherlie"
    ],
    "script department": "Kamal Chandra",
    "miscellaneous": [
        "Kiran Arya",
        "Sadhu Baijnath",
        "Freyan Bhujwala",
        "Himanshu Joshi",
        "Priyanka Pal"
    ],
    "akas": [
        "Shaadi Mein Jarur Aana (Canada, English title)",
        "Die Braut, die sich noch nicht traut (Germany)",
        "Shaadi Main Zaroor Aana (Australia)",
        "Приходите на свадьбу (Russia)",
        "Te invit la nunta ... ta (Romania)"
    ],
    "writer": "Kamal Pandey",
    "director": "Ratnaa Sinha",
    "production companies": "Soundrya Productions",
    "distributors": [
        "Soham Rockstar Entertainment",
        "Aagaaz Entertainment",
        "Alive Vertrieb und Marketing",
        "Zee5"
    ],
    "plot": [
        "Satyendra Mishra \"Rajkumar Rao\" and Aarti Shukla \"Kriti Kharbanda\" agree to get married arranged by their parents, after Satyendra Mishra get government job. Aarti Shukla, run away from their marriage. What life waits for them ahead?",
        "Satyendra aka Sattu (Rajkummar Rao) and Aarti (Kriti Kharbanda) meet for a proposed arranged marriage and fall in love in the process. On the night of their marriage, an unexpected turn of events turns their world upside down. Set in the backdrop of India's civil services, _Shaadi Mein Zaroor Aana_ (qv) explores the challenges that Satyendra and Aarti face as a middle-class couple in India.::Kamal Pandey"
    ],
    "synopsis": "Satyendra Mishra aka Sattu (Rajkummar Rao) a clerk in income tax department and Aarti Shukla (Kriti Kharbanda), an ambitious college topper, meet for a proposed arranged marriage and fall in love in the process. On the night of their marriage, Aarti got to know that she has passed her civil service exam, and she can become an officer, but as per her sister's conversation with Sattu's family she came to know, she will not be allowed to work after her marriage, so in the dilemma of pursuing her dream or to marry her love and sacrifice it, she decided to choose to run away from the marriage and become an officer. Sattu was left shocked and with his family, mother father uncle and sister completely broken down due to the incident.After the interval, story takes an angle of revenge. Aarti a sub-registrar, after 4 years of service, gets temporary suspended due to accusation of taking bribe of 3 crore, for selling un used government property for public construction, Senior IAS officer, Satyendra Mishra, takes the case for investigation in his hands, and starts the enquiry. Satyendra starts the enquiry, questioning all parties involved in the case. Aarti feels mentally tortured, since she feels Satyendra is taking revenge on her and tries to explain the marriage night incidence was not a selfish act but an act out of hurry, and she regrets about it with the hope that Satyendra will drop the case, but Satyendra keeps his investigation going and gets her arrested. Next day, he presents the case to the jury, with a video as an evidence. Which shows that Aarti's friend and personal assistant Nirmala, actually cheated her and got all the government property paper signed by aarti, without her awareness. So Aarti is found not guilty and gets acquitted. And later is revealed that, Satyendra put Aarti in custody, to protect her, not as a revenge.Aarti, realizes she hurt Satyendra and still he protects her, and feels he still loves him. But due to his ego is not able to accept that. She starts persuading Satyendra (sattu) to marry her, but he had decided not to get marry again, after the mishap. Aarti feels really upset, then with her family and Sattu's family, schemes a plan of fake marriage of her with Sharad (Aarti's Brother-in-law), to make Satyendra, jealous and that would make him accept his love for Aarti and marry her.\nPlan succeeds and in the climax, Satyendra accepts his love for Aarti, and gets married."
}