{
    "id": "8010920",
    "localized title": "Vitthala Shappath",
    "cast": [
        "Rajesh Bhosale",
        "Mangesh Desai",
        "Krutika Gaikwad",
        "Vidyadhar Joshi",
        "Sanjay Khapre",
        "Supreet Nikam",
        "Ketan Pawar",
        "Anuradha Rajadhyaksha",
        "Pranav Raorane",
        "Uday Sabnis",
        "Vijay Sairaj",
        "Anshuman Vichare"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "132",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "15 Sep 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzA3Y2FlYmMtZDljNy00YjFjLWI2ZWYtNGNjZWJmYmE4MzIzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8010920",
    "plot outline": "Vitthala Shappath is a 2017 film about the love story of a young boy named 'Krishna' who is from a middle class family living in a rural area. Vitthala Shappath is a promise and commitment. The film is releasing on 15 September 2017. Krishna is a son of his parents but he forgets the main object of life. He enjoys his own way by disobeying the guidelines of his parents who are devotee of Lord Vitthala. Krishna goes on wrong path and result of which he faces a drastic problem and after realizing his mistakes, he overcomes from his bad nature. He started to full fill motive of his father and Naina help him in his work. During the period Krishna and Naina fall in love of each other. At one instance situation came before him is that he has to choose any one out of two things, one is motive of his father and second is Naina's love. What he will choose? Vijay is the hero ?",
    "languages": "Marathi",
    "title": "Vitthala Shappath",
    "kind": "movie",
    "directors": "Pawar Chandrakant",
    "writers": "Pawar Chandrakant",
    "producers": "Sukesh S. Sawardekar",
    "composers": "Chinar-Mahesh",
    "cinematographers": "Sandy",
    "editors": [
        "Ashish Mhatre",
        "Apurva Motiwale"
    ],
    "editorial department": "Vishwajeet Dodekar",
    "costume designers": "Manisha Gadekar",
    "assistant directors": [
        "Prasad Gawali",
        "Dattsangram Wasamkar"
    ],
    "art department": "Sachin Patil",
    "sound department": "Akhilesh Kumar Gupta",
    "visual effects": "Pooja Mishra",
    "music department": [
        "Mangesh Kangane",
        "Adarsh Shinde"
    ],
    "miscellaneous": [
        "Ganesh Gargote",
        "Umesh Jadhav",
        "Radhey Lalsa"
    ],
    "writer": "Pawar Chandrakant",
    "director": "Pawar Chandrakant",
    "production companies": [
        "Gurudarshan Films",
        "Pahal Productions"
    ],
    "distributors": "Rajat Enterprises",
    "other companies": "Media One",
    "plot": [
        "_Vitthala Shappath_ (qv) is a 2017 film about the love story of a young boy named 'Krishna' who is from a middle class family living in a rural area. _Vitthala Shappath_ (qv) is a promise and commitment. The film is releasing on 15 September 2017. Krishna is a son of his parents but he forgets the main object of life. He enjoys his own way by disobeying the guidelines of his parents who are devotee of Lord Vitthala. Krishna goes on wrong path and result of which he faces a drastic problem and after realizing his mistakes, he overcomes from his bad nature. He started to full fill motive of his father and Naina help him in his work. During the period Krishna and Naina fall in love of each other. At one instance situation came before him is that he has to choose any one out of two things, one is motive of his father and second is Naina's love. What he will choose? Vijay is the hero ?::Shrinivas G. Kulkarni",
        "Krishna, the only son of his parents, disobeys his parents' orders and likes to live life on his terms. Soon, he realizes his wrong doing and tries to help his father accomplish his motive. In his pursuit, he helps Naina and the two fall in love with each other. Things go well for Krishna, until in a twist of fate, he finds himself torn between choosing his love for Naina and fulfilling his father's motive."
    ]
}