{
    "id": "8909120",
    "localized title": "Gulf",
    "cast": [
        "Dimple Hayathi",
        "Chetan Maddineni",
        "Nagineedu",
        "Krishna Murali Posani",
        "Shivakarthik"
    ],
    "genres": "Drama",
    "runtimes": "132",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "13 Oct 2017 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTJmMGZmMTMtN2Q4Ny00ODhjLTkzYmUtNDM3MDIxODY2OWZmXkEyXkFqcGdeQXVyNDMzNDEzNzA@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "8909120",
    "plot outline": "While many harrowing tales have come forth through news reports of how Indians choosing to work in Gulf countries face inhumane treatment, 'Gulf' charts the journey of Shiva (Chetan) and Lakshmi (Dimple) who go to Dubai in search of greener pastures.",
    "languages": "Telugu",
    "title": "Gulf",
    "kind": "movie",
    "directors": "Suneel Kumar Reddy",
    "writers": "Pulagam Chinnarayana",
    "producers": "Ravindra Babu Yakkali",
    "composers": "Pravin Immadi",
    "editors": "Kalyan Sami",
    "miscellaneous": "Pulagam Chinnarayana",
    "akas": "Gulf (India)",
    "writer": "Pulagam Chinnarayana",
    "director": "Suneel Kumar Reddy",
    "production companies": "Sravya Films",
    "distributors": "Sravya Films",
    "plot": [
        "Siva relocates from an Indian village to Dubai aspiring to become rich and meets Lakshmi, who also has big dreams. However, they soon become victims to injustice and decide to flee from the _Gulf_ (qv).",
        "While many harrowing tales have come forth through news reports of how Indians choosing to work in _Gulf_ (qv) countries face inhumane treatment, '_Gulf_ (qv)' charts the journey of Shiva (Chetan) and Lakshmi (Dimple) who go to Dubai in search of greener pastures."
    ],
    "synopsis": "\"Gulf \"is a collage of experiences of migrants to GCC nations from Indian sub continent especially from south of India. There are many success stories and also some failure stories in this region. This film intended to discuss various case studies in an entertaining fashion.\nThis is a story of a youngster who is frustrated with his financial growth in his traditional occupation of weaving clothes. Lack of proper job prospects in his hometown and the peer pressure to make riches he chooses to migrate to gulf region. He falls in trap of a middle man who promises too much and swindles money from him for the visa. En route he meets one innocent and bubbly girl who is also travelling to gulf with a goal to take care of the health of her mother who is a cancer patient. She turns out to be a housemaid in the house of youngster's boss. Their friendship turns into love. What happens to their love and their goals is the crux of the story.\nWe are also profiling some success stories of entrepreneurs like Kishore Babu Duvvuri, Sriram of Btech CAD and Tulasi Prasad who started their business in Gulf and became successful and Ms. Anuradha who became an influential social worker and a lawyer. Their stories will be inspirational to the other migrants and future migrants also.\nThe contribution of Gulf migrants to Indian sub continent is enormous. Many laborers sent their hard earned money back to the country to educate their children and bring prosperity to their family members. Billions of rupees that were remitted by them helped in the growth of their villages and also the nation. But unfortunately their efforts were not acknowledged properly by their fellow countrymen.\nThis film is an effort to bring attention towards their contribution, their sacrifices and respect they deserve, to the larger audience. This film also explains how lack of understanding the law of the land will bring troubles to the migrants.\nThe film is in the final stages of shooting. This film is being made in Telugu, Tamil and Malayalam languages. This has been shot in Hyderabad, Chennai, Thiruvananthapuram and Gulf countries.\nThis film is produced under the banner of Sravya Films. Produced by Yakkali Ravindra Babu and Maddineni Ramani . Camera : SV Sivaram. Music : Praveen Immadi. Editing : Kalyan. Dialouges : Pulagam Chinnaryana. Screenplay and Direction: P. Suneel Kumar Reddy\nArtists : Chetan Maddineni, Santhosh Pawan, Anil Kalyan, Dimple, Tirrtha, Digvijay, surya, Nagineedu, Posani Krishna murali, Thanikella Bharani, Sankarabharanam Rajyalakshmi, Venu, Bittiri Satti, Badram, Nalla Venu , Thotapalli Madhu etc.,"
}