{
    "id": "0368479",
    "localized title": "Cold Case",
    "cast": [
        "Kathryn Morris",
        "John Finn",
        "Jeremy Ratchford",
        "Thom Barry",
        "Danny Pino",
        "Tracie Thoms",
        "Nicki Aycox",
        "Susan Chuang",
        "Jonathan LaPaglia",
        "Josh Hopkins",
        "Tania Raymonde",
        "Raymond J. Barry",
        "Daniel Baldwin",
        "Bobby Cannavale",
        "Kevin McCorkle",
        "Terri Hoyos",
        "Doug Spinuzza",
        "Bonnie Root",
        "Ismael 'East' Carlo",
        "Keith Szarabajka",
        "Meredith Baxter",
        "Sonja Sohn",
        "Kenny Johnson",
        "Marisol Nichols",
        "Sarah Joy Brown",
        "James Hanlon",
        "Brennan Elliott",
        "Mark Rolston",
        "Robin Weigert",
        "Justin Chambers",
        "Bahni Turpin",
        "Nestor Carbonell",
        "Johnny Messner",
        "Oren Williams",
        "Joe Penny",
        "Dondré T. Whitfield",
        "Anthony John Crane",
        "Brant Cotton",
        "Susanna Thompson",
        "Alex Valente",
        "Michael Ironside",
        "J.R. Cacia",
        "Hawk Younkins",
        "Silas Weir Mitchell",
        "John Billingsley",
        "Sarah Aldrich",
        "Kevin Chapman",
        "John Diehl",
        "Jesse Plemons",
        "JB Blanc"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "44",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "1.33 : 1 (letterbox)",
    "sound mix": "Dolby Digital::(Dolby 5.1)",
    "certificates": [
        "Argentina:13",
        "Australia:M",
        "Australia:PG::(some episodes)",
        "Brazil:14",
        "Brazil:12::(some episodes)",
        "Chile:14",
        "France:10",
        "Germany:Not Rated",
        "Hungary:16::(some episodes)",
        "Italy:T",
        "Japan:R::(self-applied)",
        "Netherlands:12",
        "Norway:15::(TV rating)",
        "South Korea:15",
        "Spain:13",
        "United Kingdom:15",
        "United States:TV-14",
        "United States:TV-PG::(some episodes)"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjdjNWNkZDYtYjRjOS00ZWNhLWJhZDItNjI0NTIxY2E0ZWQ2XkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0368479",
    "plot outline": "Lilly Rush is a Philadelphia police detective working for the department's homicide squad and being assigned \"cold cases\": crimes that were committed many years before and have not been solved. Lilly must try to re-think the crime scenes and interview other people involved with the victims to find a link to solving the cases.",
    "languages": "English",
    "title": "Cold Case",
    "kind": "tv series",
    "series years": "2003-2010",
    "akas": [
        "Cold Case : Affaires classées (France)",
        "Cold Case - Kein Opfer ist je vergessen (Germany)",
        "Caso abierto (Spain)",
        "Odlozený prípad (Slovakia)",
        "Злочини из прошлости (Serbia)"
    ],
    "seasons": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7"
    ],
    "writer": [
        "Meredith Stiehm",
        "Meredith Stiehm",
        "Meredith Stiehm"
    ],
    "production companies": [
        "Jerry Bruckheimer Television",
        "Warner Bros. Television",
        "CBS Productions",
        "CBS Paramount Network Television",
        "CBS Television Studios"
    ],
    "distributors": [
        "CBS",
        "Canadian Television (CTV)",
        "2BE",
        "AXN",
        "CNBC-e",
        "KANAALTWEE",
        "Kabel Eins",
        "Kanal 2",
        "Net5",
        "Nine Network Australia",
        "Prizma",
        "RTL Klub Televízió",
        "RTL Televizija",
        "Saeta TV Canal 10",
        "Sky",
        "WOWOW"
    ],
    "special effects": [
        "Spectrum Effects",
        "Stargate Studios"
    ],
    "other companies": [
        "A+E Networks",
        "Aero Mock-Ups",
        "All Balloons All The Time",
        "Central Casting",
        "Chapman/Leonard Studio Equipment",
        "Chapman/Leonard Studio Equipment",
        "Chapman/Leonard Studio Equipment",
        "Chapman/Leonard Studio Equipment",
        "Chapman/Leonard Studio Equipment",
        "Direct Tools & Fasteners",
        "Filmtools",
        "Haddad's",
        "LCW Props",
        "Lakeshore Records",
        "Media Ventures",
        "Monster Picture Crane",
        "Panavision Remote Systems",
        "ShowBiz Enterprises",
        "Star Waggons",
        "The PostWorks Lab"
    ],
    "plot": [
        "The Philadelphia homicide squad's lone female detective finds her calling when she's assigned \"cold cases\", older crimes that have never been solved.",
        "Lilly Rush is a Philadelphia police detective working for the department's homicide squad and being assigned \"cold cases\": crimes that were committed many years before and have not been solved. Lilly must try to re-think the crime scenes and interview other people involved with the victims to find a link to solving the cases.::ahmetkozan"
    ],
    "synopsis": "Detective (Lilly) Rush is a homicide detective working for the Philadelphia Police Department in the present day. Although she initially dabbled in current crimes, she begins focusing on \"cold cases\" (murder cases in the past that were originally never solved). Assisting her along the way are her colleagues. Her boss and at times surrogate father figure, John Stillman, is her mentor and the one who was there for her in the past after she was assaulted as a child. Her partner, Detective Scotty Valens, is also her best friend, and a street-smart guy who struggled with extreme grief and guilt after his schizophrenic girlfriend began seeing imaginary friends from childhood called \"the giants\" and eventually took her own life. Lilly grew up with an alcoholic mother who acted more like a needy child than a mom. Her father was out of the picture throughout childhood, and her promiscuous sister, Christina, was known as the family tramp after Lilly's boyfriend cheated on her while he was drunk. Because of the ordeal, Lilly often resents her entire family although she does care about them all the same.Among Lilly's other colleagues are:Detective Will Jeffries: Jeffries is a former Vietnam war vet and high school D.J. who, while working as a police officer before getting into the homicide career, lost his wife in a fatal truck hit-and-run accident. Because of the accident, he often despises people who drive unsafely and ignore the rules of the road. He's one of the most valued members of the team and a good friend to the other detectives.Detective Kat Miller: Miller worked in narcotics and was introduced to homicide in Season 4. She's one of Lilly's best friends and knows the areas of Philadelphia like the back of her hand, a useful skill as a detective. She has a daughter called Veronica, whose deadbeat father is an ex-gangster. Initially Miller wants to keep Veronica away from her father at all costs because of his criminal past, but by Season 7 she eventually decides to compromise with her former husband after he tries to gain full custody of the child.Detective Nick Vera: Vera is an overweight big-mouth at times, but is actually very caring and really wants to have a family (his wife left him and started a family with another man). Vera is revealed in Season 7 to be on the verge of a nervous breakdown after unintentionally having an innocent man convicted of murder. Despite this, he's a great cop.Franny: Franny is a medical forensics expert who often examines cadavers and crime scene evidence throughout the first half of the show.Louie: Louie is an expert at the science of fire and explosives, using his skills to help solve crimes where these things were present as a weapon. Lilly likes him as a good friend, and eventually he gets married to a science teacher and invites the Cold Case team to his wedding.Frankie: Frankie studies photography in the police department, mostly working with traditional film. She has a brief relationship with Scotty.Cold Case is unique because, unlike most crime shows, it focuses on the past, celebrating nostalgia and combining present technology and police methods with old-school music and references to things like vinyl records, disco, super 8 film, roller rinks and the hippie counterculture, among other things. As the show progresses it gets much more intense and several side-stories arise. The show also bases several episodes on films like The Breakfast Club, The Ice Storm, Fight Club and The Big Chill. Unfortunately Cold Case was cancelled by CBS during Season 7, but rumors about a revival have been brought up by fans of the show ever since. Cold Case is the Americanized version of a Canadian television program called Cold Squad."
}