{
    "id": "11769340",
    "localized title": "Mara Pappa Superhero",
    "cast": [
        "Shraddha Dangar",
        "Bhavya Sirohi",
        "Abhinay Banker",
        "Bhatt Bhushan",
        "Revanta Sarabhai",
        "Bhavya Sirohi",
        "Bharat Thakkar",
        "Priyanka Raja",
        "Jaanushi Oza"
    ],
    "genres": "Drama",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "gu",
    "color info": "Color",
    "original air date": "2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODQ2YmRjYWItY2Y1Mi00MjI1LWEzODYtYTMzZTc5YjYzZjkyXkEyXkFqcGdeQXVyMTI2MDk3Mjk@._V1_SY150_CR66,0,101,150_.jpg",
    "imdbID": "11769340",
    "languages": "Gujarati",
    "title": "Mara Pappa Superhero",
    "kind": "movie",
    "directors": "Darshan Ashwin Trivedi",
    "writers": "Raam Mori",
    "producers": [
        "Tejasvi Vidyut Buch",
        "Milapsinh Jadeja",
        "Nishith Mehta",
        "U.T. Rao",
        "Darshan Ashwin Trivedi",
        "Burzin Unwalla"
    ],
    "composers": "Nishith Mehta",
    "cinematographers": "Tapan Vyas",
    "editors": "Burzin Unwalla",
    "editorial department": "Prayagraj Choksy",
    "art directors": "Jay Shihora",
    "assistant directors": [
        "Jeet Chavda",
        "Gaurang Kabira",
        "Parry Majmudar",
        "Karishma Patel",
        "Vishwanshu Trivedi"
    ],
    "visual effects": [
        "Chirag Mody",
        "Harsh Patel",
        "Rahul Rajput"
    ],
    "akas": "My Father Superhero (Norway)",
    "writer": "Raam Mori",
    "director": "Darshan Ashwin Trivedi",
    "production companies": "Saiffron Entertainment",
    "plot": "_Mara Pappa Superhero_ (qv) is about a 9 year old girl's struggle to establish that her father is a superhero. She takes it as a challenge to convince everybody that her father is a superhero.",
    "synopsis": "Mara Pappa Superhero is about a 9 year old girl's struggle to establish that her father is a superhero. The film revolves around slum dweller Kanku, whose parents are street vendors. Kanku would stay with her uncle, while parents would go to work. The uncle works in a villa as a create taker. Kanku is friends with the owners daughter, 12 years old Kiara. Kiara is a cartoon fan and she loves watching Superhero cartoons on TV channels. On one such days, when Kanku comes to play with Kiara; Kiara tells her as to how much she loves Superheroes and that her father is a superhero. This thought strikes the mind of Kanku.\nKanku goes back home disturbed. She wants to believe that her father is also a Superhero. She tried give this great news to her father. But the father doesn't understand her, he hasn't even seen how the Superhero looks like. Kanku struggles to find a visual reference of a Superhero. Once she finds the reference, she reaches out to her parents, only to get ridiculed by them. The father out rightly rejects the idea of him being a Superhero. Kiara and her uncle also do not believe in her. The only person who believes in her is her best friend from the slum Jamburo.\nKanku makes a lot of efforts to establish that her father is a Superhero. At the end she almost loses hopes. But while her mother narrates a mythological tale to her, where the God had forgotten about his super powers and he had to be reminded of his super powers; Kanku realizes that perhaps her father is a Superhero, and he has forgotten his Superpowers. She decides to climb the terrace and jumps in front of his father, thinking his father will fly and save her like a Superhero.\nKanku loses her senses. She is almost in a vegetable state. Here is where the father's emotional journey starts. He decides to take up the profession of performing as a Superhero on the streets of Ahmedabad. He wants to show the daughter that he is a Superhero, but the daughter cannot react to him. Eventually, he becomes so famous that people in the city start referring to him as a superhero. So, will the chirpy, bubbly Kanku come out of her vegetable state? Find out in this tear-jerking narrative."
}