{
    "id": "12084320",
    "localized title": "Main Mulayam Singh Yadav",
    "cast": [
        "Amyth Sethi",
        "Govind Namdeo",
        "Mukesh Tiwari",
        "Prakash Belawadi",
        "Supriya Karnik",
        "Ranojoy Bishnu",
        "Kiran Jhangiani",
        "Sayaji Shinde",
        "Rajkumar Kanojia",
        "Gargi Patel",
        "Sana Amin Sheikh",
        "Mimoh Chakraborty",
        "Prerna Sethi Mandal",
        "Gopal Singh",
        "Zarina Wahab",
        "Anupam Shyam",
        "Ram Sujan Singh",
        "Debdas",
        "Vimal Bhatia",
        "Khagesh Vaidya",
        "Chittrali Das",
        "Gagan Gupta",
        "Mahima Gupta",
        "Harshad Jayvant Jadhav",
        "Harshat Miami",
        "Rahul Pathak",
        "Amith Sethi",
        "Prawal Pratap Singh"
    ],
    "genres": "Biography",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "16:9 HD",
    "sound mix": "Dolby Surround 7.1",
    "certificates": "India:UA",
    "original air date": "22 Jan 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjhhMDNiYWEtODhkNi00MmQzLWE0MWItZWNlYTFhMzI0NTJmXkEyXkFqcGdeQXVyNTc0MjY0NTM@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "12084320",
    "languages": "Hindi",
    "title": "Main Mulayam Singh Yadav",
    "kind": "movie",
    "directors": "Suvendu Ghosh",
    "writers": "Rashid Iqbal",
    "producers": "Meena Sethi Mondal",
    "composers": "Sharib Toshi",
    "cinematographers": "Yogesh M. Koli",
    "editors": "Raj Singh Sidhu",
    "casting directors": "Arjun Narayan",
    "production designers": "Yogesh Ingale",
    "art directors": "Yogesh Ingale",
    "costume designers": [
        "Snigdha Ghosh",
        "Yamini Ghosh"
    ],
    "make up department": [
        "Mohammad Altaf",
        "Arun Gire"
    ],
    "production managers": "Ajeet Gagandev Patel",
    "assistant directors": [
        "Gagan Bhardwaj",
        "Lovekansh Garg",
        "Akshay Khadilkar",
        "Sayantan Roy",
        "Chandni Sharma"
    ],
    "art department": "Mahesh Somnath Hajare",
    "sound department": [
        "S.k Agarwal",
        "Prince John Carelet",
        "Kartik Sharma V"
    ],
    "visual effects": "Kuntal Ghosh",
    "camera department": "Simarpreet Singh Sandhu",
    "miscellaneous": [
        "Premankur Bose",
        "SudhaNshu Kumar"
    ],
    "writer": "Rashid Iqbal",
    "director": "Suvendu Ghosh",
    "production companies": "MS Films & Productions",
    "synopsis": "\"ZINDA KAUMEIN PAANCH SAAL TAK INTEZAAR NAHIN KARTI\"\nThis quote by one of his guru Dr. Ram Manohar Lohia became his Mantra as he flourished and became one of the most successful Political Leaders in the country MULAYAM SINGH YADAV.\nA farmer's son in a small village called Safai in Etwas district of Uttar Pradesh fought in most adverse conditions to become the supreme leader of his state. Coming from a very humble background his father wanted him to become a Wrestler, but he was destined to become something bigger. In one of the wrestling contest a local Political leader Nathuram saw this young boy when he slammed wrestlers who were double the size of him, Nathuram saw this strong-willed boy and gave him his first opportunity to enter Politics.\nIt was his destiny that Nathuram also introduced him to one of the most influential leaders of the country of that era Dr. Ram Manohar Lohia. Nathuram also helped him with a job as an English teacher in Karhal but his main focus remained Politics.\nLohia's convictions towards the equality of people and other social justice issues strongly influenced Yadav's own ideas about standing up for the rights of minorities and his actions based on those principles marked his subsequent political career.\nAfter Lohia came in his life Former Prime Minister of India Chaudhary Charan Singh, from whom he learned the nitty-gritty of politics and it was then Mulayam Singh Yadav became a big name in UP politics, he was also the political heir of Chaudhary Charan Singh. Nathuram, Ram Manohar Lohia and Chaudhary Charan Singh were the 3 pillars who groomed and shaped the political wisdom of Mulayam Singh Yadav.\nFrom an English teacher in a Primary school to Chief Minister of Uttar Pradesh, this is the journey of a man who was in jail for 19 months at the time of Emergency. This is the story of a man who was shot on the day he won his very first election. This is the Story of a man who wrestled and found his way among the giants. When capitalism and bureaucracy were the main pillars of politics, he came and changed the scenario, he changed the game of bigger political parties and big names. This is an inspiring tale of a farmer's son who became the supreme leader of the state."
}