{
    "id": "12361178",
    "localized title": "Drishyam 2",
    "cast": [
        "Mohanlal",
        "Meena",
        "Ansiba",
        "Esther Anil",
        "Siddique",
        "Asha Sharath",
        "Saikumar",
        "Murali Gopy",
        "Ganesh Kumar",
        "Anjali Nair",
        "Sumesh Chandran",
        "Antony Perumbavoor",
        "Dinesh Prabhakar",
        "Ajith Koothattukulam",
        "Narayanan Nair",
        "Santhi Priya",
        "Aneesh Menon",
        "Boban Samuel",
        "Pauly Valsan",
        "Krishna Prabha",
        "Krishna",
        "Shobha Mohan",
        "Adam Ayub",
        "Joy Mathew",
        "Mela Reghu",
        "Jayashankar",
        "Abraham",
        "Sethu Adoor",
        "Rafeeq Ahammed",
        "Ambili",
        "Abraham Evan Anil",
        "Tessa Anthony",
        "Arfaz Ayub",
        "Eldho Benchamin",
        "Ravi Vinod Boss",
        "Elisha Cherian",
        "Jayan Crayon",
        "Reji Elanji",
        "Ajay Ghosh",
        "Giri",
        "Igneshys",
        "Chinchu Jawan",
        "Katina Ann Jeethu",
        "Jio",
        "Johnson",
        "Gigi Joseph",
        "Martin Joseph",
        "Raj Joseph",
        "Rto Joshy",
        "Murali Kannur",
        "Kishore",
        "Rajeev Kovilakom",
        "Krishnakumar",
        "George Kutty",
        "Lijan",
        "Liju",
        "Althaf Manaf",
        "Manoj",
        "Varghese Mathai",
        "Nandakumar",
        "Nandini",
        "Adithyan Padmarajan",
        "Rajesh Paravoor",
        "Poojappura Radhakrishnan",
        "Gautam Raghavan",
        "Nirmal Ramakrishnan",
        "Anagha Ramesh",
        "Renjini",
        "Robin",
        "Sasidharan",
        "Aswin Sidharth",
        "Laya Simpson"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "152",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:M::(self-applied)",
        "Canada:PG-13",
        "Canada:13+::(self-applied)",
        "France:13::(self-applied)",
        "India:13::(self-applied)",
        "Indonesia:13+::(self-applied)",
        "Italy:VM12::(self-applied)",
        "Mexico:12+::(self-applied)",
        "Singapore:PG",
        "Singapore:PG13::(Amazon Prime Video)",
        "Spain:13",
        "Turkey:13+::(self-applied)",
        "United Kingdom:12",
        "United Arab Emirates:13+::(self-applied)"
    ],
    "original air date": "19 Feb 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2RiZDVjYWEtZGNhYy00ZGU0LTgwZjMtZTJmNmMyNGQ5NGYyXkEyXkFqcGdeQXVyNjY1MTg4Mzc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "12361178",
    "plot outline": "Six years after the terrible event that almost destroyed his family, Georgekutty is the proud owner of a movie theater and aspiring to write and produce his own hit film. Yet his wife Rani is ill at ease. She worries about Georgekutty, who's taken out a loan and started drinking. She worries about her daughters; Anju suffers epileptic fits and cowers in fear at the sound of a passing police siren, and young Anu's growing independence takes her away from her mother's watchful eyes. Even more worrying, the neighbors have started to gossip and the police have remained relentless in unearthing George's darkest secret. When someone from the past returns to the village, can Georgekutty save his family a second time?",
    "languages": "Malayalam",
    "title": "Drishyam 2",
    "kind": "movie",
    "directors": "Jeethu Joseph",
    "writers": "Jeethu Joseph",
    "composers": "Anil Johnson",
    "cinematographers": "Satheesh Kurup",
    "editors": "V.S. Vinayak",
    "art directors": "Rajeev Kovilakom",
    "costume designers": "Linta Jeethu",
    "make up department": "Jithesh Poyya",
    "assistant directors": [
        "Arfaz Ayub",
        "Sudeesh Ramachandran",
        "Sony G Solomon"
    ],
    "sound department": [
        "ThomasAjay Abraham",
        "Sinoy Joseph",
        "Boney M. Joy",
        "Ashique Muhammed",
        "Mohammad Iqbal Paratwada",
        "Sapthaa Records",
        "Justin E. Thomas"
    ],
    "camera department": "Jithesh Mangalapilly",
    "location management": "Sony John",
    "music department": [
        "Zonobia Safar",
        "Vinayak Sasikumar"
    ],
    "miscellaneous": "Vivek Ranjit",
    "akas": "Видимость 2 (Russia)",
    "writer": "Jeethu Joseph",
    "director": "Jeethu Joseph",
    "production companies": "Aashirvad Cinemas",
    "distributors": [
        "Phars Film",
        "Phars Film",
        "Phars Film",
        "Amazon Prime Video",
        "Amazon Prime Video"
    ],
    "other companies": "Sapthaa Records",
    "plot": [
        "A gripping tale of an investigation and a family which is threatened by it. Will Georgekutty be able to protect his family this time?",
        "Six years after the terrible event that almost destroyed his family, Georgekutty is the proud owner of a movie theater and aspiring to write and produce his own hit film. Yet his wife Rani is ill at ease. She worries about Georgekutty, who's taken out a loan and started drinking. She worries about her daughters; Anju suffers epileptic fits and cowers in fear at the sound of a passing police siren, and young Anu's growing independence takes her away from her mother's watchful eyes. Even more worrying, the neighbors have started to gossip and the police have remained relentless in unearthing George's darkest secret. When someone from the past returns to the village, can Georgekutty save his family a second time?::L. Hamre",
        "Jose who has attacked his brother in law and on run from cops sees Geroge Kutty hiding something at the upcoming police station on 3rd August 2013.Six years later George Kutty is now a theater owner and wants to produce a film even thou objections from his family,George's family his wife Rani children Anju and Anu continue to live comfortable lives.But Anju gets fits in between of being caught in Varun's murder ,while Rani also lives in a fear that cops might someday find Varun's body and question them again as George has still not shared the secret what he did with Varun's body.Rani constantly shares her fears with her neighbor Saritha whose living with her abusive husband Sabu as it makes her feel better by sharing about the fearful incident.Prabhakar comes to meet George at his theater with the hope that he might disclose about Varun's body so that he can perform the final rights but George does not share anything.The local police have faced lot many humiliations over the years unable to solve the mystery of Varun's missing body decide to re-investigate the case with IPS Thomas Bastin junior of Geeta.Jose whose out of prison wants to give better life to his family decides to revel the cops what he saw the night he was arrested for a big some of money.::alex.mjacko@gmail.com"
    ],
    "synopsis": "The film begins with Jose, a convict, on the run from the police. In an attempt to hide, he takes refuge behind an under-construction police station, from where he witnesses Georgekutty emerging from. He is then caught by the police and apprehended.Six years later, Georgekutty, Rani, Anju and Anu lead an affluent life. Georgekutty, now an owner of a movie theatre, yearns to produce a film, despite his family's objection. He is in constant touch with Vinayachandran, a prominent screenwriter, in order to develop screenplay for his project. Although the family is comfortable, Anju has repeated fits of epilepsy and is now a PTSD patient, a consequence of her fear of getting arrested in connection to Varun's murder. Jealous of the family's meteoric rise in wealth, Georgekutty's neighbors start spreading rumors tarnishing the family's image, especially Anju's, much to Rani's distress. Her only source of solace is her friendly neighbor Saritha, although the duo's friendship is not accepted by Saritha's abusive husband, Sabu.The police, having received much humiliation due to their inability to solve Varun's case, decide to reinvestigate the case, under the supervision of IG Thomas Bastin. Meanwhile, Georgekutty encounters Prabhakar, who begs him to disclose the location of Varun's body so that he can collect his skeleton to perform funeral rites, but to no avail. Anu returns home on a spring break and hosts a sleepover party with her friends, despite Rani's protests. One night, Rani conveys to Saritha of her fears of getting arrested and inadvertently blurts the fact that Georgekutty had moved Varun's body. Unbeknownst to her and the family, Saritha and Sabu are actually undercover cops, assigned by Bastin in an attempt to discover the location of Varun's body. Among his other spies was Anumol's boyfriend.Meanwhile, Jose is released from prison. After overhearing Georgekutty's case from townspeople, he recollects about having seen him at the then-unfinished police station and promptly tips off the police. Bastin informs this to Geetha and Prabhakar, who arrives from the US to oversee the new developments on the case. Relying on Jose's information, the authorities excavate the police station, eventually discovering a human skeleton. Georgekutty learns these events through surveillance cameras. He and his family are then apprehended and questioned by the police. To make matters worse, Rani's earlier revelation to Saritha had been recorded; Saritha and Sabu had bugged Georgekutty's house. Geetha's brash questioning results in Anju having another epileptic fit.Distraught, Georgekutty gives in a fabricated story in which he is the murderer of Varun, for which he claims he has preserved evidence. After they are let go, the family muse about their supposedly bleak future. After Georgekutty is formally arrested and tried, Vinayachandran meets with Bastin, Geetha and Prabhakar. He reveals that, on Georgekutty's recommendation, their screenplay was published as a novel titled Drishyam under Vinayachandran's name for protecting copyright. In their novel, the hero successfully manages to hide the body, but when discovered, he gives a false confession to save his child. Bastin then realises that Georgekutty's recorded confession matches with Drishyam's plot. In the court, Georgekutty pleads not guilty, his lawyer argues that the police had used the book's plot to frame Georgekutty. Much to the police's shock, the DNA results of the tests conducted on the human skeleton do no match with that of Varun's.Shocked, Vinayachandran reveals that Georgekutty had an alternate climax for his film, in which the hero, attempting to evade capture, would learn about the procedures conducted when such a skeleton is found on that location, Idukki district. The hero would then procure the skeleton of another youngster who had died with injuries similar to that of Varun's, by befriending a local gravedigger. He would further befriend the security guard of the medical institution where the forensic tests of the discovered skeleton would be conducted. On the day the original skeleton is dug up and send to forensic lab, he would discreetly switch the victim's skeleton with the one he procured, while cremating the original one, thus destroying all incriminating evidence.As per Vinayachandran's narration, it is revealed that Georgekutty had followed suit. With no incriminating evidence to prove his culpability, Georgekutty is released. His lawyer requests the court to direct the police to stop proceeding against Georgekutty for the time being as he is moving to High Court to quash the proceedings against him. Georgekutty later has Varun's cremated skeleton discreetly handed over to Geetha and Prabhakar, who floats his ashes in river. Bastin urges them to end their spat with Georgekutty, as they will never succeed in punishing him. He tells that Georgekutty's vigilant life itself is a punishment; he must live the rest of his life with constant supervision, caution and guilt. The couple apparently agrees with him. Meanwhile, Georgekutty, watching the trio from afar, silently leaves."
}