{
    "id": "13181612",
    "localized title": "Tari Sathe",
    "cast": [
        "Jhinal Belani",
        "Bhavya Ghandhi"
    ],
    "genres": "Family",
    "runtimes": "119",
    "countries": "India",
    "country codes": "in",
    "language codes": "gu",
    "color info": "Color",
    "certificates": "India:U",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjM2ODU1NjMtYzY3Mi00Mzc3LTlmNjktZDk3YTRiYWRlNWI4XkEyXkFqcGdeQXVyODE5OTIxODU@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "13181612",
    "plot outline": "The world is made of thousand differences and same thing is with our mankind, our religions, our customs and so on. Tari Sathe is a great example of difference of thinking of a new generation from different cities. It properly enhances the situation where they're is a dilemma of selection or rejection from one end and understanding or adjusting on other end. The guy thinks about love affection joint family and values while the girl is thinking about security and stability of life. So ultimately what's important loving as per adjustment or adjustment in love. The story revolves between two youngsters who are at the age of getting married. The girl seeks to meet the boy with a wish of a denial as per her imaginary thoughts and her own upgraded and practical thinking. On the other end boy with positive mindset without revealing his original identity creates consequential sequences so that the girl cannot meet the person whom she came for. Unveiling the back stories of their life with other co partners and making themselves comfortable with each other gives a type of dramatic foursquare angled love story with beautiful and melodious song.",
    "languages": "Gujarati",
    "title": "Tari Sathe",
    "kind": "movie",
    "directors": "Rakesh Shah",
    "producers": [
        "Manoj Ahir",
        "Vishal Bhatt",
        "Bhanubhai Raval",
        "Sanjay Raval",
        "Miral Shah"
    ],
    "composers": [
        "Mihir Bhatt",
        "Nikhil Kamat",
        "Maulik Mehta"
    ],
    "cinematographers": "Suraj Kurade",
    "editors": [
        "Parth Y. Bhatt",
        "Shailendra Kumar"
    ],
    "art directors": "Shloka Shah",
    "make up department": [
        "Rashid Khan",
        "Bhumika Mojidra",
        "Dhara Shah"
    ],
    "art department": "Mitul Chopda",
    "music department": [
        "Nakash Aziz",
        "Mihir Bhatt",
        "Meet Mehta",
        "Payal Shah",
        "Nayna Sharma"
    ],
    "miscellaneous": "Ankit Brahmbhatt",
    "director": "Rakesh Shah",
    "other companies": "Blow Horn Media",
    "plot": [
        "The story revolves between two youngsters who are at the age of getting married. The girl seeks to meet the boy with a wish of a denial. On the other end boy with positive mindset without revealing his original identity.",
        "The world is made of thousand differences and same thing is with our mankind, our religions, our customs and so on. _Tari Sathe_ (qv) is a great example of difference of thinking of a new generation from different cities. It properly enhances the situation where they're is a dilemma of selection or rejection from one end and understanding or adjusting on other end. The guy thinks about love affection joint family and values while the girl is thinking about security and stability of life. So ultimately what's important loving as per adjustment or adjustment in love. The story revolves between two youngsters who are at the age of getting married. The girl seeks to meet the boy with a wish of a denial as per her imaginary thoughts and her own upgraded and practical thinking. On the other end boy with positive mindset without revealing his original identity creates consequential sequences so that the girl cannot meet the person whom she came for. Unveiling the back stories of their life with other co partners and making themselves comfortable with each other gives a type of dramatic foursquare angled love story with beautiful and melodious song.::Rakesh Shah"
    ]
}