{
    "id": "14303128",
    "localized title": "Kadampari",
    "cast": [
        "Arul",
        "Akila Narayanan",
        "Kaashima Rafi"
    ],
    "genres": "Horror",
    "runtimes": "104",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "Norway:15::(iTunes rating)"
    ],
    "original air date": "19 Mar 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODM1MmFjZTYtNGUxNC00NWQ4LTgwNDEtNGRkZGZmNWFmOTE0XkEyXkFqcGdeQXVyMTMwNzExNjQ5._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "14303128",
    "languages": "Tamil",
    "title": "Kadampari",
    "kind": "movie",
    "directors": "Arul",
    "writers": "Arul",
    "producers": "Arul",
    "composers": "Prithivy",
    "cinematographers": "Vtk Udhayan",
    "editors": "Rajavarman",
    "writer": "Arul",
    "director": "Arul",
    "synopsis": "Arul and his sister Ruthra and friends Jency ,stella,victor travelling to hills station near by andhra area from Chennai.On the way, they met an accident and all got injured .they are all try to find some help in middle of the Forrest , also it's raining. Leaving the car, they finally found one house in the forrest. There is a old man living in that house , his name is beemsing . They ask help and explain the situation to that old man . But beemsing told them to seek help in town in dumb language. Their injuries convince him to let them in, but he warns them to not leave the hall.Arul and beemsing go outside to get firewood. As ruthra and victor wander around the house to find a bathroom, ruthra hears a girl crying out for help in through water pipe . They hide when they hear beemsing return and see him check a basement door before the others mollify him. When ruthra and victor check the basement, they find Anamika (beemsing daughter),but they thought she is innocent and beemsing kidnapped and locked in a box. Beemsing angrily confronts them with a rifle, but Arul saves them by knocking out beemsing . Arul lets Anamika out of the box and ties up Beemsing . Anamika does not speak much, and, when beemsing regains consciousness, he only tells them that they will all die in dumb language . They gag him and look for a working car or phone, to no avail.They soon become suspicious when they discover the house has so many suspence and Beemsing has a decades-old photograph of Anamika then only they came to know she is his daughter , and the box is carved with occult symbols. Anamika taunts Beemsing by telling him that she will kill everyone. When he frees himself, he slashes his wrists and runs at her with a knife. Victor , who earlier took Beemsing rifle, shoots and kills him. As stella and Anamika separate from the others to talk, suddenly one police man arrives and demands to see Beemsing . When they explain that they had to kill him in self-defense, police man orders them at gunpoint to enter the box. Arul briefly enters the box, but rushes police man and disarms him.Police man reveals that Anamika is a witch. She can take over the body of anyone who kills her current host. Beemsing locked her up nearly 40 years ago after his daughter was possessed. The witch knows everyone's secrets and uses them to sow discord and encourage people to kill her, so she can inhabit the strongest person. She need 1000 healthy bodies to travel and get back her original body .Stella kills Anamika after she threatens to reveal Stella's abortion, and victor kills the witch (stella ) when she reveals that he is a serial killer who preys on young women. Police man encourages them to wound the witch (victor ) rather than kill her, but Ruthra accidentally kills victor. The witch (ruthra) taunts them by revealing that Arul turned off Police man's life support without telling jency.After they bring Ruthra back to the house, Arul insists they find a way to cure her, but Police man says it is not possible. The witch frees herself from Ruthra, kills police man, and promises to let Jency live if Arul will sacrifice himself, as the witch does not want to inhabit Ruthra's injured body. Arul initially refuses, but, after the witch appears to him and disfigures herself, he agrees. Before Arul can sacrifice himself, Jency kills the witch herself. Overcome with grief, Arul locks Jency (now possessed) in the box."
}