{
    "id": "14598754",
    "localized title": "Honsla Rakh",
    "cast": [
        "Diljit Dosanjh",
        "Shehnaaz Gill",
        "Sonam Bajwa",
        "Gurfateh Singh Grewal",
        "Darren Andrichuk",
        "Beth Anthony",
        "Baljinder Atwal",
        "Gaurav Bakshi",
        "Erica Jane Beckstead",
        "Jamie Crozier",
        "Raja Dhillon",
        "Hannah Everett",
        "Kiran Gill",
        "Richard Guenther",
        "Adriana Heyde",
        "Sachin Yadav Iamsyrs",
        "Balinder Johal",
        "Mauri Momose",
        "Adam Muxlow",
        "Kamaljit Neeru",
        "Manpreet Rayat",
        "Deepinder Sandhu",
        "Eve-Yasmine Saoud-Easton",
        "Mandeep Singh",
        "Palak Singh",
        "Mitchell Sviatko",
        "Tarannum Thind",
        "Wolff Podzun"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "pa",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:PA::(Alberta)",
        "India:UA",
        "Italy:T",
        "New Zealand:M",
        "Norway:A::(cinema rating)",
        "Philippines:13+::(self-applied)",
        "Singapore:NC16",
        "United Kingdom:12A",
        "United Arab Emirates:PG-13"
    ],
    "original air date": "15 Oct 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjhlOWJlMzctNjI3Yi00NzUzLTk5MjUtYjVkZmM3NzEyMWE1XkEyXkFqcGdeQXVyMTM4MzE0MDk1._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "14598754",
    "plot outline": "What happens when a lovable, rooted, desi, Punjabi young man, who's a single father with a seven year old boy attempts to find love again, find a mom for his son, crosses paths with his ex who comes back into the city after a seven year gap? Honsla Rakh, starring Diljit Dosanjh, Sonam Bajwa, Shehnaaz Gill and Shinda Grewal is a romantic comedy set in Vancouver, Canada that has warmth at its center and deals with the emotional bonds between father and child, and love between men and women in modern times.",
    "languages": "Punjabi",
    "title": "Honsla Rakh",
    "kind": "movie",
    "directors": "Amarjit Singh Saron",
    "writers": "Rakesh Dhawan",
    "producers": [
        "Diljit Dosanjh",
        "Pawan Gill",
        "Rupesh Mali",
        "Sonali Singh",
        "Daljit Singh Thind"
    ],
    "composers": [
        "Avvy Sra",
        "Intense",
        "Mixsingh",
        "Yeah Proof",
        "Jsl Singh"
    ],
    "cinematographers": "Baljit Singh Deo",
    "editors": "Manish More",
    "editorial department": [
        "Tushar Desai",
        "Pratik Kothari",
        "Gaurav Rai",
        "A.S. Sujith"
    ],
    "casting directors": "Raj Tiwana",
    "production designers": "Sheena Saini",
    "art directors": "Aman Khangura",
    "costume designers": [
        "Moneey Singh",
        "Tanya Singh"
    ],
    "make up department": [
        "Saloni Sagar",
        "Renu Sindhu"
    ],
    "production managers": [
        "Guarav Bakshi",
        "Terry Hundal",
        "Navin Kumar Jha",
        "Joe Jose",
        "Dharmveer Rai"
    ],
    "assistant directors": [
        "Sidak Gill",
        "Jai Mann",
        "Aneet Sekhon",
        "Garry Somal",
        "Raj Tiwana"
    ],
    "art department": [
        "Gladys Acolentava",
        "Adriana Heyde"
    ],
    "sound department": [
        "Pranam Pansare",
        "Yash Rathod",
        "Siddhesh Sardesai",
        "Desai Yash"
    ],
    "camera department": "Kohinoor Singh",
    "animation department": "Mohammad Aqib",
    "costume departmen": [
        "Gurpartap Singh",
        "Manjot Singh"
    ],
    "music department": [
        "Laddi Chahal",
        "Anku Malik",
        "Akash Noatia",
        "Happy Raikoti",
        "Raj Ranjodh",
        "Sandeep Saxena"
    ],
    "miscellaneous": [
        "Erica Jane Beckstead",
        "Thirsty Fish",
        "Tina Goldsack",
        "Joe Jose",
        "Arvind Thakur"
    ],
    "akas": "Honsla Rakh - Stay Calm (Norway)",
    "writer": "Rakesh Dhawan",
    "director": "Amarjit Singh Saron",
    "production companies": [
        "Storytime Productions",
        "Thind Motion Films"
    ],
    "distributors": [
        "Friday Entertainment",
        "HKC Entertainment",
        "Masala Life Films",
        "Amazon Prime Video",
        "Amazon Prime Video"
    ],
    "plot": [
        "A loveable, rooted, desi, punjabi young man, who's a single father with a seven year old boy attempts to find love again.",
        "What happens when a lovable, rooted, desi, Punjabi young man, who's a single father with a seven year old boy attempts to find love again, find a mom for his son, crosses paths with his ex who comes back into the city after a seven year gap? _Honsla Rakh_ (qv), starring Diljit Dosanjh, Sonam Bajwa, Shehnaaz Gill and Shinda Grewal is a romantic comedy set in Vancouver, Canada that has warmth at its center and deals with the emotional bonds between father and child, and love between men and women in modern times."
    ],
    "synopsis": "Yankey Singh is a divorced single parent, who lives with his son, Honsla Singh. He runs a successful Indian restaurant in Canada. He is desperate to find a woman for marriage, and always introduces his son as his younger brother whenever he meets a pretty girl. One day, at the airport, while waiting for a delayed flight, he accidentally meets Sweety, his ex-wife, while waiting for their delayed flight.In a flashback, a young Yankey and Sweety are on a date where Sweety places a condition that after marriage, they won't have any kids and would focus on their careers. But, after a few months of their marriage, Sweety accidentally gets pregnant and often experiences mood swings. She demands a divorce and wants Yankey to get the child's custody. After the child is born, Sweety leaves Yankey and her newborn child with him, whom he names Honsla. Then, the film depicts the struggle Yankey faced as a single parent, and how he couldn't marry a single girl as he is always rejected for having a child.After the flashback, Sweety is revealed to be a successful fashion designer, who then finally meets her son, Honsla. Just as she meets Honsla, her new husband calls her, thus disappointing Yankey. As the delayed flight is cancelled, Yankey meets Jasmine, and falls in love with her instantly. They become friends and start dating. Yankey proposes to Jasmine, but as soon as she finds out he has a son, she rejects him. But Honsla immediately lies that his mother (Yankey's first wife) is dead, and Jasmine then agrees to marry Yankey.Initially, both of them introduce Honsla as Yankey's younger brother to their family, and Jasmine's parents agree to their marriage. The situation deteriorates when Sweety and her husband appear at his wedding. Yankey and Honsla both decide to tell everyone the truth, as he doesn't want to hurt Jasmine and her parents anymore.During their engagement, Yankey tells everyone the truth. He confesses that Sweety was his first wife and Honsla is his and Sweety's son. Seeing his father sad, Honsla decides to stay with Sweety for his father's sake, but Yankey, who loves Honsla, leaves the engagement on the spot. Then, it is revealed that both were doing a small drama to convince Jasmine and her family members.All of them finally forgive Yankey and accept Honsla. Just as Sweety and her husband leave, Honsla calls Sweety \"Mummy\", thus enlightening her. Yankey says that Sweety can meet Honsla whenever she wants and the film ends on a happy note with a group photo."
}