{
    "id": "14992960",
    "localized title": "Net",
    "cast": [
        "Avika Gor",
        "Praneeta Patnaik",
        "Vishwadev Rachakonda",
        "Rahul Ramakrishna"
    ],
    "genres": [
        "Drama",
        "Thriller"
    ],
    "runtimes": "103",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:UA 16+",
        "India:UA 13+::(self-applied)"
    ],
    "original air date": "10 Sep 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYmY1YzYzNTMtZDRlZS00Y2ZkLTg0NjctOTg1NjM1ZTViYWIwXkEyXkFqcGdeQXVyMTIzMzg0MTM2._V1_SY150_CR25,0,101,150_.jpg",
    "imdbID": "14992960",
    "plot outline": "NET is a 90-minute film that shows the weakness of human life, dealing with obsession taking over ethical values. Net, a story set in Nalgonda, revolves around a newly-married middle-class couple and a young couple, working in the software industry. Laxman, a small mobile-shop owner, in an unhappy marriage, stumbles upon Priya, a software professional through a porn site. Priya's apartment is under surveillance of hidden cameras making her and her boyfriend Ranjith's private life accessible to everyone who can unlock every room of her house by paying a heavy subscription fee. Laxman's obsession with her keeps mounting up until he finds out that Ranjith is cheating on Priya. That's when his entire life turns upside down when he goes out of his way to help Priya. Life pushes all the characters to a unseen limit and leads to broken relationships and shocking endings and finally everyone is trapped in a net. How they eventually get out of the net or not falls rest of the story.",
    "languages": "Tamil",
    "title": "Net",
    "kind": "movie",
    "directors": "Bhargav Macharla",
    "writers": "Bhargav Macharla",
    "producers": "Rahul Tamada",
    "cinematographers": "Abhiraj Nair",
    "sound department": [
        "Kdk Shankar",
        "Nagarjun Thallapalli"
    ],
    "casting department": "Amit Arora",
    "writer": "Bhargav Macharla",
    "director": "Bhargav Macharla",
    "production companies": "Tamada Media",
    "distributors": [
        "Zee5",
        "Zee5"
    ],
    "plot": [
        "Small-town, mobile store owner Laxman's life turns upside down when he encounters an online subscription-based spying website and starts following a young girl Priya. His innocent obsession leads him to take immoral decisions.",
        "NET is a 90-minute film that shows the weakness of human life, dealing with obsession taking over ethical values. _Net_ (qv), a story set in Nalgonda, revolves around a newly-married middle-class couple and a young couple, working in the software industry. Laxman, a small mobile-shop owner, in an unhappy marriage, stumbles upon Priya, a software professional through a porn site. Priya's apartment is under surveillance of hidden cameras making her and her boyfriend Ranjith's private life accessible to everyone who can unlock every room of her house by paying a heavy subscription fee. Laxman's obsession with her keeps mounting up until he finds out that Ranjith is cheating on Priya. That's when his entire life turns upside down when he goes out of his way to help Priya. Life pushes all the characters to a unseen limit and leads to broken relationships and shocking endings and finally everyone is trapped in a net. How they eventually get out of the net or not falls rest of the story.::Promita Mukherjee"
    ]
}