{
    "id": "15097216",
    "localized title": "Jai Bhim",
    "cast": [
        "Suriya",
        "Lijo Mol Jose",
        "Manikandan",
        "Rajisha Vijayan",
        "Prakash Raj",
        "Rao Ramesh",
        "Guru Somasundaram",
        "M.S. Bhaskar",
        "V. Jayaprakash",
        "Sibi Thomas",
        "Ilavarasu",
        "Jayarao",
        "Sujatha Sivakumar",
        "Ravi Venkatraman",
        "Tamizh",
        "Kumaravel",
        "Supergood Subramani",
        "Bala Hasan",
        "Raja Rani Pandian",
        "Subatra Robert",
        "Rajendran",
        "Baby Joshika Maya",
        "Bava Chelladurai",
        "Kaleeswaran",
        "Kumar Natarajan",
        "Sanjay Swaroop",
        "Shankar Sundaram",
        "Anaangoor Raju",
        "M. Sinrasu",
        "S. Ravi",
        "Deepa",
        "Kaveri",
        "Bigil Siva",
        "Hello Kandasamy",
        "K. Raj",
        "Jijoi Pr",
        "Kalakkadu V. Ranganathan",
        "Supervisor Raju",
        "Srikanth",
        "Kulothungan",
        "Pathman",
        "Padmapriya",
        "Set Dhanasekhar",
        "Anbaana Arun",
        "'Winner' Ramachandran",
        "Rukmani",
        "Sivalingam Babu",
        "Amarar Krav Maha Sriram",
        "Rajesh Balachandiran",
        "David Soloman",
        "Maheshwaran",
        "Dayaalan",
        "Jaishankar",
        "Ravishankar",
        "Aravind Sejju",
        "Brahadeeshwaran",
        "Mayilai Manivannan",
        "Murugesan",
        "Ramkumar Pazhani",
        "Deva",
        "Subramani",
        "Saravanan",
        "Sellavel",
        "Yuva",
        "Dhandapani",
        "Karthik",
        "Vetri Kiran",
        "Chaplin Sundamir",
        "Jagir",
        "Sivajudasan",
        "Ashokan",
        "Ganeshan",
        "Kamal",
        "Balaji",
        "Parthasarathy",
        "Sathish",
        "Harikrishnan",
        "Murugan",
        "Ramasubramanyan",
        "Thiagarajan",
        "Aarumugam",
        "Alima",
        "Amala",
        "Anandhi",
        "Anjala",
        "Anju",
        "Bhoominathan",
        "Chinnarasu",
        "Chitra",
        "Devi",
        "Dhanalakshmi",
        "Ellappan",
        "Ezhumalai",
        "Geetha",
        "Janaki",
        "Kannan",
        "Kanniyappan",
        "Lakshmi",
        "Malar",
        "Velli Muthu",
        "Panneer",
        "Parthi",
        "Poongodi",
        "Prashanth",
        "Raja",
        "Ramesh",
        "Ranganathan",
        "Ranjith",
        "Sakthivel",
        "Sekar Sami",
        "Sathya",
        "Selvaraj",
        "Selvi",
        "Shankar",
        "Sivakumar",
        "Thangavel",
        "Thenaambal",
        "Valli",
        "Vasantha",
        "Velu",
        "Venkateshan",
        "Vennila",
        "Vijaykumar",
        "Viji"
    ],
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtimes": "164",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ta",
        "hi"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:MA15+::(self applied)",
        "Brazil:16::(self applied)",
        "Canada:16+::(self applied)",
        "France:16::(self applied)",
        "India:A::(self-applied)",
        "Indonesia:16+::(self-applied)",
        "Netherlands:16::(self-applied)",
        "Philippines:16+::(self-applied)",
        "Singapore:NC16::(self-applied)",
        "Turkey:16+::(self-applied)",
        "United States:TV-MA",
        "United Arab Emirates:16+::(self-applied)"
    ],
    "original air date": "02 Nov 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2Y5ZWMwZDgtZDQxYy00Mjk0LThhY2YtMmU1MTRmMjVhMjRiXkEyXkFqcGdeQXVyMTI1NDEyNTM5._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "15097216",
    "plot outline": "Rajakannu and his wife Sengeni belong to a lower cast and works as labors in the field to protect it from rats thou they live life of poverty but are happy with what they have. Rajakannu and Sengeni plan a second child and soon Sengeni gives the good news once Rajkannu is called to the house of a upper caste man as a snake has sneaked inside his house.The next day theft of jewelry is reported in the same house suspicious raising towards Rajkannu .The cops got to arrest Rajkannu but he leaves the town for work following which the cops detain a pregnant Sengani and rest of family members asking them details about the Rajkannu.The cops trace Rajkannu and torture him and his brothers in jail asking him to confess the crime they did not commit later Sengeni finds that Rajkannu and his brother have eloped from the prison to escape torture.Mythra who teaches tribal village comes across a lawyer Chandru who fights for tribal people and after hearing story of Senegeni files a Habeas corpus case in court.",
    "languages": [
        "Tamil",
        "Hindi"
    ],
    "title": "Jai Bhim",
    "kind": "movie",
    "directors": "T.J. Gnanavel",
    "writers": "T.J. Gnanavel",
    "producers": [
        "Jyotika",
        "Suriya"
    ],
    "composers": "Sean Roldan",
    "cinematographers": "S.R. Kathir",
    "editors": "Philomin Raj",
    "editorial department": "Gopal Balaji",
    "art directors": [
        "K. Kathir",
        "Ali Safdari"
    ],
    "production managers": "Priyanshu Sharma",
    "sound department": [
        "Alagiakoothan",
        "Nagavenkatakumar",
        "Shrikanth Sundar",
        "Karthick Suresh"
    ],
    "visual effects": [
        "Azhagu Raj Pandian",
        "Hari Prasath Sundaresan"
    ],
    "stunts": "Anbariv",
    "music department": [
        "Joaquim Badia",
        "Matt Dunkley",
        "Lewis Jones",
        "Bohemia Junction Limited",
        "Roger Linley",
        "Andrew T. Mackay",
        "Steve Mair",
        "Neelesh Mandalapu",
        "Akash Noatia",
        "Grand Philharmonic Orchestra",
        "Colin Rae",
        "Indrajeet Singh",
        "Laurence Ungless",
        "Kostas Vaporidis",
        "Wil Jones"
    ],
    "miscellaneous": [
        "Mayank Badhwar",
        "Mandava Sai Kumar"
    ],
    "akas": [
        "Да прольётся свет (Russia)",
        "ジャイビム (Japan, Japanese title)"
    ],
    "writer": "T.J. Gnanavel",
    "director": "T.J. Gnanavel",
    "production companies": "2D Entertainment",
    "distributors": [
        "Amazon Prime Video",
        "Amazon Prime Video",
        "Amazon Prime Video",
        "Kalaignar Tv"
    ],
    "other companies": "Sony Music India",
    "plot": [
        "When a tribal man is arrested for a case of alleged theft, his wife turns to a human-rights lawyer to help bring justice.",
        "Rajakannu and his wife Sengeni belong to a lower cast and works as labors in the field to protect it from rats thou they live life of poverty but are happy with what they have. Rajakannu and Sengeni plan a second child and soon Sengeni gives the good news once Rajkannu is called to the house of a upper caste man as a snake has sneaked inside his house.The next day theft of jewelry is reported in the same house suspicious raising towards Rajkannu .The cops got to arrest Rajkannu but he leaves the town for work following which the cops detain a pregnant Sengani and rest of family members asking them details about the Rajkannu.The cops trace Rajkannu and torture him and his brothers in jail asking him to confess the crime they did not commit later Sengeni finds that Rajkannu and his brother have eloped from the prison to escape torture.Mythra who teaches tribal village comes across a lawyer Chandru who fights for tribal people and after hearing story of Senegeni files a Habeas corpus case in court.::alex.mjacko@gmail.com"
    ],
    "synopsis": "The film commences with a portrait of society's caste divide, with the police checking the caste of detainees to determine who should be released. Only inmates from the upper and middle castes get released. The police blame people from lower caste accusing them of perpetrating crimes in multiple pending cases.[6] Rajakannu and Sengeni are a couple from the Irula tribe who labor in the fields of upper-caste men to control rat infestation and catch venomous snakes. Rajakannu is called to a rich man's dwelling to catch a snake that sneaked inside a room.The next day, a case of burglary is reported when the wife of the man reports missing jewellery pieces from her closet and raises doubt on Rajakannu. The police invade Rajakannu's home to find evidence. Rajakannu had left the town earlier for work. During the invasion, the police brutally beat and unlawfully detains his pregnant wife. The police arrest other relatives, Rajakannu's brother, Iruttupan, his sister Pachaiammal and his brother-in-law, Mosakutty and torture them to confess the whereabouts of Rajakannu. The police find Rajakannu and imprison him. They brutally torture him to confess the crime but releases his wife. Later, Sengeni is informed that all three men in detention are absconding and police threaten her furthermore to tell them about their whereabouts.Mythra, who teaches adults from Irula tribe, gets to know about Chandru, a lawyer who fights cases for tribal communities, and manages to convince him to seek justice for Sengeni. After listening to the narration of all events that happened until then from Sengeni, Chandru files a habeas corpus case in the court. The public attorney, in defence of the police, produces eye-witnesses to concoct a story that Rajakannu and the other two indeed absconded from jail. Finding gaps in the eye-witnesses' statements, Chandru uncovers that they were committing perjury and asks the court to investigate two police officers - Sub-Inspector Gurumurthy, a casteist cop and constable Veerasamy.Advocate general Ram Mohan takes over the case and in defence of the police, claims that the three accused have fled to Kerala when Varadarajulu, the employer of Iruttapan, acknowledges that Iruttapan informed him through a phone call that he fled to Kerala after committing robbery. In retort, Chandru manages to discover that the three cops in question went to Kerala to make a phone call to Varadarajulu which Gurumurthy admits, that he mimicked the voice of Iruttapan. Chandru and Mythra find Rajakannu dead in the middle of a road near the border of Pondicherry. Both believe that Rajakannu did not die due to a car accident, rather due to lock-up murder.Chandru consults the doctor who operated on Rajakannu. The doctor tells him that the cause of death was due to the breaking of the ribcage, but theorises that this could be caused by a car running over him. Veerasamy confesses to Ram Mohan that Rajakannu died in lock up custody. Veerasamy called Guru after the death. Guru tells Veerasamy that he should stage that both escaped and leave Rajakannu on the road making everyone believe that he died due to a car accident. Mosakutty and Iruttapan were transferred to another jail in Kerala. After hearing this, the lawyer tells them to act like they do not know anything in court. Chandru checks the call history of the police station and tells the court that a call to Guru's residence was made at 9:10 pm, which does not match with Veerasamy's statement. Chandru asks the court for more time to investigate, which they allow.Chandru, Mythra, Sengeni and the Irular tribe go around the city protesting for justice. Chandru connects the dots and finds that Irutappan indeed called Varadarajulu, but the police coerced him to make the call. Mythra finds Iruttapan and Mosakutty and they tell the court about the torture all three of them went through and how the cops killed Rajakannu. Perumalsamy, an Inspector General, says the cops took a bribe from the real thief. Chandru also says that on the road where Rajakannu's corpse was found, there were a set of tyre marks. There were also footprints that matched Guru's and Constable Kiruba's footprints. After hearing these shreds of evidence, the court announces the verdict: the cops who killed Rajakannu should be arrested, Sengeni will get three lakhs and half a ground land as compensation while Iruttapan, Mosakutty and Pachaiamma get two lakhs each. Sengeni tearfully thanks Chandru for his help and Chandru attends the inauguration of Sengeni's new house, fulfilling Rajakannu's dream to get Sengeni a new house."
}