{
    "id": "15141270",
    "localized title": "Akshi",
    "cast": [
        "Govinde Gowda",
        "Devendra Medarametla",
        "Master Mithun",
        "Baby Sowmya Prabhu",
        "Kalaadegula Srinivas",
        "Ila Vitla"
    ],
    "genres": "Drama",
    "runtimes": "127",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color::(DCP)",
    "aspect ratio": "16:9 HD",
    "sound mix": "D-Cinema 96kHz 5.1",
    "certificates": "India:All::(theatrical rating)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDMwYzFlMmMtZmEwMy00MWVjLWE4ODYtNjdkNzM2ZjBkNjdiXkEyXkFqcGdeQXVyOTgwMDQwMzA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "15141270",
    "languages": "Kannada",
    "title": "Akshi",
    "kind": "movie",
    "directors": [
        "Manoj Kumar",
        "Manoj Kumar"
    ],
    "writers": "Devendra Naidu",
    "producers": [
        "Ramesha Chavan",
        "Ravi Holalu",
        "Srinivas Kalaadegula"
    ],
    "composers": "Kalaadegula Srinivas",
    "cinematographers": "Mukul Gowda",
    "editors": "Manoj Kumar",
    "writer": "Devendra Naidu",
    "director": [
        "Manoj Kumar",
        "Manoj Kumar"
    ],
    "production companies": "Kalaadegula Studio",
    "plot": "A Boy's Quest to Normalize Eye Donation in remote village.",
    "synopsis": "One of the small villages near Chikkamagulur coffee Estates, Karnataka state, India tells so many stories. Its a Ramu's story, a 12 year old boy who lives almost wholly for his younger sister, Lakshmi. Despite being blind at birth, Lakshmi is the apple of Ramu's and his father's eyes and Lakshmi who sings extremely well is also very smart. Ramu devotes himself to her making it his life's mission to help her experience life through the other four senses. Helping him is a 70 year old man called Kurudappa, who is also blind by Birth.\nWith the arrival of a new doctor in the village, Ramu family understands that it is possible to get an eye transplant for his sister. He dreams of her gaining eyesight without a true comprehension of the complex challenges that lie ahead - from the long wait lists ahead for those waiting for eye donation, to the criteria that need to be fulfilled for eye donation and more. Yet, despite all that when Lakshmi gets approved as the recipient of a single eye, tragedy strikes. Heavy rains and landslides wreak havoc on the village and also claim the life of Lakshmi who walks into the disaster unknowingly.\nAfter Lakshmi's funeral, the village including Ramu's parents return to normalcy. Ramu however is unable to comprehend a world without his sister. The villagers start questioning his mental health and his mother takes matters into her own hands by taking him to temples and hospitals. This is when Ramu comes across a school for the visually challenged. He delves deeper into the process of Eye Donation and talks to Kurudappa & Doctor about this, as well.\nWith his newfound knowledge, Ramu sets about to try and educate people in nearby villages. He tries to eradicate the superstitions and preconceived notions around eye donation. How could a child presume to be more educated than them? After Ramu tries to procure the eyes of an elderly person who had pledged his eyes before his death, the villagers react by violently thrashing him and branding him mad, leading his parents to agree with them. Slowly and surely, his parents come around despite their own misgivings and finally donate their own eyes.\nAs he continues with his work he gets the opportunity to team up with his class teacher who decides to help him with awareness. She writes a simple play about eye donation for Ramu to act in during the School's anniversary. The play is a huge success, impressing even the Panchayat President who agrees to open an eye donation camp for the village. But..... makes the climax of the story."
}