{
    "id": "15768122",
    "localized title": "Halkie Fulkee",
    "cast": [
        "Satvi Choksi",
        "Purvi Desai",
        "Bhavwini Gandhi",
        "Bhavwini Gandhi",
        "Manasi Prabhakar Joshi",
        "Neha Mehta",
        "Rachana Pakai",
        "Aanchal Shah",
        "Anandee Tripathi",
        "Disha Savla Upadhyay"
    ],
    "genres": "Family",
    "runtimes": "148",
    "countries": "India",
    "country codes": "in",
    "language codes": "gu",
    "color info": "Color",
    "sound mix": "D-Cinema 48kHz 5.1",
    "certificates": "India:U",
    "original air date": "17 Dec 2021 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTkyMDMyMGQtZTVkOS00ZGVmLTg2ZDUtNzdhMjkwYjg5NTZmXkEyXkFqcGdeQXVyMTEwNzIxOTU1._V1_SY150_CR99,0,101,150_.jpg",
    "imdbID": "15768122",
    "plot outline": "Halkie Fulkee revolves around 9 ladies spend some quality time with each other periodically. When the time comes, will they stick through the bad times? When they are in a jogger's park or a restaurant or a movie theatre or a footpath, they make fun of everyone mangiest them and around to put a smile in this otherwise chaotic world.",
    "languages": "Gujarati",
    "title": "Halkie Fulkee",
    "kind": "movie",
    "directors": "Jayant Gilatar",
    "writers": [
        "Jayant Gilatar",
        "",
        "Geeta Manek",
        "",
        "Divyakant Pandya",
        "",
        "Aashu Patel"
    ],
    "producers": [
        "Atul M. Bosamiya",
        "Jayant Gilatar",
        "Jiten Purohit",
        "Shatrughnasinh Solanki"
    ],
    "composers": "Yug Bhusal",
    "assistant directors": [
        "Chirag Makwana",
        "Hardik Solanki"
    ],
    "music department": "Suyog Churi",
    "miscellaneous": [
        "Saahil Goradia",
        "Sumeet Goradia"
    ],
    "thanks": [
        "Niraj Navadiya",
        "Chintan Patoliya",
        "Navisha Patoliya"
    ],
    "akas": "Halkie Fulkee (India)",
    "writer": [
        "Jayant Gilatar",
        "Geeta Manek",
        "Divyakant Pandya"
    ],
    "director": "Jayant Gilatar",
    "production companies": [
        "JJ Creations",
        "Shivam Cinema Vision"
    ],
    "distributors": "Panorama Studios Distribution",
    "plot": "_Halkie Fulkee_ (qv) revolves around 9 ladies spend some quality time with each other periodically. When the time comes, will they stick through the bad times? When they are in a jogger's park or a restaurant or a movie theatre or a footpath, they make fun of everyone mangiest them and around to put a smile in this otherwise chaotic world.",
    "synopsis": "The story revolves around 9 ladies (Aneri, Anandi, Policybhabhi, Kirti, Shakti, Gayatri,\nNeerja, Pari, Vani) who make their fortune happy and personal by spending time with each\nother at around 20-25 days interval from their established home and professional roles set\nin their social life. They are housewives, dubbing artists, interior designers, life insurance\npolicy agents but in the few afternoon hours which they spend at the group's respected\nmember Aneri's home or any mall, theatre, garden or pub, they try not to be either one of\nthem or just mother, sister, wife. They believe in a crazy and fun-filled 'me' (us) time.\nWhen we look into their lives we see how they handle some usual and some unusual\nconflicts with each others' supportive shoulders. Aneri, an alone but joyful diva, is dealing\nwith her spoiled niece with a bag full of insults and shameful accusations. Anandi, a chirpy\nand helpful woman, chooses between her selfish husband and ailing father. Policybhabhi, a\nlower-middle-class village rooted innocent and confident woman, is making her way into\nthe hearts of everyone and getting help for her family dreams. Kirti, an arrogant and\nself-centered upper society middle-aged woman, can't help herself with the attitude of life\nbut learn something valuable. Shakti, a brave Tomboy and family woman, speaks and acts\nthe truth of society. Gayatri, a hefty and happy-go-lucky woman, brings light moments in\nher surroundings. Neerja, a working professional, is busy convincing her orthodox\nmother-in-law how a family can hold together despite challenges. Pari, a beautiful wife of a\nGynec, wants to give all the love to her husband but make her own life troublesome. Vani, a\ndreamer, fights with the odds in the family to make way for her passion.\nThis film would make the audience feel instant relevance with what the characters of the\nfilm do, feel, and go through in their lives. All the smiles, tears, anger, laughter, and even the\nsilences are reflections of what such a ladies' party group would emote in real life.\nThe strong bond of the group lifts up their individuality and when they are together, the\nworld around them also learns to live a blissful and delightful life. When they are in a\njogger's park or a restaurant or a movie theatre or a footpath, they make fun of every one\nmangiest them and around to put a smile in this otherwise chaotic world.\nBut one day their joyous journey and happy hugs find it's way into an intense and dramatic\ncircumstance where emotions and support seem bound. One of their close family members\nis in a life or death situation but that's not where it ends. They find themselves at a stage\nwhere even a life or death could bring a lot of questions on almighty God's cruelty.\nBut it's all worth it when they stand by each other with all the heartfelt love."
}