{
    "id": "0046085",
    "localized title": "Mogambo",
    "cast": [
        "Clark Gable",
        "Ava Gardner",
        "Grace Kelly",
        "Donald Sinden",
        "Philip Stainton",
        "Eric Pohlmann",
        "Laurence Naismith",
        "Denis O'Dea",
        "Samburu",
        "Wagenia",
        "Bahaya",
        "M'Beti",
        "Asa Etula",
        "Bruce Seton"
    ],
    "genres": [
        "Adventure",
        "Drama",
        "Romance"
    ],
    "runtimes": "116",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "1.37 : 1",
    "sound mix": "Mono::(Western Electric Recording)",
    "certificates": [
        "Argentina:Atp",
        "Australia:G",
        "Australia:PG",
        "Brazil:12::(video rating)",
        "Canada:PG::(video rating)",
        "Finland:K-16",
        "France:12::(video rating)",
        "Germany:12::(video rating)",
        "Italy:T",
        "Japan:PG-12::(video rating)",
        "Netherlands:18",
        "Netherlands:18",
        "Norway:7::(recommended rating)",
        "Norway:16",
        "Philippines:PG-13::(MTRCB)",
        "Portugal:M/12",
        "Singapore:PG::(video rating)",
        "South Africa:PG::(video rating)",
        "South Korea:12::(video rating)",
        "Spain:14::(ICAA)",
        "Sweden:15",
        "United Kingdom:U",
        "United Kingdom:PG::(video rating)",
        "United Kingdom:U",
        "(video rating: 111m)",
        "United States:Passed::(National Board of Review)",
        "United States:Approved",
        "United States:TV-PG::(TV Rating)",
        "West Germany:12::(f)"
    ],
    "original air date": "09 Oct 1953 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzIxMTI3ZTEtMmQzNi00ZWE0LTk4YmYtMzE1MWFmODc0ZDIzXkEyXkFqcGdeQXVyNTkxMzEwMzU@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0046085",
    "plot outline": "Victor Marswell runs a big game trapping company in Kenya. Eloise Kelly is ditched there, and an immediate attraction happens between them. Then Mr. and Mrs. Nordley show up for their gorilla documenting safari. Mrs. Nordley is not infatuated with her husband any more, and takes a liking to Marswell. The two men and two women have some difficulty arranging these emotions to their mutual satisfaction, but eventually succeed.",
    "languages": "English",
    "title": "Mogambo",
    "kind": "movie",
    "directors": "John Ford",
    "writers": [
        "John Lee Mahin",
        "",
        "Wilson Collison"
    ],
    "producers": "Sam Zimbalist",
    "cinematographers": [
        "Robert Surtees",
        "Freddie Young"
    ],
    "editors": "Frank Clarke",
    "editorial department": "Brian Blamey",
    "art directors": "Alfred Junge",
    "costume designers": "Helen Rose",
    "make up department": [
        "Colin Garde",
        "Maude Onslow",
        "John Truwe"
    ],
    "production managers": [
        "Roy Parkinson",
        "Stanley Goldsmith"
    ],
    "assistant directors": [
        "Cecil F. Ford",
        "Wingate Smith",
        "John Pellatt",
        "Peter Price"
    ],
    "sound department": [
        "Sash Fisher",
        "A.W. Watkins",
        "John Aldred",
        "Hugh Strain"
    ],
    "special effects": [
        "Tom Howard",
        "Bert Monk"
    ],
    "stunts": "Bunny Allen",
    "camera department": [
        "Cecil Cooney",
        "Skeets Kelly",
        "Neil Binney",
        "Freddie Cooper",
        "Stephen Dade",
        "Jackson Drury",
        "Kelvin Pike",
        "Jack Whitehead",
        "Doug Wolf"
    ],
    "script department": "Angela Martelli",
    "miscellaneous": [
        "Joan Bridge",
        "Bunny Allen",
        "Frank Allen",
        "Yakima Canutt",
        "Eva Monley"
    ],
    "akas": [
        "Mogambo - Abenteuer in Afrika (Germany)",
        "モガンボ (Japan, Japanese title)",
        "Могамбо (Soviet Union, Russian title)",
        "Могамбо (Bulgaria, Bulgarian title)",
        "Μογκάμπο (Greece)"
    ],
    "writer": [
        "John Lee Mahin",
        "Wilson Collison"
    ],
    "director": "John Ford",
    "production companies": "Metro-Goldwyn-Mayer (MGM)",
    "distributors": [
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro",
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro-Goldwyn-Mayer (MGM)",
        "Metro-Goldwyn-Mayer British Studios",
        "MGM/UA Home Entertainment",
        "Chapel Distribution",
        "Warner Home Video",
        "Warner Home Video",
        "Living Colour Entertainment",
        "FR3",
        "Home Box Office (HBO)",
        "SFM Entertainment"
    ],
    "other companies": [
        "Government Officials of Kenya Colony",
        "Government Officials of Tanganyika",
        "Government Officials of The Ugandan Protectorate",
        "Government Officials of The Republic of French Equatorial Africa",
        "Samburu Tribe of Kenya Colony"
    ],
    "plot": [
        "On a Kenyan safari, white hunter Victor Marswell has a love triangle with seductive American socialite Eloise Kelly and anthropologist Donald Nordley's cheating wife Linda.",
        "Victor Marswell runs a big game trapping company in Kenya. Eloise Kelly is ditched there, and an immediate attraction happens between them. Then Mr. and Mrs. Nordley show up for their gorilla documenting safari. Mrs. Nordley is not infatuated with her husband any more, and takes a liking to Marswell. The two men and two women have some difficulty arranging these emotions to their mutual satisfaction, but eventually succeed.::Rob Hardy <ai822@dayton.wright.edu>",
        "Victor Marswell lives in East Africa capturing live animals for zoos and circuses. He returns from safari to find that the attractive Honey Bear Kelly has arrived, expecting to meet a friend who left Marswell's camp the week before. The hard-living Marswell and the seductive Kelly seem made for each other and there's an instant attraction. That is until Linda Nordley and her scientist-husband arrive for a safari. Marswell finds himself strangely attracted to the demure Mrs. Nordley and those feelings are reciprocated. The result is a love triangle with all of the mixed, raw emotion that usually provides.::garykmcd",
        "Having missed connections with a maharajah, gorgeous, adaptable playgirl Eloise Kelly descends upon white hunter Vic Marswell. After brief resistance, they fall into each other's arms. Then anthropologist Donald Nordley arrives; Vic is inexplicably drawn to Mrs. Nordley, a blonde twit. Kelly, her departure delayed, must go along on the Nordley safari where the two women clash over Vic. Much local color along the way.::Rod Crawford <puffinus@u.washington.edu>",
        "Victor Marswell lives in Africa and captures live animals for zoos, circuses and animal trainers. He also takes visitors on safari. He returns to his camp one day to find that a sexy American, Honey Bear Kelly, has arrived unannounced. She was invited by an Indian Maharajah who has since left. She and Marswell are attracted to one another but after the arrival of an anthropologist and his wife, Donald and Linda Nordley, Marswell develops an interest in the beautiful Linda. As they all set off on safari to find gorillas for Donald Nordley's research, tensions rise as both women desire Marswell.::garykmcd"
    ],
    "synopsis": "This movie is the remake of Red Dust, a 1932 MGM movie also starred Clark Gable.Clark Gable plays Victor Marswell, the rough-edged owner of a safari guide company that specialises in capturing and selling wild animals to zoos and circus.The company's formal owner, a maharajah named Bunganor, had met a less-than-reputable beauty Eloise Kelly (Ava Gardner) in New York and invited her to join him in Africa. But Eloise arrived on the safari only to find that the maharajah had gone back to India and that she had to wait a week for the next boat.During the week, Victor started a short-lived romance with Eloise, although he didn't think much of her to take her seriously. Eloise was already in love with Victor but decided to leave as planned.The same boat also brought in Victor's client - an anthropologist named Donald Nordley had hired Victor has a guide for his research on gorillas. Accompanying Donald was another beautiful woman - his wife Linda (Grace Kelly).Eloise's boat was nearly shipwrecked and would take four weeks to repair, so returns Eloise the Vamp to battle with Linda the Damsel in Distress for Victor's affections.Victor decided to take Eloise with the Nordleys on their tour and drop her off at Kenya Station, where transportation could be easily arranged. Upon reaching Kenya Station, they found that the natives have revolted against the British over ivory poaching and the commanding officer was injured. Eloise now had no choice but to follow the group into gorilla country until Victor can make other arrangements.Unlike Eloise, Linda was brought up in a sheltered upper-class circle and did not adjust to the jungle life well. The excitement and fright she felt about her new surrounding intensified Victor's appeal, and Victor found himself falling in love with Linda. The two started an affair and Linda decided to leave Donald. A broken-hearted Eloise looked on and tried to talk senses into the lovers; her efforts were appreciated by Victor, and snubbed at by Linda.After a talk with Donald, Victor saw how much Donald loves Linda and that she can never survive his safari lifestyle. Eloise helped Victor staged an act to break off the affair and decided to leave Victor for good. As they said goodbye Victor proposed, and a tearful Eloise jumped off the canoe and walked right into Victor's arms."
}