{
    "id": "0104098",
    "localized title": "Dharavi",
    "cast": [
        "Somesh Agarwal",
        "Shabana Azmi",
        "Pramod Bala",
        "Madhuri Dixit",
        "Anil Kapoor",
        "Mushtaq Khan",
        "Satish Khopkar",
        "Anjana Mumtaz",
        "Chandu Parkhi",
        "Om Puri",
        "Deepak Qazir",
        "Virendra Saxena",
        "Shakti Singh",
        "Raghuvir Yadav"
    ],
    "genres": [
        "Crime",
        "Drama"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Stereo",
    "certificates": [
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "09 Apr 1992 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzhjNzA2YTUtMDU2Yi00N2I5LTlmMTgtNmJhYzUzNTBmODdkXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "0104098",
    "plot outline": "Dharavi - known as the biggest slums on Earth, has many people living in abject poverty and destitute conditions. One such person is Rajkaran a taxi driver by profession, who has bought a taxi and is still for it in small installments. He, his wife, Kumud, and his son live in small tenement. Electricity and water are not available legally, but can be obtained illegally by paying middlemen, who in turn bribe the police and the Bombay Municipal Corporation (BMC) officials. Rajkaran's dream is to own his taxi, and start his own business - of dyeing clothes. His dream comes to light, when he, along with three others, acquire the necessary land and building for it. Once started, things start looking up for Rajkaran, and he even has his mom, Amma come over to live with them. Then things take a turn for the worse - the building is deemed illegal by the BMC and is demolished; Rajkaran and his associates are unable to protect nor save their investment; Unable to pay for his taxi, his vehicle is taken away; His associates refuse to co-operate with him nor even speak with him; His mother finds out that his wife is having an affair with her ex-husband, Shankar; In desperation, Rajkaran takes up another job as a taxi-driver and robs a passenger, and ends up in jail; His brother-in-law is killed by rivals; His mother, unable to see her son's suffering and misery decides to go back to her home-town; and Kumud leaves him to go back to her ex-husband. Rajkaran comes out of jail, thanks to a corrupt system and false witnesses, and is back on square one again - homeless and penniless - he must now decide what is best for him and the rest of his life.",
    "languages": "Hindi",
    "title": "Dharavi",
    "kind": "movie",
    "directors": "Sudhir Mishra",
    "writers": "Sudhir Mishra",
    "producers": [
        "Ravi Malik",
        "N.P. Mukne"
    ],
    "composers": "Rajat Dholakia",
    "cinematographers": "Rajesh Joshi",
    "editors": "Renu Saluja",
    "art directors": "Subash Sinha Roy",
    "costume designers": "Vandana Khanna",
    "production managers": "Nitin Chandrachud",
    "assistant directors": "Rajesh Singh",
    "sound department": [
        "Madhu Apsara",
        "Hitendra Ghosh"
    ],
    "stunts": "Ravi Dewan",
    "akas": "Dharavi (India)",
    "writer": "Sudhir Mishra",
    "director": "Sudhir Mishra",
    "production companies": [
        "Doordarshan",
        "National Film Development Corporation"
    ],
    "plot": [
        "Rajkaran lives in _Dharavi_ (qv), the biggest slum in the world. He aspires to start his own business and even manages to do it. But several misfortunes land him back to square one, penniless and alone.",
        "_Dharavi_ (qv) - known as the biggest slums on Earth, has many people living in abject poverty and destitute conditions. One such person is Rajkaran a taxi driver by profession, who has bought a taxi and is still for it in small installments. He, his wife, Kumud, and his son live in small tenement. Electricity and water are not available legally, but can be obtained illegally by paying middlemen, who in turn bribe the police and the Bombay Municipal Corporation (BMC) officials. Rajkaran's dream is to own his taxi, and start his own business - of dyeing clothes. His dream comes to light, when he, along with three others, acquire the necessary land and building for it. Once started, things start looking up for Rajkaran, and he even has his mom, Amma come over to live with them. Then things take a turn for the worse - the building is deemed illegal by the BMC and is demolished; Rajkaran and his associates are unable to protect nor save their investment; Unable to pay for his taxi, his vehicle is taken away; His associates refuse to co-operate with him nor even speak with him; His mother finds out that his wife is having an affair with her ex-husband, Shankar; In desperation, Rajkaran takes up another job as a taxi-driver and robs a passenger, and ends up in jail; His brother-in-law is killed by rivals; His mother, unable to see her son's suffering and misery decides to go back to her home-town; and Kumud leaves him to go back to her ex-husband. Rajkaran comes out of jail, thanks to a corrupt system and false witnesses, and is back on square one again - homeless and penniless - he must now decide what is best for him and the rest of his life.::rAjOo (gunwanti@hotmail.com)"
    ]
}