{
    "id": "0113483",
    "localized title": "Joseph",
    "cast": [
        "Ben Kingsley",
        "Paul Mercurio",
        "Martin Landau",
        "Lesley Ann Warren",
        "Alice Krige",
        "Dominique Sanda",
        "Warren Clarke",
        "Stefano Dionisi",
        "Gloria Carlin",
        "Michael Angelis",
        "Vincenzo Nicoli",
        "Colin Bruce",
        "Michael Attwell",
        "Davide Cincis",
        "Rodolfo Corsato",
        "Pete Lee-Wilson",
        "Selva Rasalingam",
        "Diego Wallraff",
        "Michael Zimmermann",
        "Paloma Baeza",
        "Anna Mazzotti",
        "Valeria Cavalli",
        "Kelly Miracco",
        "Jamie Glover",
        "Rinaldo Rocco",
        "Timur Yusef",
        "Brett Warren",
        "Andrew Clover",
        "Arthur Brauss",
        "Eric P. Caspar",
        "Anton Alexander",
        "Milton Johns",
        "Renato Scarpa",
        "Peter Eyre",
        "Timothy Bateson",
        "Nadim Sawalha",
        "Josh Maguire",
        "Gabriel Thomson",
        "Oliver Cotton",
        "Anna Zapparoli",
        "Monica Bellucci"
    ],
    "genres": [
        "Adventure",
        "Biography",
        "Drama",
        "History"
    ],
    "runtimes": "185",
    "countries": [
        "Italy",
        "Germany",
        "United States"
    ],
    "country codes": [
        "it",
        "de",
        "us"
    ],
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "1.33 : 1",
    "sound mix": "Stereo",
    "certificates": [
        "Argentina:13",
        "Australia:M",
        "Germany:6",
        "Netherlands:MG6"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWEwZGE2NTItOTIyYy00ZTY4LWE3NTctN2VmZjg5MTk3MWQzXkEyXkFqcGdeQXVyNzMwOTY2NTI@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "0113483",
    "plot outline": "The story begins in Egypt, in the marketplace of Avaris where Joseph is sold as a slave to Potiphar, the Pharaoh's Chief Steward. Joseph, the favored son of the patriarch Jacob, was given into captivity by his own envious brothers. A tireless and highly productive worker, Joseph wins his master's trust and is named steward of Potiphar's household. However, Joseph also unwittingly arouses the lust of Potiphar's wife. Luring him into her room one day, she orders Joseph to give her pleasure. But Joseph prefers punishment, even death, to betraying his master. As he flees from the room, the desperate woman tears off Joseph's garment and brandishes it as proof of her violation. As Potiphar questions him, Joseph begins to narrate the story of his past, a tale of suffering and hardship. We flash back to the time when Jacob and his family settled near the town of Schechem. It is a brief and unhappy stay, for when Jacob's daughter Dinah is ravished by the young prince of Schechem, Jacob's sons decide to exact revenge with a bloodbath - despite an agreement reached between Jacob and the Schechemites. As Jacob and his family flee, Rachel, Jacob's beloved wife, dies while giving birth to Benjamin. A few years elapse, and Jacob's older sons become increasingly resentful of their father's preference for Joseph. When Joseph turns seventeen, his father has a wonderful colored coat made for him, which further excites the jealousy of the brothers. When Joseph is sent to a distant pasture one day to look after his brothers, they seize him, tear off his coat, throw him into a dry well and, the following day, sell him as a slave to traders on their way to Egypt. This is how he enters the service of Potiphar. Despite his doubts about his wife's version of the \"rape\", Potiphar has Joseph jailed to vindicate his wife publicly. In prison, Joseph is assigned to attend two high court officials who are suspected of having stolen a bracelet from the Pharaoh. Tormented by dreams, the men ask Joseph for help. Joseph tells the cup-bearer that he will be reinstated, and the chief-baker that he will hang. Two years later, the cup-bearer remembers Joseph when the Pharaoh is unable to obtain from his priests a rational interpretation of two anguishing dreams. Joseph is summoned and predicts that after seven years of plentiful harvest, Egypt will suffer seven years of famine. Convinced, the Pharaoh appoints Joseph as his chancellor and gives him a beautiful Egyptian woman as his wife. Joseph immediately begins to put aside a fifth of the country's harvest. After seven years a murderous famine strikes, driving people from nations near and far to come to Egypt to buy grain. Among the famished, Joseph recognizes his brothers. Testing them to see if they have changed, Joseph is satisfied and reveals his identity. Finally reunited with his beloved brother Benjamin and his father Jacob, Joseph reconciles with his family, and the Pharaoh invites them to settle in Egypt as overseers of his livestock.",
    "languages": "English",
    "title": "Joseph",
    "kind": "tv mini series",
    "series years": "1995-1995",
    "akas": [
        "Giuseppe (Italy)",
        "Die Bibel: Josef (Germany)",
        "La bible: Joseph (France)",
        "La Biblia: José (Spain)",
        "József (Hungary)"
    ],
    "seasons": "1",
    "writer": [
        "James Carrington",
        "Lionel Chetwynd"
    ],
    "production companies": [
        "Beta Film",
        "Lube",
        "Lux Vide",
        "Quinta Communications",
        "Turner Pictures"
    ],
    "distributors": [
        "Con Dios Entertainment",
        "Flashstar Home Vídeo",
        "Kinowelt Home Entertainment",
        "TNT",
        "Trinity Broadcasting Network (TBN)"
    ],
    "other companies": [
        "Accademia Polifonia Di Roma",
        "Achouba Productions",
        "Alitalia",
        "Biblical Studio Morocco",
        "Broking Italia",
        "Buena Vista Sound",
        "Echo Film Services",
        "Fonima Studio",
        "Gioielli L.A.B.A. Roma",
        "LVR",
        "Orchestra dell'Unione Musicisti di Roma (U.M.R.)",
        "Panalight",
        "Rocchetti e Carboni",
        "Royal Air Maroc",
        "Symphonic Orchestra and Chorus of Rome",
        "Technicolor SIA & Rue",
        "Technovision",
        "Trasporti Cinematografici Tranquilli (TCT)"
    ],
    "plot": [
        "The Biblical story of _Joseph_ (qv), who was sold to slavery by his brothers who were jealous of his prophetic abilities to analyze dreams and of his being their father's favorite.",
        "The story begins in Egypt, in the marketplace of Avaris where _Joseph_ (qv) is sold as a slave to Potiphar, the Pharaoh's Chief Steward. _Joseph_ (qv), the favored son of the patriarch Jacob, was given into captivity by his own envious brothers. A tireless and highly productive worker, _Joseph_ (qv) wins his master's trust and is named steward of Potiphar's household. However, _Joseph_ (qv) also unwittingly arouses the lust of Potiphar's wife. Luring him into her room one day, she orders _Joseph_ (qv) to give her pleasure. But _Joseph_ (qv) prefers punishment, even death, to betraying his master. As he flees from the room, the desperate woman tears off _Joseph_ (qv)'s garment and brandishes it as proof of her violation. As Potiphar questions him, _Joseph_ (qv) begins to narrate the story of his past, a tale of suffering and hardship. We flash back to the time when Jacob and his family settled near the town of Schechem. It is a brief and unhappy stay, for when Jacob's daughter Dinah is ravished by the young prince of Schechem, Jacob's sons decide to exact revenge with a bloodbath - despite an agreement reached between Jacob and the Schechemites. As Jacob and his family flee, Rachel, Jacob's beloved wife, dies while giving birth to Benjamin. A few years elapse, and Jacob's older sons become increasingly resentful of their father's preference for _Joseph_ (qv). When _Joseph_ (qv) turns seventeen, his father has a wonderful colored coat made for him, which further excites the jealousy of the brothers. When _Joseph_ (qv) is sent to a distant pasture one day to look after his brothers, they seize him, tear off his coat, throw him into a dry well and, the following day, sell him as a slave to traders on their way to Egypt. This is how he enters the service of Potiphar. Despite his doubts about his wife's version of the \"rape\", Potiphar has _Joseph_ (qv) jailed to vindicate his wife publicly. In prison, _Joseph_ (qv) is assigned to attend two high court officials who are suspected of having stolen a bracelet from the Pharaoh. Tormented by dreams, the men ask _Joseph_ (qv) for help. _Joseph_ (qv) tells the cup-bearer that he will be reinstated, and the chief-baker that he will hang. Two years later, the cup-bearer remembers _Joseph_ (qv) when the Pharaoh is unable to obtain from his priests a rational interpretation of two anguishing dreams. _Joseph_ (qv) is summoned and predicts that after seven years of plentiful harvest, Egypt will suffer seven years of famine. Convinced, the Pharaoh appoints _Joseph_ (qv) as his chancellor and gives him a beautiful Egyptian woman as his wife. _Joseph_ (qv) immediately begins to put aside a fifth of the country's harvest. After seven years a murderous famine strikes, driving people from nations near and far to come to Egypt to buy grain. Among the famished, _Joseph_ (qv) recognizes his brothers. Testing them to see if they have changed, _Joseph_ (qv) is satisfied and reveals his identity. Finally reunited with his beloved brother Benjamin and his father Jacob, _Joseph_ (qv) reconciles with his family, and the Pharaoh invites them to settle in Egypt as overseers of his livestock.::Anonymous"
    ],
    "synopsis": "The Old Testament story of Joseph, favorite son of Jacob (Martin Landau) and great-grandson of Abraham, who was sold into slavery by his brothers, but who rose to become prime minister of Egypt. Joseph (Paul Mercurio) governed the country during a seven-year famine, during which his brothers visited Egypt seeking grain, only to encounter their brother, whom they had long presumed dead. Also features Ben Kingsley and Leslie Anne Warren."
}