{
    "id": "0249361",
    "localized title": "Annamayya",
    "cast": [
        "Nagarjuna Akkineni",
        "Suman",
        "Bhanupriya",
        "Mohan Babu",
        "Srikanya",
        "Kasthuri",
        "Ramya Krishnan",
        "Roja",
        "Ananth",
        "Babu Mohan",
        "Tanikella Bharani",
        "Brahmanandam",
        "Gundu Hanumantha Rao",
        "Jenny",
        "Balaiah M.",
        "Mallikharjunarao",
        "Siva Parvathi",
        "Kota Srinivasa Rao",
        "A.V.S. Subramanyam",
        "Suthi Velu"
    ],
    "genres": [
        "Biography",
        "Drama",
        "History",
        "Music"
    ],
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": [
        "India:U",
        "United States:Not Rated"
    ],
    "original air date": "22 May 1997 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjFjMDIxY2ItOWM5Mi00NTBjLWE0YTQtNjQ5YjhjY2RkMDIzXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0249361",
    "plot outline": "Lord Vishnu listens to requests from his consort Lakshmi, that there weren't many people singing songs in praise of the Lord in Telugu language. In response, the Lord sends his sword Nandaka, to be born as Annamacharya (Annamayya) to a childless couple - Narayana Suri and Lakkamba in Tallapaka village, Kadapa District. Growing as a normal young man, Annamayya is in love with his 2 cousins Timakka and Akkalamma and thinks that his cousins are the most beautiful creations of god. Lord Vishnu appears in front of Annamayya in disguise and accepts a challenge from him to show someone more beautiful than his cousins - God in the form of Lord Venkateswara in a temple in his village. Upon discovering the beauty of the Lord, Annamayya is lost in a different world and ends up making a pilgrimage to Tirumala Venkateswara Temple without planning or informing his parents. As he finds pilgrims entering the holy hills (Saptagiri- seven hills), he embarks his journey towards Him. But, he is lost and is helped by Goddess Lakshmi herself in the form of an old lady by informing him that his footwear was preventing his progress. Also weakened by fasting, Annamayya accepts Laddu - a prasadam from the food consecrated by the Lord himself. Upon reaching Tirumala, he is enthralled by the beauty of God and settles there to write and sing hymns in praise of the Lord.",
    "languages": "Telugu",
    "title": "Annamayya",
    "kind": "movie",
    "directors": "K. Raghavendra Rao",
    "writers": [
        "J.K. Bharavi",
        "",
        "J.K. Bharavi"
    ],
    "producers": [
        "Doraswamy Raju",
        "Vijay Kumar Varma"
    ],
    "composers": "M.M. Keeravani",
    "cinematographers": "Ajay Vincent",
    "editors": "A. Sreekar Prasad",
    "art directors": "Bhaskara Raju V.",
    "costume designers": "T. Babu Rao",
    "make up department": "Bommadevara Ramchandra Rao",
    "sound department": "Graham Edmondson",
    "visual effects": "Rajiv Raghunathan",
    "camera department": "Sriwass",
    "costume departmen": "P. Shekar Babu",
    "music department": [
        "Anand",
        "S.P. Balasubrahmanyam",
        "J.K. Bharavi",
        "Anand Bhattacharya",
        "K.S. Chithra",
        "Gangadhar",
        "M.M. Keeravani",
        "Mano",
        "Anuradha Paudwal",
        "Purnachandhar",
        "Renuka",
        "Sailaja S.P.",
        "M.M. Srilekha",
        "Sujatha"
    ],
    "miscellaneous": [
        "D.K.S. Babu",
        "Suchithra Chandrabose"
    ],
    "thanks": "Arjuna Raju",
    "writer": [
        "J.K. Bharavi",
        "J.K. Bharavi"
    ],
    "director": "K. Raghavendra Rao",
    "production companies": "V.M.C. Productions",
    "distributors": [
        "V.M.C. Productions",
        "M.G. Movies",
        "Volga Videos"
    ],
    "other companies": [
        "National Litho Printers",
        "Prasad Film Laboratories P. Ltd.",
        "Super Cassettes Industries Limited (T-Series)"
    ],
    "plot": [
        "A cinematic version of the life of famous Indian saint-poet, _Annamayya_ (qv).",
        "Lord Vishnu listens to requests from his consort Lakshmi, that there weren't many people singing songs in praise of the Lord in Telugu language. In response, the Lord sends his sword Nandaka, to be born as Annamacharya (_Annamayya_ (qv)) to a childless couple - Narayana Suri and Lakkamba in Tallapaka village, Kadapa District. Growing as a normal young man, _Annamayya_ (qv) is in love with his 2 cousins Timakka and Akkalamma and thinks that his cousins are the most beautiful creations of god. Lord Vishnu appears in front of _Annamayya_ (qv) in disguise and accepts a challenge from him to show someone more beautiful than his cousins - God in the form of Lord Venkateswara in a temple in his village. Upon discovering the beauty of the Lord, _Annamayya_ (qv) is lost in a different world and ends up making a pilgrimage to Tirumala Venkateswara Temple without planning or informing his parents. As he finds pilgrims entering the holy hills (Saptagiri- seven hills), he embarks his journey towards Him. But, he is lost and is helped by Goddess Lakshmi herself in the form of an old lady by informing him that his footwear was preventing his progress. Also weakened by fasting, _Annamayya_ (qv) accepts Laddu - a prasadam from the food consecrated by the Lord himself. Upon reaching Tirumala, he is enthralled by the beauty of God and settles there to write and sing hymns in praise of the Lord.::_Annamayya_ (qv)"
    ]
}