{
    "id": "0292160",
    "localized title": "Onnu Muthal Poojyam Vare",
    "cast": [
        "Mohanlal",
        "Asha Jayaram",
        "Nedumudi Venu",
        "Shari",
        "Sukumari",
        "Prathap Pothen",
        "Geethu Mohandas",
        "Suresh Gopi",
        "Mukesh",
        "Sainuddin",
        "Kalabhavan Rahman"
    ],
    "genres": "Drama",
    "runtimes": "105",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "sound mix": "Stereo",
    "certificates": [
        "India:U",
        "United States:Not Rated"
    ],
    "original air date": "20 Oct 1986 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYmU5MWIyM2UtNWE3MS00OTBhLWI2ZjMtZGM2MTQyMjJiZDRmXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0292160",
    "plot outline": "The film sheds light on the story of Aleena (Asha Jayaram), a widow and her four-year-old daughter Deepamol (Geethu Mohandas). Aleena lives with her daughter treasuring the memories of her late husband (Prathap Pothan) in a big house. She repeatedly dismisses the notion of remarriage. She is a painter and works in the advertising industry. Deepamol is a bubbly little girl always playing around with the telephone making random calls. One such call turns their life forever when Deepamol gets in contact with her \"Telephone uncle\" (Mohanlal). Deepamol gets attached to Telephone uncle very fast. Though Aleena was on the fence and skeptical of the man's intentions, she eventually falls in love. Telephone uncle resists the coercions from the mother and never reveals his name or whereabouts. Finally, he comes to their place on the night of Deepamol's birthday raising Aleena's hope for a better life, only to put an end to it within a very short time. Watch the full movie Onnu Muthal Poojyam Vare online, only on Eros Now.",
    "languages": "Malayalam",
    "title": "Onnu Muthal Poojyam Vare",
    "kind": "movie",
    "directors": "Reghunath Paleri",
    "writers": "Reghunath Paleri",
    "producers": [
        "Navodaya Appachan",
        "Jijo Punnoose"
    ],
    "composers": "Mohan Sitara",
    "cinematographers": "Shaji N. Karun",
    "editors": "T.R. Shekhar",
    "casting directors": "Rajeev Kumar",
    "make up department": "Pattanam Rasheed",
    "assistant directors": "Rajeev Kumar",
    "music department": [
        "K.S. Chithra",
        "O.N.V. Kurup",
        "G. Venugopal"
    ],
    "miscellaneous": "Gayathri Ashokan",
    "writer": "Reghunath Paleri",
    "director": "Reghunath Paleri",
    "production companies": "Navodaya",
    "plot": "The film sheds light on the story of Aleena (Asha Jayaram), a widow and her four-year-old daughter Deepamol (Geethu Mohandas). Aleena lives with her daughter treasuring the memories of her late husband (Prathap Pothan) in a big house. She repeatedly dismisses the notion of remarriage. She is a painter and works in the advertising industry. Deepamol is a bubbly little girl always playing around with the telephone making random calls. One such call turns their life forever when Deepamol gets in contact with her \"Telephone uncle\" (Mohanlal). Deepamol gets attached to Telephone uncle very fast. Though Aleena was on the fence and skeptical of the man's intentions, she eventually falls in love. Telephone uncle resists the coercions from the mother and never reveals his name or whereabouts. Finally, he comes to their place on the night of Deepamol's birthday raising Aleena's hope for a better life, only to put an end to it within a very short time. Watch the full movie _Onnu Muthal Poojyam Vare_ (qv) online, only on Eros Now."
}