{
    "id": "10045014",
    "localized title": "Rangu",
    "cast": [
        "Tanish Alladi",
        "Priya Singh",
        "Paruchuri Ravindranath",
        "Sameerdatta",
        "Paruchuri Venkateswara Rao",
        "Krishna Murali Posani",
        "Shafi",
        "Raghu Kumar Karumanchi",
        "Muktevi Prakasarao",
        "Aman Mettapalli"
    ],
    "genres": "Action",
    "runtimes": "156",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": "India:UA",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTI3NThmNzctOTM5MS00MDJhLTkxNDMtMDVmODI4NDhjMDNmXkEyXkFqcGdeQXVyNDI5NTI4Mjc@._V1_SY150_CR55,0,101,150_.jpg",
    "imdbID": "10045014",
    "plot outline": "\"Lara\" (Tanish) is a top ranker in his school. He joins the senior college for his graduation and starts a happy life. But his life becomes hell because of his senior \"Bandi Srinu\" (Sameer Datta), who is bad in his attitude. Left with no choice, Lara takes the violence route. He forcefully becomes a dreaded Rowdy. This is also the time when he falls in love with \"Purna\" (Priya Singh) and decides to start a new life. But to his bad luck, he becomes most wanted list in police.",
    "languages": "Telugu",
    "title": "Rangu",
    "kind": "movie",
    "directors": "Kaarthikeya Varikallu",
    "writers": [
        "Kaarthikeya Varikallu",
        "",
        "Kaarthikeya Varikallu",
        "",
        "Paruchuri Venkateswara Rao",
        "Gopalakrishna Paruchuri"
    ],
    "producers": [
        "Nalla Ayyanna Naidu",
        "Nalla Swami Naidu",
        "Padmanabha Reddy"
    ],
    "cinematographers": "T. Surendra Reddy",
    "editors": "Basva Paidi Reddy",
    "production managers": "Srinivasa Naidu Galaba",
    "stunts": "Real Sathish",
    "camera department": [
        "P. Anjibabu",
        "Jagadeesh Komari",
        "Rajarao Vallam",
        "N. Adarsh Varma"
    ],
    "music department": "Yogeshwar Sharma",
    "akas": "Rangu (India)",
    "writer": [
        "Kaarthikeya Varikallu",
        "Kaarthikeya Varikallu",
        "Paruchuri Venkateswara Rao"
    ],
    "director": "Kaarthikeya Varikallu",
    "production companies": "U&I Entertainments",
    "plot": [
        "\"_Rangu_ (qv)\" movie shot based on the true life story of a Vijayawada student \"LARA\", who faced bitter experiences and their Severe consequences in his life.",
        "\"Lara\" (Tanish) is a top ranker in his school. He joins the senior college for his graduation and starts a happy life. But his life becomes hell because of his senior \"Bandi Srinu\" (Sameer Datta), who is bad in his attitude. Left with no choice, Lara takes the violence route. He forcefully becomes a dreaded Rowdy. This is also the time when he falls in love with \"Purna\" (Priya Singh) and decides to start a new life. But to his bad luck, he becomes most wanted list in police.::Tambireddy Surendrareddy"
    ],
    "synopsis": "\"Lara\" is a top ranker in his school, joins the senior college for his graduation.\nBeginning day's of college, his senior Student \"Bandi Srinu\" and his gang, made him fool in the name of ragging in front of his girl friend. Unfortunately both of them wanted to love the same girl. Rivalry Started between Lara and Bandi Srinu because of the same girl. Gradually they are become two groups. One is \"Lara group\" another one is \"Bandi Srinu\" group.\nQuite often both the groups repeatedly fight unnecessarily. College Faculty also warns them so many times. Police also warned them repeatedly. At last both the groups compromised before the exams. In that occasion of compromise, when they are celebrating a drink party, all of sudden both the groups starts chasing an auto driver, who is the rival of Lara. Unexpectedly one of the strangers died because of Lara.\nA known lawyer of his family, bribes the Police inspector to get bail for Lara.\nLara get to involve in his friend's love issue. Police arrested Lara with the F.I.R; registered by the father of the bride groom. Lara came out from the lockup, with the support of M.L.A. Left with no choice, Lara takes the violence route. He forcibly becomes a dreaded Rowdy.\nThis is also the time when he falls in love with Purna and decides to start a new life. To earn money Lara started illegal settlements for the public issues. But to his bad luck, he becomes most wanted list in police along with co rowdy shatters.\nDay by day, Lara life becomes more and more complicated because of the sincere officer \"ACP Ravi\". ACP gave so many chances to Lara to rectify his mistakes, but Lara is totally against to the corrupted police system.\nSituations made him criminal !\nLara life in underground !!\nPurna is now pregnant !!!\nPoliticians also wanted to kill him !!!!\nCo rowdies are against him !!!!!\nSincere police \"ACP Ravi\" wanted to save Lara !!!!!!"
}