{
    "id": "15716784",
    "localized title": "Kinaare",
    "cast": [
        "Amrita Tanganiya",
        "Chirag Nagpal",
        "Rahul Shukla"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "original air date": "04 Nov 2022 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGYxYWY1YjctZjY0Yi00ZTZkLWI4NTctMWEwZWIzZjE4NDI1XkEyXkFqcGdeQXVyMTMyNjY2MDAx._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "15716784",
    "languages": "Hindi",
    "title": "Kinaare",
    "kind": "movie",
    "directors": "Udai k Ambastha",
    "writers": "Chirag Nagpal",
    "assistant directors": "Saurabh Shreyansh",
    "music department": [
        "Harsh Bidla",
        "Syed Amir Hussain",
        "Syed Amir Hussain"
    ],
    "akas": "Kinaare (India)",
    "writer": "Chirag Nagpal",
    "director": "Udai k Ambastha",
    "production companies": "Trividdha Films I",
    "synopsis": "True love is like parallels of a river, can flow together but can never meet. This narrative is a\ncycle of vicissitudes which pirouettes around fondness between Rohaan (Male lead) and Maira (Female lead).The story starts with the appearance of Mr. Verma, Maira's father waiting for the doctor in his cabin as Maira is admitted in heart hospital. As soon as doctor arrives, he discusses Maira's condition with the doctor. Doctor informs him about Maira not recovering and heart transplant would be impossible in this\nstate. Mr. Verma breaks down after hearing this because he is unprepared to bear the pain of losing his loved ones after the sudden demise of his wife, sister and brother in law. Since, he has to take care of Reet (his niece) too. Leaving the cabin, he calls Reet who lives in London to share everything. Reet gets upset after hearing everything and oddly starts blaming herself. She then comes to India and goes to the\nclub to see Rohaan, a rock star in his concert. She gets shocked as soon as Rohaan comes on stage\nbecause seeing him it is evident that he is in a state of depression (long dirty hair, reddish eyes with dark circles). During the concert, he sees Reet and hugs her warmly. They sit and talk and Reet asks him to come to the hospital but he refuses. (Rohaan and Maira were in a relationship during college days\nbut the two parted ways due to misunderstandings.) Reet convinces him and they visit hospital to see Maira. Seeing her in such condition, Rohaan faints. Now, both Rohaan and Maira are admitted in the\nhospital. A friend of Rohaan blames Maira for Rohaan's condition. After hearing this, Reet tells him that she is responsible for everything instead of Maira. She starts narrating everything and there comes a flashback. Flashback shows their college life and the love triangle between Reet, Rohaan and Maira. Rohaan loves Maira and Reet loves Rohaan. With the help of a boy named Parth (who loves Reet), Reet\ncreates misunderstanding between Rohaan and Maira wrongly which parted them away. But\nunfortunately, Rohaan hears all this. He gets angry at first but forgives Reet because now the biggest motive of his life is to save the life of Maira. Rohaan apologizes to Maira and promises to be with her forever. Maira starts recovering and her body is now ready for heart transplant but the doctors can't find a match for the transplant. Her health starts deteriorating and Rohaan tries to commit suicide so that he could give his heart but Reet stops him. Next day, Reet tells him that the operation was successful. But in reality, it was Rohaan's hallucination as doctors tell him that Reet met with an accident and gave her heart for operation so that Rohaan and Maira can live happily ever after.\nRohaan and Maira, the two parallels of a river meet but the river itself stops."
}