{
    "id": "1670249",
    "localized title": "Janaki",
    "cast": [
        "Leela Antharjjanam",
        "Prakash Bare",
        "Vinay Forrt",
        "Sajitha Madathil",
        "Krishna Padmakumar",
        "Sathi Premji",
        "Sreejith Ravi",
        "T.G. Ravi",
        "Antony Thekkek"
    ],
    "genres": [
        "Drama",
        "Family"
    ],
    "runtimes": "92",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "hi"
    ],
    "color info": "Color",
    "original air date": "23 Feb 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTA3NzIzNDktOWUyMS00NzQyLWFhN2YtNjRhNTQ5NWM4NmNkXkEyXkFqcGdeQXVyMjIzOTE0OTY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "1670249",
    "plot outline": "Janaki showcases the tumultuous life of 12 year old child, who lives in the unsafe openness of the street. Orphaned and abandoned, she goes through all the unpleasant odds until she finds abode at the Tharavad of Sekharan Master, an elderly Gandhian who treats her like his own grandchild. Janaki finds a sense of belonging in the love of Sekharan's family members and the harmony created by the innocent solidarity of children. But the outside world always hunts her down. The death of her protector throws Janaki back to the wretched realities, a life of abuse and exploitation. Janaki is the representative of dejected womanhood, hurt and humiliated.",
    "languages": [
        "Malayalam",
        "Hindi"
    ],
    "title": "Janaki",
    "kind": "movie",
    "directors": "M.G. Sasi",
    "writers": [
        "M.G. Sasi",
        "",
        "M.G. Sasi",
        "",
        "M.G. Sasi"
    ],
    "producers": [
        "Prakash Bare",
        "Nandajan Ka",
        "Antony Thekkek"
    ],
    "composers": "Shyam Dharman",
    "cinematographers": "M.J. Radhakrishnan",
    "editors": "Vijai Sankar",
    "assistant directors": [
        "Prakash Bare",
        "Shylaja Chetlur"
    ],
    "music department": [
        "M.G. Sasi",
        "K.J. Yesudas"
    ],
    "akas": "Daughter of Earth",
    "writer": [
        "M.G. Sasi",
        "M.G. Sasi",
        "M.G. Sasi"
    ],
    "director": "M.G. Sasi",
    "production companies": "Silicon Media",
    "plot": "_Janaki_ (qv) showcases the tumultuous life of 12 year old child, who lives in the unsafe openness of the street. Orphaned and abandoned, she goes through all the unpleasant odds until she finds abode at the Tharavad of Sekharan Master, an elderly Gandhian who treats her like his own grandchild. _Janaki_ (qv) finds a sense of belonging in the love of Sekharan's family members and the harmony created by the innocent solidarity of children. But the outside world always hunts her down. The death of her protector throws _Janaki_ (qv) back to the wretched realities, a life of abuse and exploitation. _Janaki_ (qv) is the representative of dejected womanhood, hurt and humiliated.::Anonymous"
}