{
    "id": "2677064",
    "localized title": "Vishwaroopam 2",
    "cast": [
        "Kamal Haasan",
        "Rahul Bose",
        "Shekhar Kapur",
        "Pooja Kumar",
        "Andrea Jeremiah",
        "Jaideep Ahlawat",
        "Anant Mahadevan",
        "Waheeda Rehman",
        "Russell Geoffrey Banks",
        "Damian Mavis",
        "Steven Clarke",
        "Jude S. Walko",
        "Samrat Chakrabarti",
        "Michael Corsale",
        "Elona Gagani",
        "Rajendra Gupta",
        "Robert Horwell",
        "Yusuf Hussain",
        "Deepak Jethi",
        "Paul O'Dea",
        "Vidyuth Sreenivasan"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "en",
        "ta",
        "hi",
        "te"
    ],
    "color info": "Color",
    "sound mix": "Dolby Atmos",
    "certificates": [
        "Australia:MA15+",
        "Austria:6",
        "Canada:18A::(Alberta)",
        "Canada:14A::(British Columbia)",
        "Canada:18A::(Ontario)",
        "Canada:13+::(Quebec)",
        "France:Tous publics",
        "Germany:Not Rated",
        "India:UA",
        "India:UA",
        "Ireland:15A",
        "Malaysia:18",
        "Netherlands:12",
        "New Zealand:(Banned)",
        "New Zealand:R16",
        "Norway:15",
        "Singapore:NC16",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "10 Aug 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMmU1NGE2ZDAtOWZiMC00Y2E2LWI1YjgtMmZiN2VkY2IzZGQ0XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2677064",
    "plot outline": "The Dirty Bomb planned attack on New York City by Al-Quada terrorist Omar Qureshi was destroyed by an Indian Intelligence Bureau Agent, Wisam through investigation. While Omar and Salim have escaped from New York to India, Wisam was given the responsibility to kill Omar along with his co-terrorists. In the process, Wisam's past comes into fruition.",
    "languages": [
        "English",
        "Tamil",
        "Hindi",
        "Telugu"
    ],
    "title": "Vishwaroopam 2",
    "kind": "movie",
    "directors": "Kamal Haasan",
    "writers": [
        "Kamal Haasan",
        "",
        "Atul Tiwari",
        "",
        "Kamal Haasan",
        "",
        "Kamal Haasan",
        "",
        "Shashank Vennelakanti"
    ],
    "producers": [
        "Chandra Haasan",
        "Kamal Haasan",
        "Rengarajan Jaiprakash",
        "Viswanathan Ravichandran",
        "Navmeet Singh",
        "Jude S. Walko"
    ],
    "composers": "Ghibran",
    "cinematographers": [
        "Shamdat Sainudeen",
        "Sanu John Varughese"
    ],
    "editors": [
        "Mahesh Narayanan",
        "Vijai Sankar"
    ],
    "editorial department": "Arunachalam Sivalingam",
    "art directors": "Lalgudi Ilayaraja",
    "costume designers": [
        "Gautami",
        "Gautami"
    ],
    "production managers": [
        "S. Moorthy",
        "Gopalakrishnan Thiyagarajan",
        "Venkatesh R"
    ],
    "assistant directors": [
        "Ike",
        "C.S. Karthikeyan",
        "P. Praveen Kumar",
        "Stefan Richter",
        "Rajesh M. Selva",
        "Santhosh Selvaraj",
        "Tegveer Singh",
        "Lokesh Srinivasan",
        "Pongkarnda 'Kik' Udomprasert",
        "Jude S. Walko",
        "Lee Whittaker"
    ],
    "art department": "Abinash Kumar Pandit",
    "sound department": [
        "Marc Glassman",
        "Marti D. Humphrey",
        "Chris M. Jacobson",
        "Anand Krishnamoorthi",
        "Kabir Malik",
        "Ivo Moraga",
        "Kunal Rajan",
        "Vargas Soledad",
        "Ramji Soma",
        "Soledad Vargas"
    ],
    "visual effects": [
        "Bejoy Arputharaj",
        "Asmita Bharrati",
        "Asif Bhushan",
        "Ashwin Kumar",
        "Amit Malviya",
        "Sreyas Nair",
        "Prashanth Narayanan",
        "Naveenprabhu",
        "Raghav Rai",
        "Rajeev Kumar Rastogi",
        "Arunachalam Sivalingam",
        "Madhu Sudhanan",
        "Neel Trivedi",
        "Venkat Karunakar Uday",
        "Rahul Vishwakarma"
    ],
    "stunts": [
        "Amrin Abubakker",
        "Brahim Chab",
        "Feroz",
        "Parvez Feroze",
        "Parvez Khan",
        "T. Ramesh",
        "Stefan Richter",
        "Lee Whittaker"
    ],
    "camera department": [
        "Tarun Hasan",
        "Robert Horwell",
        "Sarayuth Nissaidee",
        "Sony Sasankan",
        "Arunachalam Sivalingam"
    ],
    "music department": [
        "Kaushiki Chakraborty",
        "Ghibran",
        "Chaitra H.G.",
        "Kamal Haasan",
        "Andrea Jeremiah",
        "Prasoon Joshi",
        "Sathya Prakash",
        "Sarath Santosh",
        "Ramajogayya Sastry",
        "Sandeep Shrivastava",
        "Aravind Srinivas",
        "Vairamuthu"
    ],
    "miscellaneous": [
        "Kamal Haasan",
        "Birju Maharaj",
        "Ace Marrero",
        "Fatema Nagree",
        "Deepak Sahu",
        "Mandvi Sharma"
    ],
    "akas": [
        "Vishwaroop 2 (India, Hindi title)",
        "Vishwaroop 2 (United States)",
        "Vishwaroop 2 (Canada, English title)",
        "Vishwaroop 2 (France)",
        "Многоликий Янус 2 (Russia)"
    ],
    "writer": [
        "Kamal Haasan",
        "Atul Tiwari",
        "Kamal Haasan"
    ],
    "director": "Kamal Haasan",
    "production companies": [
        "Raajkamal Films International",
        "Aascar Film P."
    ],
    "distributors": [
        "Aascar Film P.",
        "MKS Retail Group",
        "Murugan Talkies",
        "Night Ed Films",
        "Reliance Entertainment",
        "Rohit Shetty Picturez",
        "Hotstar",
        "Hotstar",
        "Star VijayTV"
    ],
    "special effects": "Cerebrums Animation Studio",
    "other companies": [
        "Blue Falcon Productions",
        "Lahari Music",
        "T-Series",
        "The Dub Stage"
    ],
    "plot": [
        "RAW agent Wisam Ahmad Kashmiri prevents an al-Qaida terrorist from executing a massive attack on New York. He must now wade through further traps and conspiracies to thwart a new plot against three democratic nations.",
        "The Dirty Bomb planned attack on New York City by Al-Quada terrorist Omar Qureshi was destroyed by an Indian Intelligence Bureau Agent, Wisam through investigation. While Omar and Salim have escaped from New York to India, Wisam was given the responsibility to kill Omar along with his co-terrorists. In the process, Wisam's past comes into fruition.::NV",
        "The massive attack planned on New York City by Al-Qaeda Terrorist Omar Qureshi Was disrupted by an RAW Agent Wisam Ahmad Kashmiri. The terrorists Omar And Saleem escape from New York City. Wisam is given the responsibility to eliminate Omar and his Jihadis. Omar and Saleem hurry to execute their international plot to defame three democracies in one day. Wisam plods through traps conspiracies murder mayhem gut gore and finally to victory.::Santhosh"
    ],
    "synopsis": "It's been a few days since the events of the first movie: R.A.W Espionage agent Wisam Ahmed Kashmiri and his wife Nirupama, apprentice and student Ashmitha, and his mentor Colonel Jagganath work with the N.Y.P.D to disable the cesium bomb planted by Wisam's old friend and later enemy Omar Quereshi, who leads a band of Al Qaeda warriors in a secret village appointed by the once hidden Bin Laden. The characters travel to India where Omar intends to run away to and strike next, but first they deliver the body of their friend John Dawkins to his family in England, who was murdered in New York by Omar's deputy Salim.During the flight, Wisam recalls how he first met Ashmita and becomes close partners with her. In order to set Wisam up for the infiltration in Afghanistan they must spoil his record, so under instruction of Jagganath and his mentor Gowswami, Wisam and Ashmita stage a supposed sexual assault on the latter leading Wisam to be dismissed from the force and jailed. Gowswami paroles Wisam and they portray him as a supposed fugitive on the run to get him to join Al Qaeda. Wisam joins the mission with Lieutenant Rai who is code-named Imtiaz. In the present day, the group meets an older Gowswami who expresses sorrow for Dawkin's passing and their close friendship. Gowswami states that he wishes Salim dead for his deed and about how he's always stated that he will die staring his enemy in the eye or vice versa. Nirupama also gets jealous on the car ride to their residence of Ashmita's friendship with Wisam. The group is contacted by Eshwar Iyer, Gowsami's boss and the man tasked with helping Wisam in dealing with Omar. The group particularly doesn't like him for being undisciplined and disloyal to his work and rather seeking attention. Wisam attempts to change the radio station from the romance music Ashmita played for them, and in a sudden turn of events he activates the parking break when he sees a man in the car in front of them pull out an anti-tank gun, leading to a crash. Ashmita is injured and Nirupama is unconcious, but Gowsami is fatally wounded. Wisam finds the gunman and kills him, and brings his body to Gowswami before he dies. A grevious Wisam falls asleep in which he flashes back to the American attack in Afghanistan, and how just before he suggested to Omar to allow Jalal and Nasser to follow their dreams instead of serving as soldiers.Wisam also confirms to Jagganath of the upcoming attack on the American military base that Mammu killed himself at but fails to prevent it, in addition to Thawveeq's execution. A few nights after the air bombing on the village, Omar asks for Salim and Wisam's loyalty to support him as the new village head. That night, Wisam is informed that Osama Bin Ladin is seeking security with Omar and has Imtiaz radio the control station to nab him. Eshwar and Jaaganath send American soldiers to the village when Omar catches Wisam signaling them. Omar expresses mistrust and anger at Wisam's treachery and betrayal, claiming that he killed his family and he was blind to it. Omar tells Wisam that his treachery will taint Omar's leadership and decides that he should kill him without the people knowing. Imtiaz rushes from the corner of the pueblo with a knife but Omar blocks his offence and shoots him. Wisam pins Omar and activates flares to signal the Americans to the village. Omar shoots Wisam and he is carried onto a rescue helicopter wounded. Omar is drawn back by gunfire from the helicopters which wound him and Wisam is put off the force and hospitalized for his wounds, so he signs off from the military for four years, afterwhich he meets Nirupama in New York and marries her for a normal life. However he resumes operation when a surviving Omar attempts revenge on America.In the present, Wisam, Ashmita, Nirupama, and Jagganath meet with Iyer at a hotel, who expresses disappointment with being unable to interrogate the gunman and criticizes Wisam's intentions and methods of handling the case. Iyer remains skeptical of Wisam's loyalty simply because he's a Muslim and working with his wife and partner. Wisam becomes offended of Iyer's prejudice and calls him out for being dishonest and stands his ground in his value in dealing with Omar. Iyer leaves unhappy and the moment he's gone, Ashmita and Wisam test the room for potential bugs. Iyer attempts to eavesdrop anything valuable he could use for his own gain but they inform Iyer on the other end that he won't outsmart them and destroys the bug, after-which Wisam discusses his awareness of Nirupama's affair with Deepak and they rekindle their differences.Ashmita calls Wisam and Nirupama downstairs to meet with Iyer and discuss the whereabouts of Omar and his intentions, but Wisam is surprised to see that he's with Munavar whom apparently doesn't recognize or pretends not to know Wisam. Confirming his suspicions that Iyer is in cahoots with Omar, Wisam heads to a recon bomb site in an abandoned building as instructed. Since the task is seemingly pointless, Wisam pretends to be locked in the basement and silently escapes the building before Iyer activates the bomb in the building with his phone and Wisam fails to respond. Wisam immediately calls Ashmita to tell him of Iyer's treachery as Iyer calls Munavar to dispose of Ashmita. Munavar overhears Wisam still being alive and escapes before Ashmita can apprehend him. Wisam calls Iyer and tells him that he will find and kill him. He also calls up Jagganath who's in the restroom and tells him to be careful of Iyer. Jagganath and Iyer simultaneously arm themselves with guns, and Jagganath shoots Iyer dead before he can be struck upon.The group meets with Wisam's friend Jim to find the whereabouts of Iyer and Munavar's illegally rented car and trace it to Sheerness. They find an ocean log book in the car leading to the sight of a ship wreckage in a harbor in Sheerness. The wreckage as described by Wisam was a ship lost in WW2 containing a shipment of explosives to the Axis forces. Wisam deduces that England is one of Omar's attack sites and that he intends to use a cesium bomb to trigger the explosives causing tsunami like flooding at the coasts. They arrive at the harbor and Nirupama, who has a certificate in SCUBA diving finds the bomb underwater. She and Wisam's men attempt to disable it. Wisam takes a break to use the restroom but finds Jim dead by stabbing since he went earlier. Wisam finds one of Iyers men hidden and attempting to detonate the bomb. Wisam fights the man and kills him, disabling the bomb just before it can explode.The team arrives in Dehli and after resting, Nirupama finds out just how much Wisam cares about her when he insists her upmost safety during the mission thrown at her, as told by Jagganath to one of his bosses Seshardri. After spending the night they meet Wisam's mother at a hospital, where Nirupama realizes she has Alzheimers and doesn't remember Wisam. She only remembers Wisam when he last joined the military but nothing more. Omar and Salim eventually arrive in India and Salim takes Nirupama and Ashmita hostage, and under disguise to avoid the guards watching over them.On the ride to Omar's place, Ashmita flips the driver's seat and pulls the parking break, flipping the car and wrecking it. Ashmita knocks out the driver and fights Salim, defeating him. But she's forced to stop when Salim's men hold Nirupama at gunpoint. Salim pins Ashmita and breaks her arm. Wisam is sent Ashmita's dismembered body and is ordered by Munavar to turn himself in to see Nirupama alive. Wisam is taken to Omar's residence and is knocked out by Salim. Wisam begs Omar to spare Nirupama, and he sends Nirupama to another building to be killed by Salim afterwards along with Wisam's mother who's been taken hostage. Omar grievously expresses sorrow over Khadija and his son Nasser's deaths. Wisam however reveals that Omar's family is in fact alive.During the American bombing, Wisam evacuates the remaining civilians including Nasser(Omar's son), Jalal, and Khadija into the helicopters, but he is discovered by the other Nasser(the village leader) who kills the remaining women and children before Wisam can save them. Wisam fights Nasser and several of his goons, and stabs the village leader in the heart as Omar's family leaves the village. Omar initially refuses to believe it but states that his family has betrayed Allah by living in America and must be killed too. Omar places a bomb on Wisam's neck with a forty second timer before departing.Salim and his men have Wisam's mother and Nirupama hostage as the bomb explodes, and Salim states that Wisam is dead. Salim proudly exclaims that Nirupama will be next, and that they have planted 64 bombs around the nation in celebration of India's independence and that they can be activated in one phone call with chain reaction. Suddenly, Wisam breaks into the room from the window and Salim immediately retaliates. Wisam brutally kills all of his men and injures Munavar, and eventually punching Salim in the throat, removing his voice. Salim questions Wisam's escape non-verbally in which it's revealed that Wisam broke out of his bonds and fought Omar. They were both knocked into a cooking pan below the building in a shack and the oil from the pot spills on Omar, setting him on fire. Omar burns in agony and gets run into by a truck, then Wisam escapes to find Salim. Wisam watches his former friend weep and die of his injuries.An injured Omar recovers in the hospital where Wisam brings his son Nasser, Jalal, and Khadija to visit him. Nasser and Jalal are all grown up and have respectively studied medicine and engineering. Wisam asks Omar if he would have allowed this considering he would have just sacrificed them for his beliefs. Omar admits and chants in Allah's name before dying, and Wisam and Nirupama depart the hospital in light that their war is over."
}