{
    "id": "3588016",
    "localized title": "Dalamarmarangal",
    "cast": [
        "Indrans",
        "Iniya",
        "Jayakrishnan",
        "Lissy Jose",
        "Kanakalatha",
        "Sai Kumar",
        "Sruthi Lakshmi",
        "Meghanadhan",
        "Shobha Mohan",
        "Vinu Mohan",
        "Nirmisha",
        "Kochu Preman"
    ],
    "genres": "Drama",
    "runtimes": "102",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "2009 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWI5OTIzZTUtYTI3Yy00NDE5LTgyN2MtMDhiZWZkYzBmNmY0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "3588016",
    "plot outline": "The hidden secrets of an attempted murder are revealed through portrayal of circumstances that three different girls pass through in their life. Aswathy, a textiles shop employee, is staying with her bedridden and sick mother. She looks after the family with her meager salary. Kartika is a girl who is bestowed upon lots of love and affection by her parents. Her life zooms into a crisis when she comes to know of the secrets of her father's profession. The third girl, Rohini, lives in luxury and has tremendously rich parents. But the uneasiness and unhappiness in the family atmosphere makes her very very sad. She elopes with her very poor lover. Her father engages hired hoodlums to get her back after beating up the lover. She decides to commit suicide. Aswathy 's mother comes in search of Indusekharan, Rohini's father. Aswathy is actually an illegitimate daughter of Indusekharan. But Indusekharan decides to get Aswathy murdered. The person whom he engages to do this murder is Kartika's father. He comes towards Aswathy as the messenger of death. This is an essay on how three different girls from three different social and economic backdrops try to cope with their life against all odds. Their crisis gets deepened and dangerous due to the attitudes of their parents. The experiences they go through prove that lack of love and affection is the prime reason that made hell out of their lives. Lack of love and affection leads one to violence and to destruction as well. Dalamarmarangal establishes that love is the one and only antidote to violence.",
    "languages": "Malayalam",
    "title": "Dalamarmarangal",
    "kind": "movie",
    "directors": "Vijayakrishnan",
    "writers": "Vijayakrishnan",
    "producers": "Anil Dev",
    "composers": "Mohan Sitara",
    "cinematographers": "Kannan",
    "music department": [
        "K.S. Chithra",
        "Vijayakrishnan",
        "Vijay Yesudas"
    ],
    "akas": "Dalamarmarangal (India)",
    "writer": "Vijayakrishnan",
    "director": "Vijayakrishnan",
    "production companies": "Film Fantasy",
    "plot": "The hidden secrets of an attempted murder are revealed through portrayal of circumstances that three different girls pass through in their life. Aswathy, a textiles shop employee, is staying with her bedridden and sick mother. She looks after the family with her meager salary. Kartika is a girl who is bestowed upon lots of love and affection by her parents. Her life zooms into a crisis when she comes to know of the secrets of her father's profession. The third girl, Rohini, lives in luxury and has tremendously rich parents. But the uneasiness and unhappiness in the family atmosphere makes her very very sad. She elopes with her very poor lover. Her father engages hired hoodlums to get her back after beating up the lover. She decides to commit suicide. Aswathy 's mother comes in search of Indusekharan, Rohini's father. Aswathy is actually an illegitimate daughter of Indusekharan. But Indusekharan decides to get Aswathy murdered. The person whom he engages to do this murder is Kartika's father. He comes towards Aswathy as the messenger of death. This is an essay on how three different girls from three different social and economic backdrops try to cope with their life against all odds. Their crisis gets deepened and dangerous due to the attitudes of their parents. The experiences they go through prove that lack of love and affection is the prime reason that made hell out of their lives. Lack of love and affection leads one to violence and to destruction as well. _Dalamarmarangal_ (qv) establishes that love is the one and only antidote to violence.::Vijayakrishnan"
}