{
    "id": "5047160",
    "localized title": "Ka Bodyscapes",
    "cast": [
        "Naseera",
        "Rajesh Kannan",
        "Jason Chacko",
        "Saritha",
        "Shyam Sheetal",
        "Nilambur Ayisha",
        "Arundhathi",
        "Nalini Jameela",
        "Adhithi",
        "Tinto Arayani",
        "Jayaprakash Kuloor",
        "Ashvin Matthew",
        "Deepa Vasudevan"
    ],
    "genres": "Drama",
    "runtimes": "99",
    "countries": [
        "India",
        "United States"
    ],
    "country codes": [
        "in",
        "us"
    ],
    "language codes": "ml",
    "color info": "Color",
    "aspect ratio": "2.35 : 1 (CinemaScope version)",
    "sound mix": "D-Cinema 48kHz 5.1",
    "certificates": [
        "India:A",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTc3OTAzNjIwOF5BMl5BanBnXkFtZTgwMTc0OTg4NjE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "5047160",
    "languages": "Malayalam",
    "title": "Ka Bodyscapes",
    "kind": "movie",
    "directors": "Jayan Cherian",
    "writers": [
        "Jayan Cherian",
        "",
        "Jayan Cherian",
        "",
        "Jayan Cherian"
    ],
    "producers": [
        "Jayan Cherian",
        "Nisha Jayan",
        "Nisha Jayan"
    ],
    "composers": "Sunilkumar P.K.",
    "cinematographers": "M.J. Radhakrishnan",
    "editors": "Renjith Kuzhur",
    "production designers": [
        "Mm Manjesh",
        "Manu Perunna"
    ],
    "art directors": [
        "Mm Manjesh",
        "Manu Perunna"
    ],
    "production managers": "Sandeep Ravindranath",
    "assistant directors": [
        "Biswas Balan",
        "Tasni Banu",
        "Jolly Chirayath",
        "Kiran Daneal",
        "Gishnu",
        "Bundhu Thankam Kalyani",
        "Kishor Kumar",
        "Jijo Kurikose",
        "Nadhi",
        "Sandeep Ravindranath"
    ],
    "sound department": [
        "N. Harikumar",
        "Harikumar Madhavan Nair",
        "Vipin V Nair",
        "Arun Rama Varma"
    ],
    "thanks": "Deedi Damodaran",
    "akas": "Ka Bodyscapes (India)",
    "writer": [
        "Jayan Cherian",
        "Jayan Cherian",
        "Jayan Cherian"
    ],
    "director": "Jayan Cherian",
    "production companies": "Inner Silence Films",
    "distributors": "Ariztical Entertainment",
    "plot": "Three young people, Haris, a gay painter; Vishnu, a rural kabaddi player and their friend Sia, an activist who refuse to conform to dominant norms of femininity, struggle to find space and happiness in a conservative Indian City.",
    "synopsis": "In the city of Calicut in the Indian state of Kerala, three young people grapple with entrenched structures of patriarchy - the free-spirited painter Haris, his love interest and friend, the athletic, mild-mannered Vishnu, and a fiery young woman, Sia. The air is filled with protests and challenges to the rising religious and economic right wing. KaBodyscapes cuts out a slice of contemporary Kerala, recreating in fiction the struggles of the young to gain space in the face of Hindu right-wing aggression in particular and community and class oppression in general. Haris, a talented but struggling young painter, is on the verge of being catapulted to fame. As he prepares for his first solo exhibition, he persuades Vishnu, the object of his desire, to join him in the city. Vishnu is fully within the grip of his Hindu right-wing family, which limits his choices; his desire is muted. But he joins Haris and stays with him in his tiny rented apartment as a reluctant yet willing lover and model. It is perhaps no coincidence that he is a kabbadi player - kabbadi being a game in which members of two rival teams must enter and exit each others' delineated spaces alone, challenging the rival team to capture them. KaBodyscapes opens with Vishnu making precisely such a challenge to a rival team as Haris watches adoringly - and fails to return safe to his own space. It forebodes the tragic denouement of their romance. Parallel to the doomed lovers' tale runs the story of Haris' friend and confidante Sia, a white-collar worker in an export firm. Sia struggles both at home and at work. At home, she battles the misogynist restrictions her conservative Muslim relatives impose on her even as they deny her economic security. At work, she questions the violent and humiliating labor controls, and the dehumanizing surveillance. Like Haris and Vishnu, Sia's struggle is lonely and uphill, even when her friends rally around her in critical moments. As Haris, Vishnu, and Sia hurtle towards a confrontation with Hindu right-wing forces and predatory capitalism, their struggles cannot be but against the abjection of body and desire in the everyday life of the city. Haris' deeply cosmopolitan art, which reclaims the body and desire, invokes the Egyptian Ka, the spiritual body-double, thus seizing the body from its degradation and elevating it as the necessary vehicle of Ka. Vishnu, however reluctantly, awakens to his body and slowly learns to answer its desires. Sia protests against the misogynist punishments meted out to menstruating women workers, and in moments of solitude, explores her own body through intense and loving touch. Each of these defiant acts provokes severe punishment and for these young people, it marks entry into adulthood in a challenging world."
}