{
    "id": "5311546",
    "localized title": "नटसम्राट",
    "original title": "Natsamrat",
    "cast": [
        "Nana Patekar",
        "Medha Manjrekar",
        "Mrunmayee Deshpande",
        "Sunil Barve",
        "Vikram Gokhale",
        "Ajit Parab",
        "Neha Pendse",
        "Nilesh Divekar",
        "Jitendra Joshi",
        "Shridhar Limaye",
        "Savita Malpekar",
        "Sandeep Pathak",
        "Pooja Sawant",
        "Aniket Vishwasrao",
        "Jaywant Wadkar"
    ],
    "genres": [
        "Drama",
        "Family"
    ],
    "runtimes": "166",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Singapore:PG",
        "Singapore:PG13::(Netflix)",
        "United Arab Emirates:PG-13"
    ],
    "original air date": "01 Jan 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjkzZWIyZTctN2U3Ny00MDZlLTkzZTYtMTI2MWI5YTFiZWZkXkEyXkFqcGdeQXVyNTM2NTg3Nzg@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "5311546",
    "plot outline": "The film is a tragedy about a veteran theatre actor named Ganpat \"Appa\" Belwalkar (Nana Patekar) who has been the best of his lot during his heyday, garnering fame and fortune acting in plays based on various works, especially William Shakespeare's. It is a tragedy of a veteran actor who enjoyed a very vital importance in his life but who becomes the victim of old age alienation and estrangement. The film reveals an intensely tragic fate of an actor who becomes victim of fate and fortune in old age, which is similar to the fate of Lear. Natsamrat suffers the pangs of old age and dishonor inflicted on him by his own children. It is a tragedy of great humanist and actor who succumbs to the ill fate and destiny. In fact, Natsamrat is a story of Ganpatrao Belvalkar, who withstands great suffering after his retirement from stage acting.",
    "languages": "Marathi",
    "title": "Natsamrat",
    "kind": "movie",
    "directors": "Mahesh Manjrekar",
    "writers": [
        "Abhijeet Shirish Deshpande",
        "",
        "Abhijeet Shirish Deshpande",
        "",
        "Mahesh Manjrekar",
        "",
        "Kiran Yadnyopavit"
    ],
    "producers": [
        "Nishant Roy Bombarde",
        "Vishwas Joshi",
        "Nana Patekar"
    ],
    "composers": "Ajit Parab",
    "cinematographers": [
        "Ajith V. Reddy",
        "V. Ajith Reddy"
    ],
    "editors": "Paresh Manjrekar",
    "editorial department": [
        "Pranab Manna",
        "Pranab Manna",
        "Virat Sharma"
    ],
    "production designers": [
        "Eknath Kadam",
        "Prashant Rane"
    ],
    "make up department": "Rohit Mahadik",
    "production managers": [
        "Amol Mane",
        "Vijay Shirke"
    ],
    "assistant directors": [
        "Himanshu Arora",
        "Ganesh Modak"
    ],
    "art department": [
        "Akshay Ambekar",
        "Mahale Siddhesh"
    ],
    "sound department": [
        "S.k Agarwal",
        "Vitthal Gore",
        "Suresh Sharma"
    ],
    "visual effects": [
        "Akash Chavan",
        "Paresh Kumar Swain"
    ],
    "camera department": [
        "Rajesh Singh",
        "Rajesh Singh-DIT"
    ],
    "costume departmen": "Raveena Patil",
    "miscellaneous": [
        "Nikhil Gangavane",
        "Vizual Junkies",
        "Nitin Keni",
        "Dhiraj Zope"
    ],
    "akas": [
        "नटसम्राट (India, Hindi title)",
        "Natsamrat: Asa Nat Hone Nahi (Australia)"
    ],
    "writer": [
        "Abhijeet Shirish Deshpande",
        "Abhijeet Shirish Deshpande",
        "Mahesh Manjrekar"
    ],
    "director": "Mahesh Manjrekar",
    "production companies": [
        "Fincraft Media & Entertainment",
        "Great Maratha Entertainment Company India"
    ],
    "distributors": [
        "Zee Studios",
        "Nittin Keni Creations",
        "Zee Studios"
    ],
    "plot": [
        "After he retires, an aging theatre actor and his wife begin to feel unwanted by their children.",
        "The film is a tragedy about a veteran theatre actor named Ganpat \"Appa\" Belwalkar (Nana Patekar) who has been the best of his lot during his heyday, garnering fame and fortune acting in plays based on various works, especially William Shakespeare's. It is a tragedy of a veteran actor who enjoyed a very vital importance in his life but who becomes the victim of old age alienation and estrangement. The film reveals an intensely tragic fate of an actor who becomes victim of fate and fortune in old age, which is similar to the fate of Lear. _Natsamrat_ (qv) suffers the pangs of old age and dishonor inflicted on him by his own children. It is a tragedy of great humanist and actor who succumbs to the ill fate and destiny. In fact, _Natsamrat_ (qv) is a story of Ganpatrao Belvalkar, who withstands great suffering after his retirement from stage acting.",
        "Ganpat Belwalkar a talented and respected stage artist has gained name and fame with the verge of retirement he decides to chill with his friend Rambhau and spend time with his wife Kaveri.He transfers his assets to his children and wants to live a relaxed life a straight forward person but sometimes his words don't go well with others.After transferring his assets Ganpatrao looses his respect in the family circumstances force him and his wife to shift at their daughter Vidya's place but there to they are ashamed by her.Ganpat and Kaveri leave their house on a stormy rainy night and take shelter wherever they can.Kaveri soon passes away and Ganpatrao starts to live on streets where he is taken care by slum dwellers.::alex.mjacko@gmail.com"
    ]
}