{
    "id": "5556784",
    "localized title": "Kodi",
    "cast": [
        "Dhanush",
        "Trisha Krishnan",
        "Anupama Parameswaran",
        "Saranya Ponvannan",
        "G. Marimuthu",
        "Kaali Venkat",
        "S.A. Chandrashekhar",
        "Vijayakumar",
        "Karunas"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Canada:PG::(Alberta)",
        "Canada:G::(Quebec)",
        "India:U",
        "Norway:12::(cinema rating)",
        "Singapore:PG13",
        "Singapore:PG",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "27 Oct 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWIzMjc1ZjgtMzE4NS00MGE4LWJjNTctMjAxMzNkMTlmMDBiXkEyXkFqcGdeQXVyODk1OTg3MTI@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "5556784",
    "plot outline": "Kodi and Anbu are look-alike twins born to in staunch political worker who immolates himself in protest for a good cause. Kodi dedicates himself to carry over the work of his late father to take his party to greater heights, while Anbu puts family first. When Kodi's love for Rudra, a fierce speaker from the rival party begins to impede his political career, he also stumbles upon a scam that shakes his beliefs to unveil a flurry of events that brings Anbu into the mix of unexpected events!",
    "languages": "Tamil",
    "title": "Kodi",
    "kind": "movie",
    "directors": "R.S. Durai Senthilkumar",
    "writers": "R.S. Durai Senthilkumar",
    "producers": "Vetrimaaran",
    "composers": "Santhosh Narayanan",
    "editorial department": "Babu Narreshkumar",
    "assistant directors": "Gopinath Thanhavel",
    "sound department": [
        "Narayanan Sp",
        "Suren"
    ],
    "visual effects": "Harihara Suthan",
    "stunts": "Stunt Silva",
    "camera department": [
        "Anand",
        "Nutakki Anoop",
        "Hayath Basha",
        "N. Bharathwaj",
        "Charlestead",
        "P. Govindaraj",
        "Gautam Kumar Jayaseelan",
        "Kalyanvikram",
        "Vishnu Kanth",
        "P. Karthick",
        "S. Karthick",
        "Satish Kumar",
        "Padmanathan M.",
        "Umashankar M.",
        "K. Nirmal Venkatesh",
        "Prashanth",
        "Swathik Raj",
        "Sudhakar",
        "Venkatesan",
        "Christye Xavier"
    ],
    "location management": "Ajmal Koya Appu",
    "music department": "Sujith Sreedhar",
    "akas": [
        "Dharmayogi (India, Telugu title)",
        "Rowdy Hero 2 (India, Hindi title)",
        "Flag (United States)",
        "Коди (Russia)"
    ],
    "writer": "R.S. Durai Senthilkumar",
    "director": "R.S. Durai Senthilkumar",
    "production companies": [
        "Grass Root Film Company",
        "Oveyen Studio",
        "Wunderbar Films"
    ],
    "distributors": [
        "AP International",
        "Aanna Films",
        "Ayangaran International Films",
        "Ayngaran International",
        "Escape Artists Motion Pictures",
        "Golden Cinema",
        "Phars Film",
        "Southern Star International",
        "Divo",
        "Sun TV"
    ],
    "other companies": "Sony Music India",
    "plot": [
        "A young politician competes with his ambitious girlfriend in the elections while his twin brother gets forcefully dragged into this battle.",
        "_Kodi_ (qv) and Anbu are look-alike twins born to in staunch political worker who immolates himself in protest for a good cause. _Kodi_ (qv) dedicates himself to carry over the work of his late father to take his party to greater heights, while Anbu puts family first. When _Kodi_ (qv)'s love for Rudra, a fierce speaker from the rival party begins to impede his political career, he also stumbles upon a scam that shakes his beliefs to unveil a flurry of events that brings Anbu into the mix of unexpected events!::PipingHotViews",
        "A timid man vows to seek revenge against the person who had killed his brave brother by entering the political field and fulfill his brother's last wish meanwhile unraveling the mystery of his brother's death and starts to change like his brother due to a disorder.::susindhar"
    ],
    "synopsis": "For Kodi (Dhanush), politics has been a part of his life ever since his birth. His father Murugan (Karunaas), a low-rung party worker, brings him up to become a politician, before setting himself on fire, protesting against a factory whose toxic mercury waste has ruined lives in the locality. Kodi's identical twin, Anbu (also Dhanush), is a contrast to his rough-and-tough brother. He is a college lecturer and a pacifist.Kodi moves with his adopted assistant Bhagat Singh (Kaali Venkat). His girlfriend Rudhra (Trisha) belongs to the ruling party and has been in politics since childhood like him. Here enters egg-seller Malathi (Anupama Parameswaran), whose eggs are broken by Kodi. When she chases him, she comes across Anbu and mistakes him as Kodi. Anbu falls in love with Malathi. Malathi tells him her village pathetic condition due to the factory's mercury waste, which Anbu tells Kodi.Kodi meets Thalaivar (S.A. Chandrasekhar), who tells that they would take up this matter. Meanwhile, Kodi comes in possession of documents relating to the factory, from which he comes to know that his party member Marimuthu (G. Marimuthu) and the whole party is responsible for what has happened to the villagers. Depressed, he shares this information with Rudhra who speaks up this matter in public, causing great embarrassment to Kodi's party. To keep him silent, his party leadership announces him as their candidate. Problems soon arise as Rudhra's party members come to know about the Kodi-Rudhra's affair, and start pressurizing Rudhra to give up her candidacy. A depressed Rudhra meets Kodi in the woods. When they meet together, the goons sent by former MLA Arivazhagan (Namo Narayana) attacks them. Kodi in the end he is stabbed by Rudhra, who tells him that if he died then there is no obstacle for her. Kodi dies for her sake.Rudhra meets Kodi's family after funeral and tells them that her party is willing to give Anbu the post of MLA. Kodi's mother (Saranya Ponvannan) denies, but Anbu accepts it and wins the by-election. Soon, Anbu take the matter to find his brother's murderer and also to solve the issue of the factory. Kotraivel (Rajasimman) a member of Kodi's party finds out a camera, in which the video showing Rudhra killing Kodi is recorded and he threatens Rudhra to stop the factory issue. Rudhra uses the Inspector (Anil Murali) as a pawn to destroy the evidence and also get him killed by Kotraivel. Rudhra begins to feel that Anbu will find out the truth and moreover, the documents related to the factory were being taken to the court by Anbu. In order to stop him, Rudhra kidnaps his mother and Bhagat and tells him to come to the factory. In the end, a fight between Anbu and Rudhra's goons along with Kotraivel and Marimuthu takes place which results in Anbu emerging victorious. When he is about to kill Rudhra, his mother tells him to leave her. Soon, Bhagat kills her saying she did not deserve to live and should go away with Kodi."
}