{
    "id": "6096212",
    "localized title": "Alifa",
    "cast": [
        "Baharul Islam",
        "Jaya Seal",
        "Victor Banerjee",
        "Prasun Gayen",
        "Satya Ranjan",
        "Pakija Hasmi",
        "Rayan Abdul",
        "Swapna Dey",
        "Pabitra Rabha",
        "Tajmal Hussain",
        "Mahmuda Begum",
        "Liyakat Ali",
        "Sanku Baruah",
        "Mahendra Das",
        "Mali",
        "Al-Mamun Al Siyam"
    ],
    "genres": "Drama",
    "runtimes": "109",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "30 Mar 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNGIyMGU1MzctMjhkMC00ZGI5LTg0OWMtMWVjMGQ3NTg5MTUxXkEyXkFqcGdeQXVyNjk5MzIwOTg@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "6096212",
    "plot outline": "Ali, a daily wage earner living in the vicinity of a sprawling city, has to cope with uncertainty, hardship and abuses. He is at the mercy of a forest guard for not being evicted from his family's new-found habitat in a green hilly area overlooking the city. He finds solace in his hardworking, young wife and their two children. Ali is used to create stories to answer queries by his children about the night sky and about his past. His stories hide his inability to understand nature - for deep down his senses there is the real story of sorrow, as his riverside village is now extinct due to heavy flood and erosion. But he is little aware that most cruel troubles are brewing and about to threaten their meek existence. It remains an impossible task to enroll his daughter Alifa and son Faisal in primary school despite his wife Fatima working as a construction labour. As fate would have it, Fatima developed an affair with a co-worker that caused grave injury to Ali's faith and longing for her. Meanwhile in a dramatic turn of events Ali and his neighbours in the hills are forced to spend sleepless nights for fear of a prowling leopard that came out of the woods. What follows is the hardest fate befalling Ali's family.",
    "languages": "Bangla",
    "title": "Alifa",
    "kind": "movie",
    "directors": "Deep Choudhury",
    "writers": "Deep Choudhury",
    "producers": "Armaan Ahmed",
    "cinematographers": "Nahid Ahmed",
    "editors": "Rabiranjan Maitra",
    "editorial department": "Shuvro Roy",
    "casting directors": "Parth Gagan",
    "art directors": "Gulok Saha",
    "costume designers": "Gita Rani Goswami",
    "make up department": "Ashitav Baruah",
    "production managers": "Rasmin Borah",
    "assistant directors": [
        "Ghanashyam Kalita",
        "Nikunja Kalita"
    ],
    "sound department": [
        "Anirban Borthakur",
        "Subir Kumar Das"
    ],
    "special effects": "Priyam Chakraborty",
    "music department": "Subir Kumar Das",
    "script department": "Majibur Rahman",
    "thanks": [
        "Victor Banerjee",
        "News Live",
        "Pogo"
    ],
    "writer": "Deep Choudhury",
    "director": "Deep Choudhury",
    "production companies": "Arman Productions",
    "plot": [
        "_Alifa_ (qv) is a saga of human-wildlife conflict competing with basic questions of love, hatred, dreams and desires as well as the frailties of human nature and wider social bonding.",
        "Ali, a daily wage earner living in the vicinity of a sprawling city, has to cope with uncertainty, hardship and abuses. He is at the mercy of a forest guard for not being evicted from his family's new-found habitat in a green hilly area overlooking the city. He finds solace in his hardworking, young wife and their two children. Ali is used to create stories to answer queries by his children about the night sky and about his past. His stories hide his inability to understand nature - for deep down his senses there is the real story of sorrow, as his riverside village is now extinct due to heavy flood and erosion. But he is little aware that most cruel troubles are brewing and about to threaten their meek existence. It remains an impossible task to enroll his daughter _Alifa_ (qv) and son Faisal in primary school despite his wife Fatima working as a construction labour. As fate would have it, Fatima developed an affair with a co-worker that caused grave injury to Ali's faith and longing for her. Meanwhile in a dramatic turn of events Ali and his neighbours in the hills are forced to spend sleepless nights for fear of a prowling leopard that came out of the woods. What follows is the hardest fate befalling Ali's family.::Deep Choudhury"
    ]
}