{
    "id": "6102396",
    "localized title": "Kaalakaandi",
    "cast": [
        "Saif Ali Khan",
        "Asif Basra",
        "Neil Bhoopalam",
        "Ankit Bisht",
        "Vishal Chopra",
        "Amyra Dastur",
        "Sobhita Dhulipala",
        "Deepak Dobriyal",
        "Shyam Gopal",
        "Narendra Jha",
        "Savitri Joshi",
        "Deepak Kalra",
        "Geeta Kapoor",
        "Kunaal Roy Kapur",
        "Ravi Khote",
        "Akshay Oberoi",
        "Shivam Patil",
        "Vijay Raaz",
        "Rajendra Rastogi",
        "Amanda Rosario",
        "Kundan Roy",
        "Nary Singh",
        "Isha Talwar",
        "Shenaz Treasury",
        "Pankaj Tripathi",
        "Suresh Verma"
    ],
    "genres": [
        "Comedy",
        "Thriller"
    ],
    "runtimes": "112",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:15::(cinema rating)"
    ],
    "original air date": "12 Jan 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTA1NDcwMzc4NjNeQTJeQWpwZ15BbWU4MDgwOTg4NDQz._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "6102396",
    "plot outline": "Unfolding through a course of a night in Mumbai, Kaalakaandi showcases three parallel tracks -- a man who discovers he has terminal illness decides to let go of his principles and live a little; a woman involved in a hit-and-run seeks redemption and two goons must decide if they can trust each other.",
    "languages": "Hindi",
    "title": "Kaalakaandi",
    "kind": "movie",
    "directors": "Akshat Verma",
    "writers": "Akshat Verma",
    "producers": [
        "Vicky Bhatia",
        "Ashi Dua",
        "Rohit Khattar",
        "Kapil Madnani",
        "Nitin Makasare",
        "Sahil Mehra",
        "Nupu Press",
        "Yogiraj Shetty",
        "Aditya Singh",
        "Akshat Verma"
    ],
    "composers": [
        "Shashwat Sachdev",
        "Sameer Uddin"
    ],
    "cinematographers": "Himman Dhamija",
    "editors": "Shan Mohammed",
    "editorial department": [
        "John Joseph",
        "Rahul Purav"
    ],
    "casting directors": [
        "Mukesh Chhabra",
        "Panchami Ghavri"
    ],
    "production designers": "Nidhi Rungta",
    "art directors": "Richard Viagulam",
    "production managers": [
        "Sengupta Lipi",
        "Mukesh Prajapati",
        "Ambica Setia",
        "Manoj Thakur",
        "Ravishankar Tiwari",
        "Dayanand Yadav"
    ],
    "assistant directors": [
        "Himank Gaur",
        "Sunil Pandey",
        "Utkarsh Topiwala"
    ],
    "art department": [
        "Elisha D'Souza",
        "Deepak Kumar"
    ],
    "sound department": [
        "Arpit Chandra",
        "Bibin Dev",
        "Manoj M. Goswami",
        "Shijin Melvin Hutton",
        "Rajesh Kodadi",
        "Vimal Kumar",
        "Satyaprakash Maurya",
        "Mohammad Iqbal Paratwada",
        "Hiremath Ravi",
        "Jitendra Vajpayee"
    ],
    "visual effects": [
        "Ravi Gulhane",
        "Himanshu Sharma"
    ],
    "stunts": [
        "Mehmood Bakshi",
        "Pradyumna Kumar Swain"
    ],
    "camera department": [
        "Gautam Chaudhary",
        "Romeo Fonseca",
        "Narjes Golaftab",
        "Suraj Kutty",
        "Hitesh Mulani",
        "Shamsher Singh Rajwar",
        "Yash Rathore",
        "Bhagyesh Sharma",
        "Pankaj Sharma"
    ],
    "casting department": "Simran Gursahani",
    "costume departmen": [
        "Ayushi Bhardwaj",
        "Trividha Mehra"
    ],
    "location management": "Ashwin Bhandare",
    "music department": [
        "Arfius Al-din",
        "Neha Bhasin",
        "Vishal Dadlani",
        "Anvita Dutt",
        "Vivek Hariharan",
        "Arun Kamath",
        "Raghav Mehta",
        "Abhishek Nailwal",
        "Siddharth Pandit",
        "Romy",
        "Shashwat Sachdev",
        "Akshay Verma"
    ],
    "script department": "Ishita Dasgupta",
    "miscellaneous": [
        "Freyan Bhujwala",
        "Tessa Inkelaar",
        "Raj Malik"
    ],
    "akas": "Во все тяжкие (Russia)",
    "writer": "Akshat Verma",
    "director": "Akshat Verma",
    "production companies": [
        "Cinestaan Film Company",
        "Flying Unicorn Entertainment"
    ],
    "other companies": "Purple Grape Studio",
    "plot": [
        "Focusing on life, death and karma, this dark comedy follows three parallel tracks - a man who discovers that he is a terminally ill, a woman seeking redemption and two goons with major trust issues.",
        "Unfolding through a course of a night in Mumbai, _Kaalakaandi_ (qv) showcases three parallel tracks -- a man who discovers he has terminal illness decides to let go of his principles and live a little; a woman involved in a hit-and-run seeks redemption and two goons must decide if they can trust each other."
    ],
    "synopsis": "Rileen (Saif Ali Khan), receives the news of his growing stomach cancer, which is at the last stage. He is left heartbroken but remains quiet in front of everyone. He decides to live life to fullest, by smoking and taking drugs from a friend, but remains unhappy.His engaged brother Angad (Akshay Oberoi) is getting ready when he receives a call from his ex-girlfriend, Selina (Amanda Rosario) to a hotel. Angad sets out to meet her along with Rileen in the name of a haircut.In the next story, we see Tara (Sobhita Dhulipala) packing her bags to pursue higher studies in US, while her boyfriend Zubin (Kunaal Roy Kapur) is trying to convince her to change her plans but she remains adamant. Hours before flight, both of them attend a birthday party, but soon a police raid takes place over there and Tara is nervous as her flight is in two hours. She manages to escape with her friends along with Zubin in the car. On the car, Zubin and Tara share a heated argument over Tara kissing a guy, Tara loses control and hits a motorcycle killing two guys. Tara is left guilty but moves when Zubin and her friends asks her not to meet the Cops.Meanwhile, Rileen finds himself surrounded by animated imagination here and there. He imagines strange things. The reality of his life is teaching him the beautiful fantasy and happy side. He meets a transgender Sheila (Nary Singh) and coolly tells her that he wants to see her \"Southern Hemisphere\" down there, with no touching and no loving feeling, only looking, and succeeds in doing. Rileen becomes happy and decides to fulfill other things on his list.Next story is of two goons who wants to make it big, Mafia (Deepak Dobriyal) and Rahmat (Vijay Raaz). They plot a plan to extract money from their own boss Raza (Asif Basra) and cooks up a story. While during a party, Ustad (Neil Bhoopalam) a guy who has helped Raza very much gets killed in the road by two guys riding on a bike. Mafia and Rahmat witnesses the crime.Angad learns that Selina is just using him and feels guilty about cheating Neha (Amyra Dastur),the bride. Angad meets Neha and talks to her. Angad learns that Neha is a very nice girl he can get and both of them hugs each other and gets ready for marriage.Mafia's greed gets increased and he kills Rahmat and loots the entire money. He then shoots himself in the abdomen and tells Raza someone has robbed their money and killed Rahmat and in that fight Mafia too gets injured. Raza doesn't believes Mafia and is on the verge of Killing Mafia, but leaves him looking at the deepness of his wound. Mafia walks into the road.Rileen meets the wedding photographer Rakhi (Isha Talwar) and tells his son too had a birthmark like her on elbow. Rakhi asks him his name but he states that \"People just meet, say names, waves bye and goes away, which of no use.\" He also tells her about his growing Cancer. Rakhi somehow comforts Rileen and they Kiss each other. On being asked \"What does he mean to her?\", she replies \"I don't know!\" He happily laughs and tells her his name as \"Rileen.\"Tara Checks into the airport while Zubin asks her not to think of the horrific night. Tara feels very guilty and decides to approach the police and file an FIR, but the police asks her not to do so as the two guys who was injured and nearly killed in the accident was Underworld shooters who killed Ustad. Tara meets Zubin waiting for her. She gets to know he truly loves her and proposes him for marriage and then kisses him.Rileen marches into the dance ceremony of the marriage where everyone is dancing mindlessly along with Angad and Neha. Rileen dances like a mad fellow takes out his gun scaring everyone. He fires two bullets, one of the bullet rises high up in the sky then goes down hitting Mafia on head, thus killing.In the final scene Rileen looks into the camera and screams as the second bullet has hit his foot."
}