{
    "id": "7179784",
    "localized title": "Irumbu Thirai",
    "cast": [
        "Vishal",
        "Samantha Ruth Prabhu",
        "Arjun Sarja",
        "Delhi Ganesh",
        "Robo Shankar",
        "Suman",
        "Vincent Ashokan",
        "Kaali Venkat",
        "Darshana Rajendran",
        "Madhusudhan Rao",
        "G. Marimuthu",
        "Harish",
        "Mahanadhi Shankar",
        "Sharath Ravi",
        "Jeremy Roske",
        "Vivek Prasanna",
        "Rail Ravi",
        "Kavithalaya Krishnan",
        "R.S. Shivaji",
        "Sreeja Ravi",
        "Gopi Gpr",
        "Ayup Khan",
        "Abdool Lee",
        "Manikuttan",
        "P.S. Mithran",
        "Aranthangi Nisha",
        "Nitin Prasanna",
        "Vignesh Raghavan",
        "Sidharth Varma",
        "Pradeep K Vijayan"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:PG::(Ontario)",
        "France:Tous Public",
        "India:U",
        "Malaysia:P13",
        "Singapore:PG",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "11 May 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzcyN2VkYTAtMWM3NS00M2RhLThhZGEtNDJhNjE3ZWYyOGMzXkEyXkFqcGdeQXVyODIwMDI1NjM@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "7179784",
    "plot outline": "The movie is an action thriller that concerns hacking and the leak of information, how in the days of interconnections, the privacy of a person doesn't hold power, as anyone can be hacked and their personal information stolen from them.",
    "languages": "Tamil",
    "title": "Irumbu Thirai",
    "kind": "movie",
    "directors": "P.S. Mithran",
    "writers": [
        "P.S. Mithran",
        "",
        "Pon Parthiban"
    ],
    "producers": "Vishal",
    "composers": "Yuvan Shankar Raja",
    "cinematographers": "George C. Williams",
    "editors": "Antony L. Ruben",
    "assistant directors": "Nareshgowsik",
    "sound department": "Tapas Nayak",
    "visual effects": "Ashwin Kumar",
    "stunts": "Dhilip Subbarayan",
    "thanks": [
        "Dharani",
        "Southern Railways India",
        "Manoj Leonel Jason",
        "Anand Jeeva",
        "Vijay Kartik Kannan",
        "Rathna Kumar",
        "Madhavan",
        "Sathyaraj Natarajan",
        "Abraham Prabhu",
        "G.K. Reddy",
        "Ashok Selvan",
        "Dinesh Subbarayan"
    ],
    "akas": [
        "The Return of Abhimanyu (India, Hindi title)",
        "Abhimanyudu (India, Telugu title)",
        "Iron Curtain (United States)",
        "Iron Curtain (World-wide, English title)",
        "Abhimanyudu (United States)"
    ],
    "writer": [
        "P.S. Mithran",
        "Pon Parthiban"
    ],
    "director": "P.S. Mithran",
    "production companies": "Vishal Film Factory",
    "distributors": [
        "AP International",
        "Ayngaran International",
        "Golden Cinema",
        "Krikes Cine Creations",
        "Lyca Productions",
        "Murugan Talkies",
        "Night Ed Films",
        "Phars Film",
        "United India Exports",
        "Sun NXT",
        "United India Exports",
        "Zee Tamil",
        "Zee5"
    ],
    "other companies": "Think Music",
    "plot": [
        "A soldier takes on a gang of cyber criminals when money goes missing from his account.",
        "The movie is an action thriller that concerns hacking and the leak of information, how in the days of interconnections, the privacy of a person doesn't hold power, as anyone can be hacked and their personal information stolen from them.::Santhosh",
        "Kathiravan, a major in the Indian army with anger management issues, is compelled by circumstances to borrow a loan from a bank with false documents. When the entire money in the account vanishes, Kathiravan tries to track down the scamsters, and it leads him to White Devil, a master hacker."
    ],
    "synopsis": "Major Kathiravan is a military official who gives training for new recruits. He is very hot-headed and strict officer on duty. Off-duty, he wants to get settled in a foreign country as he dislikes the system here. Hence, he is trying to woo a foreign tourist girl for love & marriage. However, his attempts are unsuccessful. He has a family back in his village. But then, he is never affectionate with them. He dislikes his father just because of the reason that his father got debts all around the village and never repaid it on time. Also, due to his father's nature, he is unable to save Kathir's mother who is on her deathbed. This embarrasses and hurts Kathiravan very much as a child. After the death of his mother, he grows up in a city away from his father and sister. He sends money to them every month but never visited his village or seen his father & sister.In the nearby locality of his house, a suicide happens. A man couldn't repay his debt hence commits suicide leaving his wife and child. A collection agent who comes to inquire about the loan harassed the man's wife. Kathiravan sees this & gets angered, leading to him beating up the collection officer black & blue. This comes to the notice in his workplace and his senior official blackmarks Kathiravan as mentally unstable. Hence, he orders Kathiravan to undergo anger management program on the condition once when officially cleared by the medical supervisor, he is allowed to resume his duty. He along with his uncle goes to the clinic and finds the chief psychiatrist as Rathi Devi, a young woman. Kathiravan initially gets angry at her and threatens her to sign all the papers just as a mere formality. Rathi Devi, however, stubborn, and also keeps a cool head and advises Kathiravan to stay calm but Kathiravan dislikes it . He sees a photo of a women posing in front of the Eiffel Tower is Paris in Rathi's office. Kathiravan comes to know that it is Rathi's elder sister and she is settled in France. Hence, Kathiravan tries to impress Rathi's sister and gets well settled. Hence he acts as if he is following Rathi's order to stay calm. Rathi hears his flashback and counsels him to go to his village and spend time with his father & sister. As a proof, she orders him to upload a picture daily on social media. Kathiravan reluctantly does this and posts every picture on Facebook. But, as days go in his village, he comes to know about his sister's love affair with another guy. He wants them to get married, but his sister hates him and orders Kathiravan to stay away from her personal zone as he was never a responsible brother. Kathiravan realizes his mistake and finds out the truth that his sister's future mother-in-law demands them to bear the marriage expenses which will cost around 10 lakhs totally. He promises that he will fulfill his sister wish.Kathiravan returns to Chennai, he tries for applying for a loan in every bank. But to his dismay, it gets rejected everywhere. With the advice of his uncle, he takes his father to Chennai along with him and tries to get a loan in his father's name. They gets rejected everywhere as they don't have any financial security with them. They are very dejected and leave the bank. To their surprise, they get approached by a man who claims as a loan agent and tells them to forge documents stating that they are starting a Xerox cum computer shop business in Ambattur and that he will help them in getting the loan. In return, he demands only a cheque of INR 60,000 after the first due is over. Kathiravan initially refuses, but as his father urges him, he reluctantly agrees to the man's offer and submits all the original documents to him. The man helps them in obtaining a loan of 6 Lakhs INR.Initially, Kathiravan is overjoyed and starts the marriage preparation. He gives the ATM card to his dad as it's in his name. He teaches his father how to use ATM. Initially, his father is successful in using it. Later on, when his father goes alone to the ATM, he is unable to withdraw money due to insufficient balance. He informs Kathiravan who in turn is shell-shocked to know about the missing fund. He checks his dad's phone. To his surprise, no SMS was received on his phone regarding withdrawal from the bank. Kathiravan enquires to the bank staffs in a futile effort and gets upset very much with his father as he pushed for the loan and scolds him harshly. Unable to bear the words, his father attempts suicide. In the hospital, Kathiravan comes to know about his father's real sacrifice in childhood. He took debts because he wanted Kathiravan's sick mother to live longer. Kathiravan feels remorseful after hearing this and starts loving his father. On Rathi Devi's advice and with help of his teammates in the military campus he decides to the track down the culprit.Kathiravan manages to apprehend a loan agent who had similar terms to Kathiravan's loan agen in order to extradite some information. He gets a phone call from a mysterious number who tells Kathiravan to release him. That person reveals all details about Kathiravan and even threatens him that the private audio and video in his sister phone will be released on the Internet. Upon hearing this Kathiravan gets shocked and decides to leave that guy but the guy is fatally hit by a van. The mysterious person warns Kathiravan over the phone and cuts the call. The mysterious person is later revealed to be Sathyamoorthy aka White Devil, a mysterious cyberterrorist. White Devil is the kingpin of Dark Net with an aim is to know the information of every person in the country. He runs an educational trust named Amara Jothi Institutions and cons people from all walks of life who are in need of money. Kathiravan through various methods gets to know about the next victim conned by the same agent and confronts him. He also comes to know that how White Devil blocked Bank messages with the help of hacking. When Kathiravan finally confronts Sathyamoorthy in a ceremony where he is felicitated by UNICEF reveals that he knew that Kathiravan was following him since he was captured on a selfie posted on Facebook and attacks his sister through his strong networks. Sathyamoorthy also tells Kathiravan that he put 10 Lakhs to his account which was used by terrorist groups. Kathiravan afterwards is court martialed and is dismissed from his post. Since Kathiravan is dismissed he with the help of Rathi Devi tracks White Devil's men and, through hacking, transfers Tamil Nadu Police's Money into his account. At a dock where the two finally engage in a fist fight. Sathyamoorthy burns the money thinking that the money will never be repaid now but to his astonishment the money which Sathyamoorthy burnt was the Minister's money whom which Sathyamoorthy struck a deal with. All the people who were conned by Sathyamoorthy come to know about the theft through messages which have been unblocked. Kathiravan leaves Sathyamoorthy and then blends in with the crowd. Sathyamoorthy is arrested by the police creates a new username named Dark Angel implying that he will return."
}