{
    "id": "7218518",
    "localized title": "Padman",
    "cast": [
        "Akshay Kumar",
        "Radhika Apte",
        "Sonam Kapoor",
        "Jyoti Subhash",
        "Urmila Mahanta",
        "Suneel Sinha",
        "Sanjay Singh",
        "Rakesh Chaturvedi Om",
        "Mrinmayee Godbole",
        "Mridul Satam",
        "Parul Chauhan",
        "Saurabh Agarwal",
        "Amitabh Bachchan",
        "Varun Bag",
        "Himika Bose",
        "Riva Bubber",
        "Saidujjaman Durjoy",
        "Gautmik",
        "Chittaranjan Giri",
        "Lalita Goyal",
        "Shriram Jog",
        "Tiffany M. Johnson",
        "Faiz Khan",
        "Wasim Khan",
        "Swini Khara",
        "Ran Levy",
        "Zachary Harris Martin",
        "Biju Menon",
        "Aman Singh Mukar",
        "Terri O'Neill",
        "Andreas Pliatsikas",
        "A.R. Rama",
        "Santosh Rege",
        "Lalit Salvi",
        "Abhimanyu Sarkar",
        "Amit Sharma",
        "Nandini Shrivastava",
        "Akash Srivastava",
        "Rob Tunstall",
        "George Zouvelos"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:PG",
        "Brazil:14",
        "Canada:PG::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:PG::(Manitoba/Ontario)",
        "Canada:G::(Quebec)",
        "Germany:6",
        "Hong Kong:IIA",
        "India:UA",
        "Indonesia:13+",
        "Ireland:12A",
        "Japan:G",
        "Luxembourg:12",
        "Malaysia:P13",
        "Maldives:15+",
        "Netherlands:9",
        "New Zealand:PG",
        "Nigeria:PG",
        "Norway:7",
        "Philippines:G",
        "Singapore:PG",
        "South Africa:10-12",
        "South Korea:12",
        "Sweden:15::(self-applied)",
        "Switzerland:16",
        "Taiwan:GP",
        "Turkey:13+::(self-applied)",
        "United Kingdom:12A",
        "United States:PG-13"
    ],
    "original air date": "09 Feb 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODViYjQ0YTktMTM5NS00YTVkLWE5MmUtNGY1MzUwOGY0OTg2XkEyXkFqcGdeQXVyNjg5NzkxNTU@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "7218518",
    "plot outline": "Biography of Tamil Nadu activist Arunachalam Muruganantham, whose mission was to provide sanitary napkins to poor women of rural areas who used rags or leaves because sanitary napkins were rare. After he did not get fruitful results from his family and a medical college he approached, he decided to try it himself by filling a football bladder with goat's blood and roaming around with it for a day to check the absorption rate of the sanitary napkins he made.",
    "languages": "Hindi",
    "title": "Pad Man",
    "kind": "movie",
    "directors": "R. Balki",
    "writers": [
        "R. Balki",
        "",
        "Swanand Kirkire"
    ],
    "producers": [
        "Jiten Nand Kishor Arora",
        "Harsh Dave",
        "Shailesh Gupta",
        "Arjun N. Kapoor",
        "Hetvi Karia",
        "Twinkle Khanna",
        "Anil Naidu",
        "Santosh Rai",
        "Santosh Rege",
        "Ravi Sarin",
        "Prashant Shah",
        "Chavi Sirohi",
        "Hitesh Thakkar"
    ],
    "composers": "Amit Trivedi",
    "cinematographers": [
        "Tanveer Mir",
        "P.C. Sreeram"
    ],
    "editors": "Chandan Arora",
    "editorial department": [
        "Saurabh Gaur",
        "Gagan Sachdeva",
        "Jespal Nadar"
    ],
    "casting directors": "Shruti Mahajan",
    "production designers": "Rupin Suchak",
    "set decorators": "Naveen Jain",
    "costume designers": [
        "Ayushi Jain",
        "Theia Tekchandaney"
    ],
    "production managers": [
        "Danish Ansari",
        "Kinchit Desai",
        "Lalit Salvi"
    ],
    "assistant directors": [
        "Ajay Arya",
        "Ruby Chauhan",
        "Viral Desai",
        "Zoya Parvin",
        "Ambica Rana",
        "Jagan Shakti",
        "Skandha Sreeram"
    ],
    "art department": [
        "Swati Sawaldiya",
        "Dikshant Soni",
        "Minal v Uchil"
    ],
    "sound department": [
        "Curran Alphonso",
        "Sajjan Choudhary",
        "Chowdhry Danish",
        "Boloy Kumar Doloi",
        "Gokul K.R.",
        "Rajesh Kodadi",
        "Prathibha Krishnamoorthy",
        "Debasish Mishra",
        "Karnail Singh",
        "Vinay Upadhyay",
        "Varun Visoi"
    ],
    "stunts": "Amar Shetty",
    "camera department": [
        "Maajid Khan",
        "Patrick Longman",
        "Rajesh Madaan",
        "Mahesh Mishra",
        "Ben Noftzger",
        "Al Rivera",
        "K. Sandeep",
        "Priyam Shah",
        "B.K. Sivan",
        "Siddhartha Swayambhoo"
    ],
    "casting department": [
        "Anjali Jaiswal",
        "Ashish Kumar",
        "Narendra Rathore",
        "Rakesh Shah",
        "Bobbi Taxali"
    ],
    "costume departmen": [
        "Diptee Agarwal",
        "Ankana Awasthi"
    ],
    "location management": [
        "Sudhanshu Parihar",
        "Dinesh Pawar"
    ],
    "music department": [
        "Mohit Chauhan",
        "Jonita Gandhi",
        "Vineeth Jayan",
        "Rani Kaur",
        "Kausar Munir",
        "Ashish Narula",
        "Akash Noatia",
        "Raja Rasaily",
        "Yashita Sharma",
        "Yashika Sikka",
        "Arijit Singh",
        "Mika Singh",
        "Urmila Sutar",
        "Amit Trivedi",
        "Emikid"
    ],
    "script department": "Aakar Kaushik",
    "transportation department": "Hector Maldonado",
    "miscellaneous": [
        "Ishwinder Arora",
        "Swati Desai",
        "Rubeena Dode",
        "Waheed Dode",
        "Anupam Dubey",
        "Varun Gupta",
        "Leelavathi K.",
        "Maajid Khan",
        "Ram Mirchandani",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Deepesh Shah",
        "Salim Shaikh",
        "Avinash Singh",
        "Lada Guruden Singh",
        "Dharam Soni"
    ],
    "thanks": "Angry Rantman",
    "akas": [
        "Pad Man (India, English title)",
        "Pad Man (United States)",
        "パッドマン 5億人の女性を救った男 (Japan, Japanese title)",
        "護墊俠 (Taiwan)",
        "Betétember (Hungary)"
    ],
    "writer": [
        "R. Balki",
        "Swanand Kirkire"
    ],
    "director": "R. Balki",
    "production companies": [
        "Mrs Funnybones Movies",
        "Hope Productions",
        "KriArj Entertainment",
        "Cape of Good Films",
        "Columbia Pictures"
    ],
    "distributors": [
        "Beijing HY Media",
        "Columbia Pictures",
        "Phars Film",
        "Sony Pictures Entertainment",
        "Sony Pictures Releasing"
    ],
    "special effects": "EFX Magic in Motion",
    "other companies": [
        "Hype",
        "Just Right Studioz",
        "Prasad Film Labs",
        "Sterling Media",
        "Trigger Max",
        "Yellow inc.",
        "Zee Music Company"
    ],
    "plot": [
        "Upon realizing the extent to which women are affected by their menses, a man sets out to create a sanitary pad machine and to provide inexpensive sanitary pads to the women of rural India.",
        "Biography of Tamil Nadu activist Arunachalam Muruganantham, whose mission was to provide sanitary napkins to poor women of rural areas who used rags or leaves because sanitary napkins were rare. After he did not get fruitful results from his family and a medical college he approached, he decided to try it himself by filling a football bladder with goat's blood and roaming around with it for a day to check the absorption rate of the sanitary napkins he made.::alex.mjacko@gmail.com",
        "Laxmikanth Chauhan is a partner/tool operator in a workshop. He is against how women in his society are treated during their menses. When he marries he decides to make things better for his wife Gayatri; he purchases sanitary napkins for her because she has been using dirty, unhygienic rags. Gayatri asks him to return the napkins because they're too expensive. He decides to try to make them himself for less money and convinces her to use them, but they're not better; he tries to improve them but fails. Laxmi is then criticized in his village for taking up such initiative; his family disowns him and he is forced to leave his village. But his hopes survive and he researches how to make low-cost sanitary napkins for the betterment of women.::alex.mjacko@gmail.com"
    ],
    "synopsis": "The story starts with the marriage of Lakshmikant Chauhan (Akshay Kumar) and Gayatri (Radhika Apte), a happy go lucky couple. Lakshmikant is deeply in love with his wife and will do anything for her comfort and happiness. When Gayatri is temporarily banished from the household during her menstrual periods, Laxmi is caught unaware due to his lack of knowledge about the subject which is otherwise referred to as 'five day test match for women' by the village youth. Laxmi makes his peace with it but gets worried on seeing Gayatri using a dirty rag during her periods. When asked about it, Gayatri tells him it's none of his business and he, being a 'pure' human should not interfere in this feminine topic. Undeterred, Laxmi goes to a medical store and buys sanitary pads for his wife which cost Rs.55. When he reaches home and hands it over to Gayatri, she reprimands him and tells him to return it as using such costly napkins meant cutting off milk expenses of a month. Unable to return it, Laxmi, crestfallen, goes to work where a worker gets injured. He immediately applies a pad to the injury despite the others referring to it as 'impure'. In the hospital, the doctor lauds Laxmi's quick thinking and says that it is the cleanest choice to stop bleeding. Excited, Laxmi then buys some cotton, cloth and glue and makes a temporary pad which he thinks is a better replacement for the costly one.Gayatri uses it but the pad fails in its function and she tells Laxmi to not interfere in women's matters again. Laxmi disregards her, again tries to make a pad, and attempts to give it to a neighbor girl which again creates a mess. He then gives it to a medical student who decides to help him out but is deterred by her friends. To add to his woes, the meeting of Laxmi and the medical student is spotted by his close relative which makes his wife think that Laxmi has an extramarital affair. Laxmi visits his sister and tries to give her pads which leads to embarrassment in front of her in-laws. Gayatri then makes Laxmi promise to not involve anyone in this mess anymore. Adhering to her words and yet unwilling to let go of the issue, Laxmi then tries it on himself by attaching a balloon filled with goat blood borrowed from a friend, which leads to Laxmi getting blood stains on trousers in public resulting in humiliation. This act causes him to be branded a 'pervert' and a 'man with loose morals' by the entire village. Gayatri's brothers take her away and Laxmi decides to leave the village, pledging to fight the taboo surrounding menstruation.After learning that sanitary pads use the more absorbent cellulose fibre rather than cotton, Laxmi then goes to a college to gain knowledge about the materials used in sanitary napkins. In need of money and shelter, he ends up working as a manservant in a professor's house. The professor's son introduces him to the internet and helps him get every piece of information. He places an order for cellulose fibre for sanitary pad with an international company. The professor is baffled by Laxmi's actions and shows him videos of pad making machines worth crores to derail his ideas. Instead, Laxmi decides to make his own pad vending machine and leaves the house. He borrows money for his machine and then manages to make a near perfect pad but has no one to test it. By a chance of events, he meets Pari Walia (Sonam Kapoor), and supplies a pad to her. The next day, Laxmi visits her and asks her for feedback. Shocked, she says that it was just like other normal pads. His joy knows no bounds and he calls Gayatri to give her the news. Gayatri, however, gets upset at his obsession with menstruation and her brother warn Laxmi to stay away from them.Meanwhile, Pari invites him to an innovation fair in IIT-Delhi with the winner receiving Rs.2,00,000 as prize money. Laxmi's invention is recognized as the 'Life-changing Innovation of the Year' and he is honoured and felicitated. He shoots to fame but the villagers, on realizing the nature of his invention, badmouth and insult him. His machine is patented and Pari helps him reach out to and sell his pads to the rural women, who later join him, in his pad making venture under the brand name 'Pari'. Laxmi proceeds to make more low cost sanitary pad manufacturing machines for sale to rural women. He is invited to New York and gives a speech in UNICEF which makes him popular. Back home, he is awarded the Padmashri. Pari falls in love with him but then dismisses her own feelings for his happiness. Laxmi returns to a hero's welcome in his village. The film ends with Laxmi and Gayatri finally uniting and Pari leaving with happy memories of Laxmi."
}