{
    "id": "7329858",
    "localized title": "Pari",
    "cast": [
        "Anushka Sharma",
        "Parambrata Chattopadhyay",
        "Rajat Kapoor",
        "Ritabhari Chakraborty",
        "Preeti Sharma",
        "Mansi Multani",
        "Dibyendu Bhattacharya",
        "Imran Rasheed",
        "Mohammed Shakir",
        "Aasif Khan",
        "Vinod Suryavanshi",
        "Joydeep Mukherjee",
        "Jagannath Seth",
        "Anshuman Jha",
        "Nisha",
        "Shamim Khan",
        "Pradip Dhar",
        "Anirban Bhattacharya",
        "Soumen Dutta",
        "Abhijeet Lahiri",
        "Mithu Chakraborty",
        "Usha Nagar",
        "Eshika Dey",
        "Santilal Mukherjee",
        "Kancha Kari",
        "Manoj Diwakar",
        "Suraj Khatri",
        "Jitendra Shastri",
        "Arijit Dutta",
        "Happy",
        "Sujata Ghosh",
        "Sujata Chakraborty",
        "Rana Basu",
        "Jayanta Dey",
        "Praveen",
        "Debabrata",
        "Rwintankar Das",
        "Rohit KaduDeshmukh",
        "Chanda Karanji"
    ],
    "genres": [
        "Fantasy",
        "Horror",
        "Mystery"
    ],
    "runtimes": "136",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:14A::(Alberta)",
        "India:A",
        "Indonesia:17+",
        "New Zealand:R16",
        "Singapore:PG13",
        "Sweden:15",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "02 Mar 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTU4YzgxMjYtMzg4Mi00MjJiLThjOGMtYThkM2E0MWQ1NTA3XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "7329858",
    "plot outline": "On a rainy day, Arnab and his parents are traveling in a car after meeting Piyali regarding his marriage. Their car hits a strange looking old woman who dies on the spot. Arnab and cops locate her house where her daughter Ruksahana is chained who doesn't seem to be normal and is disconnected from outside world. After performing last rites of her mother Arnab leaves Ruksahana back to her house. But Professor Qasim Ali comes to capture her with his men who know about her identity. But she manages to escape and reach Arnab's place who shelters her not knowing her true identity.",
    "languages": "Hindi",
    "title": "Pari",
    "kind": "movie",
    "directors": "Prosit Roy",
    "writers": [
        "Abhishek Banerjee",
        "Prosit Roy",
        "",
        "Anvita Dutt"
    ],
    "producers": [
        "Prerna Arora",
        "Rohit Jayaswal",
        "Arjun N. Kapoor",
        "Saurabh Malhotra",
        "Manoj Mittra",
        "Biplab Das Roy",
        "Sushanto Sarkar",
        "Anushka Sharma",
        "Sudip Sharma",
        "Yogiraj Shetty",
        "Iqbal Siddiqui",
        "Karnesh Ssharma",
        "Hitesh Thakkar"
    ],
    "composers": [
        "Anupam Roy",
        "Ketan Sodha"
    ],
    "cinematographers": "Jishnu Bhattacharjee",
    "editors": [
        "Manas Mittal",
        "Akshay Zine"
    ],
    "editorial department": [
        "Salil Deshpande",
        "Lohit Grover",
        "Tushar Jadhav",
        "Manendra Singh Lodhi",
        "Nitin Minz"
    ],
    "casting directors": [
        "Anmol Ahuja",
        "Abhishek Banerjee"
    ],
    "production designers": "Meenal Agarwal",
    "art directors": "Debashis Debnath",
    "costume designers": "Veera Kapur Ee",
    "make up department": [
        "Vikram Gaikwad",
        "Shoma Goswami",
        "Amit Kamble",
        "Clover Wootton"
    ],
    "production managers": [
        "Jayaraj Hejmady",
        "Himanshu Joshi",
        "Sengupta Lipi",
        "Manthan Prajapati",
        "Mannu Sharma"
    ],
    "assistant directors": [
        "Abesh Banerjee",
        "Poulami Bhattacharya",
        "Awaiz Electricwala",
        "Madhubanti Mukherjee",
        "Eshaan Phadnis",
        "Ambica Rana",
        "Suhaib Rao",
        "Prerak Sharma",
        "Amit Talukdar"
    ],
    "art department": [
        "Kavish Handa",
        "Nikhil Hansora"
    ],
    "sound department": [
        "Debajit Changmai",
        "Prasad Chavan",
        "Sajjan Choudhary",
        "Chowdhry Danish",
        "Anish John",
        "Gokul K.R.",
        "Rahul Karpe",
        "Prathibha Krishnamoorthy",
        "C.V. Raju",
        "Karnail Singh",
        "Ravi Dev Singh",
        "Jaikumar Sivalingam",
        "Omkar Tamhan",
        "Santosh Verma",
        "Aravind Vijayakumar",
        "Varun Visoi"
    ],
    "visual effects": [
        "Aditya Badekar",
        "Shailesh Chibire",
        "Soumen Das",
        "Robin Gaikwad",
        "Yogeshwar Ghodake",
        "Haresh Hingorani",
        "Anand Kambli",
        "Sagar Kudle",
        "Tushar G. Mukharjee",
        "Shamli Naik",
        "Mohnish Parwani",
        "Amit Patidar",
        "Vitthal Pawar",
        "Vitthal Navnath Pawar",
        "Aditi Tiwari",
        "Milind Waghmare",
        "Keitan Yadav"
    ],
    "stunts": [
        "Sunil Rodrigues",
        "Amritpal Singh"
    ],
    "camera department": [
        "Wasim Khan",
        "Pradeep Kharwar",
        "Anooyj Krishnan",
        "Atanu Mandal",
        "Amit Mishra",
        "Milan Rathod",
        "Anup Singh",
        "Karamjit Singh",
        "Monu Kumar Tiwari"
    ],
    "animation department": [
        "Yuvraj Singh Dodia",
        "Soham Parmar"
    ],
    "casting department": [
        "Aasif Khan",
        "Pranav Ojha"
    ],
    "music department": [
        "Arfius Al-din",
        "Rekha Bhardwaj",
        "Vivek Samuel Dayal",
        "Anvita Dutt",
        "Amey Ghule",
        "Dipanjan Guha",
        "Ishan Mitra",
        "Rohan Roy",
        "Rajkumar Sengupta"
    ],
    "script department": "Rohit k Sharma",
    "miscellaneous": [
        "Ishwinder Arora",
        "Makrand Bhadsavle",
        "Mohit Choudhary",
        "Kiran Desai",
        "Varun Gupta",
        "Rukesh Handa",
        "Abhishek Jain",
        "Sumeet Kamath",
        "Sunny Khanna",
        "Saurabh Kharde",
        "Avinash Singh",
        "Rachit Singh",
        "Shrikant Velekar"
    ],
    "akas": [
        "Pari: Not a Fairy Tale (India, Hindi title)",
        "Fairy: Not a Fairytale (United States)",
        "Фея (Russia)"
    ],
    "writer": [
        "Abhishek Banerjee",
        "Prosit Roy",
        "Anvita Dutt"
    ],
    "director": "Prosit Roy",
    "production companies": [
        "Clean Slate Films",
        "Clean Slate Filmz",
        "KriArj Entertainment",
        "Kyta Productions"
    ],
    "distributors": "Pooja Entertainment & Films",
    "special effects": "Redchillies.VFX",
    "other companies": [
        "Light n Light",
        "Post Co. The",
        "Redchillies.Color",
        "Trigger Happy Entertainment",
        "Trigger Happy Entertainment",
        "Trigger Happy",
        "Trigger Jump",
        "Trigger Max",
        "Worldwide Open",
        "Zee Music"
    ],
    "plot": [
        "Arnab tries to help Ruksahana, who is found under mysterious circumstances in a house. He lets her stay at his home until he discovers something strange about her.",
        "On a rainy day, Arnab and his parents are traveling in a car after meeting Piyali regarding his marriage. Their car hits a strange looking old woman who dies on the spot. Arnab and cops locate her house where her daughter Ruksahana is chained who doesn't seem to be normal and is disconnected from outside world. After performing last rites of her mother Arnab leaves Ruksahana back to her house. But Professor Qasim Ali comes to capture her with his men who know about her identity. But she manages to escape and reach Arnab's place who shelters her not knowing her true identity.::alex.mjacko@gmail.com"
    ],
    "synopsis": "A guy (Arnab) with his family is returning from a recent meet with a girl(Piyali) who is a surgeon in an internship and her family to get into arranged marriage but on their way back they get into a car accident in which an old lady dies and when the police is trying to get to the family of the dead old lady they find a girl (Rukhsana) who is chained in a barn in the woods where they lived. The girl is completely cut off from the world and knows nothing about the world. The police closes the case as a suicide and also since Rukhsana doesn't want to be in the world outside of the woods where she with her mother lived but Arnab wants to help her because he feels guilty but Rukhsana goes back to the woods. The next day Rukhsana finds out that the guy (Professor) who has been haunting her since she was a child has found her and runs away to Arnab who takes her to his home to keep her safe. Piyali has agreed to marry Arnab and makes an engagement ceremony at Arnab's house where Rukhsana is already hiding, somehow he manages to hide her and the guests go back home. One day Rukhsana at home was listening to songs on the MP3 while she sees her nails are grown back again so she tries to find the nail cutter which she can't, the day goes by and Arnab comes home and finds blood all over the house and Rukhsana sitting next to it she has cut her nails with a knife and a lot of herself as well then Arnab tries to help her and they get into a moment and they make love to each other. Then one day Rukhsana starts to have a lot of pain and in the evening she is agonizing with the pain when Arnab finds her and tries to help but she doesn't let him so later he goes to sleep and after that Rukhsana starts climbing the building's Windows and sees Adobe she starts to adore him when suddenly she bites him and leave her venom into the dog who dies straight. The next day when Arnab is about to leave for work and he sees the Professor in his building's lobby who is trying to tell him that Rukhsana is not a human and she is just trying to make a baby out of you so she can feed the God of darkness and tells him to stay away from her and don't even think about getting close to her but he already has and she is now pregnant while Arnab unknowingly doesn't believes him and asks him to leave, but then when he finds out that she has killed someone who was trying to kill Arnab he starts to get afraid of her and then he asks her to leave when Rukhsana grabs Arnab by his neck and then realizes and starts apologizing to Arnab then he leaves and goes to his office where he is researching and trying to know what Rukhsana is and he finds a book by the professor who tried to warn him while the professor gets to know that Rukhsana really has feelings for Arnab. Arnab finds the book and reads in it that Rukhsana is the daughter of an evil God who's motive is to make more of his off-springs so one day he can take over the world and goes back to Rukhsana with chains and Rukhsana willingly gets into the chains because she loves him but right after that the professor arrives and Arnab abandons Rukhsana and asks how long will it be to kill her because he so afraid of her and the professor tells him that it takes time to kill these types while his actual motive is just to torture her because she has given a hard time to the professor in this time Piyali finds out about Rukhsana and catches them making love and rushes out and calls off the wedding. 3 weeks has gone by since Arnab abandoned Rukhsana who is being tortured by the professor's goons. Arnab has gone to his parents house and hasn't talked to them or even stepped out of his room when after 3 weeks Piyali comes to confront him and he tells her the truth about Rukhsana and then he realizes what he has done and goes to rescue Rukhsana and finds out that she has already killed all the goons and she is going after Piyali because she tried to steal Arnab from her so he calls Piyali and warns her by that time Rukhsana is already in her house and ready to kill her for vengeance but then she goes into labour and then Piyali gets into moment of awareness and helps Rukhsana deliver the baby and when she comes back after getting cleaned up she sees that Rukhsana has left without the baby and then Arnab comes and sees the baby and finds out that the baby was made out of love and not by the god of darkness and he knows where he will find Rukhsana and goes to the woods and sees her dying because she needs to leave out some of her venom to live and Arnab tries to calm her down by hugging here and when Rukhsana is about to bite Arnab and leave her venom into his body she controls herself and in the process dies out of her own venom Piyali and Arnab raise the child as their own."
}