{
    "id": "7523010",
    "localized title": "Koode",
    "cast": [
        "Prithviraj Sukumaran",
        "Nazriya Nazim",
        "Parvathy Thiruvothu",
        "Atul Kulkarni",
        "Roshan Mathew",
        "Maala Parvathi",
        "Ranjith",
        "Joy Badlani",
        "Krishnakumar Menon",
        "Devan",
        "Nandu Poduval",
        "Santhosh Keezhattoor",
        "Prashant Nair",
        "Vinod Kovoor",
        "Siddharth Menon",
        "Basil",
        "Jolly Chirayath",
        "Sajitha Madathil",
        "Pauly Valsan",
        "Nilambur Ayisha",
        "Prajwal Prasad",
        "Sarath Chandran",
        "Shambhu Menon",
        "Aravind Sk",
        "Sivakumar Sopanam",
        "G.R. Rajan",
        "Baby Mira",
        "Franco Davis Manjila"
    ],
    "genres": [
        "Drama",
        "Fantasy"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "Canada:PG::(Alberta)",
        "India:U",
        "India:U::(CBFC)",
        "Singapore:PG",
        "United Kingdom:PG"
    ],
    "original air date": "14 Jul 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjI5NGM0NGEtNmQ1ZS00YjI5LWJkODYtNzVhY2MwNDFiMmRmXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "7523010",
    "plot outline": "Joshua who spent almost two decades outside the country to earn money for his sister, Jenny's treatment, return for her funeral. Soon, Joshua encounters Jenny's soul who guides him to reclaim his life, spreading happiness and warmth to everyone around them.",
    "languages": "Malayalam",
    "title": "Koode",
    "kind": "movie",
    "directors": "Anjali Menon",
    "writers": [
        "Sachin Kundalkar",
        "",
        "Anjali Menon",
        "",
        "Anjali Menon",
        "",
        "Anjali Menon"
    ],
    "producers": [
        "Anjali Menon",
        "Mini Purushot",
        "M. Renjith",
        "Vinod Unnithan"
    ],
    "composers": [
        "Raghu Dixit",
        "M. Jayachandran"
    ],
    "cinematographers": "Littil Swayamp",
    "editors": "Praveen Prabhakar",
    "editorial department": [
        "Shamal Chacko",
        "Robert Lang",
        "Don Max",
        "Rithesh Rai",
        "Arvind Singh",
        "Antony Nikhil Varghese"
    ],
    "production designers": "Arvind Ashok Kumar",
    "costume designers": "Pampa Biswas",
    "make up department": "Mitta Antony",
    "production managers": [
        "Vivian Pinto",
        "Nandu Poduval",
        "Vinod Unnithan"
    ],
    "assistant directors": [
        "Chandrika Chandran",
        "Manoj Kannoth",
        "Sudharshan Narayanan"
    ],
    "art department": [
        "Shrimathy Karthikeyan",
        "Anjali Mandapaka"
    ],
    "sound department": [
        "Ajayan Adat",
        "Baylon Fonseca",
        "Shaun Froes",
        "Shijomon George",
        "Justin Jose",
        "Jithin Joseph",
        "Subramanian K.V.",
        "Manas Mali",
        "Shijil p Nair",
        "Balu Thankachan"
    ],
    "visual effects": [
        "Sandeep Gupta",
        "Shankar Jalvi",
        "Issac Vethanayagam"
    ],
    "camera department": "Bijith Dharmadam",
    "music department": [
        "Nakul Abhyankar",
        "Rafeeq Ahammed",
        "Anne Amie",
        "Benny Dayal",
        "Raghu Dixit",
        "Abhay Jodhpurkar",
        "Karthik",
        "Shruti Namboothiri"
    ],
    "miscellaneous": "Faiz Akhtar",
    "akas": "Вместе (Russia)",
    "writer": [
        "Sachin Kundalkar",
        "Anjali Menon",
        "Anjali Menon"
    ],
    "director": "Anjali Menon",
    "production companies": [
        "Little Films",
        "Rejaputhra Visual Media"
    ],
    "distributors": [
        "Phars Film",
        "Rejaputhra Visual Media"
    ],
    "plot": [
        "The story is set against the backdrop of hills of Nilgiris where two siblings, Joshua and Jenny, who come from a middle-class family. Together, they dwell on the serenity and calmness of the mountains.",
        "Joshua who spent almost two decades outside the country to earn money for his sister, Jenny's treatment, return for her funeral. Soon, Joshua encounters Jenny's soul who guides him to reclaim his life, spreading happiness and warmth to everyone around them."
    ],
    "synopsis": "The film opens showing Joshua/Josh/Cha(Prithviraj) working in a factory in Dubai/Gulf. He gets an urgent phone call informing about his sister Jenny's death. The movie then shifts to his landing in his home town. He attends Jenny's funeral; Josh seems unperturbed even after being shown Jenny's body.\nFlashback is shown of how Josh - 15 year old, his father a mechanic and his mother pregnant with his sister are preparing for Christmas festivities at home. At the midnight mass, labor pains start and a baby girl is delivered. Josh names his sister Jenny - Jennifer. The flashback shows how he adores and takes care of his baby sister. Jenny is diagnosed with a congenital disease and is expected not to live long, depending on medicines all her life. The hospital expense takes a toll on the not so well off family and they struggle to keep food on the table. With so much happening in the house, Josh is dismissed from his school as he hasn't been performing well. His father who is aware of his love for machines takes him to a train yard to cheer him up.\nJosh's maternal uncle offers help to take Josh to Gulf and put him on some kind of vocation bringing some money to the household. The parents reluctantly agree. A subtle hint of sexual abuse is shown that Josh would have encountered at his uncle's behest. Josh comes out of the flashback at that point.\nJosh discovers many creative expressions of Jenny in terms of drawing, poetry in her room. He is introduced to Brownie-Jenny's dog who seems to have taken a liking to Josh. To take a drive down the town, Josh asks his father to lend him a vehicle. Father shows him Jenny's ambulance van which was used for her hospital trips. He drives the van to a lakeside where he spends some time; he discovers that somebody is sleeping in the van back seat. He finds out that it is his sister Jenny(Nazriya Nazim). He comes out of his dream at that point and goes to the van parked outside his house. To his surprise he does indeed find Jenny alive inside the van talking to him. He sits all night outside the van, he musters courage to ask who she is as he suspects some kind of foul play. The girl convinces that she is indeed Jenny and he is the only person who can see/hear/talk to her.\nStill flabbergasted about the whole situation, he goes inside and gets a cup of coffee as asked by Jenny. She tells him how hungry she is and Josh takes her to a roadside restaurant. They stop at a point on the road and see few children playing football. At that point it is revealed how good he was in football and his coach- Coach Ashraf(Atul Kulkarni) was his mentor. Jenny from now on wards tries to uncover the demons he has buried in his heart.\nJenny borrows Josh's office smart phone and orders materials worth 47000 rupees. Josh is angry and scolds her about spending his hard earned money recklessly. She replies back that she shopped only for him and asks what is the use of earning money if he didn't spend time with his family and not enjoy his life. They fight and she ends up not talking to him. He goes to Jenny's room and finds a desk where there are pictures of Jenny. Each of the picture has her standing/posing with Josh's photograph. He feels bad and goes back to the van and tells her of his decision of staying back for few more days.\nThe story now introduces Sophie(Parvathy), childhood sweetheart of Josh who went on to marry an alcoholic and suffered domestic violence and ended up divorcing him. She is staying with her father and his family. The family members are not happy that she divorced her husband and bad mouth her. Josh and Jenny visit the old dilapidated house that he used to visit back in his child hood. Josh finds Sophie there and they en quire about each other and depart. Sophie back in her house is molested by a younger cousin. She tells this to another relative who interferes. But he advices her that it is not the cousin who is at fault-maybe she herself is an easy target and hence the consequence; depicting his mal intentions as well. She is left aghast at her situation. Next day, Jenny and Josh while roaming about in the van discover Sophie contemplating suicide. Josh comes in the nick of the time and saves her.\nJosh tracks down Coach Ashraf who is shown to suffer some memory loss due to old age living in neglected situation. Josh and Sophie bring him to an old age home and start taking care of him.\nJenny shows Josh her college and tells him about her life there. She tells him about how she liked a boy, Krish who played in a band. Due to her poetic skills, she participates with the band but collapses on one such performance. Krish discovers about her disease and deserts her. Josh finds Jenny's diary filled with love poems. He gives it to Krish.\nJosh finds his father always tinkering/repairing toys that village children bring to him. He discovers that his dad has been tending /taking care of his childhood toys in his attic. He becomes emotional. He realizes the love he missed from his father and buries the grudge he has against his father for sending him away at such a young age. Things seem to take a good turn for coach. On one such day Coach gives Josh his field whistle seeing how Josh still seemed interested in football.\nOne day, Sophie and Josh spend time in the old house discussing about a book, when her family members come and take her away forcibly. Jenny tells Josh to help Sophie as he knows well how much of difference someone's support makes when one is alone. Josh all instigated reaches Sophie's house and calls her to come with him. Sophie taken aback with the suddenness refuses to go with him. It starts to rain and Josh drives back and locks him up in his room, angry on why he listened to Jenny. He then sees Sophie walking to his house all drenched. He runs and opens the door and takes her to his room and shuts the door leaving his family shocked about the turn of events. Sophie's family members come to Josh's house enquiring and make them open the room door only to find that both of them have eloped through the window.\nThey both drive through the place living out of their van.\nKrish catches up with them and invites Josh to the college where they are holding a memorial for Jenny. He then tells Josh that he is ashamed about the way he reacted to Jenny's illness. He discloses that he too liked Jenny. Josh attends the memorial with Sophie. Sophie's cousins/uncles come there and attack Josh. Krish and his friends save them from the gang and they escape.\nJenny is happy having seen Krish save her brother.\nJosh and Sophie are spending the night at the lakeside. Jenny talks to Josh and tells him that he would make an amazing dad. Next morning, Josh discovers that Jenny is nowhere to be found. He breaks down sensing her absence for the first time after her death and realizes how much he will miss her.\nThe film ends with Josh shown to be coaching local lads in football and becoming a father to a baby girl."
}