{
    "id": "7882096",
    "localized title": "Shivu Paru",
    "cast": [
        "Ramesh Bhat",
        "Honnavalli Krishna",
        "Disha Poovaiah",
        "Chitra Shenoy",
        "America Suresh",
        "Tharanga Vishwa"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Fantasy",
        "Romance",
        "Thriller"
    ],
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "D-Cinema 48kHz 5.1",
    "certificates": "India:UA",
    "original air date": "2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTBkM2MyZGItMjg1Yy00YmMyLTgzYWYtNzg3N2VhMWE3ZTdkXkEyXkFqcGdeQXVyODExNzA2MDE@._V1_SY150_CR50,0,101,150_.jpg",
    "imdbID": "7882096",
    "languages": "Kannada",
    "title": "Shivu Paru",
    "kind": "movie",
    "directors": "America Suresh",
    "writers": "America Suresh",
    "producers": "America Suresh",
    "composers": "America Suresh",
    "cinematographers": "Halesh",
    "editors": [
        "Jeevan",
        "Banu Prakash",
        "America Suresh"
    ],
    "writer": "America Suresh",
    "director": "America Suresh",
    "production companies": "Surifilm Arts & Technology",
    "plot": "Famous TV anchor Shiva Shivu marries Paru but due to some unfortunate circumstances, he gets killed by a Mumbai based hitman named Kittappa.",
    "synopsis": "A star-crossed romantic love story of an ill-fated girl Paru who falls in love and eventually get married to a TV anchor Shivu who is coincidentally her lover from the past life who gets killed. Paru kills herself to join her dead husband.Shivu, the protagonist, a celebrity TV anchor at Swarna Channel hosting the popular TV show Pyate Hudgir Hallig Bandru (PHHB) for 5 seasons, rejects many marriage proposals including his co-host Suman insisting he will only marry his dream girl from village who haunting him from child hood. Paru, the only daughter of Rampur village head Jayasihma meets Shivu during the shooting of PHHB show at her village. They fall in love and eventually marries against all odds. Shivu and Paru start their married life in city. During PHHB Grand Finale, a sniper Kittappa from Mumbai makes a final attempt to kill Paru. Coincidently Shivu sees the sniper aiming at his wife and runs to help her instead he was hit by bullet and dies on the spot. Looking at the unfortunate situation Yama turns away without Shivu and the protagonist becomes a Ghost. Eventually Paru discovers with the help of famous TV show Punarjanma on Swarna Channel that Shivu was her lover from past life and they sacrifice their life for each other at young age just like Romeo Juliet. She finally discovers why sniper killed her husband. She kills herself by consuming poison to join Shivu. Paru becomes ghost and joins her husband but the Yama comes and takes them away from earth. Will they take rebirth? Why Kittappa killed Shivu?"
}