{
    "id": "8037610",
    "localized title": "Gulabjaam",
    "cast": [
        "Siddharth Chandekar",
        "Madhura Deshpande",
        "Sonali Kulkarni",
        "Samar Nakhate",
        "Renuka Shahane"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": [
        "India:U::(self-applied)",
        "Singapore:PG"
    ],
    "original air date": "16 Feb 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmIzMWQxMjctYzJhMS00MGFiLTkwOTctMWRmZWRlNGJkYzg3XkEyXkFqcGdeQXVyNjc0NTgxNzc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8037610",
    "plot outline": "Aditya is a young Maharashtrian man from London who comes to Pune to find a someone who would teach him traditional Maharashtrian cooking. His aim is to open a Marathi Gourmet Restaurant in London. In search of a perfect guru, he meets eccentric Radha, a woman who makes lunch boxes for the students and working men in her area. Aditya needs to pass many tests before Radha would accept him as student. But once she starts teaching him, a new path of life opens for Aditya. Gulabjaam is a food film, where Marathi food is almost the third important character.",
    "languages": "Marathi",
    "title": "Gulabjaam",
    "kind": "movie",
    "directors": "Sachin Kundalkar",
    "writers": "Tejas Modak",
    "producers": [
        "Amol Bhagat",
        "Vinod Malgewar",
        "Vishal Vats"
    ],
    "composers": "Debarpito Saha",
    "cinematographers": "Milind Jog",
    "editors": "Suchitra Sathe",
    "editorial department": [
        "Amey Kulkarni",
        "Kolhatkar Mrugank",
        "Sajith Rajendran",
        "Pavan Theurkar"
    ],
    "production designers": "Poorva Pandit",
    "art directors": "Nitin Borkar",
    "assistant directors": "Vaibhav Khisti",
    "art department": "Akshay Ambekar",
    "sound department": [
        "Arif Chagla",
        "Gokul K.R.",
        "Nikhil Varma"
    ],
    "visual effects": [
        "Chetan Deshmukh",
        "Aniket Jog",
        "Adwait Page"
    ],
    "camera department": [
        "Amey Kulkarni",
        "Ranjan Kumar Sahoo",
        "Amol Salunke",
        "Shinge Shrinivas"
    ],
    "music department": "Alok Punjani",
    "miscellaneous": [
        "Ajinkya Jadhav",
        "Vizual Junkies",
        "Prasad Kadam"
    ],
    "writer": "Tejas Modak",
    "director": "Sachin Kundalkar",
    "production companies": "Golden Gate Motion Pictures",
    "plot": [
        "Aditya is a young Maharashtrian man from London who comes to Pune to find a someone who would teach him traditional Maharashtrian cooking. His aim is to open a Marathi Gourmet Restaurant in London.",
        "Aditya is a young Maharashtrian man from London who comes to Pune to find a someone who would teach him traditional Maharashtrian cooking. His aim is to open a Marathi Gourmet Restaurant in London. In search of a perfect guru, he meets eccentric Radha, a woman who makes lunch boxes for the students and working men in her area. Aditya needs to pass many tests before Radha would accept him as student. But once she starts teaching him, a new path of life opens for Aditya. _Gulabjaam_ (qv) is a food film, where Marathi food is almost the third important character.",
        "Aditya a Maharashtrian banker lies to his family about a job in London.But goes to Pune to learn veg Maharashtrian food.He comes across a middle aged woman Radha whose rude to him .But later she teaches him different aspects of cooking on how to purchase groceries and together they start a service dial a chef.Aditya wants to start a restaurant and but can't open up to his family.He also finds the reason why is Radha so passionate about food.::alex.mjacko@gmail.com"
    ]
}