{
    "id": "8108198",
    "localized title": "Andhadhun",
    "cast": [
        "Ayushmann Khurrana",
        "Tabu",
        "Radhika Apte",
        "Anil Dhawan",
        "Manav Vij",
        "Ashwini Kalsekar",
        "Chhaya Kadam",
        "Zakhir Hussain",
        "Rashmi Agdekar",
        "Abhishek Shukla",
        "Mohini Kewalramani",
        "Nikitasha Kapoor",
        "Saumin Patel",
        "Hera Sajid",
        "Abhishek Anand",
        "Vishal Bajaj",
        "Yogesh Chandekar",
        "Rahul Gajjal",
        "Suchitra Mohite",
        "Pratik Nandkumar More",
        "Pankaj Poal",
        "Mahesh Rale",
        "Swapnil Sawant",
        "Kabir Sajid Shaikh",
        "Sujeet Kumar Sharma",
        "Surabhi Sharma",
        "Gopal Singh",
        "Hemendra Pratap Singh",
        "Pawan Singh",
        "Akash Soni",
        "Franco Vaz",
        "Jaydutt Vyas",
        "Hani Yadav"
    ],
    "genres": [
        "Comedy",
        "Crime",
        "Music",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "139",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "Dolby Digital",
        "Dolby Atmos"
    ],
    "certificates": [
        "Argentina:13",
        "Australia:M",
        "Brazil:12",
        "Canada:PG::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Germany:12::(self-applied)",
        "India:UA",
        "Indonesia:17+",
        "Ireland:12A",
        "Italy:T::(self-applied)",
        "Japan:G",
        "Malaysia:P13",
        "Netherlands:12",
        "New Zealand:M",
        "Philippines:PG::(self-applied)",
        "Poland:12::(self-applied)",
        "Singapore:PG13",
        "South Africa:16",
        "South Korea:15",
        "Turkey:16+::(self-applied)",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated",
        "United States:TV-14::(Netflix)",
        "United Arab Emirates:15+::(self-applied)"
    ],
    "original air date": "05 Oct 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZWZhMjhhZmYtOTIzOC00MGYzLWI1OGYtM2ZkN2IxNTI4ZWI3XkEyXkFqcGdeQXVyNDAzNDk0MTQ@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "8108198",
    "plot outline": "Akash a blind pianist is preparing for a London concert.Sophie's scooter bumps into Akash and upon finding he a pianist she takes him to her restaurant Franco's run by her father and offers him a job.Akash meets 70s actor Pramod Sinha at the restaurant who asks him to do a private concert of his songs at his residence to surprise his wife Simi. Next Day upon reaching his house a shocking surprise is waiting for Akash.",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "Andhadhun",
    "kind": "movie",
    "directors": "Sriram Raghavan",
    "writers": [
        "Arijit Biswas",
        "",
        "Yogesh Chandekar",
        "",
        "Sriram Raghavan",
        "",
        "Hemanth M. Rao",
        "",
        "Pooja Ladha Surti",
        "",
        "Olivier Treiner"
    ],
    "producers": [
        "Bobby Adhale",
        "Vishal Bajaj",
        "Vicky Bhatia",
        "Amit J. Chaudhary",
        "Kewal Garg",
        "Hetvi Karia",
        "Ashish Kathpal",
        "Kanchan Marathe",
        "Pratik Nandkumar More",
        "Gaurav Nanda",
        "Dikssha Jyote Routray",
        "Sanjay Routray",
        "Sharda Singh",
        "Archana Tamboskar",
        "Ashok Vashodia",
        "Maciej Zemojcin"
    ],
    "composers": [
        "Daniel B. George",
        "Girish Nakod",
        "Raftaar",
        "Amit Trivedi"
    ],
    "cinematographers": "K.U. Mohanan",
    "editors": "Pooja Ladha Surti",
    "editorial department": [
        "Abhishek Anand",
        "Ranganath Gowda",
        "Sajith Rajendran",
        "Vipin Surve"
    ],
    "casting directors": "Girdhar Swami",
    "production designers": [
        "Donald Reagen Gracy",
        "Snigdha Karmahe",
        "Anita Rajgopalan Lata",
        "Pankaj Pol"
    ],
    "art directors": [
        "Amrish Patange",
        "Dayanidhi Patturajan"
    ],
    "costume designers": [
        "Sabina Halder",
        "Anaita Shroff"
    ],
    "make up department": [
        "Nikita Kapoor",
        "Bahadur Singh",
        "Preetisheel Singh"
    ],
    "production managers": [
        "Vicky Bhatia",
        "Sachin Bhintade",
        "Raj Gori",
        "Harshad Jayvant Jadhav",
        "Sanjeev Kumar",
        "Nusrat Somjee",
        "Daksha Thakkar"
    ],
    "assistant directors": [
        "Konrad Bajno",
        "R. Bishal",
        "Yogesh Chandekar",
        "Jashvender Chauhan",
        "Aditya Gupta",
        "Priyanka Kashikar",
        "Aastha Khanna",
        "Tisha Mehra",
        "Daani Naidu",
        "Rakesh Sain",
        "Hera Sajid",
        "Abhishek Shukla",
        "Pooja Ladha Surti"
    ],
    "art department": [
        "Pranay Chaure",
        "Priya Ju",
        "Shashank Nigam",
        "Balram Raut",
        "Binay Sarkar",
        "Gayatri Shinde",
        "Seema Yadav"
    ],
    "sound department": [
        "Madhu Apsara",
        "Nikunj Arora",
        "Arpit Chandra",
        "Sajjan Choudhary",
        "Chowdhry Danish",
        "Gokul K.R.",
        "Ajay Kumar P.B.",
        "Akash Sengupta",
        "Altamash Shrivastav",
        "Harjeet Singh",
        "Karnail Singh",
        "Justin E. Thomas",
        "Varun Visoi"
    ],
    "visual effects": [
        "Andronikos Bisogiannis",
        "Elias Deros",
        "Ajay Gaikwad",
        "Jorgo Gjikopulli",
        "Vikash Jaiswal",
        "Sandeep Kamal",
        "Pavlos Kapalas",
        "Melina Kapota",
        "Dimitris Koulalis",
        "Stavros Makrozachopoulos",
        "Chandan Mehta",
        "Petros Naoumis",
        "Raghav Rai",
        "Vivekananthan Rajasekaran",
        "Rajeev Kumar Rastogi",
        "Vivek Shankhla",
        "Amarjeet Singh",
        "Amarjeet Singh",
        "Neel Trivedi",
        "Stefanos Vyrinis",
        "Danny Wilson",
        "Rahul Vishwakarma"
    ],
    "stunts": "Parvez Khan",
    "camera department": [
        "Rudhraveer Singh Bhati",
        "Ajay Chavan",
        "Mahesh Gowda",
        "Nilesh Gowda",
        "Mhetre Jitesh",
        "Deepak Menon",
        "Bhatt Mihir",
        "Ganesh Patil",
        "Bhagyesh Sharma",
        "Pankaj Sharma",
        "Rudraveer Singh",
        "ShyamKumar Thakur"
    ],
    "animation department": [
        "Mohammad Aqib",
        "Fotinos Chiolos",
        "Christophe Menchior",
        "Antonis Moisiadis",
        "Xenia Mourafeti",
        "Stathis Nikou",
        "Dimosthenis Vagias"
    ],
    "costume departmen": "Hemlataa Pariwal",
    "music department": [
        "Robin Fargose",
        "Altamash Faridi",
        "Shadab Faridi",
        "Daniel B. George",
        "Abhishek Ghatak",
        "Protijyoti Ghosh",
        "Paritosh Hazare",
        "Vineeth Jayan",
        "Ujjwal Kashyap",
        "Ayushmann Khurrana",
        "Ikramuddin Lochoor",
        "Ankur Mukherjee",
        "Girish Nakod",
        "Aman Nath",
        "Akash Noatia",
        "Raash Pabri",
        "Raftaar",
        "Raja Rasaily",
        "Raghav Sachar",
        "Jaideep Sahni",
        "Aakanksha Sharma",
        "Arijit Singh",
        "Abhijeet Srivastava",
        "Urmila Sutar",
        "Divyanshu Tejwani",
        "Amit Trivedi",
        "Franco Vaz",
        "Volkan Öztürk"
    ],
    "production department": "Kanchan Marathe",
    "miscellaneous": [
        "Ajit Andhare",
        "Priya Aven",
        "Jitu Bhowmik",
        "Prabhat Choudhary",
        "Ankita Darde",
        "Rudrarup Datta",
        "Vijay Ganguly",
        "Neeraj Goswamy",
        "Gayatri Gulati",
        "Reema Jogi",
        "Rakesh Kank",
        "Shraddha Malkar",
        "Abhishek Pai",
        "Siddharth Pande",
        "Ashish Pandey",
        "Bimal Parekh",
        "Hiral Parekh",
        "Ganesh Patil",
        "Sarita Patil",
        "K.G. Ramnarayan",
        "Manish Sinha",
        "Sudhanshu Vats"
    ],
    "thanks": [
        "Emilia Henriques da Silva",
        "Shridhar Raghavan",
        "Rupesh Tillu"
    ],
    "akas": [
        "Mud Mud Ke Na Dekh (India, Hindi title)",
        "The Blind Melody (World-wide, English title)",
        "The Blind Melody (United States)",
        "调音师 (China, Mandarin title)",
        "盲目のメロディ インド式殺人狂騒曲 (Japan, Japanese title)"
    ],
    "writer": [
        "Arijit Biswas",
        "Yogesh Chandekar",
        "Sriram Raghavan"
    ],
    "director": "Sriram Raghavan",
    "production companies": [
        "Matchbox Pictures",
        "Viacom18 Motion Pictures"
    ],
    "distributors": [
        "Beijing Herui FIlm Culture",
        "Eros Worldwide",
        "Eros Worldwide",
        "Lian Ray Global",
        "SpaceBox",
        "Viacom18 Motion Pictures"
    ],
    "other companies": [
        "Bandish Studios",
        "Marching Ants",
        "Pentacle Creationz",
        "Prime Focus",
        "Spice",
        "Zee Music Company"
    ],
    "plot": [
        "A series of mysterious events change the life of a blind pianist, who must now report a crime that he should technically know nothing of.",
        "Akash a blind pianist is preparing for a London concert.Sophie's scooter bumps into Akash and upon finding he a pianist she takes him to her restaurant Franco's run by her father and offers him a job.Akash meets 70s actor Pramod Sinha at the restaurant who asks him to do a private concert of his songs at his residence to surprise his wife Simi. Next Day upon reaching his house a shocking surprise is waiting for Akash.::alex.mjacko@mypeepul.com",
        "A pianist who pretends to be blind for inspiration, witnesses a murder and has to deal with the murderer wife of the victim and her boyfriend. During his ordeal he loses his eyesight for real and struggles save his life from the murderous duo.",
        "Akash a piano player pretending to be blind he meets Sophie who gives him a break to play at her father's restaurant.Inspired with his talent former actor Pramod Sinha invites him to his house to play on his wife's Simi's birthday.Upn reaching Akash finds Pramod is dead and he pretends of being unaware of things around.But trouble starts when Simi suspects that he is not blind.::alex.mjacko@gmail.com"
    ],
    "synopsis": "A farmer hunts a pesky seemingly visually impaired hare in a cabbage field beside a highway. As the hare hides behind a milestone on the highway the farmer spots it and takes aim with his gun.Akash (Ayushmann Khurrana) is a talented but seemingly blind pianist in search of inspiration. He spends his time fervently attempting to complete a musical piece which is an example of his finest art. The only people seemingly aware of his innocuous presence initially are a neighboring kid who keeps testing him in attempts to see if he is truly blind, and a pet cat named Rani.Akash is knocked over while crossing the road one day by Sophie (Radhika Apte) whose father owns a diner. Sophie is awed by Akash's talent and gets him a gig at the diner where he is noticed by yesteryear actor Pramod Sinha (Anil Dhawan). Pramod is married to Simi (Tabu) and to commemorate their wedding anniversary, invites Akash over to his apartment for a private performance for himself and his wife. Sophie drops him back to his flat, whereupon it is revealed that Akash can see, as he watches Sophie drive away. Sophie is oblivious to this, however, and the two develop a relationship.When Akash reaches Pramod Sinha's flat, Simi opens the door and is reluctant to let him in, but does so when she sees that her neighbor is watching them. Simi, convinced that Akash is blind, allows him to play the piano inside. Akash begins, but immediately notices a body nearby. However, he feigns ignorance and continues to play the piano to maintain his charade of blindness.Akash excuses himself and goes to the bathroom whereupon he sees Inspector Manohar (Manav Vij) hiding but acts as if he is unaware of him, since he is assumed to be blind. On his return to the piano, he manages to identify the body as that of Pramod Sinha. Simi and Manohar (who were lovers) clean the body up silently and put it in a suitcase to be disposed off while Akash resumes playing the piano - supposedly unaware. In a flashback, it is revealed that Pramod had lied to his wife about a supposed trip to Bangalore, but had, in reality, gone to bring anniversary gifts as a surprise for his wife.Afterwards, Akash attempts to report the murder but is unable to, as he discovers that Manohar is an inspector in the police station. As Inspector Manohar would know Akash was aware the whole time, Akash finally ends up lying about the boy living downstairs, and accusing him of killing his cat Rani to change the reason of his approaching the police.Simi manages to kill the neighbor who had also noticed Manohar's entry into the flat, once again in the unwitting Akash's presence, who is forced to continue his charade of being unaware of either of the murders.Both Manohar and Simi continue to browbeat Akash, perpetually testing him to ascertain if he was really blind. Akash finally cracks when Simi manages to pour poison in his coffee in front of him, in an attempt to ascertain if he was really blind. Akash then insists that he doesn't want any problems, and just wants to leave for a concert in London. He then tells Simi that he faked the blindness as part of a social experiment in one of his pursuits for inspiration as an artist. However, he begins to choke, realizing that a sweet that Simi had given him earlier was poisoned. Retching, he collapses.Sophie comes by, and sees that the neighboring child had recorded a video of Akash moving and seeing his way about like a normal person. Furious and heartbroken, she leaves him. Akash wakes up and, realizing that he cannot see, fervently washes his eyes. He realizes he has been blinded and demands that Simi restore his sight. Simi tells him to focus on his art and that no one would believe his story of her guilt on the two murders since he was a blind man, and leaves. After a discussion with Manohar, they decide that blinding Akash would not be enough as he could still reveal details, and Manohar comes back to finish the job. After a tense struggle, Akash escapes out to the road, faints and comes to in a shady clinic, which is revealed to be a front for illicit organ harvesting.Dr. Swami (Zakir Hussain) and his two assistants decide to spare Akash and help him in his quest for gaining money required to reverse his blinding. They kidnap and subdue Simi and blackmail Manohar into bringing one crore rupees to a specified location. At this point several twists come about. The assistants tie Akash up with Simi to claim all of the money for themselves. They then extort the money from Manohar, who shoots one of them but gets trapped in an elevator by the other. Manohar, trapped, then ends up accidentally shooting himself, leaving his fate uncertain. The money extorted from Manohar is eventually revealed to be fake money.Meanwhile, a desperate Akash removes Simi's blindfold after she helps him to free himself. Akash, blind but guided by Simi, attempts to escape while Simi frees herself and attacks him. Dr. Swami enters and the two of them subdue Simi. Dr. Swami and Akash tie Simi in the trunk of a car and begin driving. Dr Swami reveals his plans to harvest Simi's organs for six crore rupees and pay for Akash's cornea transplant, but Akash is morally perturbed by the notion. Dr. Swami drives away with Akash, with Simi bound in the trunk.Two years later, in Europe, a travelling Sophie meets Akash (still apparently blind with dark glasses) at one of his gigs in Europe, where he tells her the entire story.Akash then tells her that after Dr. Swami had driven away with him, Simi awakened in the trunk and started making noises. Dr. Swami dismisses Akash's scruples, stops the car and goes to the trunk of the car, where he is swiftly overpowered by Simi. Simi then takes control of the car. Akash, thinking that it is still Dr. Swami at the wheel, continues to try to convince him to let Simi go. Hearing this, Simi drops Akash off and drives off but changes her mind and turns around, intending to run him over. At this point, the hare (from the beginning of the movie) slams into her windshield, causing her to lose control and crash. The car explodes, killing Simi with it.Sophie hears the entire story and commiserates. She tells Akash that he should have harvested Simi's organs and gotten his sight back. Akash, however, doesn't say a word and leaves with the help of his stick, which has a rabbit carved on its handle. Once out of sight, he uses the stick to smartly swat a can out of his path."
}