{
    "id": "8338746",
    "localized title": "Phamous",
    "cast": [
        "Jimmy Shergill",
        "Shriya Saran",
        "Kay Kay Menon",
        "Pankaj Tripathi",
        "Jackie Shroff",
        "Mahie Gill",
        "Brijendra Kala",
        "Achyut Potdar",
        "Deepraj Rana",
        "Jameel Khan",
        "Samvedna Suwalka",
        "Karan Patel",
        "Padmavati Rao",
        "Satyadeep Misra",
        "Sachal Tyagi",
        "Sumvinder Khanduri",
        "Sitaram Panchal",
        "Flora Bose",
        "Rajendra Gupta",
        "Akshay Mittal",
        "Yusof Mutahar",
        "Ravi Sah"
    ],
    "genres": [
        "Comedy",
        "Crime",
        "Drama",
        "Romance"
    ],
    "runtimes": "115",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+::(Netflix self-rating)",
        "India:A",
        "Singapore:NC16"
    ],
    "original air date": "01 Jun 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDQwOGM0YTYtN2VhMi00NTQzLTg4MmUtYWEzM2U2YzIzNDVmXkEyXkFqcGdeQXVyODQwMDcwNDY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "8338746",
    "plot outline": "Set in the wild wild east, the story of Phamous invites you on an odyssey that hits your heart and face at the same time. Find love, power and wisdom amidst guns and dhakkad's. In a clash of ambition, love and hope, this story shows the rise of the unique duo of Kadak Singh and Ram Vijay Tripathi against the patriarch Shambhu all tied up in a saga by an innocent boy. Politics and Power come against Love and Revenge exposing the hollow darkness of human nature. How the most powerful people fall for the clumsiest human emotions and are willing to tear down the world around them, making it very difficult for loyalty, love and hope to exist. Will it survive? Starring Kay Kay, Pankaj Tripathi, Jackie Shroff and Jimmy Sheirgill along with Shriya Saran, the characters welcome you to the land of bandook for the war, is on.",
    "languages": "Hindi",
    "title": "Phamous",
    "kind": "movie",
    "directors": "Karan Butani",
    "writers": "H. Banerjee",
    "producers": [
        "Amitabh Chandra",
        "Sunit Jawadekar",
        "Raj Khatri",
        "Nivedita Kothare"
    ],
    "composers": "Krsna Solo",
    "cinematographers": "Chetan Vohra",
    "editors": "Nayan Haresh Bhadra",
    "editorial department": "Tushar Desai",
    "production designers": [
        "Dhananjoy Mandol",
        "Harjeet Singh"
    ],
    "art directors": "Balram Sarkar",
    "costume designers": "Mansi Shah",
    "production managers": "Ritankar Nandy",
    "assistant directors": [
        "Mousumi Chatterjee",
        "Powell Jadaun",
        "Ekal Deep Kaur",
        "Pratik Kothari",
        "Pradeep Kumar",
        "Akshay Mittal",
        "Amit Saini",
        "Rahul Deo Verma"
    ],
    "art department": "Aaryan Prajapati",
    "sound department": "Sujit Shingare",
    "visual effects": "Gurdit Singh",
    "camera department": [
        "Rajbir Singh",
        "Sukhwinder Singh"
    ],
    "music department": [
        "Arfius Al-din",
        "Vishal Dadlani",
        "Jonita Gandhi",
        "Sundeep Gosswami",
        "Rohit Meena",
        "Jubin Nautiyal",
        "Priyanka Negi",
        "Akash Prajapati",
        "Puneet Sharma",
        "Naveen Tyagi"
    ],
    "miscellaneous": [
        "Varun Gupta",
        "Anil Rodhan",
        "Ranjit Singh"
    ],
    "writer": "H. Banerjee",
    "director": "Karan Butani",
    "production companies": [
        "Om Reels",
        "Vidisha Productions"
    ],
    "plot": [
        "India's highlands descend into bullet-riddled mayhem as the longtime rivalries and ruthless revenge missions among four men come to a head.",
        "Set in the wild wild east, the story of _Phamous_ (qv) invites you on an odyssey that hits your heart and face at the same time. Find love, power and wisdom amidst guns and dhakkad's. In a clash of ambition, love and hope, this story shows the rise of the unique duo of Kadak Singh and Ram Vijay Tripathi against the patriarch Shambhu all tied up in a saga by an innocent boy. Politics and Power come against Love and Revenge exposing the hollow darkness of human nature. How the most powerful people fall for the clumsiest human emotions and are willing to tear down the world around them, making it very difficult for loyalty, love and hope to exist. Will it survive? Starring Kay Kay, Pankaj Tripathi, Jackie Shroff and Jimmy Sheirgill along with Shriya Saran, the characters welcome you to the land of bandook for the war, is on."
    ],
    "synopsis": "The movie is set in Chambal in Madhya Pradesh, India, a town notoriously famous for dacoits and where the possession of a gun made you famous. The story begins at Shambhu Singh's (Jackie Shroff) daughter's wedding when Kadak Singh (Kay Kay Singh) kidnaps her for Tripathi (Pankaj Tripathi), a sleazy local politician that he serves. Being the first man in power for the possession of a fine rifle in the town, Shambu Singh accidentally shoots his own daughter in an attempt to save her. After being arrested, Shambu Singh spends his time in jail plotting to avenge his daughter. The town falls in the hands of Tripathi who takes political control since Shambu was now out of the way. Assisted by his faithful sidekick Kadak Singh, he terrifies the town folk with rape, murder and shootings.Radhe (Jimmy Sheirgill ), who lives in Chambal, idolizes Kadak Singh, but hates Tripathi who rapes and kills his favourite teacher, Rosy (Mahie Gill). Kadak also develops a certain respect for the boy when he saves him from the police and over time even starts to treat him like a brother.Years later, Raadhe's marriage gets fixed with the local Thakur's daughter, Lalli (Shriya Saran). Their marriage is not happy at first because of Lalli's past mistakes but they get over the hurdle and eventually fall in love with each other. Things are great for a while. Kadak offers Raadhe a good job and Raadhe gets to work for his idol.But the good times end when Tripathi starts to eye Lalli and when Raadhe protests, orders Kadak to kill Raadhe and bring Lalli to him. Kadak, now caught between his love for the boy and his duty to his boss tries to reason with both of them. Having failed, he orders his men to kidnap Lalli and kill Raadhe with a heavy heart. Kadak's men bury Raadhe alive and lock Lalli up in a room to await Tripathi's pleasure. That's when Shambu Singh jumps back into the scene and rescues Raadhe from his grave.Shambu, heart filled with vengeance and Raadhe in an attempt to save his trapped bride attack Tripathi's residence. Shambu dies in the attack but not before he kills Kadak having finally avenged his daughter's death. Raadhe thrashes up Tripathi killing him and saving Lalli from his clutches. The story ends with Raadhe and Lalli leaving Chambal for good."
}