{
    "id": "8396262",
    "localized title": "Sultan The Saviour",
    "original title": "Sultan: The Saviour",
    "cast": [
        "Jeet",
        "Prantik Banerjee",
        "Mukul Dev",
        "Taskeen Rahman",
        "Bidya Sinha Saha",
        "Priyanka Sarkar"
    ],
    "genres": "Thriller",
    "runtimes": "163",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "15 Jun 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDk3N2JjNGItYjk3Ni00NzhiLTk0OGEtMzRkMDZhYTBhM2EzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "8396262",
    "languages": "Bangla",
    "title": "Sultan: The Saviour",
    "kind": "movie",
    "directors": "Raja Chanda",
    "writers": "Anshuman Pratyush",
    "producers": [
        "Abdul Aziz",
        "Jeet",
        "Amit Jumrani",
        "Gopal Madnani",
        "Nishpal Singh"
    ],
    "composers": "Savvy Gupta",
    "cinematographers": "P. Shelvakumar",
    "editors": "Md. Kalam",
    "editorial department": [
        "Halim Ahmed Atish",
        "Debakriti Kundu",
        "Soumitra Sarkar"
    ],
    "art department": "Shakib Hasan Soukhin",
    "visual effects": [
        "Amit Chakraborty",
        "Sudip Samanta"
    ],
    "music department": [
        "Arfius Al-din",
        "Savvy Gupta",
        "Subhadeep Mitra",
        "Suddho Roy",
        "Anupam Sen",
        "Ahsan Shoishob",
        "Abir Sourav"
    ],
    "akas": "Sultan The Saviour (India, English title)",
    "writer": "Anshuman Pratyush",
    "director": "Raja Chanda",
    "production companies": [
        "Jeetz Filmworks",
        "Surinder Films"
    ],
    "distributors": [
        "BongOz Films",
        "Jeetz Filmworks"
    ],
    "plot": "A man decides to save his sister from the clutches of a deadly Mafia Don.",
    "synopsis": "Raja (Jeet) and his sister Disha (Priyanka Sarkar) come to settle down in Kolkata where she has enrolled for a course to hone her artistic skills. Raja is an extremely peace loving soft-hearted person who makes even rowdies like Kolkata Kaali like him in one instant. Kolkata is also the operating base of a high-profile international criminal syndicate run by three brothers Urbish (Mukul Dev), Umang and Ujaan .Raja advised by his new house owner starts working under Apatya (Kanchan Mullick) who owns a Taxi company.\nCops in Kolkata ask Taxi and Auto drivers for help in nabbing criminal members of Urbish gang and prepare a suspect list. Raja identifies one of the suspects and informs the police about the where abouts of the criminals which leads to a large haul of illegal weapons, drugs, money and also to the arrest of many of the lower level gang members belonging to Urbish. Frustrated, Umang finds Raja and brings him to his den to be killed, but is instead killed by Raja who becomes extremely violent during the altercation. Simultaneously Raja gets acquainted with Aliya (Mim) and Aliya's brother Ahir gets acquainted with Disha in two separate incidents and they are attracted to each other and Ahir gets his parents to meet and officially ask for Disha's hand in marriage.\nUmang who gets to know about Ujaan's death comes to Kolkata and tries to find the murderer using a highly sophisticated technical team who track the GPS of the mobile which were in the area. As the final trace emerges it is revealed that Raja has infiltrated the building where Umang had set up camp. Raja after a violent fight with the mercenaries and Umang, kills everyone in the building and receives Urbish's call and informs him about the deaths of Umang & Ujaan, while all this has been witnessed by Aliya. Aliya rushes to stop the engagement of his brother, but is stopped by Raja, who reveals his history of being Sultan Bhai, a notorious goon in Diwanganj, who was shown affection by Disha and her parents even though he vacated them out of their own house for money. Disha gets entangled in a flesh trade kidnapping scandal under Umang and is rescued by Raja, but also incurs injury impacting her memory. Her parents are also murdered during this incident. Raja brings her to Kolkata to take revenge and also to enroll her into the best arts college in the country which is present there.\nUrbish who coincidentally gets help from Disha to sketch out the suspect kidnaps her and thus ensues a final take down fight with Raja. Raja is able to hide his true violent self from Disha and also kill Urbish thus exacting his revenge and keeping his sister safe."
}