{
    "id": "8396238",
    "localized title": "Farzand",
    "cast": [
        "Mrunmayee Deshpande",
        "Sameer Dharmadhikari",
        "Neha Joshi",
        "Astad Kale",
        "Mrinal Kulkarni",
        "Chinmay Mandlekar",
        "Rohan Mankani",
        "Ankit Mohan",
        "Prasad Oak",
        "Ajay Purkar",
        "Nikhil Raut",
        "Pradhuman Singh",
        "Pravin Tarde"
    ],
    "genres": [
        "Action",
        "Drama",
        "History",
        "War"
    ],
    "runtimes": "141",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "Singapore:NC16"
    ],
    "original air date": "01 Jun 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmM2NGI3NDYtYmI1MS00NjQ3LWIzNTgtYWUwODVlNWExMmI3XkEyXkFqcGdeQXVyNjc0NTgxNzc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8396238",
    "plot outline": "Maharashtra has a very well known history and in that, the period of Shivaji Maharaj is of pride to us all. Adilshah from Bijapur was the strongest enemy of Shivaji Maharaj and the ruler of Konkan and Maharashtra. Shivaji established Swaraj in these parts and set the people free from Adilshah's slavery. And hence, he became Shivaji's biggest enemy. Adilshah later, declared a war against Shivaji Maharaj and captured the Panhala fort. After several attempts for recapturing the fort, Shivaji Maharaj failed. Adilshah, being a tricky politician, appointed the brutal Beshakh Khan as the guardian of the fort. The illegal and immoral acts of Beshakh Khan was against Swaraj and a hurdle for the coronation of Shivaji Maharaj. To stop him and capture the fort of Panhala was now an issue of prestige for Shivaji Maharaj. Farzand is the movie about Shivaji Maharaj's 60 great warriors lead by Kondaji Farzand, which portrays their great achievements in capturing Panhala fort.",
    "languages": "Marathi",
    "title": "Farzand",
    "kind": "movie",
    "directors": "Digpal Lanjekar",
    "writers": [
        "Iraj Farahvashi",
        "",
        "Digpal Lanjekar"
    ],
    "producers": "Anirban Sarkar",
    "composers": "Dj Swap India",
    "cinematographers": "Kedar Prabhakar Gaekwad",
    "editors": "Pramod Kahar",
    "editorial department": "Mayuresh Bavare",
    "art directors": "Nitin Chandrakant Desai",
    "assistant directors": [
        "Nikhil Lanjekar",
        "Aishwarya Shidhaye"
    ],
    "art department": "Anil Gunjal",
    "sound department": [
        "Pranav Madhav Abhyankar",
        "Himanshu Mahesh Ambekar",
        "Arpit Chandra",
        "Parth Gondhalekar",
        "Nikhil Lanjekar",
        "Rajakrishnan M.R."
    ],
    "visual effects": [
        "Jishnu P. Dev",
        "Amey Gosavi",
        "Dharmesh Kanani",
        "Sneha Kanekar",
        "Siddhesh Ware"
    ],
    "camera department": [
        "Prathamesh prakash Avasare",
        "Dhruv Desai",
        "Ravish Jaiswal",
        "Ranjan Kumar Sahoo",
        "Nikhil Sonawane"
    ],
    "music department": [
        "Amitraj",
        "Kedar Divekar",
        "Gourav Korgaonkar"
    ],
    "miscellaneous": [
        "Ganesh Gargote",
        "Vizual Junkies",
        "Akshata Tikhe"
    ],
    "writer": [
        "Iraj Farahvashi",
        "Digpal Lanjekar"
    ],
    "director": "Digpal Lanjekar",
    "production companies": "Swami Samartha Creations",
    "other companies": "Media One",
    "plot": [
        "_Farzand_ (qv) follows the story of warrior Kondaji _Farzand_ (qv), who along with 60 warriors defeated 2500 soldiers of the enemy to win the Panhala fort in just three and half hours in 1673.",
        "Maharashtra has a very well known history and in that, the period of Shivaji Maharaj is of pride to us all. Adilshah from Bijapur was the strongest enemy of Shivaji Maharaj and the ruler of Konkan and Maharashtra. Shivaji established Swaraj in these parts and set the people free from Adilshah's slavery. And hence, he became Shivaji's biggest enemy. Adilshah later, declared a war against Shivaji Maharaj and captured the Panhala fort. After several attempts for recapturing the fort, Shivaji Maharaj failed. Adilshah, being a tricky politician, appointed the brutal Beshakh Khan as the guardian of the fort. The illegal and immoral acts of Beshakh Khan was against Swaraj and a hurdle for the coronation of Shivaji Maharaj. To stop him and capture the fort of Panhala was now an issue of prestige for Shivaji Maharaj. _Farzand_ (qv) is the movie about Shivaji Maharaj's 60 great warriors lead by Kondaji _Farzand_ (qv), which portrays their great achievements in capturing Panhala fort.::Bhadresh Pandav"
    ],
    "synopsis": "Tanaji Malusare (Ganesh Yadav), one of Shivaji's top generals dies , while capturing Kondana fort near Pune from a Mughal garrison approx( 1670). The fort was renamed Sinhagad by Shivaji in memory of Tanaji. the famous quote - Gad Aala pan Shinva Gela happened during this timeLater, Shivaji is to be crowned king. But Shivaji himself is not happy. Coronation would be meaningless if he is unable to secure the boundaries of his kingdom and provide peace and security to his people. Panhala fort, near Kolhapur, at the southern limits of his kingdom, is still under the command of an able & strong general, Beshak Khan, of the Adilshah of Bijapur. He was a former Mughal army member at Sinhagad and, presumably, responsible for killing TanajiKhan's forces harass the peasantry in the surrounding villages. But what rankles Shivaji more is that an attempt under his own leadership to retake the fort in 1666, which he had held briefly in 1660 after killing the fearsome Adilshahi general Afzal Khan, had failed miserably, and the misadventure had cost the lives of more than 1,000 of his soldiers. Baji Prabhu died in the battle of Pavankhind to allow Shivaji to escape to Vishalgad. Baji Prabhu fought valiantly in that pass for five hours, supposedly with two swords weighing 15 kilograms eachShivaji decides on Subedar Kondaji Farzand (Ankit Mohan), for the mission. Farzand was Tanaji's disciple & keen on revenge..Farzand asks for only 60 handpicked soldiers for an assault on the fort that houses a 2,500-strong Bijapur garrison. The Marathas receive able support from the fabled, impersonator & Intelligence chief Bahirji Naik (Prasad Oak), a tamasha troupe member and informer Kesar (Mrunmayee Deshpande), and others. Farzand collects & trains his team rigorously to prepare for the attack. They get plans & find the most improbable & steep side to climb up.\nBahirji Naik & Kesar get into Beshak Khan's army but are captured. Kesar kills Khamat Khan & along with Bahirji Naik help in the attack on Panhala by Kondaji. The smart & brave 60 marathas attack intelligently with fire arrows, axes, swords & slings. Kesar fights valiantly but is wounded grievously. Beshak Khan & his fighters beat Kondaji & bleed him a lot. Finally Kondaji Farzand kills Beshak Khan. Shivaji Maharaj joins the battle with his troops in the finale. Tanaji Malsure is finally avenged. Shivaji, Bahirji & Kondaji pay respects to Sivhnagad."
}