{
    "id": "8535546",
    "localized title": "Aatagadharaa Siva",
    "cast": [
        "Hyper Aadi",
        "Bhadram",
        "Chammak Chandra",
        "Chanti",
        "Doddanna",
        "Uday Shankar"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "111",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "original air date": "19 Jul 2018 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTY3M2U1YWUtNTU4YS00MmRjLTg3NWMtNjQ4MTFkZDdjNDBjXkEyXkFqcGdeQXVyNDc2NzU1MTA@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "8535546",
    "languages": "Telugu",
    "title": "Aatagadharaa Siva",
    "kind": "movie",
    "directors": "Chandra Siddhartha",
    "writers": "Muni Suresh Pillai",
    "producers": "Rockline Venkatesh",
    "composers": [
        "Nobin Paul",
        "Vasuki Vaibhav"
    ],
    "cinematographers": "Lavith",
    "editors": "Navin Nooli",
    "editorial department": "Tom C. Jose",
    "music department": [
        "Ananya Bhat",
        "Pulagam Chinnarayana"
    ],
    "writer": "Muni Suresh Pillai",
    "director": "Chandra Siddhartha",
    "production companies": "Rockline Entertainment",
    "distributors": [
        "Blue Sky Cinema",
        "Global Cinemas",
        "Rockline Entertainment",
        "Sri Greeshma Deepika Films",
        "Whacked Out Media"
    ],
    "plot": "Revolving around the idea of \"life is a game\", the suspense comedy-drama features Hyper Aadi, Chammak Chandra and Chalaki Chanti in pivotal roles.",
    "synopsis": "Jangayya, a local vet in a small village in Telangana, India, a man well loved by the locals but has no family to live for also works as the local executioner for the Central Jail in Hyderabad. He receives a summons from the prison one day after he had just finished treating an injured cow to come and execute a prisoner. When questioned by the cow's owner as to how such a kind and caring person can also do such a terrible job, he responds that evil must be eliminated to protect those we care for.Meanwhile, a prisoner in the Central Jail in Hyderabad escapes that night after faking an injury and attacking the police officer who comes to tend to his wounds. The man escapes the city and starts to wonder around the country side. The news of the breakout is all over the media with the police offering a large price to anyone who might turn him over. But over time the people forget about the sensational news. The newspapers and fliers with his face on it end up as packaging material in markets and grocery stores.\nThe prisoner roams around freely and finds help from a truck driver. The man not having realized that the man's face had been all over the news just a few days ago chats merrily with him and offers to help him. On his way however, his truck breaks down and the two get stuck in the middle of nowhere. The two try to find a passing vehicle who might be able to help them. A large party in a car stop in front of them asking if they had seen and a dark boy and a short girl anywhere nearby. They deny that they have ever seen a couple like that but ask them if they could help. The party ignores them and leaves.The same day Jangayya leaves his village in his old jeep to go to the prison for the execution, not having heard of the prisoner's escape. Jangayya meets the stranded duo in the middle of the road and offers to help them. He helps tow the truck with the ropes that were actually meant for the hanging and takes them to the closest mechanic. The truck driver stays back with his truck but asks Jangayya if he could help out the man with him. Jangayya agrees to drop him off on the way. Still not having realized that the man sitting next to him was the same man he was meant to execute, the two travel together in an uncomfortable silence. Jangayya tries to make conversation with the man but finds him very queer and decides to leave him alone. He stops to fill oil in his jeep and wipes his sticky hands in a spare piece of newspaper lying on the floor of his jeep. He throws away the piece of paper and only after driving off a bit, he realizes that he's dropped a ring along with the piece of paper. He halts to walk back and fetch the ring. Only then does he see the news item on the paper and is shocked to realize that the man he's been travelling with was the same man he was meant to execute that day and that he had broken out of prison and that there was a huge price on his head. Trying not to look too shaken, Jangayya walks back starts driving again like everything was absolutely normal.\nMeanwhile a defense personnel tries to find a ride on the same deserted road. He stops two drunkards on a bike who were also looking for the dark boy and the fair girl. They ignore him but he manages to woo them with a bottle of expensive wine.\nA boy and his lover on the same road running away from their caste obsessed families hurts himself and bruises his ankle. The couple decide to find shelter somewhere and sees a jeep parked in front of a temple. They sneak into the back seat of the jeep and wait for someone to drive away.Jangayya after his recent shocking discovery stops at a temple to pray and hope that there will be no trouble. When he gets back into his jeep and starts driving, the couple in the back seat reveal themselves. When questioned, they reveal their names to be Adi and Paru and explain to him that they have eloped and that their families have sent men looking for them as they are both from different caste groups and are against the two of them getting married. They beg him for help and finally Jangayya agrees.\nThe couple get cosy on the back of the jeep and talk about their marriage plans. Adi shows Paru the sacred marriage thread that he has been carrying around in his pocket wrapped up in a piece of newspaper. That's when they catch a glimpse of the article in the newspaper and same as Jangayya, were shocked to see that they were travelling with a wanted criminal with a price on his head. The drive suddenly becomes an uncomfortably silent one. Noticing the sudden change, the criminal gets suspicious and tries to escape but Jangayya knocks him out and ties him up. After convincing Adi that he can take the price money if he would help Jangayya with the prisoner, the three load the unconscious criminal into the jeep.Meanwhile the army man and the two men exchange stories as they drive along. He explains to his two new friends that he had taken a break from duty and was coming home to tend to his pregnant wife who was about to give birth sometime that week. After getting dropped, the man also advices them not to break the couple up and to drink the expensive wine as a celebration of their union.\nWhen Adi sets to drive Jengayya's jeep and was about to take off again, they notice the goons sent by the couple's families speeding towards them. After a short car chase where the two drunk men on the bike also join the fray, Jangayya's jeep finally gets cornered. When Jangayya stands up for the couple, one of the angry men grab the expensive wine bottle and smashes it against his head leaving Jangayya unconscious with a bloody wound. But the goons now start fighting over the spilled wine and in the commotion, the couple escape.\nWhile all this is happening, the police in Hyderabad get information about the whereabouts of the criminal. A police officer sets off along the road and comes to question Jangayya. Having just woken up from his unconscious state, Jangayya is very confused and tells them that the prisoner had hit him on the head and escaped even though he was still lying tied up on the back of the jeep. The police officer instead of helping the injured Jangayya abandons him and takes off.\nThe army personnel on the other hand while walking towards his house is stopped by his brother on a bike who informs him that his wife was in labour and was rushing to the hospital in an auto rickshaw. The man immediately takes off on the bike to the hospital.\nSomewhere in the middle of the same path, a woman cries from labour pain in a stranded auto rickshaw while her mother-in-law tries to find help. She finds a weak Jangayya slumped against the hood of his jeep and the now conscious criminal trying to loosen himself from the various knots that Jangayya had bound him with. She is shocked to see Jangayya's state and dresses his wounds with a scrap for fabric torn from her sari. She then begs him to help her daughter-in-law. Though very weak, Jangayya starts to drive towards the auto but is hit by unconsciousness again half way through. Now utterly desperate, the mother-in-law tries to find another way. She notices the man lying on the back of the jeep and loosens his bonds begging him to help her. He ignores her pleas at first but is hit by a change of heart when the woman in labour addresses him as a brother. After helping her into the backseat of Jangayya's jeep, the women realize that there was no time to get to the hospital. She gives birth to a healthy baby boy right there on the backseat of the jeep.\nAdi and Paru after having escaped realize that they had left their bag of money that they had stolen from their families before they left home was still on Jangayya's jeep. They decide to find their way back to the jeep again. They stop the army man to hitch a ride but he says that he's in a hurry and can't help them. However, they still force their company on him and climb onto his back seat. But as they catch sight of Jangayya's jeep he is surprised to see not only his mother there but also his wife with his new-born son. As night has fallen, he invites the entire party to spend the night at his house to thank them for helping his family.At the man's house that night, the criminal who everyone starts calling Babji is treated with a lot of love and respect for his actions after a long time of ill-treatment at the prison. Even Jangayya and the runaway couple start to warm up towards him to the point where Paru even starts calling him a brother.\nThe next morning, the party say their good-byes and get on with their journey. But tragedy strikes again when they are ambushed by the goons set out to capture Adi and Paru. They hold back the protesting Jangayya but Babji steps in between the fight and threatens to kill the goons single-handedly. He holds them back while Adi ties the sacred marriage thread around Paru's neck and declares them married on the spot. The goons call up their respective families and inform them that the marriage was already over. The families forgive the couple and take them back home, a happy married couple.Jangayya and Babji are now back to where they started. Jangayya reveals to Babji that he was the executioner who was meant to hang him. Babji is shocked that he is going to face his death in the hands of a man that he had started to look up to as a father figure. Jangayya, now not having the heart to do what he must do, tricks him into getting off the vehicle and drives off leaving him behind stranded. Fortunately, Babji catches up again with his old friend, the truck driver and hitches a ride from him.The police officer on the other hand catch up with the party of goons to show a picture of the man and ask them if the they had seen him anywhere. Adi and Paru try to distract the police but the others direct him towards Jangayya's jeep. The police officer now suspicious of Jangayya's motives catch up with him and out of rage attempts to strangle Jangayya into revealing Babji's whereabouts. But Babji in the truck, having caught up with Jangayya, attacks the officer from the back saving Jangayya's life.Back to where they began, Jangayya finally questions Babji as to why the police were so keen on killing him even though he seemed like a good person. He then tells Jangayya as to why he was arrested in the first place. He had been in love with a girl named Sujatha but her father had been against the match. After fixing her match with another man, Sujatha had hanged herself out of grief. Angry at the loss of his love, Babji had been arrested after killing her father. Meanwhile, another powerful politician had also been caught for a number of murders he had committed. Being the powerful man that he was, the accusations had turned towards Babji instead who had later been sentenced to die. Now that he had escaped, the politicians were afraid that he might reveal the truth. The two switch places so that Babji takes the wheel and Jangayya can take a nap. When Jangayya wakes up, he is shocked to see that he's in front of the prison and Babji had surrendered himself.\nOn the day of the hanging, when Jangayya sets off to do his job, he collapses dead right before the deed is done. Babji is seen doing Jangayya's funeral rights as a son would at the end of the movie."
}