{
    "id": "8644126",
    "localized title": "Kargil",
    "cast": [
        "Iswarya",
        "Akan Jeyabalan",
        "Karthikeyan",
        "Meiyyappan",
        "Jishnu Menon",
        "Prerna Sadani",
        "Nivin Sahaya",
        "Sivaani Senthil",
        "Suhail"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "103",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "22 Jun 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTAzNzIwYjItOGY3Yy00MzJmLTg2ZjEtNzdjZmQwM2ZkYjk3XkEyXkFqcGdeQXVyNzM4OTQzMzg@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "8644126",
    "plot outline": "Kargil is a war not between two countries but between two hearts. Arjun (Jishnu Menon) an IT Professional romances with his lover girl Maha who fights more which Arjun treats as his Love. Maha informs about her Dad who travels from US next week and ask Arjun to receive him, impress him and get permission for marriage. Arjun accept that with a smile and says he will marry Maha immediately as Tatkal marriage once his Dad arrives. On the day, Arjun travels alone from Chennai to Bangalore in his car without receiving Dad and Maha as usual get angry with him and disconnect the mobile. Throughout the movie hero travels alone in his car and speaks in the speakerphone with all the other characters. Along with Maha, the trouble arises from Sinfhu, his Ex-Lover and current MD, boss Kings, Missed call Beep Sahayam, Inspector Vincent, US return Aadhi Arjun resolves his problems believe in his love and states MY TRUST IS MY LOVE and finally impresses Dad and convince Maha.",
    "languages": "Tamil",
    "title": "Kargil",
    "kind": "movie",
    "directors": "Sivaani Senthil",
    "writers": "Sivaani Senthil",
    "producers": "Subha Senthil",
    "composers": "Vignesh Pai",
    "cinematographers": "Ganesh Paramahamsa",
    "editors": "Abinath",
    "writer": "Sivaani Senthil",
    "director": "Sivaani Senthil",
    "production companies": "Sivaani Studios",
    "distributors": [
        "Sivaani Studios",
        "Truefix Studios"
    ],
    "plot": "_Kargil_ (qv) is a war not between two countries but between two hearts. Arjun (Jishnu Menon) an IT Professional romances with his lover girl Maha who fights more which Arjun treats as his Love. Maha informs about her Dad who travels from US next week and ask Arjun to receive him, impress him and get permission for marriage. Arjun accept that with a smile and says he will marry Maha immediately as Tatkal marriage once his Dad arrives. On the day, Arjun travels alone from Chennai to Bangalore in his car without receiving Dad and Maha as usual get angry with him and disconnect the mobile. Throughout the movie hero travels alone in his car and speaks in the speakerphone with all the other characters. Along with Maha, the trouble arises from Sinfhu, his Ex-Lover and current MD, boss Kings, Missed call Beep Sahayam, Inspector Vincent, US return Aadhi Arjun resolves his problems believe in his love and states MY TRUST IS MY LOVE and finally impresses Dad and convince Maha."
}