{
    "id": "9174422",
    "localized title": "Karshanam",
    "cast": [
        "Dhananjay Atrey",
        "Anusha Rai",
        "Vijay Chendur",
        "Srinivasa Murthy"
    ],
    "genres": "Thriller",
    "runtimes": "115",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.39 : 1",
    "sound mix": "Dolby Digital::(5.1)",
    "certificates": "India:UA",
    "original air date": "23 Nov 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjU3MWM0ZWEtMmJlZS00OGZlLWFjMzAtNDFlZDMxNWNmZWVkXkEyXkFqcGdeQXVyNjY0OTkzMjk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "9174422",
    "languages": "Kannada",
    "title": "Karshanam",
    "kind": "movie",
    "directors": "Sharavana",
    "composers": "Hemanth Subrahmanya",
    "editors": "Venkatesh U.D.V.",
    "music department": "Hemanth Subrahmanya",
    "thanks": "Rockline Venkatesh",
    "akas": "Karshanam (India)",
    "director": "Sharavana",
    "production companies": "D J Entertainments",
    "plot": "As a man lives in a slum and works hard to achieve his dreams, a series of murders take place in the city.",
    "synopsis": "Young and dynamic Shankar lives in a small house in a slum. He is an ardent fan of the late actor Shankar Nag. Though born in a slum, Shankar has been brought up with good values and culture by his parents, whom he loves very much. Shankar's father Krishnappa has inculcated discipline and principles in Shankar's upbringing.\nShankar dreams big and is working on his own Lithium-Ion battery project for electric cars. He plans to make his project a success, to alleviate the poverty of his parents. In a chance encounter, Manya, a journalist with a T.V Channel meets Shankar and falls in love with him.\nWhile he is working hard to achieve his dreams, a series of murders start to take place in the city. The people who commit the murders are caught red handed, but don't remember having committed the crime. All of them are well known to the victims and yet indulge in the crime, without remembering why they did it. What is happening...?\nThings take a dangerous turn when Shankar's best friend Rajesh is killed by his own father Murthy. The future of Shankar's battery project is itself goes to stake. With the help of Manya, the journalist, Shankar starts to investigate Shankar has to work quickly and unravel the reason behind the murders, as his own life comes under danger.\nWill Shankar succeed in unearthing the truth, despite the dangers and obstacles? Who is committing the murders? This is the billion dollar question.\n. The movie has been completely shot in Bengaluru, showing the present day Bengaluru and the challenges faced by its people. The slum scenes involving Shankar and his background have been shot in the Nayandahalli slum to get a realistic effect. The fight scenes have been shot naturally, with no dupes. The lead actor Dhananjay Atrey has performed original stunts without ropes or cables. Four melodious songs form a part of the movie, and are placed very aptly, at the right circumstances. One of the song describes the investigation, while another recounts the occurrence of a murder. Two other songs depict romance and Hero introduction."
}