{
    "id": "9304360",
    "localized title": "Ayogya",
    "cast": [
        "Vishal",
        "Parthiban",
        "K.S. Ravikumar",
        "Raashi Khanna",
        "Pooja Devariya",
        "Anandraj",
        "M.S. Bhaskar",
        "Yogi Babu",
        "Sonia Agarwal",
        "Radha Ravi",
        "Santhana Bharathi",
        "Aadukalam Naren",
        "R.N.R. Manohar",
        "Devadarshini Chetan",
        "Vela Ramamoorthy",
        "Arjai",
        "Lallu",
        "Rahul Thatha",
        "Sana Khaan",
        "Aboorva",
        "Ajith",
        "Rani Akka",
        "Ennore Anbu",
        "Annoor",
        "Apoorva",
        "Ismath Banu",
        "Brigida",
        "Dheeraj",
        "Geetha",
        "Jintha Gopi",
        "Hariharan",
        "Harshini",
        "Jayachandran",
        "Bharati Kannan",
        "Kamala Krishnamurthy",
        "Pavitra Lokesh",
        "Mani Megalai",
        "Muthu",
        "Vazhakku En Muthuraman",
        "Nithyaraj",
        "Kasthuri Paati",
        "Prema Paati",
        "Pintu Pandu",
        "Kayal Perera",
        "Prajeesh",
        "Lakshmi Rahul",
        "Rashid",
        "Ravichandravel",
        "Roshini",
        "Sachu",
        "Vizag Seenu",
        "Semmalar",
        "Shalini",
        "Apoorva Srinivasan",
        "Tirupathi",
        "Temper Vamsi",
        "Veera",
        "Antony Xavier"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "runtimes": "146",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "India:UA",
        "Singapore:NC16",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "10 May 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2E5NTQ0NTUtM2U5NC00Yjc1LTk0MjItYWNjYWFhNGNjMjUxXkEyXkFqcGdeQXVyMTA4NjE0NjEy._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "9304360",
    "plot outline": "Karnan, an orphan, grows up to become a corrupt cop who would do anything for money. He befriends Kaalirajan, the local don, who showers him with a lot of gifts. Karnan's acts frequently upset his sincere subordinate Abdul Kader, who in vain tries to stop him whenever possible. In the meanwhile, a woman constantly visits the police station to inquire about her missing daughter, but Karnan dismisses her in every possible way. He falls for Sindhu, who is kidnapped by Kaalirajan's goons on her birthday but is set free after realizing she wasn't the woman supposed to be kidnapped. Karnan almost dismisses the incident until Sindhu asks him to rescue the actual target, as a birthday present. Having no choice, Karnan engages in a brutal fight that turns out to be not only his first heroic but also a life-changing act.",
    "languages": "Tamil",
    "title": "Ayogya",
    "kind": "movie",
    "directors": "Venkat Mohan",
    "writers": [
        "Venkat Mohan",
        "",
        "Vakkantham Vamsi"
    ],
    "producers": [
        "Madhu B.",
        "Praveen Daniel"
    ],
    "composers": "Sam C.S.",
    "cinematographers": "Karthik Venkatraman",
    "editors": "Antony L. Ruben",
    "art directors": "S.S. Moorthy",
    "costume designers": [
        "Archa Mehta",
        "Uthara Menon"
    ],
    "production managers": [
        "Ilayda Güralp",
        "T. Murugesan",
        "Anthony Xavier"
    ],
    "assistant directors": "Durai Kannan",
    "art department": "Ilayda Güralp",
    "sound department": [
        "Raju Albert",
        "Gokul Dev",
        "Arun S. Mani",
        "Ramji Soma",
        "Romlin Jose Thomas",
        "Renjith Venugopal",
        "P.C. Vishnu"
    ],
    "stunts": [
        "Lakshman Chella",
        "Ram Chella"
    ],
    "music department": [
        "Deepak",
        "Anirudh Ravichander",
        "Sachinlal",
        "Ramji Soma",
        "Pooja Vaidyanath",
        "Vivek",
        "Yugabharathi"
    ],
    "miscellaneous": "Gopi Prasannaa",
    "akas": "Пройдоха (Russia)",
    "writer": [
        "Venkat Mohan",
        "Vakkantham Vamsi"
    ],
    "director": "Venkat Mohan",
    "production companies": "Light House Movie Makers",
    "distributors": [
        "Aura London",
        "Golden Cinema",
        "Home Screen Entertainment",
        "Light House Movie Makers",
        "MKS Retail Group",
        "Phars Film",
        "Screen Scene",
        "Amazon Prime Video",
        "Sun TV"
    ],
    "other companies": [
        "Lahari Music",
        "T-Series"
    ],
    "plot": [
        "A corrupt police officer finds his life changing when he takes on a case of gang rape.",
        "Karnan, an orphan, grows up to become a corrupt cop who would do anything for money. He befriends Kaalirajan, the local don, who showers him with a lot of gifts. Karnan's acts frequently upset his sincere subordinate Abdul Kader, who in vain tries to stop him whenever possible. In the meanwhile, a woman constantly visits the police station to inquire about her missing daughter, but Karnan dismisses her in every possible way. He falls for Sindhu, who is kidnapped by Kaalirajan's goons on her birthday but is set free after realizing she wasn't the woman supposed to be kidnapped. Karnan almost dismisses the incident until Sindhu asks him to rescue the actual target, as a birthday present. Having no choice, Karnan engages in a brutal fight that turns out to be not only his first heroic but also a life-changing act.::Prashast Singh"
    ],
    "synopsis": "Having believed a police officer's life to be a happy one with lots of money coming in the form of bribes, Karnan, an orphan, grows up to become a corrupt Sub-Inspector who forms an immediate friendship with the local don ECR Kaalirajan by releasing his four brothers Kumar, Prakash, Vinay, and Sabari from lock-up, who were all arrested for smuggling. Karnan's attitude does not go well with his subordinate Abdul Kader, a sincere police constable. In vain as it is, he tries to oppose Karnan's deeds.Meanwhile, Karnan meets and falls in love with Sindhu, who gets kidnapped by Kaalirajan's men on her birthday but is rescued in time by Karnan. Kaalirajan then scolds his henchmen for kidnapping the wrong person and apologizes to both of them. As her birthday gift, Sindhu requests Karnan to save the girl who was supposed to be kidnapped and killed by Kaalirajan. A reluctant Karnan fights Kaalirajan's goons and saves the girl, Santhiya. Karnan somehow reconciles with Kaalirajan later and learns that Santhiya has certain evidence against Kaalirajan's brothers. Karnan meets her and learns that her sister Bhavani was kidnapped, raped, and brutally assaulted to death by Kaalirajan's four brothers for two weeks, and this act was recorded by them. The footage was stored on a camera, which is with Santhiya now. Karnan takes the camera and arranges to send both Santhiya and her mother to the States.Before their departure, Santhiya's conversation with him leaves him shattered. Realizing that he was indeed responsible for the rape since he allowed the brothers to escape, Karnan is devastated and soon realizes that he has changed after he fights off Kaalirajan's goons sent to retrieve the camera at the police station, with Kader notifying the change in him. He soon manages to track the brothers and beat them all up before arresting them. After Bhavani's corpse is found and the autopsy is performed, Karnan produces the camera as the evidence, which turns out to be an empty one. Though no further evidence exists, Karnan asks a gap of one day to provide necessary evidence so that Kaalirajan's brothers do not escape as exonerated. Later, Kaalirajan's men attack a drunk Karnan when he is alone. After a brutal fight, they bury him alive, but he manages to escape.Karnan reaches the court the next day, and to everyone's shock, he adds that he is one among not the four, but \"five\" men who sexually assaulted Bhavani. He then convinces the judge to sentence all five of them to capital punishment in order to ensure that the other four do not escape punishment. This statement shakes the entire course of the case, and Karnan is publicly resented. He is allowed by the commissioner to watch as all four of the brothers are hanged to death, after which he too is hanged. Merely hours later, Santhiya and her mother arrive in Chennai, publicly revealing that Karnan was not involved in the rape of her sister, and the sacrifice he made was to ensure punishment to all of the accused criminals. The revelation shocks the nation, and the people who misunderstood him eventually mourn his death as his corpse is bought and walked from the gallows. The film ends with Karnan's final words: \"All men will now fear an immediate death sentence, if they ever molest a girl.\""
}