{
    "id": "0096751",
    "localized title": "Abhimanyu",
    "cast": [
        "Anil Kapoor",
        "Kimi Katkar",
        "Poonam Dhillon",
        "Anita Raj",
        "Aruna Irani",
        "Prem Chopra",
        "Shakti Kapoor",
        "Shafi Inamdar",
        "Jagdeep",
        "A.K. Hangal",
        "Urmila Bhatt",
        "Binda",
        "Guddi Maruti",
        "Tej Sapru"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Drama"
    ],
    "runtimes": "168",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:15",
        "United Kingdom:15"
    ],
    "original air date": "08 Jun 1989 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzZlZWJiMmMtYTE4NC00MGU4LWFjYzctODI5ZmM5Nzk2MzhlXkEyXkFqcGdeQXVyMTUxODIyNzk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0096751",
    "plot outline": "Wealthy Parvati and her son, Pannalal utilizes every available opportunity to humiliate a poor farmer, Abhimanyu alias Manu and his family but all efforts are prove fertile prompting Pannalal to take steps to a higher level by sexually molesting Manu's sister, Tulsi which forces her to attempt suicide. Fortunately Manu arrive just in time to save her and thus he decides to confront Pannalal with a marriage proposal but Pannalal refuses forcing Manu and his sister to donned a disguise so that Manu can get marry to Pannalal's sister, Geeta while at the same Tulsi manages to get marry to Pannalal. When the brother and sister reality comes to light - Pannalal starts to ill-treat Tulsi with a motive of marrying the girl, Lalita of his dreams. When Manu gets to learn of this he retaliates by threatening Pannalal that his sister, Geeta will meet the same treatment if he continues to behave in this manner with his sister, Tulsi.",
    "languages": "Hindi",
    "title": "Abhimanyu",
    "kind": "movie",
    "directors": "Tony Juneja",
    "writers": "Gyandev Agnihotri",
    "producers": "Kushaldeep Singh Juneja",
    "composers": "Anu Malik",
    "cinematographers": "Jal Mistry",
    "editors": [
        "Waman B. Bhosle",
        "Gurudutt Shirali"
    ],
    "editorial department": [
        "Achyut Y. Gupte",
        "Prashant Khedekar",
        "Rohita L. Shetty"
    ],
    "art directors": "Y.L. Bagchi",
    "make up department": "Raju",
    "production managers": [
        "Ravi Nair",
        "Rrem Kumar Sharma",
        "Dinesh Yadav"
    ],
    "assistant directors": [
        "Bhimrao",
        "S.P. Chaturvedi",
        "Ravi Shanker",
        "Kailash Sharma"
    ],
    "art department": [
        "Jadab Bhattacharya",
        "Jayanti"
    ],
    "sound department": [
        "Abhi Dave",
        "Anoop Mishra",
        "Kuldip Sood"
    ],
    "special effects": [
        "Baldev Malik",
        "Krishan Malik",
        "Arun Patil",
        "Prakash Tade"
    ],
    "stunts": [
        "Hari Singh",
        "Surjeet Singh"
    ],
    "camera department": [
        "Imtiaz Ansari",
        "Sadashiv Garg",
        "Kadar R. Khan",
        "Aziz Motiwala",
        "Kulwant Singh",
        "P.N. Swamy"
    ],
    "costume departmen": [
        "Nagaraj",
        "Ramkrishna"
    ],
    "music department": [
        "Anjaan",
        "Anwar",
        "Anand Bakshi",
        "Munmi Bora",
        "Indivar",
        "Farooq Kaisser",
        "Amit Kumar",
        "Shabbir Kumar",
        "Anuradha Paudwal",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Gopalan Nair",
        "Gopal Pandey",
        "G.L. Pathak",
        "Narayan Pawar",
        "Suniel S. Saini"
    ],
    "akas": "Abhimanyu (India)",
    "writer": "Gyandev Agnihotri",
    "director": "Tony Juneja",
    "production companies": "NH Studioz",
    "distributors": "NH Studioz",
    "special effects companies": "G.D. Art",
    "other companies": [
        "Bank of Baroda",
        "Belga Restaurant",
        "Impressions",
        "Kachins",
        "Kamat Foto Flash",
        "Ketnav Dubbing and Preview Theatre",
        "Madhav Men's Mode",
        "Monalisa Enterprises",
        "Reku-Fashions",
        "Sandhu & Co.",
        "Shri Krishna Films",
        "Studio Prathima",
        "Super Cassettes Industries Limited (T-Series)",
        "Valles Publicity",
        "Vasant Gandhi & Co",
        "Vijay Behl & Co."
    ],
    "plot": [
        "When a landowner rapes a poor farmer's sister, the farmer demands that the landowner marry his sister. When the landowner refuses, the siblings disguise themselves as wealthy foreigners in order to marry the landowner and his sister.",
        "Wealthy Parvati and her son, Pannalal utilizes every available opportunity to humiliate a poor farmer, _Abhimanyu_ (qv) alias Manu and his family but all efforts are prove fertile prompting Pannalal to take steps to a higher level by sexually molesting Manu's sister, Tulsi which forces her to attempt suicide. Fortunately Manu arrive just in time to save her and thus he decides to confront Pannalal with a marriage proposal but Pannalal refuses forcing Manu and his sister to donned a disguise so that Manu can get marry to Pannalal's sister, Geeta while at the same Tulsi manages to get marry to Pannalal. When the brother and sister reality comes to light - Pannalal starts to ill-treat Tulsi with a motive of marrying the girl, Lalita of his dreams. When Manu gets to learn of this he retaliates by threatening Pannalal that his sister, Geeta will meet the same treatment if he continues to behave in this manner with his sister, Tulsi.::gavin (racktoo@hotmail.com)",
        "_Abhimanyu_ (qv) alias Manu lives in a small town in India with his dad, Shyam Lal, mom, and unmarried sister, Tulsi. When the lecherous son, Pannalal, of wealthy Ram and Parvati, returns home, he is taken in by Tulsi's beauty and forces himself upon her, leaving her to commit suicide, but Ram saves her just in time. When Manu finds out that Pannalal is responsible for Tulsi's state, he goes to plead with Pannalal to marry Tulsi, he scoffs at and humiliates him. Ram, Tulsi, Pyare, their friend, Ram and his U.S. returned wealthy industrialist friend, G.S. Parmeshwaran, then get together and plot against Pannalal - which results in Pannalal getting married to Tulsi; and Ram's daughter, Geeta, getting married to Manu. Enraged at this deception, Pannalal swears revenge, and takes Tulsi with him to his mistress, Lalita, and asks her to serve her, which Tulsi agrees to do. But Pannalal is not satisfied with this - for his aim is to marry Lalita - at any cost - even if it means killing Tulsi.::rAjOo (gunwanti@hotmail.com)"
    ]
}