{
    "id": "0156874",
    "localized title": "Pasamalar",
    "cast": [
        "Gemini Ganesan",
        "Shivaji Ganesan",
        "M.N. Nambiar",
        "Kutty Padmini",
        "M.N. Rajam",
        "Savitri",
        "Sukumari",
        "K.A. Thangavelu"
    ],
    "genres": "Drama",
    "runtimes": "197",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Black and White",
    "certificates": [
        "India:U",
        "United States:Not Rated"
    ],
    "original air date": "14 May 1961 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGZmZTNlZDctMzgxNi00Y2I1LWE2MTEtNjNjM2RlNDcyMDQzXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "0156874",
    "languages": "Tamil",
    "title": "Pasamalar",
    "kind": "movie",
    "directors": "A. Bhimsingh",
    "writers": [
        "Arurdoss",
        "",
        "A. Bhimsingh",
        "",
        "K.P. Kottarakara"
    ],
    "music department": [
        "Kannadasan",
        "M.S. Viswanathan"
    ],
    "akas": "The Flower of Love",
    "writer": [
        "Arurdoss",
        "A. Bhimsingh",
        "K.P. Kottarakara"
    ],
    "director": "A. Bhimsingh",
    "production companies": "Rajamani Pictures",
    "distributors": [
        "Sivaji Productions",
        "Raj Video Vision"
    ],
    "other companies": "EMI Records",
    "plot": "The bond of love between a brother and a sister is tested due to the machinations of a greedy relative.",
    "synopsis": "Rajasekhar (Sivaji Ganesan) becomes the guardian to his younger sister Radha (Savitri) after their parents death. The brother-sister duo love, care and adore each other and are inseparable. When the factory in which Rajasekhar works is shut down due to a labour problem and he is depressed, Radha gives him 1000 which she had earned and saved by making toys. She advises him to use this money as seed capital and commence his own toy business. The dutiful brother follows his sisters advice, starts a business and in a short time, becomes rich. Anand (Gemini Ganesan) an ex-colleague of Rajasekhar who earlier helped him to get a job in his old factory, is jobless and approaches Rajasekhar for work. Rajasekhar appoints him in his concern and over a period of time, Anand and Radha fall in love. Rajasekhar, who is very possessive of his sister, gets angry with Anand as he feels betrayed.However, knowing how intensely Radha loves Anand, he arranges for their wedding. After the marriage, Anand, along with his aunt and cousin, move into Rajasekhars house. Rajasekhar marries Dr. Malathy (M. N. Rajam) on Radhas suggestion. All of them continue to live under the same roof and several misunderstandings crop up. Anands aunt uses every opportunity to widen the rift between Malathy and Radha and Radha and Anand. Unable to witness Radhas troubles, Rajasekhar moves out of the house with his wife, Through Radha, Anands aunt serves a legal notice to Rajasekhar, demanding a share in the property for Radha. Malathy files a counter petition and the property is attached by the court, pending resolution. Unable to see Radhas sufferings, Rajasekhar withdraws the case. Still the families dont unite. Radha delivers a girl and Malathy delivers a boy. After her childs birth, Malathy goes abroad for further studies, leaving the child with Rajasekhar.Unable to cope with the separation from his sister and to have peace of mind, Rajasekhar goes on a pilgrimage for several months. He returns on Diwali day and goes to meet Radha, but is denied entry by Anands aunt. While going back, he saves a little girl from getting burnt by fire crackers and in the process, loses his eyesight. He is hospitalised and Radha rushes to the hospital to see her brother. Rajasekhar learns that the girl he saved is none other than his niece. Unable to cope with his inability to see them, he dies; Radha too dies holding his hand. The duo becomes an epitome of brother-sister relationship. In the shadow of their deaths, the children unite and seek their heavenly blessings."
}