{
    "id": "0215033",
    "localized title": "The Goddess",
    "original title": "Parasakthi",
    "cast": [
        "Pandari Bai",
        "Doraiswamy",
        "Shivaji Ganesan",
        "T.P. Muthulakshmi",
        "S.S. Rajendran",
        "T.K. Ramachandran",
        "V.K. Ramasamy",
        "S.V. Sahasranamam",
        "Sriranjani"
    ],
    "genres": "Drama",
    "runtimes": "188",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Black and White",
    "certificates": "United States:Not Rated",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTkxOGRhOTUtMDNhOC00MjE1LWEzMTYtMDg0MmI4YzEwNjI1XkEyXkFqcGdeQXVyNjI2MDU5NTg@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0215033",
    "plot outline": "\"Parasakthi\" narrates the misfortunes that befall the members of a Tamil family. The youngest sister gets widowed and becomes the victim of an attempted rape by a temple priest. Sivaji Ganesan's character becomes insane.",
    "languages": "Tamil",
    "title": "Parasakthi",
    "kind": "movie",
    "directors": [
        "R. Krishnan",
        "S. Panju"
    ],
    "writers": "M. Karunanidhi",
    "producers": "A.V. Meiyappan",
    "cinematographers": "S. Maruthi Rao",
    "akas": "The Goddess (India, English title)",
    "writer": "M. Karunanidhi",
    "director": [
        "R. Krishnan",
        "S. Panju"
    ],
    "other companies": "AP International",
    "plot": [
        "Brothers Chandrasekaran, Gnanasekaran and Gunasekaran are Indian immigrants living in Burma. Things take a turn when their brother-in-law dies in an accident and their father dies of shock.",
        "\"_Parasakthi_ (qv)\" narrates the misfortunes that befall the members of a Tamil family. The youngest sister gets widowed and becomes the victim of an attempted rape by a temple priest. Sivaji Ganesan's character becomes insane.::Sundar Narayan"
    ],
    "synopsis": "Chandrasekaran, Gnanasekaran and Gunasekaran are three Indian immigrant brothers from Madurai, Tamil Nadu living in Rangoon, Burma. Their younger sister Kalyani was raised in their home town by their father Manickampillai. In 1942, during World War II, her marriage is arranged with a writer named Thangappan, and the brothers plan to visit Madurai to attend the wedding. Due to war conditions and bombardment of Burmese ports by Japan, the shipping company offers only one ticket and Gunasekaran, the youngest brother, takes it and leaves for Tamil Nadu. The ship however fails to reach on time due to the dangers of the war, and Kalyani's marriage takes place without any of her brothers present.Kalyani becomes pregnant. But on the day she delivers her child, Thangappan dies in an accident and Manickampillai dies of shock, leaving Kalyani and her child destitute. Her house gets auctioned off, and she makes her living by selling food on the streets. Gunasekaran, after being stranded at sea for several months, finally arrives in Tamil Nadu at Madras. However, while watching a dance performance, he is robbed of all his belongings after being intoxicated. Reduced to poverty, he becomes enraged at the status of the once glorious Tamil Nadu, and fakes insanity by indulging in numerous tricks to make a living. Gunasekaran finally comes across his destitute sister at Madurai, having learned of their father's death and her poverty. He continues to play insane and does not reveal his true identity to her due to his poverty, but hovers around her. Kalyani is irritated by the stranger's behaviour, unaware that he is her brother.Kalyani is nearly molested by a vagabond named Venu, but is saved by Gunasekaran. She later leaves Madurai and arrives at Tiruchi, where she obtains work as a maid of blackmarketeer Narayana Pillai, who also tries to molest her. She is, however, saved by his wife Kantha, and leaves the job. While searching for his sister, Gunasekaran reaches Tiruchi and comes across Vimala, a wealthy woman, to whom he explains the miserable status of him and his sister in the society. After resting in her house for a while, he silently leaves to continue searching for Kalyani.Meanwhile, as Japanese shelling intensifies in Burma, Chandrasekaran and Gnanasekaran decide to return to India. Chandrasekaran, accompanied by his wife Saraswati, reaches Tiruchi safely and becomes a judge, but Gnanasekaran is lost in the journey and loses a leg in the shelling before arriving in India. He begs for a living, forms an association for beggars and tries to reform them. Kalyani reaches Chandrasekaran's palatial house seeking food, but Chandrasekaran throws her out without recognising her. She later arrives at a temple seeking help, but the pujari (priest) also tries to molest her. Frustrated with life and unable to feed her child, Kalyani throws it into a river and attempts suicide, but is soon arrested for killing the child and brought for trial.At the court, Kalyani defends her act of infanticide with the judge being Chandrasekaran, who after hearing her tragic story realises she is his sister, and faints. Gunasekaran is also brought to the court for having attacked the priest who tried to molest his sister. During his trial, Gunasekaran explains the misfortunes which has befallen him and his family, and justifies his actions. Gunasekaran's valiant defence in court awakens everyone on the evils of the society. As the trial proceeds, Vimala arrives and produces Kalyani's child, which was revealed to have safely fallen in her boat instead of the river. Kalyani and Gunasekaran are pardoned and acquitted by the court, and are finally reunited with Chandrasekaran. Gnanasekaran, while collecting donations for his association of beggars, also joins them unexpectedly. With Vimala and Gunasekaran deciding to get married, the family subsequently inaugurates a welfare home for orphans."
}