{
    "id": "0232508",
    "localized title": "Raj Mahal",
    "cast": [
        "Vinod Khanna",
        "Neetu Singh",
        "Govardhan Asrani",
        "Danny Denzongpa",
        "Om Shivpuri",
        "Arpana Choudhary",
        "Kader Khan",
        "Jayshree Talpade",
        "Bhushan Tiwari"
    ],
    "genres": [
        "Action",
        "Drama"
    ],
    "runtimes": "157",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Mono",
    "original air date": "17 Sep 1982 (India)",
    "imdbID": "0232508",
    "plot outline": "This is a story about Rajmahal and the people related to it. Durjan Singh murdered the king and proclaimed himself the king of Raj Mahal. The King has two sons. Durjan Singh tries to finish off the King's family but they manage to escape, and get separated from each other. The elder son Vikram is raised by the tribal people whose leader is Baadshah Khan. The younger son becomes a dacoit. Durjan singh made the people suffer a lot. One day these two brothers meet in a competition declared by Durjan Singh, in which they are opponents. Unaware about the fact that they are brothers, they fight with each other. A few days later they both go on a treasure hunt and happen to fight with each other. During the fight, Vikram's shirt gets torn and the Rajnishani on his hand is recognised by his mother the Rajmata. They both come to know that they are brothers and they plan to take revenge against Durjan Singh.",
    "languages": "Hindi",
    "title": "Raj Mahal",
    "kind": "movie",
    "directors": "K. Parvez",
    "producers": "K.B. Lamchhane",
    "composers": [
        "Anandji Veerji Shah",
        "Kalyanji Veerji Shah"
    ],
    "music department": [
        "Asha Bhosle",
        "Hemalata",
        "Mahendra Kapoor",
        "Kishore Kumar",
        "Verma Malik",
        "Lata Mangeshkar",
        "Mohammad Rafi",
        "Raj Kavi Inderjeet Singh Tulsi"
    ],
    "akas": "Agapi kai thanatos smigoun stin India (Greece)",
    "director": "K. Parvez",
    "plot": "This is a story about Rajmahal and the people related to it. Durjan Singh murdered the king and proclaimed himself the king of _Raj Mahal_ (qv). The King has two sons. Durjan Singh tries to finish off the King's family but they manage to escape, and get separated from each other. The elder son Vikram is raised by the tribal people whose leader is Baadshah Khan. The younger son becomes a dacoit. Durjan singh made the people suffer a lot. One day these two brothers meet in a competition declared by Durjan Singh, in which they are opponents. Unaware about the fact that they are brothers, they fight with each other. A few days later they both go on a treasure hunt and happen to fight with each other. During the fight, Vikram's shirt gets torn and the Rajnishani on his hand is recognised by his mother the Rajmata. They both come to know that they are brothers and they plan to take revenge against Durjan Singh.::old is classic"
}