{
    "id": "12196626",
    "localized title": "Mastram",
    "cast": [
        "Anshuman Jha",
        "Tara-Alisha Berry",
        "Jagat Rawat",
        "Aakash Dabhade",
        "Rani Chatterjee",
        "Vipin Sharma",
        "Nehal Vadoliya",
        "Leena Sharma",
        "Murari Kumar",
        "Harshita Kushwaha",
        "Ghanshyam Garg",
        "Ravi Sharma",
        "Majid Khan",
        "Avtar Singh",
        "Isha Chabbra",
        "Garima Jain",
        "Ashmita Jaggi",
        "Amrita Das Gupta",
        "Tarun Chauhan",
        "Swapnil",
        "Kenisha Awasthi",
        "Karan",
        "Devesh Siwal",
        "Rajinder Sharma",
        "Kamalika Chanda",
        "Jignesh Joshi",
        "Ambika",
        "Saurabh",
        "Neru",
        "Prakriti",
        "Prabhjyot Singh",
        "Juhi",
        "Ali",
        "Neelam",
        "Chandru Bhan",
        "Mohsin Mir Manzoor",
        "Sanket",
        "Mohit",
        "Komal",
        "Abha Paul",
        "Shikha Sinha",
        "Col Ravi Sharma",
        "Leena Sharma",
        "Sidharth Bhardwaj",
        "Snower Sania Vasudev",
        "Vivek Jha",
        "Madhu Sharma",
        "Mohit Parashar",
        "Vivekanand Jha",
        "Vineet"
    ],
    "genres": [
        "Comedy",
        "Fantasy"
    ],
    "runtimes": "20",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "India:18",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTYwMDQ2ZTktN2ZjMS00NjNmLWJhZWEtMWM1N2M3YjU2ZDIwXkEyXkFqcGdeQXVyMTE0Nzg1NjQ2._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "12196626",
    "plot outline": "There is one story that we may or may not be aware of which is that of Mastram, the quintessential writer of this era who spoke the lingo of the Hindi heartland - literally. One teacher and many lessons - his stories were the only guide required to graduate from boys to men. His stimulating books served as the wings to every boy's imagination and fantasies. The 10 episodes feature stories of passion intertwined with turbulent day-to-day scenarios from Mastram's real life.",
    "languages": "Hindi",
    "title": "Mastram",
    "kind": "tv mini series",
    "series years": "2020-",
    "akas": "Mastram (India)",
    "seasons": "1",
    "writer": "Aryan Sunil",
    "production companies": [
        "Almighty Motion Picture",
        "MX Player"
    ],
    "distributors": "MX Player",
    "plot": [
        "Meet _Mastram_ (qv), the quintessential writer of the 80s who spoke the lingo of the Hindi heartland - literally. The 10 episodes feature stories of passion intertwined with turbulent day-to-day scenarios from _Mastram_ (qv)'s real life.",
        "There is one story that we may or may not be aware of which is that of _Mastram_ (qv), the quintessential writer of this era who spoke the lingo of the Hindi heartland - literally. One teacher and many lessons - his stories were the only guide required to graduate from boys to men. His stimulating books served as the wings to every boy's imagination and fantasies. The 10 episodes feature stories of passion intertwined with turbulent day-to-day scenarios from _Mastram_ (qv)'s real life.",
        "Rajaram is a struggling writer but no one is willing to publish his book as his content wont be sale able they want him to write Masala stories with lust which is against him.His friend Gopal ask him to watch an adult film and tells that this is his content but he disagrees.Whie traveling in a bus the village hawker Rani enters whose lusted by everyone due to her skimpy clothes as the bus starts to get empty Rani and Rajaram start making out in the traveling Vehicle.This seventh heaven experience gives Rajaram his first story he starts writing in the name of Mastraam and his lust stories are enjoyed by people of all ages and class.::alex.mjacko@gmail.com"
    ]
}