{
    "id": "13087356",
    "localized title": "Muyal",
    "cast": [
        "Murali",
        "Saranya Nag",
        "Prabhu Seikizhan",
        "Singamuthu"
    ],
    "genres": "Drama",
    "runtimes": "123",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "10 Oct 2014 (India)",
    "imdbID": "13087356",
    "plot outline": "'Muyal' is a commercial movie that combines many dramatic elements such as sentiment, comedy, romance, action, not to mention, stunning visuals. The movie revolves around three friends from college who've thus far never known any sorrow and have led blissfully happy and idyllic lives. After graduating from college, they decide to start a business together. At this juncture, an event occurs that turns their lives upside down and casts them into much turmoil. Deeply affected by the incident, they decide that no one else should have to suffer a similar fate. Their journey towards finding a lasting solution for this problem forms the crux of the movie.",
    "languages": "Tamil",
    "title": "Muyal",
    "kind": "movie",
    "directors": "S.P.S. Guhan",
    "writers": "S.P.S. Guhan",
    "composers": "G.V. Prakash Kumar",
    "akas": "Muyal (India)",
    "writer": "S.P.S. Guhan",
    "director": "S.P.S. Guhan",
    "production companies": "P&V Entertainment",
    "plot": "'_Muyal_ (qv)' is a commercial movie that combines many dramatic elements such as sentiment, comedy, romance, action, not to mention, stunning visuals. The movie revolves around three friends from college who've thus far never known any sorrow and have led blissfully happy and idyllic lives. After graduating from college, they decide to start a business together. At this juncture, an event occurs that turns their lives upside down and casts them into much turmoil. Deeply affected by the incident, they decide that no one else should have to suffer a similar fate. Their journey towards finding a lasting solution for this problem forms the crux of the movie."
}