{
    "id": "1650433",
    "localized title": "Sura",
    "cast": [
        "Joseph Vijay",
        "Tamannaah Bhatia",
        "Vadivelu",
        "Dev Gill",
        "Sriman",
        "Riyaz Khan",
        "Sujatha Sivakumar",
        "Madhan Bob",
        "Radha Ravi",
        "Ilavarasu",
        "Venniradai Moorthy",
        "Thaadi Balaji",
        "Karate Raja",
        "Alwa Vasu",
        "King Kong",
        "Rajendranath",
        "Vakil Khan"
    ],
    "genres": "Action",
    "runtimes": "159",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "sound mix": "DTS",
    "certificates": [
        "Australia:M",
        "Canada:G::(Quebec)",
        "India:U",
        "New Zealand:M",
        "South Africa:13",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "30 Apr 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNGI4M2E1NjAtNTAzMS00ZjNmLWIxM2EtODBmZmMzZTFmYWY3XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR41,0,101,150_.jpg",
    "imdbID": "1650433",
    "plot outline": "Sura is a story that is set in Yaazh Nagar, a fishermen hamlet in coastal Tamil Nadu.Sura (Vijay) is born and brought up here in the company of his friend, Ambar La, alias Umbrella (Vadivelu). Meanwhile, he comes across young bubbly Poornima (Tamannaah) who chooses to end her life unable to cope up with the death of her pet dog. Slowly, she becomes attracted towards Sura thanks to his good deeds. They start romancing. When things seem to go well, trouble enters in the form of a greedy and corrupt Minister Samuthira Raja (Dev Gill). He wants to usurp the land where these fishermen live. His attempts to take away the wealth is resisted by Sura. They cross fight each other. The Minister hatches a conspiracy to bump off Sura with the help of his Ministerial post and authority and sues him. Sura takes on them single-handedly and finally destroy his bad intention and help his town fishermen to get their own house as he wished.",
    "languages": "Tamil",
    "title": "Sura",
    "kind": "movie",
    "directors": "S.P. Rajkumar",
    "writers": "S.P. Rajkumar",
    "producers": "Sangili Murugan",
    "composers": "Mani Sharma",
    "cinematographers": [
        "N.K. Ekambaram",
        "M.S. Prabhu"
    ],
    "editors": "Don Max",
    "editorial department": "K. Sasi Kumar",
    "visual effects": [
        "Bejoy Arputharaj",
        "Karthik",
        "Rajasekar Kn",
        "Raghuraman"
    ],
    "stunts": [
        "David Bueno",
        "Brahim Chab",
        "Anton Kalinitchenko",
        "Tim Man",
        "Charlie Ruedpokanon",
        "Kazu Patrick Tang"
    ],
    "location management": "Ajmal Koya Appu",
    "music department": [
        "Na. Muthukumar",
        "Vaali"
    ],
    "akas": [
        "Shark (United States)",
        "Акула (Russia)"
    ],
    "writer": "S.P. Rajkumar",
    "director": "S.P. Rajkumar",
    "production companies": "Murugan Cine Arts",
    "distributors": [
        "Sun Pictures",
        "Ayngaran International",
        "Sun TV"
    ],
    "other companies": "Sony Music India",
    "plot": [
        "An ordinary fisherman attempts to save his village from a corrupted politician.",
        "_Sura_ (qv) is a story that is set in Yaazh Nagar, a fishermen hamlet in coastal Tamil Nadu._Sura_ (qv) (Vijay) is born and brought up here in the company of his friend, Ambar La, alias Umbrella (Vadivelu). Meanwhile, he comes across young bubbly Poornima (Tamannaah) who chooses to end her life unable to cope up with the death of her pet dog. Slowly, she becomes attracted towards _Sura_ (qv) thanks to his good deeds. They start romancing. When things seem to go well, trouble enters in the form of a greedy and corrupt Minister Samuthira Raja (Dev Gill). He wants to usurp the land where these fishermen live. His attempts to take away the wealth is resisted by _Sura_ (qv). They cross fight each other. The Minister hatches a conspiracy to bump off _Sura_ (qv) with the help of his Ministerial post and authority and sues him. _Sura_ (qv) takes on them single-handedly and finally destroy his bad intention and help his town fishermen to get their own house as he wished.::Santhosh"
    ]
}