{
    "id": "2196638",
    "localized title": "Gulabi Gang",
    "cast": [
        "Sampat Pal Devi",
        "Ram Dulari",
        "Devrati",
        "Babu",
        "Soondhi",
        "Chandrakali",
        "Bharat Patel",
        "Hemlata Patel",
        "Husna Jahan",
        "Jayprakash Shivhare",
        "Usha Patel",
        "Suman Singh Chauhan",
        "Parvati",
        "Gomati",
        "Raja Bai",
        "Matti",
        "Mahendra",
        "Tripti Agarwal"
    ],
    "genres": "Documentary",
    "runtimes": "96",
    "countries": [
        "Norway",
        "India",
        "Denmark"
    ],
    "country codes": [
        "no",
        "in",
        "dk"
    ],
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "1.78 : 1 / (high definition)",
    "sound mix": "6-Track Stereo",
    "certificates": [
        "Germany:Not Rated",
        "Norway:11"
    ],
    "original air date": "Feb 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjE2Njg5MDEzNF5BMl5BanBnXkFtZTcwNjQyMTc5Nw@@._V1_SY150_CR99,0,101,150_.jpg",
    "imdbID": "2196638",
    "plot outline": "Bundelkhand in central India, a region notorious for its rebels-turned-armed bandits, is witnessing a new kind of rebellion with an unusual cast of characters. These are the pink sari-clad women of the Gulabi Gang, who use words as weapons - demanding their rights, submitting petitions and haranguing corrupt officials. They travel long distances by cart and tractor, bus and train, to wrest justice for women and dalits, undeterred by sneering policemen and condescending bureaucrats. Sampat Pal, the group's founder, is a rough-and-tough woman with a commanding personality. Despite being born into a traditional family and married off early, she has evolved her own brand of feminism and egalitarian politics. Constantly on the move, today she may be found investigating the suspicious death of a young woman, tomorrow protesting against a corrupt official. The Gulabi Gang, with a membership of thousands, is active across many districts. Suman Singh, one of the leaders, has made it her personal mission to send a land-grabbing village chief behind bars, along with his murderous henchmen. But what's to be done when the brother of a fellow activist carries out an \"honour killing\"? Husna, a longtime member, is forced to choose between family loyalties and all that their fragile movement stands for. The Gang is still very new, and many of its members still steeped in conservative values. A whole village connives in protecting the perpetrators of violence, aided by those in power. Everywhere, the Gang encounters resistance to its notions of gender equality and efforts for social change. The film pulls us into the centre of all these blazing conflicts: we are moved by the women's courage and determination, while their frustrations and disappointments mirror our own. As it travels with them through the dusty and desolate landscape, Gulabi Gang uncovers a complex story, disturbing yet heartening.",
    "languages": "Hindi",
    "title": "Gulabi Gang",
    "kind": "movie",
    "directors": [
        "Nishtha Jain",
        "Torstein Grude"
    ],
    "writers": [
        "Torstein Grude",
        "",
        "Nishtha Jain",
        "",
        "Smriti Nevatia",
        "",
        "Smriti Nevatia"
    ],
    "producers": [
        "Finn Gjedebo",
        "Torstein Grude",
        "Mette Hoffman Meyer",
        "Nishtha Jain",
        "Anne Köhncke",
        "Gurbaj Singh",
        "Signe Byrge Sørensen",
        "Bjarte Mørner Tveit",
        "Oddleiv Vik"
    ],
    "composers": "Peter Scartabello",
    "cinematographers": "Rakesh Haridas",
    "editors": "Arjun Gourisaria",
    "editorial department": [
        "Mats Andersen",
        "Erik Andersson",
        "Susanna Chacko",
        "Nishtha Jain",
        "Stefan Kamp",
        "Adesh Prasad"
    ],
    "production managers": "Neelima Goel",
    "assistant directors": "Aditya Kelgaonkar",
    "sound department": [
        "Mateen Ahmad",
        "Niraj Gera",
        "Bobby Hess",
        "Andrea King",
        "Alexej Mungersdorff",
        "Peter Schultz"
    ],
    "special effects": "Odd Brandtzægg",
    "visual effects": [
        "Christopher Berge Hove",
        "Tom Chr. Lilletvedt"
    ],
    "camera department": [
        "Torstein Grude",
        "Aditya Kelgaonkar",
        "Chandramohan Soma"
    ],
    "miscellaneous": [
        "Shyam Bora",
        "Neelima Goel",
        "Torstein Grude",
        "Shray Gupta",
        "Nick Hegreberg",
        "Nishtha Jain",
        "Harini Lakshminarayan",
        "Karina Lavik",
        "Smriti Nevatia",
        "Laura Plotkin",
        "Sohum Shah"
    ],
    "akas": [
        "Gulabi-banden (Denmark)",
        "Gang z Gulabi (Poland)",
        "Intian voimanaiset (Finland)",
        "Гулаби Ганг (Bulgaria, Bulgarian title)",
        "Indiens starka kvinnor (Finland, Swedish title)"
    ],
    "writer": [
        "Torstein Grude",
        "Nishtha Jain",
        "Smriti Nevatia"
    ],
    "director": [
        "Nishtha Jain",
        "Torstein Grude"
    ],
    "production companies": [
        "Final Cut for Real",
        "Piraya Film A/S",
        "Raintree Films"
    ],
    "distributors": [
        "Kudos Family",
        "Yleisradio (YLE)"
    ],
    "other companies": [
        "Cosmo Tone",
        "Hinterland",
        "Mainstream ApS",
        "Raintree Films"
    ],
    "plot": [
        "In Bundelkhand, India, a revolution is in the making among the poorest of the poor, as the fiery women of the _Gulabi Gang_ (qv) empower themselves and take up the fight against gender violence, caste oppression and widespread corruption.",
        "Bundelkhand in central India, a region notorious for its rebels-turned-armed bandits, is witnessing a new kind of rebellion with an unusual cast of characters. These are the pink sari-clad women of the _Gulabi Gang_ (qv), who use words as weapons - demanding their rights, submitting petitions and haranguing corrupt officials. They travel long distances by cart and tractor, bus and train, to wrest justice for women and dalits, undeterred by sneering policemen and condescending bureaucrats. Sampat Pal, the group's founder, is a rough-and-tough woman with a commanding personality. Despite being born into a traditional family and married off early, she has evolved her own brand of feminism and egalitarian politics. Constantly on the move, today she may be found investigating the suspicious death of a young woman, tomorrow protesting against a corrupt official. The _Gulabi Gang_ (qv), with a membership of thousands, is active across many districts. Suman Singh, one of the leaders, has made it her personal mission to send a land-grabbing village chief behind bars, along with his murderous henchmen. But what's to be done when the brother of a fellow activist carries out an \"honour killing\"? Husna, a longtime member, is forced to choose between family loyalties and all that their fragile movement stands for. The Gang is still very new, and many of its members still steeped in conservative values. A whole village connives in protecting the perpetrators of violence, aided by those in power. Everywhere, the Gang encounters resistance to its notions of gender equality and efforts for social change. The film pulls us into the centre of all these blazing conflicts: we are moved by the women's courage and determination, while their frustrations and disappointments mirror our own. As it travels with them through the dusty and desolate landscape, _Gulabi Gang_ (qv) uncovers a complex story, disturbing yet heartening.::Piraya Film",
        "Enter the badlands of Bundelkhand in central India and you have entered a place of desolation, dust and despair. And yet it is hope that we discover as we follow the pink sari-clad women of _Gulabi Gang_ (qv). These women travel long distances by cart and tractor, bus and train, to wrest justice for women and Dalits, undeterred by sneering policemen and condescending bureaucrats. Sampat Pal, their leader, is a rough-and-tough woman with a commanding personality. Despite her lack of education she has evolved her own brand of feminism and egalitarian politics. Her strength lies in her words. She is constantly on the move - today investigating a young woman's suspicious death, tomorrow protesting against a corrupt official. The gang encounters resistance everywhere - whole villages connive in protecting the perpetrators of violence. As the film pulls us into the centre of these blazing conflicts, it uncovers a complex story, disturbing yet heartening."
    ],
    "synopsis": "Enter the badlands of Bundelkhand in central India and you have entered a place of desolation, dust and despair. And yet it is hope that we discover as we follow the pink sari-clad women of Gulabi Gang. These women travel long distances by cart and tractor, bus and train, to wrest justice for women and Dalits, undeterred by sneering policemen and condescending bureaucrats. Sampat Pal, their leader is a rough-and-tough woman with a commanding personality. Despite her lack of education she has evolved her own brand of feminism and egalitarian politics. Her strength lies in her words. She is constantly on the move today investigating a young womans suspicious death, tomorrow protesting against a corrupt official. The gang encounters resistance everywhere whole villages connive in protecting the perpetrators of violence. As the film pulls us into the centre of these blazing conflicts, it uncovers a complex story, disturbing yet heartening."
}