{
    "id": "2339505",
    "localized title": "Kochadaiiyaan",
    "cast": [
        "Rajinikanth",
        "Deepika Padukone",
        "Sarath Kumar",
        "Jackie Shroff",
        "Nassar",
        "Aadhi",
        "Shobana",
        "Rukmini Vijayakumar",
        "Shanmugha Rajan",
        "Ramesh Khanna",
        "Rob Oldfield",
        "Keyaan Hameed",
        "Suman"
    ],
    "genres": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "runtimes": "118",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Belgium:KT/EA",
        "Canada:14A::(Alberta)",
        "Canada:14A::(British Columbia)",
        "Canada:13+::(Quebec)",
        "Hong Kong:IIA",
        "India:U",
        "Ireland:12A",
        "New Zealand:M",
        "Norway:11",
        "Singapore:NC16",
        "Singapore:PG13",
        "South Africa:10-12",
        "Switzerland:16",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "23 May 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGJmYWYxODUtYjQxNy00YzFjLTk2OWQtMjVjNGQ2MzgzZjBiXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "2339505",
    "plot outline": "The Story of a powerful king Kochadaiiyaan, and so does his Kingdom. But on a fateful day, one of his close friends plots against him and acquires his kingdom, while he was driven away. Kochadaiiyaan gets a baby boy Rana, who grows up to become a great warrior, and fights and redeems the kingdom that rightfully belongs to him.",
    "languages": "Tamil",
    "title": "Kochadaiiyaan",
    "kind": "movie",
    "directors": "Soundarya Rajinikanth Vishagan",
    "writers": [
        "Kamlesh Pandey",
        "",
        "K.S. Ravikumar"
    ],
    "producers": [
        "Prashita Chaudhary",
        "Alex Anthony Fernandes",
        "Sunil Lulla",
        "Jayabalan Murali Manohar",
        "Sunanda Murali Manohar",
        "A.P. Madan Mohan",
        "Siddarth Prakhash"
    ],
    "composers": "A.R. Rahman",
    "cinematographers": "Padmesh",
    "editors": "Anthony",
    "editorial department": [
        "Neelkanth Mapara",
        "Vaibhav Marathe",
        "Sachin Patidar",
        "Girish Takle",
        "Vikram Dharankar"
    ],
    "art directors": "Vadivel Chinnakgoundar",
    "costume designers": "Neeta Lulla",
    "production managers": [
        "Bindni Karia",
        "Kira Moreno"
    ],
    "assistant directors": [
        "R. Madhesh",
        "Sangeeth Sahajan",
        "Sajiv"
    ],
    "art department": "Vadivel Chinnakgoundar",
    "sound department": [
        "Sampath Alwar",
        "Sajjan Choudhary",
        "Kannan Ganpat",
        "Sinoy Joseph",
        "Boney M. Joy",
        "Vijay Kumar",
        "Racchit Malhotra",
        "Resul Pookutty",
        "Sainathan",
        "Karnail Singh",
        "S. Sivakumar",
        "Krishnan Subramanian",
        "Varun Visoi"
    ],
    "visual effects": [
        "Srinivasraju Alluri",
        "Nikhil M. Anand",
        "Manidhar Areti",
        "Kay Arutyunyan",
        "Sanjay Baghel",
        "Jayadeep Chandran",
        "Dhirendra Chhatpar",
        "Tej Dilip",
        "Andrew Egiziano",
        "Saikrishnan Ganesan",
        "Brian Genna",
        "Jack Ho",
        "Avnish Jha",
        "Kotamraju Karthik",
        "Nitesh Kumar",
        "Sudhir Kurupudi",
        "Lamture.Abhijeet",
        "A.P. Madan Mohan",
        "Vamsi Krishna Mudraboina",
        "Padmesh",
        "Lino Stephen Peter",
        "Praveen",
        "Raju Purushothaman",
        "Malla Rajendra",
        "Matthew J. Rowney",
        "Sajiv",
        "K L Sateesh Varma",
        "Brian Taber",
        "Chris Treichel",
        "Eddy Wong"
    ],
    "stunts": "Peter Hein",
    "camera department": "Ajesh Venugopal",
    "animation department": [
        "Karthik Adepu",
        "Fayaz",
        "Kanal",
        "Shyam Lal",
        "Paul Ming Tak Lee",
        "Rohit Pednekar",
        "Selva Raj",
        "Kalaiarasi Sathappan"
    ],
    "music department": [
        "Raqueeb Alam",
        "S.P. Balasubrahmanyam",
        "Daniel Bhattacharya",
        "Richard Bissill",
        "Kazimir Boyle",
        "Chandrabose",
        "Ishaan Chhabra",
        "Fiona Cruickshank",
        "Kevin J. Doucette",
        "Falko Duczmal",
        "Matt Dunkley",
        "Kochadaiiyaan Ensemble",
        "Geoff Foster",
        "Haricharan",
        "Tony Joy",
        "Irshad Kamil",
        "T.R. Krishnachetan",
        "Hentry Kuruvilla",
        "Roger Linley",
        "Steve Mair",
        "Mehboob",
        "A.R. Rahman",
        "Latha Rajinikanth",
        "A.R. Reihana",
        "Sadhana Sargam",
        "V. Uma Shankar",
        "Vinay Sridhar",
        "Srinivas",
        "Chinmayee Sripada",
        "Anantha Sriram",
        "Vaali",
        "Vairamuthu",
        "Valee",
        "Vanamali",
        "Srinidhi Venkatesh",
        "Jerry Silvester Vincent",
        "Allen Walley",
        "Bruce White",
        "Warren Zielinski",
        "Rachel Bolt",
        "Dave Foster"
    ],
    "miscellaneous": [
        "Amit Basnet",
        "Nandini Karky",
        "Saroj Khan",
        "Rajan Korgaonkar",
        "R. Madhesh",
        "Aneesh Mohan",
        "Chinni Prakash",
        "Surekha Chinni Prakash",
        "Sonam Budha Sharmaa",
        "Shivashankar",
        "Iain Silvester",
        "Raju Sundaram",
        "R. Udhayakumar"
    ],
    "akas": [
        "Vikrama Simha (India, Telugu title)",
        "Kochadaiiyaan: The Legend (World-wide, English title)",
        "Легенда (Russia)",
        "Sử Thi Kochadaiiyaan (Vietnam)"
    ],
    "writer": [
        "Kamlesh Pandey",
        "K.S. Ravikumar"
    ],
    "director": "Soundarya Rajinikanth Vishagan",
    "production companies": [
        "Media One Global Entertainment",
        "Eros Worldwide",
        "Cinemorphic",
        "CounterPunch Studios"
    ],
    "distributors": [
        "Aanna Films",
        "Atmus Entertainment",
        "Ayngaran Video",
        "Lakshmi Ganpathy Films",
        "Eros Worldwide",
        "Jaya TV"
    ],
    "special effects": [
        "Prism & Pixels",
        "Centroid Motion Capture",
        "Menfond Electronic Art",
        "Prime Focus"
    ],
    "other companies": [
        "Eros Music",
        "Sony Music India",
        "Trigger Happy Entertainment"
    ],
    "plot": [
        "A noble warrior seeks revenge against the ruler of his kingdom, who killed his father. At the same time, he also ends up upsetting the neighboring enemy kingdom's ruler.",
        "The Story of a powerful king _Kochadaiiyaan_ (qv), and so does his Kingdom. But on a fateful day, one of his close friends plots against him and acquires his kingdom, while he was driven away. _Kochadaiiyaan_ (qv) gets a baby boy Rana, who grows up to become a great warrior, and fights and redeems the kingdom that rightfully belongs to him.::Nithin J",
        "The story revolves around the feud between two kingdoms - Kalingapuri and Kottaipattinam. Rana (Rajinikanth), being a resident of Kottaipattinam leaves the kingdom and reaches Kalingapuri without revealing his identity where he comes from. Later he is declared the commando of Kalingapuri by King Raja Mahendra (Jackie Sheroff). But Rana has some unsettled businesses to be accomplished.::Raj Kamal"
    ],
    "synopsis": "In ancient India, the two kingdoms of Kottaipattinam and Kalingapuri have always been enemies to each other. One day, a young boy named Rana from Kottaipattinam becomes distraught and runs away from his family by jumping into a river, despite protest from his twin brother Sena, and washes up near Kalingapuri. He's raised by fishermen and in time becomes close friends with prince Veera Mahendran and is trained to be a heavily skilled warrior. When he's grown up Rana gains heavy respect from the subjects and is invited to see the labor force of Kalingapuri, consisting of war prisanors from Kottaipattinum. Rana proposes that they train the number of slaves in their kingdom to become warriors, which Veera's father, King Mahendran allows. Rana trains the slaves and over time they become a skilled force to conquer local kingdoms. As the ultimate prize, Rana suggests laying siege to Kottaipattinum as he's convinced the slaves now despise the kingdom that has abandoned them. Declaration of war is sent to king Rishikodaghan of Kottaipattinum and Rana leads the army of warrior slaves to the kingdom, however he strangely ceases fire and is invited into the kingdom by his old friend prince Sengodagan, son of the king. He also reunites with his childhood love interest princess Vandana, Sengodagan's sister. It turns out that Rana had plotted to free the war prisinors and had discussed this plan with them before the supposed war. Mahendran recieves word of Rana's treachery and swears revenge.Rana reunites with his sister Yamuna and their uncle, but is told that Sena has gone missing after a battle. Rana is shown around the kingdom and saves Rishikodaghan from an accident, so the king grants him a wish. Since Sengodagan had expressed feelings for Yamuni, despite being a woman of lower class, Rana requests their marriage to which Rishikodaghan accepts. However after the wedding the king disowns his son and revokes his privledge to the throne for not marrying a member of royalty, which Sengodagan tolerates. One night, an intruder breaks into the castle and attempts to kill Rishigodaghan, but his daughter stops the intruder whose revealed to be Rana. Rana is arrested for treason and Vandana wonders why her friend would try to hurt her father. Rana explains that his own father Kochadaiyaan was a powerful warrior and skilled general of Kottaipattinum's army and gained heavy respect from the people which made Rishikodagan jealous. One day, while escorting a shipment of horses and weapons many soldiers of the kingdom are ambushed by enemies from Kalingapuri. The enemy soldiers are defeated but not before shooting poisoned arrows into the food supply crates, leading to Kochadaiyaan's army falling sick. With no choice, he pleads with king Mahendran to keep his men alive which he agrees to, as slaves in his kingdom along with all of the horses and weapons.When Kochadaiyaan returns to Kottaipattinam he's unjustly charged with treason by Rishikodagan. He is punished with execution and his wife, Rana, Sena, and Yamuni's mother protest that he did what needed to be done to keep the kingdom's men alive but she's silenced. Rana hugs his father, as allowed by the king just before he's executed. Kochadaiyaan is beheaded before Rana's eyes, much to his horror. After telling the story Vandana becomes angered at her father's actions but finds that Rishikodaghan intends to get her an arranged marriage to prince Veera Mahendran to seal truce to the war between the kingdoms. Rana escapes from the dungeons and crashes the wedding the next day, speaking up against Rishikodaghan's actions. King Mahendran is outraged and his men begin to attack, and Rana summons the former slave army and the rest of Kottaipattinam's forces as defense. The two kingdoms clash and Kottaipattinam repel's Kalingapuri's army. Rana kills king Mahendran but spares his son in reminder of their friendship. He also finds Rishikodaghan and beheads him in revenge. Shortly after, he's confronted by his brother Sena who has returned, but is enraged that he killed the king their father taught them to protect. The movie ends as they persumebly fight."
}