{
    "id": "2827320",
    "localized title": "Fandry",
    "cast": [
        "Somnath Awghade",
        "Rajeshwari Kharat",
        "Suraj Pawar",
        "Kishore Kadam",
        "Chhaya Kadam",
        "Nagraj Manjule",
        "Jyoti Subhash",
        "Pravin Tarde",
        "Suresh Vishwakarma",
        "Bhushan Manjule",
        "Vikas Pandurang Patil",
        "Aishwarya Shinde",
        "Sakshi Vyavhare",
        "Sanjay Chaudhri",
        "Ramchandra Dhumal",
        "Prashant Kambale",
        "Suhas Shirsat"
    ],
    "genres": [
        "Drama",
        "Family"
    ],
    "runtimes": "101",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:UA",
        "Singapore:PG",
        "United States:Not Rated"
    ],
    "original air date": "14 Feb 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjM5MDYwNDIzNF5BMl5BanBnXkFtZTgwMjc3MjQ2NDE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "2827320",
    "plot outline": "Love, the most beautiful emotion in all living creatures that God has made knows no bar, caste or boundaries, is the central theme of Fandry. A young lad (Jabya) falls in love with his classmate. Incidentally, he belongs to a lower caste, a family below the poverty line which does all sorts of jobs in the village to survive like catching Pigs and the girl belongs to a higher caste. His parents are working hard to arrange money for their daughter's wedding while Jabya is collecting money for new clothes to impress the girl. Fandry is a story of his aspirations, quest, sorrows, anguish and frustrations. Fandry also touches upon the age old monster of Caste System which is still lurking large upon the society.",
    "languages": "Marathi",
    "title": "Fandry",
    "kind": "movie",
    "directors": "Nagraj Manjule",
    "writers": "Nagraj Manjule",
    "producers": [
        "Apoorva Bakshi",
        "Nishant Roy Bombarde",
        "Tanmayee Deo",
        "Vivek Kajaria",
        "Nilesh Navalakha",
        "Jitesh Upade"
    ],
    "composers": "Alokananda Dasgupta",
    "cinematographers": "Vikram Amladi",
    "editors": "Chandan Arora",
    "editorial department": [
        "Rajiv Manahalli",
        "Nitin Minz"
    ],
    "art directors": "Santosh Sankhad",
    "costume designers": [
        "Gargi Kulkarni",
        "Dubey Priyanka"
    ],
    "production managers": [
        "Siddharth Ghadage",
        "Kapil Sharma"
    ],
    "assistant directors": "Hemant Kudale",
    "sound department": [
        "Nimish Chheda",
        "Kevin Pinto",
        "Christopher Robleto-Harvey",
        "Koteswara Rao S.V.",
        "Sudesh Sidhu",
        "Avinash Sonawane"
    ],
    "visual effects": [
        "Pravin Anarase",
        "Rajendra Berad",
        "Mayur Ghorpade",
        "Bhushan Humbe",
        "Shweta Humbe",
        "Vivek Jamble",
        "Ashish Kakade",
        "Lalit Khachane",
        "Onkar Shinde",
        "Pankaj Sonawane"
    ],
    "camera department": "Ambekar Satish",
    "miscellaneous": [
        "Apoorva Bakshi",
        "Nitin Keni",
        "Abhishek Mamgain",
        "Omkar Ranade"
    ],
    "writer": "Nagraj Manjule",
    "director": "Nagraj Manjule",
    "production companies": [
        "Holy Basil Productions",
        "Navalakha Arts, Media & Entertainment"
    ],
    "distributors": [
        "Nittin Keni Creations",
        "Film Karavan",
        "FilmKaravan",
        "Video Palace"
    ],
    "special effects": "Illusion Ethereal",
    "other companies": [
        "Illusion Ethereal",
        "Sound Spectrum",
        "Sound Spectrum"
    ],
    "plot": [
        "It is about a teenager from a Dalit (Oppressed caste) family, who lives at the village fringe, and falls in love with an upper caste girl.",
        "Love, the most beautiful emotion in all living creatures that God has made knows no bar, caste or boundaries, is the central theme of _Fandry_ (qv). A young lad (Jabya) falls in love with his classmate. Incidentally, he belongs to a lower caste, a family below the poverty line which does all sorts of jobs in the village to survive like catching Pigs and the girl belongs to a higher caste. His parents are working hard to arrange money for their daughter's wedding while Jabya is collecting money for new clothes to impress the girl. _Fandry_ (qv) is a story of his aspirations, quest, sorrows, anguish and frustrations. _Fandry_ (qv) also touches upon the age old monster of Caste System which is still lurking large upon the society.::Anonymous",
        "Jabya belongs to a lower caste family living in a village which believe in cast discrimination.He falls in one sided love with his classmate Shalu a higher caste girl.Jabya's parents are daily labor's and do small jobs for living.He shares a unique bond with his friend Piriya.The village higher caste people always let down Jabya's family and make them do all kind of shabby work and refer them as _Fandry_ (qv) which means Pig.::alex.mjacko@gmail.com"
    ],
    "synopsis": "A mesmeric force pulls Jabya onto the other side. The rarest of rare Black Sparrow he is told, is the cure to his problem. Her ashes are believed to cast a hypnotic spell on the one you are in love with. Completely away from the magical world of Jabya, exists the callous reality of his parents who are working at the most oppressed level of the Indian Class Structure and assume him to do the same work which they have done all their life. The protagonist has to now struggle between his quest to find the magical sparrow and his parents expectations.Will Jabya be successful in his pursuit of the Black Sparrow? Will the magnetic power surpass the class differences between Jabya and Shalu created by centuries of customs? Will Jabya break the fences and pass onto the other side? Or Jabya will unearth something totally unexpected in his journey?"
}