{
    "id": "3056632",
    "localized title": "Manjunath",
    "cast": [
        "Anjori Alagh",
        "Karan Ashar",
        "Aarun D. Baliean",
        "Asif Basra",
        "Seema Biswas",
        "Saksham Dayma",
        "Divya Dutta",
        "Kishore Kadam",
        "Rajesh Khattar",
        "Nalneesh",
        "Anand Nandkumar",
        "Nalneesh Neel",
        "Om Prakash",
        "Faisal Rashid",
        "Gireesh Sahdev",
        "Saurabh Santosh",
        "Satiiysh Saarathy Sasho",
        "Manoj Sharma",
        "Manoj Sharma",
        "Shishir Sharma",
        "Yashpal Sharma",
        "Naval Shukla",
        "Uday Vir Singh Yadav",
        "Rishikesh Tiwari"
    ],
    "genres": [
        "Biography",
        "Drama"
    ],
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Germany:Not Rated",
        "Singapore:NC-16"
    ],
    "original air date": "09 May 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTQ0MjU4ODkwMF5BMl5BanBnXkFtZTgwNjMzMDU0NTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "3056632",
    "plot outline": "Manjunath is a true, inspirational and hard hitting story of an ordinary man and his fight against corruption. After passing out from the prestigious Indian Institute of Management, Lucknow, Manjunath Shanmugam was placed with an Oil company as a sales manager only to blow open the large scale adulteration of fuel taking place in the country. It was then that this courageous and honest man was brutally murdered while trying to do his job in the right way and became the victim of this very system which he was trying to protect.",
    "languages": "Hindi",
    "title": "Manjunath",
    "kind": "movie",
    "directors": "Sandeep A. Varma",
    "writers": [
        "Nitin Dwivedi",
        "",
        "Sandeep A. Varma"
    ],
    "producers": [
        "Sumit Gyanchandaney",
        "Neelam Sethi",
        "Sandeep A. Varma"
    ],
    "editors": "Sandeep Francis",
    "editorial department": [
        "Vikas Sharma",
        "Bobby Yadav",
        "Jespal Nadar"
    ],
    "art directors": "Ashish Rawat",
    "costume designers": "Rohit Chaturvedi",
    "production managers": "Manish Chajlane",
    "assistant directors": [
        "Aarun D. Baliean",
        "Jaichelle Barretto",
        "Daise Concessao",
        "Kamna Dutt",
        "Niraj Sharma",
        "Niraj Sharma"
    ],
    "sound department": [
        "Subir Kumar Das",
        "Anup Dev",
        "Dusmanta Sahoo",
        "Samant Christopher Lakra"
    ],
    "animation department": "Amit Hegde",
    "music department": "Subir Kumar Das",
    "miscellaneous": [
        "Sahil Kajale",
        "Vasudevan Kothandath",
        "Aditya Warrior"
    ],
    "akas": "Manjunath (India)",
    "writer": [
        "Nitin Dwivedi",
        "Sandeep A. Varma"
    ],
    "director": "Sandeep A. Varma",
    "production companies": [
        "ICOMO",
        "National Film Development Corporation of India (NFDC)"
    ],
    "plot": [
        "'_Manjunath_ (qv)' is a warm inspirational film based on the true story of _Manjunath_ (qv) Shanmugam, a sales officer from a petroleum company who was killed by the oil mafia in 2005 for his stand against fuel adulteration.",
        "_Manjunath_ (qv) is a true, inspirational and hard hitting story of an ordinary man and his fight against corruption. After passing out from the prestigious Indian Institute of Management, Lucknow, _Manjunath_ (qv) Shanmugam was placed with an Oil company as a sales manager only to blow open the large scale adulteration of fuel taking place in the country. It was then that this courageous and honest man was brutally murdered while trying to do his job in the right way and became the victim of this very system which he was trying to protect."
    ],
    "synopsis": "Set in todays hinterland of Uttar Pradesh and state-of-the-art campus of the Indian Institute of Management-Lucknow (IIM-L), India, Manjunath is the true story of a 27 year old guy, Manjunath Shanmugam. After passing out from the IIM, Manjunath (Sasho Satiiysh Saarathy) joins a petroleum company. He is posted in Lakhimpur Kheri, a remote district in rural Uttar Pradesh. One day Manjunath goes missing. His friends (Anjorie Alagh & Faisal Rashid), who know and work with him, panic, because they know that off late he had been very disturbed and was behaving very strangely. He had become very serious and scared. And this was very different from the Manjunath they knew in college, who was always jovial, fun-loving, very friendly and a great entertainer.One of his friends finds him, but Manjunath appears very frantic. They send him back to his hometown. Manjunaths parents try to convince him to leave his job at Indian Oil that seems to be causing him stress. Initially he seems willing but slowly he realizes that he doesnt want to be quitter. Manjunath believes that, being from a top institute in the country, he is one of the cream 5% who has been given the opportunity. Being the eldest son of a mineworker, he has had a humble upbringing.He realizes that the kerosene being mixed with diesel, is coming from ration shops its the poor peoples kerosene. In addition, he also becomes conscious of the extent of pollution caused by burning adulterated fuel. He finds strength and comes back to fight, against his parents (Kishor Kadam & Seema Biswas) wishes.Now we realize why he was under so much stress. There is a clear threat to his life, because he insists on doing his duty to stop petrol adulteration. But this time, Manjunath is not deterred. He continues doing what he considers right, without worrying about the consequences. As a result of this, one night he gets brutally killed by the people who are getting harmed by his doing his duty. His family and friends suffer, cry at his death. Why? They wonder Why he put himself in so much dangerThe question still remains. Is he a failure or a success?Slowly, the worst fears start coming true. Beyond the initial grief, no one wants to come forward to carry on the fight.Suddenly, like a bolt from the blue, people unrelated to him, who have no connection to him, start to realize the importance of what Manjunath did, and start trying to do something. Like novices, they search their way around, but their will is strong. They start getting help again from unexpected quarters. It is nerve wracking, with dangers for everyone who is helping them. But suddenly, instead of one or two, there are a lot people helping them. Manjunath, who has lost hope, realizes that its not all going waste.He hopes and prays that they succeed. The film has Manjunath himself as the narrator, and it cuts back and forth from a rock concert, which is the very unique treatment to the screenplay. And the conflict of the story is not whether Manjunath lived or died, but if the effect of Manjunath lives or dies, and in the end thats the victory."
}