{
    "id": "3394420",
    "localized title": "Ulidavaru Kandanthe",
    "cast": [
        "Kishore Kumar G.",
        "Rakshit Shetty",
        "Thara",
        "Achyuth Kumar",
        "Rishab Shetty",
        "Sheetal Shetty",
        "Yagna Shetty",
        "Dinesh Mangaluru",
        "Raghu Pandeshwar",
        "B. Suresha",
        "Pramod Shetty",
        "Kavya Hande",
        "Sohan Shetty",
        "K.P. Hegde",
        "Raghavendra P. Hegde",
        "Shivananda Kota",
        "Prabhakar Kunder",
        "Arun Prakash Shetty"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "154",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "D-Cinema 48kHz 5.1",
    "certificates": [
        "India:UA",
        "United Kingdom:15::(LIFF, self-applied)",
        "United States:Not Rated"
    ],
    "original air date": "28 Mar 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTc3ODUxODg3MV5BMl5BanBnXkFtZTgwMDc0MDY4MTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3394420",
    "plot outline": "Malpe is a small fishing town on the Arabian Coast, located 6 kilometers to the west of the temple town of Udupi. Malpe's beaches are washed clean everyday by the sea. The waves ensure that nothing gets left behind on the sands. But then, the waves cannot reach everything. It is the time of the year when Udupi and its surroundings are decked up to celebrate Sri Krishna Janmaashtami (The Birth of Lord Krishna). Men and children walk the streets dressed up as characters from mythology. Teams painted as tigers are seen dancing to drum beats all around the town. But violence seems to be brewing in Malpe this Krishna Janmaashtami and it is going change the lives of the ones' involved forever.",
    "languages": "Kannada",
    "title": "Ulidavaru Kandanthe",
    "kind": "movie",
    "directors": "Rakshit Shetty",
    "writers": [
        "Rakshit Shetty",
        "",
        "Rakshit Shetty"
    ],
    "producers": [
        "Abhi",
        "Hemanth",
        "Suni"
    ],
    "composers": "B. Ajaneesh Loknath",
    "cinematographers": "Karm Chawla",
    "editors": [
        "Sachin Ravi",
        "Sachin"
    ],
    "production managers": "Wilfred Fernandes",
    "assistant directors": [
        "Shashi Kumar",
        "Rahul Pk",
        "Jayanth Seege",
        "Rishab Shetty"
    ],
    "sound department": [
        "Vajjiravel Varun",
        "Renjith Viswanathan",
        "Renjith Viswanathan"
    ],
    "special effects": "Santhosh Radhakrishnan",
    "visual effects": [
        "Santhosh Radhakrishnan",
        "Santhosh Radhakrishnan"
    ],
    "camera department": [
        "Dilip Chakravarthy",
        "Saket Saurabh"
    ],
    "music department": [
        "Manojava Galgali",
        "Rakshit Shetty",
        "Suni",
        "Vigneshwar Vishwa"
    ],
    "miscellaneous": "Senna Hegde",
    "akas": [
        "As Seen by the Rest (Canada, English title)",
        "As Seen by the Rest (United States)",
        "As Seen by the Rest (World-wide, English title)",
        "Глазами участников (Russia)"
    ],
    "writer": [
        "Rakshit Shetty",
        "Rakshit Shetty"
    ],
    "director": "Rakshit Shetty",
    "production companies": "Suvin Cinemas",
    "special effects companies": "IMT Virtual Labs",
    "plot": [
        "A journalist sets out to uncover the truth behind an incident, through the perspectives of different people, unraveling how they and their lives are intertwined with it.",
        "Malpe is a small fishing town on the Arabian Coast, located 6 kilometers to the west of the temple town of Udupi. Malpe's beaches are washed clean everyday by the sea. The waves ensure that nothing gets left behind on the sands. But then, the waves cannot reach everything. It is the time of the year when Udupi and its surroundings are decked up to celebrate Sri Krishna Janmaashtami (The Birth of Lord Krishna). Men and children walk the streets dressed up as characters from mythology. Teams painted as tigers are seen dancing to drum beats all around the town. But violence seems to be brewing in Malpe this Krishna Janmaashtami and it is going change the lives of the ones' involved forever.::Anonymous"
    ],
    "synopsis": "(this section contains spoilers for the movie)The story is set in the early 90's in the coastal town of Malpe, Udupi district in Karnataka. The opening scene depicts fishermen preparing their fishing boats for the next catch. They do so while singing the traditional folk song. A young lad is seen staring out at the open Sea.A young journalist, Regina (Sheetal Shetty) is working on a story which she tells her editor, cannot be written as a single piece. The story has several perspectives from the various characters involved and hence must be preserved as they are.In a flashback scene, a young boy Richard Anthony alias Richi is trying to outrun cops who are there to arrest him for a murder. Regina remembers seeing this from the backseat of a car and it is established that both were childhood friends.Regina starts investigating the story by questioning various characters who were involved.Chapter : 1The first person she approaches is a local cashew nut merchant, Shailesha who knows both Richi and his childhood friend Raghu (Rishab Shetty). Richi had been in a remand home for 8 years and Raghu had escaped to Bombay(Mumbai) to work in a hotel and later with a local gang. Shailesha accidentally comes across Raghu during one of his Bombay trips. The two meet up in harbour where the Shailesha tells Raghu that his father is no more and his mother is making a living by selling fish at the local market. Raghu tells him he cannot leave Bombay as he knows many 'secrets' of his employer. He plans to relocate to Dubai with his mother, once he has sorted out the necessary funds. To do this, Raghu steals a red bag which was important for a 'deal' between the Bombay and an interested party in USA. He fights his ways through the gang's henchmen and escapes to Malpe where Shailesha provides him a safe house.Raghu realises that his location is compromised as two armed gangsters approach his house and start knocking at the front door. As Raghu steels himself for the impending gunfight, the knocking stops and the men leave.Chapter : 2The second narrative comes from a close ally of Richi, Dinesha (Pramod Shetty) who is held in lock-up. Richi (now portrayed by Rakshit Shetty) is a brash and flamboyant young man who carries out dirty work for a local gangster-cum-businessman, Shankar Poojary (Dinesh Mangalore). Poojary has links with Bombay underworld and runs several fishing boats in Malpe. Richi has earned a bad reputation for himself and is a disgrace to his father, a priest in the local Church.Poojary summons Richi and Dinesha at his estate and tasks him to find Balu (Achyuth Kumar), one of his employees to 'teach him a lesson'. Poojary asks Richi not to overdo it by 'losing control'. The annual Janmashtami festival is at full swing as Richi and gang arrive at Jod raste. Balu has painted himself as a tiger and is participating in Pili-vesha (tiger dance). Richi knocks out Balu and has him sent to the harbour. However he takes a detour when he hears that Raghu is back in town and needs a 'visit'.It is revealed that Richi and Raghu were the armed gangsters who were looking for Raghu in the previous story.Richi forces his way into the house, and goes about explaining made-up story of a Cuban boy (Tony Montana from the film Scarface) and a boy from Mandva (Vijay Chauhan from the movie Agnipath), and how a person at the receiving end of a beating often doesn't realise why he is being served this. This story doubles as a threat to Raghu and also as a metaphor for the viewers who are kept in dark as the violent story unfolds. Richi finds the red bag which Raghu had stolen from Bombay gang and asks the latter to join him for a boat ride. Raghu reluctantly agrees saying that he has to join his mother for dinner later in the day.Once on the fishing boat, Richi is torturing Balu and forcing a confession out of him. Eventually Richi pull out a gun on Balu who by now is broken man, and fires a shot. It would seem that Balu is no more.Chapter : 3Raghu's mother Ratnakka (Tara) makes a living out of selling fish in Malpe. After the death of her husband her life is of struggle. Raghu visits his mother at his childhood house and tells her that he wishes to move permanently to Dubai along with her. However he has to leave immediately and will return to pick her up once her documents are in order. He agrees to visit her the next day for dinner where she will prepare her signature dish Meen-saru (South Canara style fish curry, the chapter's namesake). The next day, a gleeful Ratnakka is shopping for fish in the local market, where she lets her fellow fisher women know that she is leaving for Dubai soon. That evening Ratnakka elaborately prepares the fish curry and waits for her son to arrive. Her joy turns to disappointment as the hours go by and she slowly starts to realise that her son may not return.Munna(Kishore) has a soft corner for Balu's sister who sells fish. He often roams around the fish market in hopes of getting a glimpse of her. He also tries to woo her with the help of the young lad, aptly known as 'Democracy'. Munna works as a repairman for Shankar Poojary's boats. During the routine inspection of a fishing boat which Richi had used for his earlier 'adventure', Munna discovers an empty shell casing on the deck. Having the knowledge that Balu was previously seen with Richi at harbour, Munna concludes that Balu has been murdered by Richi and gang.Chapter : 4Balu is in a ragged state when Regina approaches him for questioning. Balu has developed a prejudice for crows and starts to pelt stones at them whenever he sees one. During one of his fishing trips he catches a heavy log of wood in the fishing net. Balu decides to keep this to himself and soon discovers that the log actually contains a priceless relic which 'glows like gold'.Balu tries to make a profit out of this by selling the merchandise to a foreign party through a Bombay based middleman. The middleman is not able to make full payment as the merchandise has been misplaced and a deal cannot be finalised. As the Janmashtami festival approaches Balu has his body painted as a tiger for Pili-vesha and is performing at Jod raste. Richi and gang knock him out and takes him on a fishing boat to force a confession. During the interrogation Richi pulls out a gun and it is revealed that the shot was fired at Raghu. During his childhood, Richi had committed a hot blooded murder trying to protect Raghu, after which the latter escaped to Bombay leaving Richi behind to be arrested. Richi has deep bitterness against Raghu for this 'betrayal' because of which he spent 8 years in a remand home.On opening the red bag, it is revealed that it contains the merchandise which Balu was trying to sell off and Raghu is the middleman from Bombay who stole the item before the deal could go through. He was planning to sell it in Dubai in order to secure a life for him and his mother.Chapter : 5Richi returns to Malpe where he is celebrating with Poojary and the tigers from Pili-vesha. Munna believes Balu was killed by Richi's gang and is now blinded by hatred for Richi and compassion for Balu's sister. Finding the right opportunity, Munna pulls out Dinesha's gun and shoots down Richi who in his dying moments is unaware of Munna's motive. The irony is clearly seen now that Richi becomes a victim of his own story of the 'Cuban boy and boy from Mandwa'. Dinesha returns the favour by shooting Munna in the back, who in his dying moments finds peace in the fact that he has avenged for Balu's sister.It is now clear that Regina was investigating the triple murders (Richi/Munna/Raghu). She concludes that the story has many facets and cannot be clubbed into a single narrative and hence decides to name the story 'as seen by others'."
}