{
    "id": "3476368",
    "localized title": "Balyakalasakhi",
    "cast": [
        "Seema Biswas",
        "Prakash Chengal",
        "Gopalakrishnan",
        "Saniya Iyappan",
        "Mammootty",
        "Mammukoya",
        "Meena",
        "Meena",
        "Anaswara Ponnambath",
        "Sasikumar",
        "Pritam Shaikh",
        "Sunil Sukhada",
        "Isha Talwar",
        "Binny Tom"
    ],
    "genres": "Romance",
    "runtimes": "121",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "D-Cinema 96kHz 5.1",
        "Dolby Digital"
    ],
    "certificates": "India:U",
    "original air date": "06 Feb 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDVjMjMwYzgtNGNjZi00ODZjLWI3MDItYWUxZWY4YWIxZDg1XkEyXkFqcGdeQXVyMTEzNzg0Mjkx._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "3476368",
    "plot outline": "Balyakalasakhi is a 2014 Malayalam romantic musical drama film written and directed by debutant Pramod Payyannur based on the 1944 novel of the same name by Vaikom Muhammad Basheer. The film stars Mammootty, Isha Talwar, Meena, Seema Biswas, KPAC Lalitha and Mamukkoya in lead roles. The story revolves around childhood sweethearts Majeed (Mammootty) and Suhra (Isha Talwar). Born to rich parents, Majeed falls in love with his not-so-affluent neighbour Suhra. After her father's death, when Suhra struggles to make both ends meet, Majeed pleads with his father to sponsor her education. Refused, he wanders off to distant lands. Some of the other characters created by Basheer such as Ettukali Mammoonju and Ottakannan Pokker also appear in the film. The launch of the film edition of the novel Balyakalasakhi was done by Leela Menon who handed over the book to Fabi Basheer, wife of Vaikom Muhammed Basheer. This is the first blockbuster malayalam movie in the year 2014.",
    "languages": "Malayalam",
    "title": "Balyakalasakhi",
    "kind": "movie",
    "directors": "Pramod Payyanur",
    "writers": [
        "Vaikom Muhammad Basheer",
        "",
        "Pramod Payyanur"
    ],
    "producers": [
        "Muhsin M B",
        "Sajeeb Hashim"
    ],
    "composers": [
        "Shahbaz Aman",
        "Raghavan Master"
    ],
    "cinematographers": "Hari Nair",
    "editors": "Manoj Kannoth",
    "editorial department": "Sarath Usha Sasidharan",
    "sound department": [
        "Gijumon T. Bruce",
        "Arun Rama Varma",
        "Anoop Thilak"
    ],
    "music department": [
        "Shahbaz Aman",
        "P. Bhaskaran",
        "Bijibal",
        "Raghav Chatterjee",
        "K.S. Chithra",
        "Ustad Faiyaz Khan",
        "V.T. Murali",
        "Kavalam Narayana Panicker",
        "Pramod Payyanur",
        "Sreekumaran Thampi",
        "K.J. Yesudas",
        "Vijay Yesudas"
    ],
    "writer": [
        "Vaikom Muhammad Basheer",
        "Pramod Payyanur"
    ],
    "director": "Pramod Payyanur",
    "production companies": "Livin Art Film Factory",
    "distributors": "Red Cinema",
    "plot": [
        "Majeed, who is from a rich family, loves his neighbour Suhara, and decides to help her financially. But when his father turns down his request to sponsor her studies, he leaves home.",
        "_Balyakalasakhi_ (qv) is a 2014 Malayalam romantic musical drama film written and directed by debutant Pramod Payyannur based on the 1944 novel of the same name by Vaikom Muhammad Basheer. The film stars Mammootty, Isha Talwar, Meena, Seema Biswas, KPAC Lalitha and Mamukkoya in lead roles. The story revolves around childhood sweethearts Majeed (Mammootty) and Suhra (Isha Talwar). Born to rich parents, Majeed falls in love with his not-so-affluent neighbour Suhra. After her father's death, when Suhra struggles to make both ends meet, Majeed pleads with his father to sponsor her education. Refused, he wanders off to distant lands. Some of the other characters created by Basheer such as Ettukali Mammoonju and Ottakannan Pokker also appear in the film. The launch of the film edition of the novel _Balyakalasakhi_ (qv) was done by Leela Menon who handed over the book to Fabi Basheer, wife of Vaikom Muhammed Basheer. This is the first blockbuster malayalam movie in the year 2014.::Anonymous"
    ]
}