{
    "id": "3505060",
    "localized title": "Idhuvum Kadandhu Pogum",
    "cast": [
        "Shilpa Bhatt",
        "Shivaji Dev",
        "Berkin Johns",
        "Anjali Nair",
        "Ravi Raghavendra",
        "Anusha Varma"
    ],
    "genres": [
        "Drama",
        "Family"
    ],
    "runtimes": "54",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "14 Apr 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjk3ODk5MzY4OV5BMl5BanBnXkFtZTgwMDYxNzI2MTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3505060",
    "plot outline": "Idhuvum Kadandhu Pogum (This too shall pass) is a powerful drama about finding hope. It is a vivid, hopeful, honest portrait of a family searching for what remains possible in the most impossible of situations. Gautam and Ramya are a soon to be married happy couple whose perfect world is changed forever when Ramya is killed in a car accident. After Ramya dies, Gautam is lost. A few months after her loss, Gautam and his family are returning to their everyday existence in the wake of a shocking, sudden loss. The shifts come in abrupt, unforeseen moments. The resulting journey is an intimate glimpse into Gautam learning to re-engage his life with hope and a world that has been tilted off its axis.",
    "languages": "Tamil",
    "title": "Idhuvum Kadandhu Pogum",
    "kind": "movie",
    "directors": [
        "Anil Krish",
        "Srihari Prabaharan"
    ],
    "writers": "Srihari Prabaharan",
    "producers": [
        "Aparna Guhan",
        "Aruna Guhan",
        "Saravanan M.",
        "Guhan M.S."
    ],
    "composers": "Umashankar Kannaiyan",
    "cinematographers": "Saleem Bilal",
    "editors": "Anil Krish",
    "costume designers": "Aruna Guhan",
    "music department": [
        "Srihari Prabaharan",
        "Sathyaseelan Rajendran",
        "Manivannan Vekatasubbu"
    ],
    "akas": "Idhuvum Kadandhu Pogum (India)",
    "writer": "Srihari Prabaharan",
    "director": [
        "Anil Krish",
        "Srihari Prabaharan"
    ],
    "production companies": "AVM Productions",
    "plot": "_Idhuvum Kadandhu Pogum_ (qv) (This too shall pass) is a powerful drama about finding hope. It is a vivid, hopeful, honest portrait of a family searching for what remains possible in the most impossible of situations. Gautam and Ramya are a soon to be married happy couple whose perfect world is changed forever when Ramya is killed in a car accident. After Ramya dies, Gautam is lost. A few months after her loss, Gautam and his family are returning to their everyday existence in the wake of a shocking, sudden loss. The shifts come in abrupt, unforeseen moments. The resulting journey is an intimate glimpse into Gautam learning to re-engage his life with hope and a world that has been tilted off its axis.::Anonymous"
}