{
    "id": "3661988",
    "localized title": "7th Day",
    "cast": [
        "Prithviraj Sukumaran",
        "Anu Mohan",
        "Tovino Thomas",
        "Vinay Forrt",
        "Janani Iyer",
        "Prem Praveen",
        "Rajesh Hebbar",
        "Yog Japee",
        "Joy Mathew",
        "Shobha Mohan",
        "Lakshmi Priya",
        "Sunil Sukhada",
        "Sreedevi Unni",
        "Baiju V.K."
    ],
    "genres": [
        "Mystery",
        "Thriller"
    ],
    "runtimes": "134",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "11 Apr 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTU3NzY0ZGMtMzAzZS00YjY5LThkMDctYmZjZjFjN2VjM2U3XkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3661988",
    "plot outline": "David Abraham IPS is a 42 year old Middle aged suspended crime branch officer from Kerala Police department. Even though David Abraham is in suspension he engages himself in the investigation of a case which is not yet recorded in the crime records.",
    "languages": "Malayalam",
    "title": "7th Day",
    "kind": "movie",
    "directors": "Syamdhar",
    "writers": "Akhil Paul",
    "producers": "Shibu G. Suseelan",
    "composers": "Deepak Dev",
    "cinematographers": "Sujith Vasudev",
    "editors": "John Kutty",
    "editorial department": "Vivekanand",
    "art directors": "Banglan",
    "make up department": "Pramod Manathala",
    "assistant directors": "Anuraj Manohar",
    "sound department": "Gijumon T. Bruce",
    "visual effects": [
        "Betsy Ajesh",
        "Albin Mynatty",
        "Nikhil Raman",
        "Peruvalloor Vimesh"
    ],
    "camera department": "Lijo Joseph",
    "animation department": "Nikhil Raman",
    "music department": [
        "Rafeeq Ahammed",
        "Deepak Dev",
        "Vinayak Sasikumar",
        "Prithviraj Sukumaran",
        "Vinod Varma"
    ],
    "thanks": "Renganaath Ravee",
    "akas": "Седьмой день (Russia)",
    "writer": "Akhil Paul",
    "director": "Syamdhar",
    "distributors": [
        "August Cinema",
        "August Cinema"
    ],
    "plot": [
        "A suspended crime branch officer gets involved in the investigation of a twisted case after he suspects a group of 5 friends of weird behavior.",
        "David Abraham IPS is a 42 year old Middle aged suspended crime branch officer from Kerala Police department. Even though David Abraham is in suspension he engages himself in the investigation of a case which is not yet recorded in the crime records.::Nithin J",
        "The story starts with a monologue by David Abraham, IPS (Prithviraj) during the night of Christmas. When he leaves a party, he gets involved in an accident with Shan(Vinay Forrt) and Vinu(Anu Mohan). David takes them to the hospital to treat Vinu's injury which he sustained while falling off the bike. From the hospital Vinu escapes, to Shan's horror. David starts to suspect that there is something wrong. But Shan says there is no problem and David drops him at his place. Then he notices that Vinu has dropped his wallet in his jeep. Shan recounts the story of his friends - Eby(Tovino Thomas), Jessica aka Jessy (Janani Iyer), Cycle(Praveen Prem) and Vinu. Vinu runs an internet cafe. Cycle is the son of a gulf-returnee with a lot of financial problems. Shan is a local correspondent for a newspaper. Eby and Jessica grew up together in an orphanage, and Vinu has a special interest for Jessica and Jessica to him. One day, Vinu's internet cafe is raided by the police looking for some stuff. Since they couldn't find anything, the police returns without saying anything to Vinu. That night, Vinu's house is raided by a goon named Charlie(Yog Japee), who is commissioned by Christopher to locate a missing sum of Rs. 1.75 crores. They suspect that Vinu took the money from them and gives 36 hours to surrender the money to him. Later David receives a call from a local travel agent that someone has given him a fake note of thousand rupees to book a bus ticket to Bangalore. David catches him from the bus and it turns out it is Cycle who was trying to get out of the town. Using Cycle, David locates his other friends - Vinu and Jessica. Eby is nowhere to be seen. David asks Vinu to recount the happenings of the night of his suicide. Though at first he tells them a lie, under pressure Vinu tells David that Ebby had planned everything and stole the cash so he could kill Vinu because of his secret love for Jessica, but Jessica and Cycle were hearing all this. Jessica said she could not forgive him for trying to kill Vinu. With guilt Ebby tells them that the money is in the vehicle and commits suicide by jumping of the waterfall. Coincidentally Ebby's blood group was the same as Vinu's and they both had the same tattoo, so they decide to use Ebby's suicide to fake Vinu's death. After their confession David reveals that Ebby was a carrier for Christopher and the money in the bag was grade one counterfeit cash. David gave them the option of either leaving the money on the table so that he can report it as an abandoned bag of counterfeit money and that no one would ever disturb them about it or arrest them and take them to the court for planned murder. They chose the first option and handed the money over to David and left. When they left, however, Shan stops the car and questions the true identity of David Abraham, and the simple option given to them. They have a light-bulb realization to what was going on."
    ],
    "synopsis": "The story begins on the night of Christmas eve with a colorful spectrum of lights from a party revealing Pritviraj (David) enjoying a drink. After a while, he leaves in his jeep along the winding roads of ooty, narrating his views on crime and justice. He takes his eye off the road for a second to adjust his rearview mirror and gets into an accident with a bike in front of him, knocking them over. The two riders (Shaan and Vinu) get angry and when they notice their bike won't start, they have no choice but to take a ride in the jeep.They go to a hospital and after a small wait outside, Shaan and David are told by a nurse that Vinu has gone missing. Shaan, after hearing this goes insane for some unknown reason shouting his name all over the place, getting angry at David as well. They decide to look around, asking locals with a photo. Later in the jeep, David says he's an IPS officer which shocks Shaan and the former says everything is alright and gets off at his house and David leaves. We see David getting into his jeep from the same pub (from the introduction) and finding a wallet in which he sees Vinu's driver's license after which he leaves the area.In the next scene we see Vinu writing a suicide note and being emotional. He then jumps off the top of a waterfall and crashes below dying.\nDavid goes searching for Vinu from the address on his license. When he arrives at the house, he gets to know from the gathered crowd that he had committed suicide. He then travels back to Shaans house and tells him that he didnt believe the nonsense the former said the previous night; also showing us the house all trashed and Shaan depressed. Shaan gets the shock of his life when told about the suicide. Shaan then explains the situation where he and his friends are trying to leave the place and disappear because of a problem with stolen money of the amount of 1.75 crores.Shaan gives the flashback to before the incident. All the friends are setting up a surprise birthday party and Shaan narrates who each of them in detail, Cycle (Cyril), Eby (Ebenezer), Vinu and Jessy. Ebenezer and Jessy grew up together at the same orphanage. They then show the times the friends had and also showing that Vinu loves Jessy.The guys are drinking and talking at Vinus internet café for a while after which Shaan and Eby leave. Vinu waits in his van while Cyril cleans up and then after a delay from cyrils end, they both leave.At Vinus house, he gets a call that the police are raiding his internet café and he rushes there where he sees a bunch of them throwing things around after which they leave, finding nothing incriminating. Later in the night, back the house Vinu is watching TV when the electricity fails and he gets hit on the head by intruders, falling unconscious.He wakes up all tied up to a chair and being threatened by a gangster named Charlie who says his boss, Christy (Christopher Moriarty) lost 1.75 crores because of Vinu and leaves saying that he will pay dearly if he doesnt return it. Shaan, Vinu and Eby get together and try to figure this out and nobody has a clue about it. Cyril enters a few moments later and apologizes saying that he took the money and explains how he found it below a computer table at the internet café that night when he was cleaning up; and how he came back later that night and hid the bag of cash in an abandoned part of his Dads tea factory. Later the next morning they go back to the tea factory and find out that the bag is empty and they all get angry at cyril for all the mess. They decide to stay at a lodge and relocate their families to a safer place; Vinu and Shaan leave the guys and carry on in their van later in the night. We then see a vehicle from behind with full headlights approaching fast and they bump the back of the van causing an accident; the guys in the car being Charlie and his gang. They start fighting and after lots of punches, Vinu runs away while Shaan who gets cornered, jumps from the bridge into a stream below, both escaping.CURRENT. David starts investigating at the orphanage and finds out that Eby and Jessy were planning on getting married and left the orphanage on Christmas eve. David sees a phone number of a hospital on Vinus license and goes to investigate at the hospital with no luck; proceeding to the official hospital lab finding that Vinu came there to test some blood that was tampered with and was denied. David then investigates an illegal lab nearby and finds out that Vinu had tested many different blood samples there, and then the former takes the records and leaves. He then goes to the senior police officer (Victor from the previous raid) to talk about the case; telling him that Vinu was looking for the same blood type as his, a rare O ve and had visited the mortuary. The next day, David investigates at the mortuary and finds out from an employee that he saw another employee giving a body away for an illegal fee and confirming that Vinu was the one who took it away. The officer phones David telling him about various huge sum withdrawals from Vinus account. David then goes to the forensic examiner for Vinus body who tells him that the body was no doubt Vinus. Later in the night, David goes to the mortuary and questions the second employee and finds out the body was brought back.Next day we see David and officer victor asking him about Christmas night. Shaan says he went to lodge and the friends were not there and when he went to purchase some medicine nearby he accidentally encounters Vinu; getting angry as hell. Vinu quickly goes to a mysterious van and comes back immediately getting onto the bike; the accident happening soon after. David then tries to figure out who was in the van.The next day Victor gets a call about counterfeit money from a bus agency and finds out Cyril used it to purchase a ticket. Victor then gets on the same bus on a seat next to Cyril that takes them to straight to the friends (Eby is missing). David and Victor start questioning them.FLASHBACK. After the encounter with Charlie, a wounded Vinu rushes to lodge where he meets Cyril and Eby and tries to plan something out; Eby saying Vinu has to disappear (die) for this to go away. The next day Eby says Vinu should fake his death by getting a body from the mortuary and manipulating it. They then go looking for an old van to carry the body and then bribe the mortuary employee to get the body later on that night. After getting it, they leave for the waterfall; getting out to make a call at the phonebooth where he runs into Shaan and has to leave Cyril who secretly drives the van away while Vinu gets on the bike with Shaan. Back at the hospital is when Vinu slips out and goes to waterfall where Vinu and Eby throw the body down the waterfall while Cyril and Jessy wait at the van. David doesnt believe that one bit and asks where Eby went; and asks for the truth.Eby and Vinu are alone at the waterfall; Eby then tells him that he loves Jessy and wont forgive him for stealing her away saying he wants to kill Vinu and get her back. Eby was the one who planted the money at the café and called in the cops hoping to put him behind bars. Jessy and Cyril then come looking for these two and find out about how Eby cheated them all. Unable to handle all the pressure, Eby says the money is in the van and then jumps; and its his body that they claim to be Vinus as they both had the same tattoo. CURRENT. David tells them the currency was counterfeit and that Eby was secretly a carrier to Christy; tells them to leave the money behind and leave, saying he would file an FIR about an unclaimed baggage.The friends leave and a few moments later Shaan shouts to stop the car asking who exactly David is; and if he really was the IPS he claimed to be.THE CLIMAX\nCharlie counts the money and says Happy New Year Christopher and the frame pans to a cigar being smoked by none other than Pritviraj (Christopher), the fake IPS officer who fooled everyone.-By jacobspeeds"
}