{
    "id": "3885736",
    "localized title": "Munnariyippu",
    "cast": [
        "Mammootty",
        "Aparna Gopinath",
        "Saiju Kurup",
        "Joy Mathew",
        "Minon",
        "Renji Panicker",
        "Prathap Pothen",
        "Kochu Preman",
        "V.K. Sriraman",
        "Sudheesh",
        "Prithviraj Sukumaran",
        "Nedumudi Venu"
    ],
    "genres": [
        "Drama",
        "Thriller"
    ],
    "runtimes": "112",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Ireland:12A",
        "Singapore:PG"
    ],
    "original air date": "22 Aug 2014 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjQ2YzNiM2EtMmU0NS00Y2ZlLWE0OWEtYzhmMDg3NmI4YWY1XkEyXkFqcGdeQXVyMjQwMDg0Ng@@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "3885736",
    "plot outline": "Raghavan (Mammootty) is a simple man who loves to lead a simple and lonely life. He is out from jail after serving imprisonment. At this juncture Anjali Arackal (Aparna Gopinath) enters into his life. Anjali is a junior journalist who wants to prove her mettle in her professional life. As part of her profession she enters the life of Raghavan. This brings changes in her personal life too.",
    "languages": "Malayalam",
    "title": "Munnariyippu",
    "kind": "movie",
    "directors": "Venu Isc",
    "writers": [
        "Venu Isc",
        "",
        "Unni R."
    ],
    "producers": "Ranjith",
    "composers": "Bijibal",
    "cinematographers": "Venu Isc",
    "editors": [
        "Beena Paul",
        "Rathin Radhakrishnan"
    ],
    "art directors": "Jotish Shankar",
    "make up department": "Pramod Manathala",
    "sound department": [
        "Vipin V Nair",
        "Anish P. Tom",
        "Vajjiravel Varun"
    ],
    "camera department": "Collins Jose",
    "akas": [
        "Warning (World-wide, English title)",
        "Дедлайн (Russia)"
    ],
    "writer": [
        "Venu Isc",
        "Unni R."
    ],
    "director": "Venu Isc",
    "production companies": "Gold Coin Motion Pictures",
    "other companies": "Icedtea Entertainment",
    "plot": [
        "Anjali, a freelance journalist meets C.K. Raghavan, an interesting inmate who's outstaying his sentence in jail for a crime he says he didn't commit. His vastly different views peak her interest and she documents his life and happenings.",
        "Raghavan (Mammootty) is a simple man who loves to lead a simple and lonely life. He is out from jail after serving imprisonment. At this juncture Anjali Arackal (Aparna Gopinath) enters into his life. Anjali is a junior journalist who wants to prove her mettle in her professional life. As part of her profession she enters the life of Raghavan. This brings changes in her personal life too.::Kan_luk",
        "The film highlights the story of Raghavan, an ex-convict who is redeeming his life after his release from prison. He stumbles upon Anjali, a journalist who decides to write an autobiography on his life. The story picks up pace as Raghavan discloses the story behind his imprisonment.::Kan_luk",
        "Anjali Arakkal, a struggling young freelance writer, gets captivated by Raghavan, a mysterious convict with a fascinating mind. When she gets him released in the hopes of authoring a book on his life though, things don't go as she planned. Ambition grapples with human nature in the tale that unfolds.::Harikrishnan J",
        "Anjali Arakkal (Aparna Gopinath), a freelance journalist, while interacting with a retiring jail superintendent named Rama Moorthy (Nedumudi Venu) for ghostwriting his autobiography, meets C. K. Raghavan (Mammootty), a prisoner committed for double homicide serving 20 years even after his official term in jail. His preference and oddball comfortability piques Anjali's interest in Raghavan. Raghavan was tried for killing his wife (Ramani) and the daughter of his employer (Pooja Patel), yet he claims of his innocence every now and then. With Moorthy's information the young journalist comes to know Raghavan writes. She gets access to his writings in which Raghavan interprets world around him in his own way. Sentences like \"Does the reflected image in a mirror looks back at him or does it accepts him and comes along with him\"; \"A Prison should be a place for people to understand their mistakes and correct them rather than a place for punishment\"; \"Life as a struggle before death\". All this makes her attracted to the mystery Raghavan has built. Further Raghavan's outlook on freedom and responsibility with his own brand of philosophy impresses Anjali and she decides to write a feature about him. The featured article gains much attention and proposals come for publishing Raghavan's Biography with his philosophies. Anjali decides use this opportunity to make a name for herself with cooperation from Raghavan's side. Raghavan is much happy about the newly gained attention he is receiving. Anjali decides to visit Raghavan in jail and process release for him from jail. After release she finds accommodation for him and compels him to write-up events and interpretation of them for making it a book. Though Raghavan hesitates. Later while Raghavan lollygagging he meets up with his aspirants and they invite him for a drink. Under influence there he reveals his ideology about Freedom as \"Removing elements that obstructs the person is known as freedom. If it happens in home, it is called as domestic abuse. If it happens in society it is revolution. Irrespective of where it happens where there is revolution, blood will spill\". Anjali reaches the limit with Raghavan's lollygagging and reacts badly in presence of her colleague Mohan. Mohan advices Anjali to not pressurize a person who was reluctant to come out from Jail. Anjali faces problem when the deadline to submit the material for the Book is nearing and Raghavan has not even started writing, above that there are other journalists who try to get full picture of Raghavan's Story. She decides its best to move Raghavan to an undisclosed place. Anjali is pressurized by the publishers. The new accommodation and lack of facilities irks Raghavan. Anjali's marriage seems almost fixed with a Chackochan (Prithviraj) and she decides to leave the book publishing project and settle the deal in court. Anjali meets with Raghavan and gives his diary and money received from jail for his rehabilitation and lashes out at him. Raghavan smirks at her. Raghavan gives her the full script of the story. Skipping through it she comes in grip with the reality of Raghavan's true nature. Fear creeps under her skin. Raghavan murders her with one blow to the head. Finally, Raghavan is shown peacefully sleeping at Jail. Photo of Anjali along with his other victims is seen pasted near to Jail Wall as trophies of his victory to his own psychotic idealization of freedom."
    ]
}