{
    "id": "0040522",
    "localized title": "Ladri Di Biciclette",
    "original title": "Ladri di biciclette",
    "cast": [
        "Lamberto Maggiorani",
        "Enzo Staiola",
        "Lianella Carell",
        "Elena Altieri",
        "Gino Saltamerenda",
        "Giulio Chiari",
        "Vittorio Antonucci",
        "Michele Sakara",
        "Fausto Guerzoni",
        "Emma Druetti",
        "Carlo Jachino",
        "Giulio Battiferri",
        "Ida Bracci Dorati",
        "Nando Bruno",
        "Eolo Capritti",
        "Memmo Carotenuto",
        "Giovanni Corporale",
        "Piero Heliczer",
        "Sergio Leone",
        "Mario Meniconi",
        "Massimo Randisi",
        "Checco Rissone",
        "Peppino Spadaro",
        "Umberto Spadaro"
    ],
    "genres": "Drama",
    "runtimes": "89",
    "countries": "Italy",
    "country codes": "it",
    "language codes": [
        "it",
        "en",
        "de"
    ],
    "color info": "Black and White",
    "aspect ratio": "1.37 : 1",
    "sound mix": "Mono",
    "certificates": [
        "Argentina:Atp",
        "Australia:G",
        "Brazil:10::(video rating)",
        "Finland:S",
        "France:Tous publics",
        "Italy:T",
        "Japan:G",
        "Netherlands:6",
        "Norway:16",
        "Norway:A::(recommended rating)",
        "Portugal:M/6",
        "Singapore:PG",
        "South Korea:12",
        "Spain:A",
        "Sweden:Btl",
        "United Kingdom:U",
        "United States:Not Rated",
        "United States:Passed::(National Board of Review)",
        "West Germany:12::(f)"
    ],
    "original air date": "24 Nov 1948 (Italy)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNmI1ODdjODctMDlmMC00ZWViLWI5MzYtYzRhNDdjYmM3MzFjXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0040522",
    "plot outline": "Antonio Ricci, an unemployed man in the depressed post-WWII economy of Italy, finally gets a job hanging up posters, but he needs a bicycle. But when his bicycle is stolen,, he and son walk the streets of Rome looking for it. Antonio finally manages to locate the thief, but with no proof he must abandon his cause. But he and his son know perfectly well that without a bike, Antonio won't be able to keep his job.",
    "languages": [
        "Italian",
        "English",
        "German"
    ],
    "title": "Bicycle Thieves",
    "kind": "movie",
    "directors": "Vittorio De Sica",
    "writers": [
        "Cesare Zavattini",
        "",
        "Luigi Bartolini",
        "",
        "Oreste Biancoli",
        "Suso Cecchi D'Amico",
        "Vittorio De Sica",
        "Adolfo Franci",
        "Gherardo Gherardi",
        "Gerardo Guerrieri",
        "Cesare Zavattini"
    ],
    "producers": [
        "Giuseppe Amato",
        "Vittorio De Sica"
    ],
    "composers": "Alessandro Cicognini",
    "cinematographers": "Carlo Montuori",
    "editors": "Eraldo Da Roma",
    "production designers": "Antonio Traverso",
    "production managers": [
        "Nino Misiano",
        "Umberto Scarpelli"
    ],
    "assistant directors": [
        "Luisa Alessandri",
        "Gerardo Guerrieri",
        "Sergio Leone"
    ],
    "sound department": [
        "Gilles Barberis",
        "Alessandro Biancani",
        "Biagio Fiorelli",
        "Pierluigi Scarpantonio",
        "Bruno Brunacci"
    ],
    "camera department": [
        "Mario Montuori",
        "Carlo Di Palma"
    ],
    "music department": "Willy Ferrero",
    "miscellaneous": [
        "Roberto Moretti",
        "Charles Clement",
        "Aldo Fabrizi",
        "Alberto Sordi"
    ],
    "akas": [
        "The Bicycle Thieves (World-wide, English title)",
        "Bicycle Thieves (Canada, English title)",
        "Bicycle Thief (World-wide, English title)",
        "The Bicycle Thief (United States)",
        "Bicycle Thieves (World-wide, English title)"
    ],
    "writer": [
        "Cesare Zavattini",
        "Luigi Bartolini",
        "Oreste Biancoli"
    ],
    "director": "Vittorio De Sica",
    "production companies": [
        "Produzioni De Sica",
        "Produzioni De Sica"
    ],
    "distributors": [
        "Ente Nazionale Industrie Cinematografiche (ENIC)",
        "Compass Film",
        "Arthur Mayer & Joseph Burstyn",
        "Pathé Consortium Cinéma",
        "Rosenbergs Filmbyrå",
        "RKO Radio Pictures",
        "Merco Pictures",
        "Ente Nazionale Industrie Cinematografiche (ENIC)",
        "Kelo Filmi",
        "Yleisradio (YLE)",
        "Filmes Castello Lopes",
        "Image Entertainment",
        "Image Entertainment",
        "Continental Home Vídeo",
        "Multimedia San Paolo S.r.l.",
        "Vídeo Mercury Films",
        "DVD Magic",
        "Umbrella Entertainment",
        "Emerald",
        "Versátil Home Vídeo",
        "The Criterion Collection",
        "Park Circus",
        "Alive Vertrieb und Marketing",
        "Another World Entertainment",
        "Future Film",
        "Homescreen",
        "Studio S Entertainment",
        "Corinth Films",
        "Umbrella Entertainment",
        "Umbrella Entertainment",
        "New Star",
        "Divisa Home Video",
        "Panocéanic Films",
        "Canale 5",
        "Iris",
        "The Criterion Collection",
        "Pidax Film",
        "Pidax Film",
        "The Criterion Channel",
        "HBO Max",
        "Asociace Ceských Filmových Klubu (ACFK)",
        "Progress Film-Vertrieb",
        "Continental Home Vídeo",
        "Epoca",
        "Films sans Frontières",
        "Home Cinema Group",
        "Leopardo Filmes",
        "Vídeo Mercury Films"
    ],
    "other companies": "Gevaert",
    "plot": [
        "In post-war Italy, a working-class man's bicycle is stolen, endangering his efforts to find work. He and his son set out to find it.",
        "Antonio Ricci, an unemployed man in the depressed post-WWII economy of Italy, finally gets a job hanging up posters, but he needs a bicycle. But when his bicycle is stolen,, he and son walk the streets of Rome looking for it. Antonio finally manages to locate the thief, but with no proof he must abandon his cause. But he and his son know perfectly well that without a bike, Antonio won't be able to keep his job.::jolusoma",
        "The unemployment rate is high in postwar Italy. After two jobless years, Antonio Ricci is finally offered a job as a poster-hanger. There is one condition: he must have his own bicycle. At the moment his bicycle is at the pawnshop, but Antonio's wife Maria says they can pawn their six sheets instead. The first day at work Antonio's bicycle is stolen. A friend offers to help him search for it the next morning at Piazza Vittorio, where street vendors sell stolen bikes. The search is unsuccessful, but Antonio and his son Bruno continue to the market at Porta Portese, where Antonio happens to see the thief talking to an elderly man. As he cannot catch the thief, he instead pursues the old man, who goes into a church and disappears during the Mass. The third time Antonio happens to see the thief, he succeeds to pursue him to his dwelling-place. A local policeman believes Antonio's story about the theft, but as he cannot find the stolen bike in the apartment, the case is dismissed. Driven into utter despair Antonio and Bruno walk back home--back to unemployment.::Maths Jesperson {maths.jesperson1@comhem.se}",
        "During the hard years of poverty in post-World-War-II Rome, poor working-class family man Antonio is finally offered a modest bill-posting job, but a bicycle is required and he's already been forced to pawn his. His wife Maria promptly pawns the family's bed-linens to redeem their bicycle, but on Antonio's first day of work, the prized possession is stolen. Desperate, the ill-fated father and his older son Bruno will scour Rome's bustling streets on a gloomy Sunday to find the vital bicycle, but undoubtedly this is an impossible task. Will Antonio ever get his job back?::Nick Riganas",
        "Antonio Ricci is only one of several men who regularly stand outside his local municipal employment office in Rome every morning hoping that work, doled out on a qualification basis, is available. This morning he is told that he has a job starting the next day: hanging posters around the city. A bicycle is a requirement for the job, and he tells a white lie that he owns one. He did own one, but he pawned it to put food on the table for himself, his wife Maria, and their two young children. At some sacrifice, he and Maria sell some of their possessions so that Antonio can get his bicycle out of hock; they believe it's worth the sacrifice, as the return in employment salary and overtime far excesses the initial capital outlay in getting the bicycle back. On Antonio's first working day, his bicycle is stolen as he is on his ladder hanging a poster. When the police tell him that they can only keep the bicycle's serial number on file in case it does show up, Antonio, with his friends and his older son, adolescent Bruno, by his side, go on what seems like a futile mission to locate the bicycle, which could now be anywhere in Rome. But Antonio views the bicycle as his and his family's means of survival, so he jumps on any clue to locate the bicycle and/or the thief--whom he actually saw--and perhaps take desperate measures in these desperate times.::Huggo",
        "In post-war Rome, Antonio is offered a job of putting posters up in the city but that job requires a bicycle. Antonio hails from a poverty stricken class n he cannot afford to miss this job as unemployment is very high. Trouble is he had already pawned the bicycle to put food on the table for his family. His resourceful wife sells the bed linens in order to get the money to get his bicycle back.::Fella_shibby@yahoo.com"
    ],
    "synopsis": "The film tells the story of Antonio Ricci, an unemployed man in the depressed post-World War II economy of Italy. With no money and a wife and two children to support, he is desperate for work. He is delighted to at last get a good job hanging up posters, but on the sole condition that he has a bicycle which must be used for work. He is told unequivocally: \"No bicycle, no job.\" His wife Maria pawns their bedsheets in order to get money to redeem his bicycle from the pawnbroker.Early on in the film, Ricci's coveted bicycle is stolen by a bold young thief who snatches it when he is hanging up a poster.Antonio thinks that the police will take the theft very seriously, but they are not really interested in the petty theft of a bike. The only option is for Antonio and his friends to walk the streets of Rome themselves, looking for the bicycle. After trying for hours with no luck, they finally give up and leave.Desperate for leads and with his better judgement clouded, Antonio even visits the dubious backstreet fortune teller that he had earlier mocked, in the hope that she may be able to shed light upon the bike's whereabouts. However, she merely doles out to him one of the truisms that form her stock in trade: \"you'll find the bike quickly, or not at all.\" Feeling cheated, a crestfallen Antonio hands over to her some of the last money that they have. After a rare treat of a meal in a restaurant, Antonio admits to his son that if he isn't able to work, they will simply starve.Antonio finally manages to locate the thief (who, it seems, had already sold the bicycle) and Bruno slips off to summon the police to the apartment. Antonio meanwhile, angrily accuses the thief of stealing his bike but the boy denies all knowledge of the crime. When the policeman arrives, he sees the accused boy lying on the floor feigning a seizure and surrounded by irate neighbours who blame Antonio's accusations for causing the \"innocent\" boy's fit.The policeman tells Antonio that although he may have seen the boy stealing the bike, he did not catch the thief red-handed, nor has he any witnesses and that Antonio making an accusation is not good enough. With no proof and with the thief's neighbours willing to give him a false alibi, he abandons his cause. Antonio walks away from the house in despair, as the thief's neighbours follow, jeering at him about his lost bicycle.At the end of the film in one of the most resonant scenes, Antonio is sitting on the curb outside the packed football stadium. He looks at the hundreds and hundreds of bicycles that are parked outside the stadium and as he cradles his head in despair, a fleet of bicycles mockingly speeds past him.After vacillating for some time about whether to steal one for himself, he decides he has no other option but to snatch one that he spots outside an apartment. Unluckily, he is seen taking the bike and caught by a crowd of angry men who slap and humiliate him in front of his son. Ironically, this time with an army of witnesses who catch him, he is frogmarched off to the police station but after seeing how upset Bruno is, the owner of the bicycle declines to press charges.The film ends with the man and his son, sad and let down from what has just happened, they walk along in a crowd, leaving us with a dim outlook for the two. Holding hands, they are both reduced to tears."
}