{
    "id": "0092906",
    "localized title": "Dolls",
    "cast": [
        "Ian Patrick Williams",
        "Carolyn Purdy-Gordon",
        "Carrie Lorraine",
        "Guy Rolfe",
        "Hilary Mason",
        "Bunty Bailey",
        "Cassie Stuart",
        "Stephen Lee"
    ],
    "genres": "Horror",
    "runtimes": "77",
    "countries": [
        "United States",
        "Italy"
    ],
    "country codes": [
        "us",
        "it"
    ],
    "language codes": "en",
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Ultra Stereo",
    "certificates": [
        "Australia:M",
        "Brazil:18",
        "Canada:14A",
        "Canada:14A::(Canadian Home Video rating)",
        "Canada:14A::(Canadian Home Video)",
        "Canada:13+::(Quebec)",
        "Finland:K-18",
        "France:Tous publics",
        "Germany:18",
        "Germany:16",
        "Italy:VM14",
        "New Zealand:M",
        "Norway:15::(recommended rating)",
        "Norway:18::(video rating)",
        "South Korea:18::(video rating)",
        "Spain:13",
        "United Kingdom:18",
        "United States:R"
    ],
    "original air date": "12 Mar 1987 (Italy)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTA4YWZiMDMtZTYzYi00N2EzLTk0NDctZGE1YWZjNjM1N2I1XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0092906",
    "plot outline": "Five adults and a child (two parties traveling separately) are stranded in a storm and spend the night in the mansion of an elderly couple who are dollmakers. However, the travelers' young daughter realizes the dolls the couple makes were once wicked humans whom the couple has miniaturized and turned into dolls.",
    "languages": "English",
    "title": "Dolls",
    "kind": "movie",
    "directors": "Stuart Gordon",
    "writers": "Ed Naha",
    "producers": [
        "Charles Band",
        "Bruce Cohn Curtis",
        "Debra Dion",
        "Michael Wolf",
        "Brian Yuzna"
    ],
    "composers": "Fuzzbee Morse",
    "cinematographers": "Mac Ahlberg",
    "editors": "Lee Percy",
    "editorial department": "Juliet Avola",
    "casting directors": "Anthony Barnao",
    "production designers": "Giovanni Natalucci",
    "set decorators": [
        "Becky Block",
        "Mariangela Capuano"
    ],
    "costume designers": "Angee Beckett",
    "make up department": [
        "John Carl Buechler",
        "Gilda De Guilmi",
        "Giancarlo Del Brocco",
        "Sabrina Farina",
        "William Forsche",
        "Rita Innocenzi",
        "Roberto Innocenzi",
        "Alessandra Molinari",
        "Alfredo Tiberi",
        "John Vulich"
    ],
    "production managers": [
        "Richard Band",
        "Roberto Bessi",
        "Dennis Stuart Murphy",
        "Gina Pietralunga",
        "Stefano Spadoni"
    ],
    "assistant directors": [
        "Judy Monti",
        "Marco Valerio Pugini",
        "Mauro Sacripanti",
        "Liz Wartenberg"
    ],
    "art department": [
        "Neal Adams",
        "Elio Altamura",
        "Alvaro Belsole",
        "Nicola Bucci",
        "Mariangela Capuano",
        "Lucio Di Domenico",
        "Ivano Gatti",
        "Ferdinando Giovannoni",
        "Nancy Nimoy",
        "Luciano Rossiello",
        "Claudia Sebastiani"
    ],
    "sound department": [
        "Mario Bramonti",
        "G.W. Brown",
        "Jim McKee",
        "Giuseppe Muratori"
    ],
    "special effects": [
        "David Allen",
        "Gabriel Bartalos",
        "John K. Brunner",
        "Vivian Brunner",
        "John Carl Buechler",
        "Giancarlo Del Brocco",
        "Mitch Devane",
        "William Forsche",
        "Helen Kinsey",
        "Ralph Miller III",
        "Bryan Moore",
        "John Vulich"
    ],
    "visual effects": "David Allen",
    "stunts": "Arnaldo Dell'Acqua",
    "camera department": [
        "Alberto Altibrandi",
        "Alfonso Avincola",
        "Elio Bosi",
        "David Boyd",
        "Bruno Brenna",
        "Domenico Caponecchi",
        "Roberto Diamanti",
        "Giovanni Mozzillo",
        "Fabrizio Papale",
        "Italo Pastorino",
        "Mauro Postorino"
    ],
    "casting department": [
        "Beth Charkham",
        "Estelle Rodkoff"
    ],
    "costume departmen": [
        "Fabrizio Caracciolo",
        "Barbara Dales",
        "Darragh Marmorstein",
        "Adalgisa Mosca"
    ],
    "music department": [
        "Richard Band",
        "Andy Newell",
        "Gerry Sackman",
        "Victor Spiegel"
    ],
    "script department": "Serena Canevari",
    "miscellaneous": [
        "Andrea Borella",
        "John K. Brunner",
        "Bennah Burton-Burtt",
        "Massimo Ciprari",
        "Robert Dawson",
        "Patricia Dubose",
        "Maria Federici",
        "Jeff Harrison",
        "Federica Jacoponi",
        "Michael Muscal",
        "Renata Paccariè",
        "Hope Perello",
        "Giancarlo J. Sini",
        "Debra Spidell",
        "Joe Zola",
        "Carolyn Purdy-Gordon"
    ],
    "thanks": [
        "Bruno Bettelheim",
        "The Brothers Grimm"
    ],
    "akas": [
        "The Dolls (United States)",
        "The Doll (United States)",
        "Dolls - Bambole (Italy)",
        "Ghost... Dolls! (Thailand, English title)",
        "Dolls - Les Poupées (France)"
    ],
    "writer": "Ed Naha",
    "director": "Stuart Gordon",
    "production companies": [
        "Empire Pictures",
        "Taryn Productions Inc."
    ],
    "distributors": [
        "Empire Pictures",
        "101 Films",
        "101 Films",
        "Avid Home Entertainment",
        "Cinema International Media",
        "Concorde Video",
        "EuroCine Films",
        "Koch Films",
        "Koch Films",
        "Koch Media",
        "Koch Media",
        "MGM Home Entertainment",
        "Pulp Video",
        "Scream Factory",
        "Sidonis",
        "Sony Pictures Home Entertainment",
        "The Sci-Fi Channel",
        "Umbrella Entertainment",
        "Umbrella Entertainment",
        "Vestron Television",
        "Vestron Video International",
        "Vestron Video International",
        "Vestron Video International",
        "Vestron Video International",
        "Vestron Video International",
        "Vestron Video"
    ],
    "special effects companies": [
        "David Allen Productions",
        "Mechanical and Makeup Imageries"
    ],
    "plot": [
        "A dysfunctional family of three stop by a mansion during a storm -- father, stepmother, and child. The child discovers that the elderly owners are magical toy makers and have a haunted collection of dolls.",
        "Five adults and a child (two parties traveling separately) are stranded in a storm and spend the night in the mansion of an elderly couple who are dollmakers. However, the travelers' young daughter realizes the dolls the couple makes were once wicked humans whom the couple has miniaturized and turned into dolls.::Anonymous (updated by R.M. Sieger)",
        "While driving in a stormy night, Rosemary Bower (with her husband David Bower, and his seven year-old daughter, Judy) gets her car stuck in the mud in the middle of nowhere. The family is traveling on vacation and Judy, who lives in Boston with her mother, daydreams, irritating her stepmother. (The two intensely dislike each other, and Judy's father never seems to take his daughter's side or to defend her from his second wife.) Unable to get a response at the front door, they manage to enter an old house through a side door. The elderly couple, toy makers Gabriel and Hilary Hartwicke, initially ostensibly armed with a gun and wary, decide to welcome the guests. While dining, three more people -- Ralph Morris, a driver with two troublesome female hitchhikers (Isabel and Enid) -- also come to the house, stranded by the storm. Gabriel and Hilary likewise invite them to spend the night. Isabel decides to steal from the couple. Judy sees Leprechauns taking her to the attic. She tries to tell to her father but he doesn't believe her. Ralph, who has the heart of a kid, is the only adult that gives attention to the little girl. The toys get rid off the evil folks and only those of pure heart get to survive and leave the mansion.::Claudio Carvalho, Rio de Janeiro, Brazil (updated by R.M. Sieger)"
    ],
    "synopsis": "Jody Bower (Carrie Lorraine) is an imaginative child on holiday with her annoying father, called David Bower (Ian Patrick Williams), a man only worried about the money of his second wife and Jody's stepmother, Rosemary (Carolyn Purdy-Gordon), a wealthy lady who finds Jody annoying. This lady is so mean that she throws Jody's teddy bear into the bushes - Jody imagines her teddy to become a huge real teddy who kills both her father and stepmother. Their car gets stuck close to a countryside house. Nobody answers when they knock the main door, but a storm breaks out, it's dark, they're lost, tired and cold, so they enter the place through a broken door.When the elderly owners of the house, Gabriel Hartwicke (Guy Rolfe) and Hilary Hartwicke (Hilary Mason), startle them. They are kind, they look like an old-fashioned marriage and they prepare dinner.There are three more people who appear that night at the mansion: two hitchhikers, Enid (Cassie Stuart) and Isabel Prange (Bunty Bailey), who are a kind of punk best friends - Isabel has the look of Madonna in her  Who's That Girl? phase - and the childish man who pick them up, a kind young man called Ralph Morris (Stephen Lee). The Hardwickes say that they used to be toy makers. After dinner, they distribute everybody in different bedrooms. Isabel and Enid play loud music in their room, but Ralph is sent to another different room, and Jody is sent to her own room. Hilary gives Jody Mr Punch, a puppet-looking doll. There are weird dolls in every room. Isabel wants to steal the antiquities at the mansion, because Gabriel and Hilary they were old. Isabel is attacked, and bleeds after being pushed against the walls. We never see who the killer is.Jody sees the bloodied body. She tells her parents, but they don't pay any attention to her. She tells Ralph, who dismisses her, until he notices Jody's blood-stained slippers. He goes with Jody to check on Isabel. They don't find the body at first, but when they try to tell Enid, she panics. She blames Ralph, the same as Rosemary and David. David especially accuses Ralph of being a pedophile. Ralph and Jody ran away in separate ways. Rosemary is the next one to be attacked by the dolls. She is killed while she's in bed by tens of dolls who jump onto it and cut her in many places. When David comes back to their room, he tries to get intimate with her. He panics when he realises that he's dead and all bloodied. He blames Ralph. In fact, next opportunity he has, he tries to kill Ralph. All this doesn't mean that David believes Jody or even cares for her - they will punish her if she continues to misbehave. By then, Ralph has realised that the dolls may be the ones killing people. He has even heard Mr Punch speak to him directly. Although he panics at the beginning and he's attacked by the dolls, they accept that he's still a child at heart, so they won't hurt him. As soon as he realises that the dolls won't hurt Jody, he stops destroying the dolls. Meanwhile, Enid is attacked by the alive dolls. She manages to burn many of them, but they are too many, attacking from all directions at once, so she is eventually killed as well. Ralph has become such a friend of the dolls, that he won't use one to defend himself when David attacks him in a rage. David tries to fight him in spite of Jody's cries trying to stop him. Finally, Gabriel and Hilary appear. David says that Hilary is a witch, which Gabriel admits. They say that every visitor to their home is given the opportunity to be friendly to the dolls. If they are kind to the dolls, they won't be hurt at all; but visitors will be killed if they are nasty people. Hilary transforms David into another Mr-Punch-like doll. The Hardwickes tell Ralph and Jody that they are free to go. Jody gives Jody her teddy bear, but Jody decides that it should be left behind, as it would be happier at the Hardwickes', until she and Ralph come back for the following summer holidays. Ralph leaves in his now-running car. From now on, he'll be the one taking care of Jody, as her biological mother doesn't care about her either. Ralph cannot be more eager to leave. As Ralph and Jody leave, some new people have their car stuck in mud. The man who leaves the car to try to solve the situation looks as snobbish and rude as David used to be.-- written by KrystelClaire"
}