{
    "id": "0116630",
    "localized title": "Indian",
    "cast": [
        "Kamal Haasan",
        "Sukanya",
        "Manisha Koirala",
        "Urmila Matondkar",
        "Nedumudi Venu",
        "Goundamani",
        "Kasthuri",
        "Aruna Irani",
        "Crazy Mohan",
        "Aachi Manorama",
        "Senthil",
        "Ajay Ratnam",
        "Nizhalgal Ravi",
        "Bala Singh",
        "Johny Lever",
        "Sudha"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "185",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "DTS",
    "certificates": [
        "India:UA",
        "New Zealand:M",
        "United Kingdom:12",
        "United Kingdom:12",
        "United Kingdom:12::(DVD)",
        "United Kingdom:PG::(theatrical)",
        "United States:Not Rated"
    ],
    "original air date": "09 May 1996 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2QxMzQyNzQtZGQzMS00MWViLWJiYjgtNTJmMWViOWM3OTc4XkEyXkFqcGdeQXVyODEzOTQwNTY@._V1_SY150_CR3,0,101,150_.jpg",
    "imdbID": "0116630",
    "plot outline": "Circa the British rule in India, a man named Senapathy decides to rebel against the British in a violent way, learns a rare martial art that enables him to kill with his bare hands, and travels to Singapore, joins the Indian Liberation Army formed by renowned Subhash Chandra Bose, is one of the soldier's to engage the British into war. He subsequently joins a death squad in order to destroy British tanks. While all of the others succeed in carrying out their mission, Senapathy is captured, jailed, beaten, and mercilessly tortured by the British. Upon his release, he is looked after by a woman named Namrata, whose honor he had saved from the British - who had captured two truckloads of women protesters, burned their clothing, and forced them to commit suicide. Namrata and Senapathy marry, India gains independence, and they soon have two children - Chandrabose and Kasthoori. Years later Chandra quarrels with his honest and straight-laced father, leaves home, so that he can earn enough money to bribe the transport secretary to get him a job as a Transport Officer. Tragedy strikes the family when Kasthoori is grievously hurt in a house-fire. They get her to the nearest hospital - but the doctor wants them to file a police report or pay him Rs.500/-; At the police station - the Inspector wants Rs.250/- or a report from the Village Administration Officer; who in turn wants Rs.150/- so that he can start preparations for the report. This delay results in Kasthoori's death - and a vengeful Senapathy decides to teach corrupt officials a lesson - a lesson that will serve to remind other corrupt officials to do their work diligently without accepting any bribes. What Senapathy does not know is that his very son Chandra is now part of this system - and he must now make up his mind to make an exception or carry on his gruesome task - knowing fully well that the Central Bureau of Investigation is hot on his tail.",
    "languages": "Tamil",
    "title": "Indian",
    "kind": "movie",
    "directors": "S. Shankar",
    "writers": [
        "S. Shankar",
        "",
        "S. Shankar",
        "",
        "Umesh Sharma",
        "",
        "Sujatha"
    ],
    "producers": [
        "A.M. Rathnam",
        "Jhamu Sughand"
    ],
    "composers": "A.R. Rahman",
    "cinematographers": "Jeeva",
    "editors": [
        "B. Lenin",
        "V.T. Vijayan"
    ],
    "art directors": "Thotta Tharani",
    "costume designers": "Reza Shariffi",
    "make up department": [
        "Michael R. Jones",
        "Ramesh Mohanty",
        "Anil Pemgirikar"
    ],
    "assistant directors": [
        "Hosimin",
        "R. Madhesh"
    ],
    "sound department": [
        "Ajith Abraham George",
        "A.S. Laxmi Narayanan"
    ],
    "special effects": "S.T. Venky",
    "stunts": [
        "Vikram Dharma",
        "Aasan Rajendran"
    ],
    "camera department": "Arjun Jena",
    "music department": [
        "S.P. Balasubrahmanyam",
        "K.S. Chithra",
        "Hariharan",
        "Harini",
        "Sujatha",
        "P. Susheela",
        "Swarnalatha",
        "Vaali",
        "Vairamuthu",
        "K.J. Yesudas"
    ],
    "miscellaneous": [
        "Rahul Nath",
        "Vishal Tyagi"
    ],
    "akas": [
        "Hindustani (India, Hindi title)",
        "Bharateeyudu (India, Telugu title)",
        "Индиец (Russia)",
        "Indiai (Hungary)"
    ],
    "writer": [
        "S. Shankar",
        "S. Shankar",
        "Umesh Sharma"
    ],
    "director": "S. Shankar",
    "production companies": [
        "Jhamu Sughand Productions",
        "Sri Surya Movies"
    ],
    "distributors": [
        "Spark Entertainment",
        "Sri Surya Movies",
        "Amazon Prime Video",
        "Shemaroo Video Pvt. Ltd.",
        "Spark Worldwide"
    ],
    "special effects companies": [
        "Crest",
        "Indian Artists Computer Graphics"
    ],
    "other companies": [
        "AP International",
        "Pyramid Saimira",
        "T-Series",
        "Tips Cassettes & Records Co."
    ],
    "plot": [
        "A veteran freedom fighter enraged with the rising crime and corruption in the society murders all the wrong doers one by one using an ancient martial arts technique.",
        "Circa the British rule in India, a man named Senapathy decides to rebel against the British in a violent way, learns a rare martial art that enables him to kill with his bare hands, and travels to Singapore, joins the _Indian_ (qv) Liberation Army formed by renowned Subhash Chandra Bose, is one of the soldier's to engage the British into war. He subsequently joins a death squad in order to destroy British tanks. While all of the others succeed in carrying out their mission, Senapathy is captured, jailed, beaten, and mercilessly tortured by the British. Upon his release, he is looked after by a woman named Namrata, whose honor he had saved from the British - who had captured two truckloads of women protesters, burned their clothing, and forced them to commit suicide. Namrata and Senapathy marry, India gains independence, and they soon have two children - Chandrabose and Kasthoori. Years later Chandra quarrels with his honest and straight-laced father, leaves home, so that he can earn enough money to bribe the transport secretary to get him a job as a Transport Officer. Tragedy strikes the family when Kasthoori is grievously hurt in a house-fire. They get her to the nearest hospital - but the doctor wants them to file a police report or pay him Rs.500/-; At the police station - the Inspector wants Rs.250/- or a report from the Village Administration Officer; who in turn wants Rs.150/- so that he can start preparations for the report. This delay results in Kasthoori's death - and a vengeful Senapathy decides to teach corrupt officials a lesson - a lesson that will serve to remind other corrupt officials to do their work diligently without accepting any bribes. What Senapathy does not know is that his very son Chandra is now part of this system - and he must now make up his mind to make an exception or carry on his gruesome task - knowing fully well that the Central Bureau of Investigation is hot on his tail.::rAjOo (gunwanti@hotmail.com)"
    ]
}