{
    "id": "0250803",
    "localized title": "Veerapandiya Kattabomman",
    "cast": [
        "Shivaji Ganesan",
        "Gemini Ganesan",
        "Padmini",
        "Varalakshmi S.",
        "Ragini",
        "V.K. Ramasamy",
        "Javar Seetharaman",
        "O.A.K. Thevar",
        "M.R. Santhanam",
        "Kuladeivam V.R. Rajagopal",
        "A. Karunanidhi",
        "Pakkiri Samy",
        "Stunt Somu",
        "Srinivasan K.V.",
        "S.A. Kannan",
        "C.R. Parthiban",
        "T.P. Muthulakshmi",
        "Tambaram Lalitha"
    ],
    "genres": [
        "Biography",
        "Drama",
        "History"
    ],
    "runtimes": "201",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Black and White",
    "certificates": "India:U",
    "original air date": "16 May 1959 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTUzMjRmYmQtZjUzNC00ZTBkLWI4Y2MtYTNjMGU4MjgwMjUyXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0250803",
    "languages": "Tamil",
    "title": "Veerapandiya Kattabomman",
    "kind": "movie",
    "directors": "B. Ramakrishnaiah Panthulu",
    "writers": "Sakthi T.K. Krishnasamy",
    "producers": "B. Ramakrishnaiah Panthulu",
    "composers": "G. Ramanathan",
    "cinematographers": "W.R. Subba Rao",
    "editors": "R. Devarajan",
    "music department": [
        "Ku. Ma. Balasubramaniam",
        "Sirkazhi S. Govindarajan",
        "A.P. Komala",
        "Trichy Loganathan",
        "V.T. Rajagopalan",
        "Jamuna Rani",
        "T.V. Rathinam",
        "A.G. Rathnamala",
        "Varalakshmi S.",
        "T.M. Soundarajan",
        "P.B. Sreenivas",
        "P. Susheela"
    ],
    "miscellaneous": "Kongara Jaggaiah",
    "akas": [
        "Amar shaheed (India, Hindi title)",
        "Veerapandya Kattabrahmanna (India, Telugu title)"
    ],
    "writer": "Sakthi T.K. Krishnasamy",
    "director": "B. Ramakrishnaiah Panthulu",
    "production companies": "Padmini Pictures",
    "distributors": "Sivaji Productions",
    "plot": "When the British East India Company forces polygar Kattabomman to pay taxes, levies and be their subsidiary ruler, he openly defies their policy and battles them until his arrest and hanging.",
    "synopsis": "Veerapandiya Kattabomman (Sivaji Ganesan) is the king of Panchalankurichi a brave fighter and a devotee of his family deity, Lord Murugan of Tiruchendur. On receiving the news of a robbery in his territory, Kattabomman and his retinue set out incognito to capture the robbers. When the robbers are captured, they confess that they had been hired by the British to create unrest in Kattabomman's domain. They also tell him that the British had enticed the neighbouring chieftain, Ettappan (V. K. Ramasamy), to help them in their endeavour to annex Panchalankurichi. Ettappan was promised that an additional two villages would be added to his land by the British, as a price for his betrayal. Ettappan, in disguise, goes to Kattabomman's court and tries to frighten him by extolling the omnipotence of the British. Kattabomman is indignant and tears off Ettappan's fake beard, but spares him because he had come to his court as an ambassador.At Chayalkudi, a village near Panchalankurichi, lives Vellaiyammal (Padmini), who vows to marry the man who tames her pet bull. She takes her bull to participate in a Jallikattu game held at Panchalankurichi under Kattabomman's patronage. All those who attempt to tame the bull fail. At Kattabomman's call, his Commander-in-chief, Vellaiyathevan (Gemini Ganesan), subdues the bull and wins Vellaiyammal's love. Later, Kattabomman comes to know of their love and gets them married.Kattabomman receives a message from Lord W. C. Jackson (C. R. Parthiban), collector of Tirunelveli, who demands a meeting with Kattabomman at Ramanathapuram to discuss the payment of Kattabomman's tribute. Captain Davison (S. A. Kannan), Kattabomman's British friend, advises him to go and see Jackson. Jackson, finding that Kattabomman has come to see him with his troops, demands to meet him alone. At the meeting, Jackson insults him and orders his arrest. Though surrounded by the British troops, Kattabomman fights his way out, but during his escape his Minister, Thanapathi Sivasubramaniam Pillai (M. R. Santhanam), is captured by the British.Some time later, Pillai is released. He brings news that Jackson has been transferred back to England on Davison's recommendation. At Kattabomman's court, a British messenger sent by Colonel Ooshington, Tirunelveli's new collector, reports that Pillai and his men have looted their granaries and killed their men at Srivaikuntam. Pillai justifies his act, saying that he instructed his men to do it due to the famine conditions prevalent in their kingdom. Ashamed of Pillai's act, Kattabomman accuses him of injustice. Pillai apologises and offers himself as a prisoner to the British, but Kattabomman refuses to hand Pillai over; instead he offers money to the British as compensation for the looted rice. Ooshington does not agree and, with Major Bannerman's (Javar Seetharaman) and Ettappan's help, instigates the neighbouring rulers to attack Kattabomman. Bannerman is placed in charge of the British troops. He and Ettappan plan to attack Panchalankurichi when the people are away attending a festival in Tiruchendur. Kattabomman's spy Sunderalingam (A. Karunanidhi), overhears this and informs Kattabomman, who prepares for battle.On the day of the battle, Vellaiyammal pleads Vellaiyathevan not to go because the previous night she had a nightmare, which was full of evil omens. Ignoring her entreaties, Vellaiyathevan sets out, and is killed in the ensuing battle. Vellaiyammal, on learning of his death, kills the man who killed him, avenging her husband's death. She finds Vellaiyathevan's corpse and, out of grief, falls dead on it. Bannerman's troops attack Panchalankurichi with heavy artillery and Kattabomman's army suffers badly. Kattabomman is wounded in the neck, but is saved by his brother, Oomaithurai (O. A. K. Thevar). Sensing that the fort cannot survive another cannon barrage, Kattabomman and Oomaithurai flee to the adjoining kingdom of Kovilpatti. Pillai, disguising himself as Kattabomman, misleads the British soldiers who are on the trail of Kattabomman. From Kovilpatti, Kattabomman and Oomaithurai then flee to Pudukkottai. Thondaimaan, the king of Pudukkottai, is ordered by the British to capture Kattabomman and Oomaithurai. In fear of the British, Thondaimaan captures the two and hands them over. While Oomaithurai is jailed, Kattabomman faces a summary trial by the British and is hanged from a Tamarind tree at Kayatharu."
}