{
    "id": "0261347",
    "localized title": "Tenali Raman",
    "cast": [
        "Shivaji Ganesan",
        "Dorairaj T.N.",
        "Chittor V. Nagaiah",
        "Jamuna",
        "Bhanumathi Ramakrishna",
        "M.N. Nambiar",
        "N.T. Rama Rao"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "History"
    ],
    "runtimes": "195",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Black and White",
    "certificates": "India:U",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTNlYTY5NmQtNjY2Yi00YTY4LTkwOTgtMzlhMmRmY2RmMzE5XkEyXkFqcGdeQXVyODEzOTQwNTY@._V1_SY150_CR7,0,101,150_.jpg",
    "imdbID": "0261347",
    "plot outline": "The Deccan Sultans of Berar, Ahmednagar, Bidar, Bijapur and Golconda who the splinters from the erstwhile Bahmani Sultnate now unite with the common purpose to defeat of Krishnadeva Raya(NTR) and the conquest of the prosperous Vijayanagaram. They send their stooge Kanakaraj to assassinate Krishnadeva Raya, but Kanakaraj fails in his mission and is put to death. Then they planned courtesan Krishnasini. Krishnasini enters Vijayanagaram, and with her acclaimed dancing skills, manages to elicit the notice of the King, a great connoisseur of arts and beauty. She then plays her cards cleverly and besotted by her intelligent repartees and smoldering sensuousness, the susceptible King is soon a puppet in her hands. Orders are given that anyone who enters their private chamber would be beheaded and the King spends with Krishnasini's for months. Reports reach the ministers that the Sultans are planning to take advantage of the King's inaccessibility and launch a combined attack on Vijayanagaram. Worried at the state of affairs, Tenali Raman(Sivaji Ganesan) braves the prohibitory order and enters Krishnasini's abode dressed as a woman, but all his appeals to the King seem to fall on deaf ears. Meanwhile Queen Tirumalamba falls seriously sick and the King finally comes out of his daze. Once the King is at his wife's bedside, Tenali Ramakrishna manages to gain entry into Krishnasini's house again, this time under the guise of an omniscient saint who assures her that he would bring the King back to her. He catches her red-handed with her gang of spies, and signals to the hidden soldiers to surround her. Realized that the game is up, Krishnasini prefers a dignified death. Shocked to see her stab herself, Timmarusu remonstrates with her that she has acted in haste, for the King would have certainly forgiven her.",
    "languages": "Tamil",
    "title": "Tenali Raman",
    "kind": "movie",
    "directors": "Ranga B.S.",
    "writers": [
        "Venkataramaiah C.K.",
        "",
        "Kannadasan"
    ],
    "producers": "Ranga B.S.",
    "composers": "Ramamurthy",
    "cinematographers": "Ranga B.S.",
    "music department": "M.S. Viswanathan",
    "writer": [
        "Venkataramaiah C.K.",
        "Kannadasan"
    ],
    "director": "Ranga B.S.",
    "production companies": "Vikram Productions",
    "plot": "The Deccan Sultans of Berar, Ahmednagar, Bidar, Bijapur and Golconda who the splinters from the erstwhile Bahmani Sultnate now unite with the common purpose to defeat of Krishnadeva Raya(NTR) and the conquest of the prosperous Vijayanagaram. They send their stooge Kanakaraj to assassinate Krishnadeva Raya, but Kanakaraj fails in his mission and is put to death. Then they planned courtesan Krishnasini. Krishnasini enters Vijayanagaram, and with her acclaimed dancing skills, manages to elicit the notice of the King, a great connoisseur of arts and beauty. She then plays her cards cleverly and besotted by her intelligent repartees and smoldering sensuousness, the susceptible King is soon a puppet in her hands. Orders are given that anyone who enters their private chamber would be beheaded and the King spends with Krishnasini's for months. Reports reach the ministers that the Sultans are planning to take advantage of the King's inaccessibility and launch a combined attack on Vijayanagaram. Worried at the state of affairs, _Tenali Raman_ (qv)(Sivaji Ganesan) braves the prohibitory order and enters Krishnasini's abode dressed as a woman, but all his appeals to the King seem to fall on deaf ears. Meanwhile Queen Tirumalamba falls seriously sick and the King finally comes out of his daze. Once the King is at his wife's bedside, Tenali Ramakrishna manages to gain entry into Krishnasini's house again, this time under the guise of an omniscient saint who assures her that he would bring the King back to her. He catches her red-handed with her gang of spies, and signals to the hidden soldiers to surround her. Realized that the game is up, Krishnasini prefers a dignified death. Shocked to see her stab herself, Timmarusu remonstrates with her that she has acted in haste, for the King would have certainly forgiven her."
}