{
    "id": "14019516",
    "localized title": "Dasavala",
    "cast": [
        "Avinash",
        "Anita Bhat",
        "Hema Chaudhary",
        "Sinchana Gowda",
        "Achyuth Kumar",
        "Iswarya Menon",
        "Prem",
        "Rangayana Raghu",
        "Shobharaj",
        "Sanchari Vijay"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "11 Oct 2013 (India)",
    "imdbID": "14019516",
    "plot outline": "Dasavala is about two tourist guides - Prem and Rangayana Raghu. The jolly guides face a peculiar situation when a handicapped artist, a singer, a girl who escapes from the clutches of prostitution, a lady who leaves her home after a tiff with her son, and another girl, who also runs away from her house not being able to accept the groom selected by her parents, land in their house. Each one of them has some sentimental story which reflects the present day society. As the story progresses, the plot unfolds and each one of them are back in their own house. But the main character Aishwarya (Aishwarya Menon) decides to stay with Prem and he had to fight with her groom to save her.",
    "languages": "Kannada",
    "title": "Dasavala",
    "kind": "movie",
    "directors": "M.S. Ramesh",
    "writers": "Ma. Chandru",
    "producers": "Anaji Nagaraj",
    "composers": "Gurukiran",
    "akas": "Dasavala (India)",
    "writer": "Ma. Chandru",
    "director": "M.S. Ramesh",
    "production companies": "Namana Films",
    "plot": "_Dasavala_ (qv) is about two tourist guides - Prem and Rangayana Raghu. The jolly guides face a peculiar situation when a handicapped artist, a singer, a girl who escapes from the clutches of prostitution, a lady who leaves her home after a tiff with her son, and another girl, who also runs away from her house not being able to accept the groom selected by her parents, land in their house. Each one of them has some sentimental story which reflects the present day society. As the story progresses, the plot unfolds and each one of them are back in their own house. But the main character Aishwarya (Aishwarya Menon) decides to stay with Prem and he had to fight with her groom to save her."
}