{
    "id": "15023478",
    "localized title": "Gaali",
    "cast": [
        "Chalaki Chanti",
        "Tanya Choudhury",
        "Swetaa Varma",
        "Manoj Nandam",
        "Madhusudhan Rao"
    ],
    "genres": "Mystery",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjM2ZGJlN2QtYzUzZi00YjFhLWJjNzgtMDdkYzkxYmNmNGZlXkEyXkFqcGdeQXVyNzAxNDQ2Mzg@._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "15023478",
    "languages": "Telugu",
    "title": "Gaali",
    "kind": "tv mini series",
    "series years": "2021-",
    "akas": "Gaali (India)",
    "seasons": "1",
    "writer": "Kenaz",
    "plot": "Dhruva and Deeksha, a love struck duo, begin their life together soon after marriage by moving into a new house. Dhruva soon suspects that Deeksha is being unfaithful so he sets up a webcam in secret to capture her deception.",
    "synopsis": "Our universe is filled with contradictions. Its existence or identity depends on the co-existence of at least two conditions which are opposite to each other, yet dependent on each other and presupposing each other, within a field of tension. Such is the case with positive and negative energies too. Historically and culturally represented throughout civilizations and cultures around the world, energy as an influencing factor in human lives. While positive energy is attributed to God and friendly spiritual entities, negative energy has been commonly referred to as demons, some call it Kali and some believe it's the anti-christ.No matter what name is given, or what imaginary depiction is portrayed, the mental hold it has on believers is undeniable. But some of us don't believe, maybe to our own detriment.Dhruva and Deeksha, a lovestruck duo, begin their life together soon after marriage by moving into a new house. Dhruva soon suspects that Deeksha is being unfaithful so he sets up a webcam in secret to capture her deception. He is amused to find out that her horrible act of deception was secretly smoking cigarettes. Dhruva's relief is quickly overshadowed by something else he sees in the footage from this webcam, something he cannot explain, on ther verge of paranormal.His friends, who are amateur film makers looking to make a horror film but are struggling to find a good story, see a perfect opportunity to investigate and possible get a good story out of this. Without Deeksha's knowledge, they set up hidden cameras all over the house to investigate these events. To help with the understanding of what they might capture on film, they bring along Swetha, a paranormal specialist who is confident that she can prove them all wrong. She claims that her special equipment and skills can end the debate once and for all by proving that ghosts and such things are not real.They discover that a girl committed suicide in that house in the past. They decide she must be the ghost or entity that is still in the house. Fueled by curiosity and a possible juicy story, Dhruva and his friends dive deeper into the past to discover what exactly happened. By the time they realize that they are in real danger, it's way too late to turn back."
}