{
    "id": "2181831",
    "localized title": "Shahid",
    "cast": [
        "Rajkummar Rao",
        "Prabhleen Sandhu",
        "Mohd. Zeeshan Ayyub",
        "Baljinder Kaur",
        "Tigmanshu Dhulia",
        "Kay Kay Menon",
        "Vipin Sharma",
        "Shalini Vatsa",
        "Vinod Rawat",
        "Suvinder Pal",
        "Pawan Kumar",
        "Vivek Ghamande",
        "Paritosh Sand",
        "Prabal Panjabi",
        "Yusuf Hussain",
        "Mukesh Chhabra",
        "Jayant Gadekar",
        "Saharsh Kumar Shukla",
        "Dharmendra Singh",
        "Pawan Singh",
        "Akash Sinha",
        "Vaibhav Vishant"
    ],
    "genres": [
        "Biography",
        "Drama"
    ],
    "runtimes": "129",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "certificates": [
        "Australia:M",
        "Brazil:14",
        "Canada:PG::(Ontario)",
        "India:A",
        "Netherlands:12",
        "Singapore:NC-16",
        "South Korea:15",
        "United Kingdom:15::(self-applied)",
        "United States:Not Rated"
    ],
    "original air date": "18 Oct 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTYyMDE1NjQ1Nl5BMl5BanBnXkFtZTgwMDAyMTUzMDE@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "2181831",
    "plot outline": "Shahid traces the true story of slain human rights activist and lawyer Shahid Azmi. From attempting to become a terrorist to being wrongly imprisoned under a draconian anti-terrorism law to becoming a criminal lawyer Shahid traces the inspiring personal journey of a boy who became an unlikely messiah for human rights while following the rise of communal violence in India. This story of an impoverished Muslim struggling to come to terms with injustice, inequality and rising above his circumstances is an inspiring testament to the human spirit.",
    "languages": "Hindi",
    "title": "Shahid",
    "kind": "movie",
    "directors": "Hansal Mehta",
    "writers": [
        "Sameer Gautam Singh",
        "Sameer Gautam Singh",
        "",
        "Sameer Gautam Singh",
        "",
        "Apurva Asrani",
        "",
        "Hansal Mehta",
        "",
        "Hansal Mehta"
    ],
    "producers": [
        "Sunil Bohra",
        "Nikesh Chauhan",
        "Achin Jain",
        "Siddharth Roy Kapur",
        "Anurag Kashyap",
        "Guneet Monga",
        "Sanjeev Singh Pal",
        "Kunal Rohra",
        "Ronnie Screwvala",
        "Sandeep Singh",
        "Shaailesh R Singh",
        "Alok Arbind Thakur",
        "Abhisek Vyas",
        "Shaan Vyas"
    ],
    "composers": "Karan Kulkarni",
    "cinematographers": "Anuj Rakesh Dhawan",
    "editors": "Apurva Asrani",
    "editorial department": [
        "Supriya Lal",
        "Birju Rajak",
        "Venugopal Rao",
        "Deepak Shrivastav"
    ],
    "casting directors": "Mukesh Chhabra",
    "art directors": "Rabiul Sarkar",
    "costume designers": "Khatri Irfan",
    "make up department": "Shrikant Desai",
    "production managers": [
        "Sagnik Bhattacharjee",
        "Shah Naimish"
    ],
    "assistant directors": "Jai Mehta",
    "sound department": [
        "Prapul Betapudi",
        "Sajjan Choudhary",
        "Bigyna Dahal",
        "Subir Kumar Das",
        "Anup Dev",
        "Yogesh Gurav",
        "Mandar Kulkarni",
        "Robin Kunjukutty",
        "Varun Visoi"
    ],
    "visual effects": [
        "Mohamed Ghouse",
        "P. Mohan",
        "Martin Sansom",
        "Arunkumar Subramanian"
    ],
    "camera department": [
        "Nusrat Jafri",
        "Rajan Maharajan"
    ],
    "casting department": [
        "Aakash Dahiya",
        "Jai Mehta",
        "Prasad Thakur",
        "Vaibhav Vishant",
        "Sanket Bandekar"
    ],
    "music department": [
        "Subir Kumar Das",
        "Karan Kulkarni",
        "Virag Mishra",
        "Alok Punjani",
        "Shellee",
        "Shailender Singh Sodhi Shellee"
    ],
    "miscellaneous": [
        "Darshan Bhanushali",
        "Mithun D'Souza",
        "Prakash Nathan",
        "Vasid Qureshi",
        "Vijesh Rajan",
        "Gaurav Verma"
    ],
    "akas": "Шахид (Russia)",
    "writer": [
        "Sameer Gautam Singh",
        "Sameer Gautam Singh",
        "Sameer Gautam Singh"
    ],
    "director": "Hansal Mehta",
    "production companies": [
        "Bohra Bros Production Pvt.",
        "Anurag Kashyap Films",
        "Paramhans Creations",
        "Bohra Bros Productions"
    ],
    "distributors": [
        "Amazon Prime Video",
        "Bohra Bros Production Pvt."
    ],
    "plot": [
        "The account of Human Rights lawyer _Shahid_ (qv) Azmi, an ordinary citizen with an extraordinary commitment to justice.",
        "_Shahid_ (qv) traces the true story of slain human rights activist and lawyer _Shahid_ (qv) Azmi. From attempting to become a terrorist to being wrongly imprisoned under a draconian anti-terrorism law to becoming a criminal lawyer _Shahid_ (qv) traces the inspiring personal journey of a boy who became an unlikely messiah for human rights while following the rise of communal violence in India. This story of an impoverished Muslim struggling to come to terms with injustice, inequality and rising above his circumstances is an inspiring testament to the human spirit.::Anonymous"
    ],
    "synopsis": "The film opens with murder of Shahid Azmi (Rajkummar Rao) and goes into flashback to the violence during the Bombay riots. There Shahid witnesses cold-blooded murders and in anger runs away to Pakistan-administered Kashmir, where he spends a brief period at a militant training camp. He soon returns. In Mumbai, he is arrested under the Terrorist and Disruptive Activities (Prevention) Act, for an alleged conspiracy to assassinate some politicians. He is brutally tortured by police and forced to admit to the crime, after which he spends seven years at Tihar Jail in New Delhi. During his incarceration at Tihar Jail, Omar Sheikh (Prabal Panjabi) tries to brainwash him. But another inmate War Saab (K K Menon) inspires him to start his college education. Once he is acquitted of the charges, he goes ahead to study law in Mumbai.After receiving his law degree, Shahid works with lawyer Maqbool Memon (Tigmanshu Dhulia) for few months, before starting his career as an independent lawyer with the financial support of his elder brother Arif (Mohammed Zeeshan Ayyub). During this process he meets Mariam (Prabhleen Sandhu), a Muslim divorcee, and marries her. Shahid soon starts picking up cases of Muslims charged under the POTA. He fights many cases pro bono in consultation with NGOs. Shahid gets his first major success as a defence lawyer when Arif Paanwala, who has been arrested under POTA in 2002 Mumbai bus bombing, is acquitted due to lack of evidence.Shahid then represents the accused in the 2006 Mumbai train bombings, the 2006 Aurangabad arms haul, and the 2006 Malegaon bombings case. He is criticized for supporting terrorists and starts getting threatening calls that disturb his family life. On one occasion, Shahid's face is blackened by assailants outside the court room. While defending Faheem Ansari in the 2008 Mumbai attacks case, he gets shot by two gunmen in his office and dies on the spot. Later, Ansari is shown to be acquitted of all charges by the Supreme Court of India due to lack of evidence.In a post-credits scene, Shahid's journey to the training camp is shown. It is edited out of the final cut to make the story tighter."
}