{
    "id": "2203308",
    "localized title": "Aashiqui 2",
    "cast": [
        "Aditya Roy Kapoor",
        "Shraddha Kapoor",
        "Shaad Randhawa",
        "Salil Acharya",
        "Parthaa Akerkar",
        "Chitrak Bandyopadhyay",
        "Ashish Bhatt",
        "Ebadat Akram Dunia",
        "Gagan Gupta",
        "Bugs Bhargava Krishna",
        "Shubhangi Latkar",
        "Soumyajit Majumdar",
        "Nickk",
        "Milind Pathak",
        "Shekhar Shukla",
        "Mahesh Thakur",
        "Geet Vaghela"
    ],
    "genres": [
        "Drama",
        "Music",
        "Musical",
        "Romance"
    ],
    "runtimes": "132",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:U",
        "New Zealand:M",
        "Singapore:PG13",
        "United States:Not Rated"
    ],
    "original air date": "26 Apr 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjEzNzczNTg2M15BMl5BanBnXkFtZTcwMjUxNjk0OQ@@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "2203308",
    "plot outline": "Rahul is a singer, who loses his career due to his drinking habits. He meets Arohi in a bar in Goa, where she works to earn a living. Impressed by her singing, he promises her to take her to Mumbai and make her a star, where they fall in love with each other. Aashiqui 2 is a musical love story of these lovers who goes through love and hate, fame and failure in their lives. However will they stay together accepting their success, or will they breakup due to their ego?",
    "languages": "Hindi",
    "title": "Aashiqui 2",
    "kind": "movie",
    "directors": "Mohit Suri",
    "writers": "Shagufta Rafique",
    "producers": [
        "Aleem Allie",
        "Nizam Allie",
        "Mehboob Bawa",
        "Mahesh Bhatt",
        "Mukesh Bhatt",
        "Dilip Borkar",
        "Noorie Hassan",
        "Hetvi Karia",
        "Bhushan Kumar",
        "Krishan Kumar"
    ],
    "composers": [
        "Jeet Gannguli",
        "Mithun Sharma",
        "Ankit Tiwari"
    ],
    "cinematographers": "Vishnu Rao",
    "editors": "Devendra Murdeshwar",
    "editorial department": [
        "Nitin Chauhan",
        "Rohit Makwana",
        "Nikhil Nadella",
        "Ganesh Shinde"
    ],
    "production designers": "Rajat Poddar",
    "art directors": [
        "Aashish Porwal",
        "Bain Rossouw"
    ],
    "costume designers": "Sheena Sitlani",
    "production managers": [
        "Mehboob Ansari",
        "Priyanshu Sharma"
    ],
    "assistant directors": [
        "Maanavi Bedi",
        "Anand Chhapia",
        "Karan Darra",
        "Chetan Desai",
        "Chetan Desai",
        "Suman Prasad",
        "Sidhaant Sachdev",
        "Richard Salafia",
        "Rajlaxmi Ratan Seth",
        "Geet Vaghela"
    ],
    "art department": [
        "Ravindra Singh Bhouriyal",
        "Chanchal Bisht",
        "Sonu Hittalmani",
        "Rahim Sayyed",
        "Krishna Swain"
    ],
    "sound department": [
        "Siddharth Dubey",
        "Mohit Maini",
        "Mohammad Iqbal Paratwada",
        "Dhrubajyoti Phukan",
        "C.V. Raju",
        "Hemant Rao",
        "Jitendra Vajpayee"
    ],
    "visual effects": [
        "Shudhdodhan Milind Ambhore",
        "Shruti Anand",
        "Sagar Aphandkar",
        "Aditya Badekar",
        "Swapnil Bagul",
        "Mahesh Baria",
        "Santosh Choudhary",
        "Vishal Desale",
        "Somesh Ghosh",
        "Ashwin Joshi",
        "Vinay Kadam",
        "Dushyant Kashyap",
        "Dam Khuman",
        "Mithil Kotwal",
        "Dhanjee Maheshwary",
        "Debabrata Maity",
        "Feroz Mallick",
        "Suhas Manjrekar",
        "Midhun",
        "Govind Mohan",
        "Rohit More",
        "Jitu Naik",
        "Anoop M. Nair",
        "Vikas Negi",
        "Om Parab",
        "Virendra Prajapati",
        "Priyank Raj",
        "Dheeren Raul",
        "Arjun Reddy",
        "Dhanendra Sahu",
        "Sandeepchoudhary",
        "Jimit Shah",
        "Satyendra Sharma",
        "Prashant Kumar Singh",
        "Sreevinod",
        "Mohite Suraj",
        "Abu Thahir",
        "Rahul Toraskar",
        "Jitendra Yadav",
        "Shritej Patvardhan"
    ],
    "stunts": "Abbas Ali Moghul",
    "camera department": [
        "Devendra Dash",
        "Chetan Maduranthakam",
        "Harish Patel",
        "Nilesh Pathak",
        "Garima Verma Rajput",
        "Nagaraj Rathinam",
        "Syed Tanveer Reyaz",
        "Rohan Shrestha",
        "Adi Visser"
    ],
    "casting department": [
        "Sameer Banerjee",
        "Shree Rammy Pandey",
        "Aayush Sharma"
    ],
    "music department": [
        "Hamim Hossain Bhuyain",
        "Nirmalya Dey",
        "Jeet Gannguli",
        "Shreya Ghoshal",
        "Niloy Rashid Jaki",
        "George Joseph",
        "Tanjeeb Khan",
        "Sanjay Masoomm",
        "Palak Muchhal",
        "Akash Noatia",
        "Dhrubajyoti Phukan",
        "Mithun Sharma",
        "Bobby Shrivastava",
        "Manav Shrotriya",
        "Arijit Singh",
        "Divyanshu Tejwani",
        "Sandeep Thakur",
        "Ankit Tiwari",
        "Mustafa Zahid",
        "Kishan Kumar Jha"
    ],
    "miscellaneous": [
        "Mukesh Chhabra",
        "Himanshu Jhunjhunwala",
        "Sana Khan",
        "Rajit Kumra",
        "Shree Rammy Pandey",
        "Sahil Sai",
        "Sonam Budha Sharmaa",
        "Prasen Sharrma"
    ],
    "akas": [
        "आशिक़ी 2 (India, Hindi title)",
        "Romance 2 (United States)",
        "Romance 2 (United Kingdom)",
        "愛するがゆえに (Japan, Japanese title)",
        "Жизнь во имя любви 2 (Russia)"
    ],
    "writer": "Shagufta Rafique",
    "director": "Mohit Suri",
    "production companies": [
        "Super Cassettes Industries Limited",
        "Vishesh Films"
    ],
    "distributors": [
        "IMGC Global Entertainment",
        "Oscaroda",
        "Thati Media",
        "T-Series"
    ],
    "special effects": "Prime Focus",
    "other companies": [
        "Light n Light",
        "Trigger Happy Entertainment",
        "prisca"
    ],
    "plot": [
        "Rahul loses his fans and fame due to alcoholism. But he then decides to turn a small time singer into a rising star.",
        "Rahul is a singer, who loses his career due to his drinking habits. He meets Arohi in a bar in Goa, where she works to earn a living. Impressed by her singing, he promises her to take her to Mumbai and make her a star, where they fall in love with each other. _Aashiqui 2_ (qv) is a musical love story of these lovers who goes through love and hate, fame and failure in their lives. However will they stay together accepting their success, or will they breakup due to their ego?::Manisha Krishna",
        "Rahul Jaiker (Aditya Rao Kapoor) is a successful singer but is a drug addict and has alcohol problems. One night in a bar he sees Aarohi (Shraddha Kapoor) performing his song. He is highly impressed and vows to make her a star. After some problems, Aarohi finally becomes a successful singer, however Rahul and his drinking issues is always a distraction for her. Will Rahul be able to get rid of his alcoholic habits? Or will Aarohi give up her singing career to save Rahul's life?::Saaki"
    ],
    "synopsis": "The film begins by showing a large crowd waiting for Rahul Jaykar (Aditya Roy Kapoor) a successful pop singer whose career is waning because of his alcohol addiction to perform at a stage show in Goa. After nearly completing a song, he is unexpectedly interrupted by Aryan (Salil Acharya) during his performance, Rahul fights him, stops his performance, and drives to a local bar. He meets Aarohi Keshav Shirke (Shraddha Kapoor), a Maharashtrian bar singer who idolizes Rahul. After noticing Aarohi looking at a photograph of Lata Mangeshkar in the bar, he assumes that she wants to become a singer. Impressed by her simplicity and voice, Rahul promises to transform her into a singing sensation, and asks her to never perform again in bars. Aarohi quits her job and returns to Mumbai with Rahul, who convinces record producer Saigal (Mahesh Thakur) to meet her. When Aarohi calls Rahul, he is attacked and injured by some unknown people, and is unable to receive her call. His friend and manager Vivek (Shaad Randhawa) says that news of Rahul's accident should not be leaked to the media, and instead publicises a false story that Rahul has left the country to participate in stage shows. When Aarohi attempts to contact Rahul again, Vivek ignores the calls. After two months of fruitlessly attempting to contact Rahul, a broken Aarohi is forced to sing in bars again because of her family problems.After recovering from his injuries, Rahul vows to search for Aarohi. He learns that Aarohi is working in a bar again and that Vivek had ignored her calls without informing him. Rahul apologizes to Aarohi and sacks Vivek, and they meet with Saigal for the recording agreement. Rahul begins to train Aarohi, who signs a music contract to sing in films and becomes a successful playback singer. Her family and Rahul are happy. But one day, he goes to a bar and watches Aarohi winning the award but two men who is in the bar begin to gossip that Rahul is using her as a servant. Hearing this he relapses into alcohol addiction. Aarohi, who loves Rahul more than her career, comforts him and make love. Despite Aarohi's mother's disapproval, Aarohi moves in with Rahul and things go well until Rahul's addiction worsens, causing him to become aggressive and violent.To help Rahul fight his alcoholism, Aarohi attempts to rehabilitate Rahul, sacrificing her singing career in doing so. After Saigal reminds them about their dream of Aarohi becoming a successful singer, Rahul orders her to focus on her work. During Aarohi's stage show, Rahul meets a journalist backstage, who accuses him of using Aarohi for pleasure and money. Furious, Rahul beats up the journalist and starts drinking. He ends up in the police station, and Aarohi comes to get him out. Rahul overhears Aarohi telling Saigal that she is going to sacrifice her career for him and is ready to give up her celebrity status because Rahul is more important to her. Rahul thinks that he has become a burden in her life, and that leaving her is his only option to save her. The next day he bids her farewell and commits suicideDistraught by Rahul's death, Aarohi decides to quit her career but Vivek persuades her to stay. He reminds her that Rahul wanted her to become a successful singer and has given his life as he did not want to be a burden on her. Aarohi agrees, and resumes her career as a singer. Later, she signs her name as \"Aarohi Rahul Jaykar\" in a fan's handbook as a tribute to Rahul and her unsung desire to marry him. As rain starts falling, she watches the couple who took her autograph sharing a romantic moment under a jacket as she and Rahul had done when he was alive."
}