{
    "id": "2350496",
    "localized title": "The Lunchbox",
    "cast": [
        "Irrfan Khan",
        "Nimrat Kaur",
        "Nawazuddin Siddiqui",
        "Lillete Dubey",
        "Nakul Vaid",
        "Bharti Achrekar",
        "Yashvi Puneet Nagar",
        "Denzil Smith",
        "Shruti Bapna",
        "Nasir Khan",
        "Lokesh Raj",
        "Sadashiv Kondaji Pokarkar",
        "Aarti Rathod",
        "Krishna Bai",
        "Raj Rishi More",
        "Santosh Kumar Chaurasiya",
        "Avijit Khanwilkar",
        "Aakash Sinha",
        "Xavier Hodges",
        "Rosemary Hodges",
        "Hubart Vossoaker",
        "Rosemary Vossoaker",
        "Flory Vossoaker",
        "Sebastian Vossoaker",
        "Quitira Vossoaker",
        "Baaburao Sankpal",
        "Chandrakantha Rajani",
        "Kancha Karki",
        "Rajendra Dubey",
        "Narendra Arora",
        "Ashwin Desai",
        "Mahesh Mahadev Salavkar",
        "Krishna Mandal",
        "Calvin Desilva",
        "Craig Narona",
        "Kyeron Kandoria",
        "Shubh Jadav",
        "Rita Sonal Panjatan",
        "Swapnil Shrirao"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "104",
    "countries": [
        "India",
        "France",
        "Germany",
        "United States",
        "Canada"
    ],
    "country codes": [
        "in",
        "fr",
        "de",
        "us",
        "ca"
    ],
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Argentina:13",
        "Australia:PG",
        "Brazil:12::(video rating)",
        "Canada:G::(British Columbia)",
        "Chile:TE",
        "Colombia:7",
        "Finland:K-7",
        "France:Tous publics",
        "Germany:0",
        "Greece:K-8",
        "Hong Kong:I",
        "Hungary:12",
        "India:U",
        "Ireland:PG",
        "Italy:T",
        "Japan:G",
        "Mexico:A",
        "Netherlands:AL",
        "New Zealand:PG",
        "Norway:A",
        "Portugal:M/12",
        "Singapore:PG",
        "South Korea:12",
        "Spain:A::(ICAA)",
        "Sweden:Btl",
        "Switzerland:10",
        "Thailand:15",
        "Turkey:G::(self-applied)",
        "United Kingdom:PG",
        "United States:PG"
    ],
    "original air date": "20 Sep 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTUwMzc1NjIzMV5BMl5BanBnXkFtZTgwODUyMTIxMTE@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "2350496",
    "plot outline": "The film, set in Mumbai, revolves around a mistaken delivery by the Dabbawalas (lunchbox service) of Mumbai, which leads to a relationship between Saajan, a lonely widower close to retirement, and Ila, an unhappy housewife, as they start exchanging notes through the daily lunchbox.",
    "languages": "Hindi",
    "title": "The Lunchbox",
    "kind": "movie",
    "directors": "Ritesh Batra",
    "writers": [
        "Ritesh Batra",
        "",
        "Vasan Bala"
    ],
    "producers": [
        "Gitika Aggarwal",
        "Shahnaab Alam",
        "Marc Baschet",
        "Ritesh Batra",
        "Lydia Dean Pilcher",
        "Benny Drechsel",
        "Nina Lath Gupta",
        "Achin Jain",
        "Smriti Jain",
        "Karan Johar",
        "Sunil John",
        "Siddharth Roy Kapur",
        "Anurag Kashyap",
        "Nitin Keni",
        "Irrfan Khan",
        "Cédomir Kolar",
        "John F. Lyons",
        "Guneet Monga",
        "Sahab Narain",
        "Arun Rangachari",
        "Vivek Rangachari",
        "Vikramjit Roy",
        "Shivani Saran",
        "Ronnie Screwvala",
        "Meraj Shaikh",
        "Karsten Stöter",
        "Danis Tanovic",
        "Shaan Vyas"
    ],
    "composers": "Max Richter",
    "cinematographers": "Michael Simmonds",
    "editors": "John F. Lyons",
    "editorial department": [
        "Jean-Michel Petit",
        "Prerna Saigal"
    ],
    "casting directors": "Seher Latif",
    "production designers": "Shruti Gupte",
    "set decorators": [
        "Pradeep Paul Francis",
        "Akshi Kapoor"
    ],
    "costume designers": "Niharika Bhasin",
    "make up department": [
        "Vijay Shikare",
        "Serina Texiera"
    ],
    "production managers": [
        "Sachin Agarwal",
        "Naved Farooqui",
        "Dilip Gupta",
        "Sumit Gyanchandaney",
        "Rahul Jadhav",
        "Raj Rishi More",
        "Bhaskar Mukherjee",
        "Shah Naimish",
        "Agarwal Sachin",
        "Raut Shweta",
        "Anna Vilgelmi",
        "Avinash Viswanathan"
    ],
    "assistant directors": [
        "Avijit Khanwilkar",
        "Raj Rishi More",
        "Ashish Ranglani",
        "Prerna Saigal",
        "Neema Sharma",
        "Sanjeev Tripathi"
    ],
    "sound department": [
        "Ramesh Birajdar",
        "Valerio Brini",
        "Michael Kaczmarek",
        "Tom Korr",
        "Markus Krohn",
        "Stephan Läufer",
        "Michael Nagel",
        "Peter Sandmann",
        "Sudesh Sidhu",
        "Aravind Vijayakumar",
        "Janne von Busse"
    ],
    "visual effects": [
        "Sultan Bal",
        "Vinay Singh Chuphal",
        "Yarlagadda Ganapathi",
        "Abhishek Goel",
        "Aziz Merchant",
        "Vishal Parmar",
        "Prasad Patel",
        "Pratik Redkar",
        "Manoj Sakesh",
        "Parikshat Tyagi",
        "Anuj Upadhyay",
        "Nilesh Uttarwar"
    ],
    "camera department": [
        "Rubb Bhungdawala",
        "Siddharth Diwan",
        "Raju Anjanna Gadam",
        "Tanmay Kant",
        "Sanjay Kumar Kesari",
        "Afzal Khan",
        "Fazal Khan",
        "Sidharth Meer",
        "Vaza Sanket",
        "Karamjit Singh"
    ],
    "casting department": [
        "Shubham Gaur",
        "Girish Sharma"
    ],
    "costume departmen": [
        "Mallika Chauhan",
        "Tasneem Khan"
    ],
    "location management": "Naved Farooqui",
    "music department": "Henning Fuchs",
    "script department": "Olivia Stewart",
    "miscellaneous": [
        "Manpreet Bacchhar",
        "André Des Rochers",
        "Neo Juris Gitika Aggarwal",
        "Mandy Goldberg",
        "Varun Gupta",
        "Achin Jain",
        "Parth Khurana",
        "Richard Lormand",
        "Emily McEvoy",
        "Apoorva Mehta",
        "Lauren Mekhael",
        "Arnab k Middya",
        "Raj Rishi More",
        "Prakash Nathan",
        "Chinni Nihalani",
        "Abdul Rahim Shaikh",
        "Bhavyanshu Singh",
        "Chandan Singh",
        "Anusha Srinivasan",
        "Anita Surendran"
    ],
    "thanks": [
        "Gyula Gazdag",
        "Ilyse McKimmie",
        "Lauren Mekhael",
        "Marten Rabarts",
        "Michelle Satter",
        "Jinal Ketan Shah",
        "Alesia Weston"
    ],
    "akas": [
        "Lunchbox (Germany)",
        "Saveurs indiennes (Canada, French title)",
        "Lounasrasia (Finland)",
        "Okus po ljubezni (Slovenia)",
        "Amor a la carta (Mexico)"
    ],
    "writer": [
        "Ritesh Batra",
        "Vasan Bala"
    ],
    "director": "Ritesh Batra",
    "production companies": [
        "Sikhya Entertainment",
        "DAR Motion Pictures",
        "National Film Development Corporation of India (NFDC)",
        "Asap Films",
        "Rohfilm",
        "Cine Mosaic",
        "Aide au cinéma indépendant - Canada (ACIC)",
        "Arte France Cinéma",
        "Centre national du cinéma et de l'image animée (CNC)",
        "Dharma Productions",
        "Institut François Mitterand",
        "Medienboard Berlin-Brandenburg",
        "Ministère des Affaires étrangères et du Développement International",
        "Nittin Keni Creations",
        "UTV Motion Pictures"
    ],
    "distributors": [
        "A Plus Films",
        "Academy 2",
        "CDI Films",
        "Cinemien",
        "Cirko Film",
        "Edko Films",
        "Filmarti",
        "Filmcoopi Zürich",
        "Golden Village Pictures",
        "Happiness Distribution",
        "Longride",
        "M3 Film",
        "NFP Marketing & Distribution",
        "Nittin Keni Creations",
        "Sony Pictures Classics",
        "UTV Motion Pictures",
        "Zima Entertainment",
        "Alambique Filmes",
        "EuroVideo",
        "Film1",
        "Homescreen",
        "Lighthouse Pictures",
        "Madman Entertainment",
        "Sony Pictures Home Entertainment",
        "Sony Pictures Home Entertainment",
        "Vrijzinnig Protestantse Radio Omroep (VPRO)",
        "Vértigo Films"
    ],
    "other companies": [
        "Cannes Film Festival",
        "K13 Kinomischung",
        "Light n Light",
        "Promoshop",
        "Promoshop",
        "Sundance Film Festival",
        "The Bridge",
        "Toronto International Film Festival",
        "Xtrathin Design"
    ],
    "plot": [
        "A mistaken delivery in Mumbai's famously efficient lunchbox delivery system connects a young housewife to an older man in the dusk of his life as they build a fantasy world together through notes in the lunchbox.",
        "The film, set in Mumbai, revolves around a mistaken delivery by the Dabbawalas (lunchbox service) of Mumbai, which leads to a relationship between Saajan, a lonely widower close to retirement, and Ila, an unhappy housewife, as they start exchanging notes through the daily lunchbox.::Iceman",
        "In Mumbai, the lonely widower Saajan Fernandes works in the accounting department of a company and is near retirement. He is assigned to train his replacement Shaikh, who is a needy orphan. One day, Fernandes mistakenly receives the lunchbox prepared by the housewife Ila to her estranged husband Rajeev and Fernandes believes that the restaurant where he buys his food improved the meal. On the next day, he receives a note from Ila inside the lunchbox and they begin to correspond to each other. Ila suspects that her husband is having a love affair and everyday Fernandes and Ila become anxious to read the note from the other. One day, Ila invites Fernandes to meet her in a restaurant. What will be their reactions in the encounter?::Claudio Carvalho, Rio de Janeiro, Brazil",
        "By an improbable mix-up in the infallible lunch-box delivery system of the famous Mumbai Dabbawalas, two perfect strangers--the lonesome middle-aged widower, Saajan Fernandes, and the young but unhappy housewife, Ila--unexpectedly, will find their lives delightfully entangled. And just like that, when Ila's elaborate menus intended to win back her husband's affection mistakenly reach Saajan, a series of hand-written lunch-box messages explaining the situation will gradually prepare the ground for a true friendship, and a genuinely intriguing interest. However, are the two long-distance friends courageous enough to take the first and most crucial step in their relationship?::Nick Riganas",
        "He pays for his lunch to be delivered at work from a local restaurant, but his order is mixed with a meal prepared by Ila (Nimrat Kaur), a housewife who thought she was making lunch for her husband. When he eats every bite of the incorrectly delivered lunch, Ila asks her husband about her success, but his response convinces her that her hubby never got the food she prepared. Ila puts a note in the next lunch, and soon she and Saajan develop a pen-pal relationship..",
        "Ila whose has lost romance in her marriage decides to get it back by preparing delicious food for her husband.But due to a mistake by Mumbai's Dabbawalas her husband Tiffan reaches a widower Saajan Fernandes.Which starts exchange of messages between the two leading to a friendship.::alex.mjacko@gmail.com",
        "In Mumbai's famously efficient lunchbox delivery system, a meal made by an unhappy young housewife mistakenly lands in the hands of a widower. After realising the mix up, the strangers begin to communicate through a series of letters, revealing a little more of themselves each time.",
        "A man named Saajan Fernandez, a Christian who works as an accountant in a govt. office is about to retire from his job. He is a very reserved person. Doesn't talk to people, doesn't socialise and lives a solitary life. Saajan's wife had died a few years back so he just drinks glasses of alcohol and watches a show on TV but there is not even a single glimmer of happiness in him. While Ila, a hindu, a young housewife, totally different from Saajan is going through a bland relationship with her husband, Rajeev who doesn't really converse with her when he returns home after work. So, Ila tries to seek his attention and romance him by sending him very special and tasty food to spice up their relationship. She sends him a lunchbox everyday through the intricate system of traditional food delivery in Mumbai which is taken care by the \"Dabbawalas\". Dabbawalas are people who send home cooked food to the people who work in offices so that their spouses don't have to worry about travelling and handing the lunchboxes on their own, to their spouses. And mind you, these dabbawalas virtually never mess up, by giving a lunchbox to the wrong person. It always goes to the right person. Ila used to send food to her husband but one day, Ila's lunchbox made for Rajeev mistakenly went to Saajan's desk. Saajan is visibly surprised because he has no one to give him food like this as he eats his food from the office canteen or from outside. Ila eventually realises her mistake through her husband who when he returned said that he ate something else only and through the dabbawala who said the address to which it went and she knew that that wasn't the right address, also scolding him a bit. Ila thinks what to do. The very next day, she tells her neighbour who is an elderly lady about the incident. After taking advice from her neighbour, Ila sends a letter to Saajan, talking about the mix up along with the lunchbox which contains food. (her husband's favourite meal, might I add.) She also tells her dabbawala to send the lunchbox to the same address like yesterday. Saajan again receives the same box and reads the letter and tries to only taste the food but it's so good that he ends up eating all of it. He writes back to her saying that the food was simply delicious and Ila loves it and this kicks off their innocent conversations through paper, through letters and in those letters, talking about each other lives. - While at work, Saajan is introduced to Shaikh a muslim who is new to the office and is set to replace Saajan as the accountant. Saajan is tasked to train him before he leaves the job completely. Shaikh's incompetence initially annoys Saajan who tries to distance himself from him and also tells lies in conversations when Sheikh asks questions about his daily life. But Saajan and Shaikh gradually strike a close bond and friendship with each other. One time, Saajan covered up Shaikh's mistakes at the office thus saving him and his job and becoming the right man for him at his wedding with Mehrunissa as Shaikh never had any parents, he was an orphan. At Ila's home, Ila finds out that Rajeev is having an affair with another woman and is cheating on her. She doesn't fume or anger up but she loses hope towards her marriage with Rajeev. In her next lunchbox letter to Saajan, she suggests moving to Bhutan where there is way lower cost of living than in India. In the very next one, Ila offers Saajan to meet her in person at a popular, local restaurant somewhere in the city before she leaves for Bhutan. Saajan agrees but he is not able to reach the place at the right time while Ila waited, waited and waited but a little later, was compelled to leave the restaurant. The following day, Saajan receives an empty lunchbox which makes him write back to Ila and in that vey letter, he apologises to a dejected Ila but says that he did turn up and saw her from a distance. Saajan said that he just couldn't gain the courage to approach her, who was sitting at the table. He expresses that she looked young and very beautiful but tells her that he is too old for her and advises her to carry on with her life. A few days later, Ila's father, battling lung cancer, died with her mother, grieving over his passing. But after her mother actually confessed to Ila, how unhappy her marriage was with her father. Ila starts searching for Saajan but learns from Shaikh that he has already retired and is headed to Nashik. Ila writes a farewell message to Saajan, stating that she has decided to leave her husband and would move to Bhutan with her young daughter. When Saajan sees this, he changes his mind while en route to Nashik and returns to Mumbai and goes in search of Ila. Ila is last seen waiting for her daughter to return home from school as Saajan gets help from the same dabbawala who regularly picked and delivered that very. - Lunchbox.::Shaurya N. Singh"
    ],
    "synopsis": "Saajan Fernandes (Irrfan Khan) is a widower who is about to retire from his job as an accountant. Ila (Nimrat Kaur) is a young wife seeking her husband's (Nakul Vaid) attention and looking for ways to put romance back into her marriage, one of which is to cook delicious food for him. Through a rare mix-up of the complicated food delivery system that picks up and delivers lunches from restaurants or homes to people at work of Mumbai, the lunchbox Ila prepares for her husband gets delivered, instead, to Saajan. Ila eventually realizes the mistake and with the advice of her neighbor aunt (Bharti Achrekar - voice only) living in the apartment above her, writes a letter to Saajan about the mix up and places it in the lunchbox (along with her husband's favorite meal) the next day.An exchange of the messages sent back and forth with the lunches ignites a friendship between the two, as they share memories and events of their own individual lives. At work, Saajan is tasked with training his replacement, Shaikh (Nawazuddin Siddiqui), an orphan whose incompetence initially annoys Saajan, who is already socially distant since his wife's death. Saajan and Shaikh gradually get to know each other better and strike a close friendship as well. At one point, Saajan saves Shaikh's job by covering for his blatant mistakes on pay orders and he also becomes his best man at his wedding with Mehrunissa (Shruti Bapna).At home, Ila finds out that her husband is having an affair and she begins to give up hope on her marriage. In one of the lunchbox letters, she suggests moving to Bhutan where the cost of living is much less than in India. Saajan writes back suggesting that the two move there together. Ila then offers to meet in person at a popular food joint, but at the appointed time Saajan doesn't turn up. Upon receiving an empty lunchbox the next day, Saajan writes back to the dejected Ila and apologizes, saying that he did arrive and saw her from a distance but couldn't approach her. He explains how young and beautiful she looked, while surmising that he is too old for her and advising her to move on.Some time later, Ila's father, battling with lung cancer, dies in her mother's care. After her mother (Lilette Dubey) confesses how unhappy her marriage was, Ila decides to search for Saajan, but then learns from Shaikh that he has already retired and headed to Nasik. She writes a last farewell message to Saajan announcing that she has decided to leave her husband and move to Bhutan with her young daughter.Meanwhile, Saajan changes his mind en route to Nasik, returning to Mumbai and going in search of Ila - who is last seen at home waiting for her daughter to return from school - as he gets help from the same food delivery service which regularly picked up and delivered the lunchbox."
}