{
    "id": "2617676",
    "localized title": "Thalaivaa",
    "cast": [
        "Joseph Vijay",
        "Amala Paul",
        "Santhanam",
        "Sathyaraj",
        "Ragini Nandwani",
        "Rajiv Pillai",
        "Nassar",
        "Abhimanyu Singh",
        "Y.G. Mahendran",
        "Manobala",
        "Ponvannan",
        "Suresh",
        "Tanu Vidyarthi",
        "Subbu Panchu",
        "Rekha",
        "Ravi Prakash",
        "Sathish",
        "Udhaya",
        "Stun Shiva",
        "Kishore",
        "Sam Anderson",
        "Khanh Trieu",
        "Shailla Quadra",
        "Meg MacIntosh",
        "Bobby Babin",
        "G.V. Prakash Kumar",
        "Dinesh",
        "K. Bujji Babu",
        "Talia Grace",
        "Prasanna Jk",
        "Varun Kamal",
        "Pooran Kiri",
        "Sathish Krishnan",
        "A.R. Manikandan",
        "Rajeev Pillai",
        "Mathivanan Sakthivel",
        "Vishal Saroye",
        "Stunt Silva",
        "Hemant Soni",
        "Srinivasan",
        "Preity Üpala"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "179",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": [
        "Dolby Digital",
        "DTS",
        "Dolby Atmos"
    ],
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "India:U",
        "Ireland:15A",
        "New Zealand:R16",
        "Norway:15",
        "Singapore:PG13",
        "South Africa:13",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United Kingdom:15::(withdrawn)",
        "United States:Not Rated"
    ],
    "original air date": "09 Aug 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjI3YzhlNjktMjdhYS00MmI3LWIyZGItN2VkNGVjMDAyYzZhXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2617676",
    "plot outline": "The film opens in the year 1988 with the death of Mumbai's King of Dharavi (Asia biggest slum) Varadarajan Mudaliar. Following his death, the rival group goes on a rampage and we are introduced to Anna (Satyaraj) who takes the job of protecting Varadarajan's Dharavi in his hands and letting his son Vishwa (Vijay) to be brought up in Australia. Over there he leads a dance troop and falls in love with Meera (Amala Paul). Later, Vishwa finds that Meera is a Mumbai cop and she pretend to be in love with him just to know about the locality of his father. His father is later killed by the scums of Mumbai and how Vishwa avenge his father's death and how he leads the Dharavi people forms the rest of the story.",
    "languages": "Tamil",
    "title": "Thalaivaa",
    "kind": "movie",
    "directors": "A.L. Vijay",
    "writers": "A.L. Vijay",
    "producers": [
        "C.P. Dinesh",
        "Chandra Prakash Jain",
        "C.P. Sunil",
        "Muskaan Khan Thakur"
    ],
    "composers": "G.V. Prakash Kumar",
    "cinematographers": "Nirav Shah",
    "editors": "Anthony",
    "editorial department": [
        "Rohit Karkera",
        "Nitin Minz"
    ],
    "casting directors": "Rahil Bathija",
    "art directors": "R.K. Naguraj",
    "costume designers": "Deepali Noor",
    "production managers": [
        "Kieran Cato",
        "Manivarma",
        "Jagdish Nandi"
    ],
    "assistant directors": [
        "Kompala Gautham",
        "Gokulakrishnan",
        "Victor Jayaraj",
        "Prasanna Jk",
        "Krishna Marimuthu",
        "Olga Miller",
        "Sarwar Mohammad",
        "Dhayakar P.",
        "Ragesh Ram",
        "Vishal Sanjeeva",
        "Kaarthikk Sundar",
        "Deepak Sundarrajan"
    ],
    "sound department": [
        "Ramachandran Anand",
        "Harish",
        "Manish Kamble",
        "Rajakrishnan M.R.",
        "Mesmin Santhosh"
    ],
    "visual effects": [
        "Binaya Ranjan Dash",
        "Ravee Gauttam",
        "Kotamraju Karthik",
        "Shivprasad Kawade",
        "Saurabh Lakshakar",
        "Ajit Patil",
        "Basannt Raj Singh",
        "Rudresh Vyas"
    ],
    "stunts": [
        "Amrin Abubakker",
        "Olga Miller",
        "Stunt Silva"
    ],
    "camera department": [
        "Sony Sasankan",
        "Tilak Raj Thakur"
    ],
    "music department": [
        "Sanjay Chandrasekhar",
        "Benny Dayal",
        "Bhanuka Fernando",
        "Haricharan",
        "Kiran",
        "G.V. Prakash Kumar",
        "Singer Megha",
        "Na. Muthukumar",
        "Pooja",
        "Vijay Prakash",
        "Saindhavi",
        "Malin Samarasekara",
        "Santhanam",
        "Shrihari",
        "Megha Sriram",
        "Sheezay Psycho Unit",
        "Joseph Vijay"
    ],
    "miscellaneous": [
        "Nikhil Murugan",
        "Shobi Paulraj",
        "Chinni Prakash",
        "Gayathri Raghuram",
        "Akshata Samant",
        "Sathish",
        "Dinesh Shikari"
    ],
    "thanks": [
        "Priyadarshan",
        "Mani Ratnam",
        "Ram Gopal Varma"
    ],
    "akas": [
        "Anna (India, Telugu title)",
        "Thalaivaa: The Leader (India, Hindi title)",
        "Leader (United States)",
        "Sanuja Siyapath (Canada, English title)",
        "Thalaiva - Le leader (France)"
    ],
    "writer": "A.L. Vijay",
    "director": [
        "A.L. Vijay",
        "A.L. Vijay"
    ],
    "production companies": "Mishri Productions",
    "distributors": [
        "Ayngaran International",
        "Parasakthi Films",
        "Tamil Cultural Centre",
        "Divo",
        "Sun TV"
    ],
    "other companies": [
        "AP International",
        "Cato Logistics",
        "Sony Music India"
    ],
    "plot": [
        "A son steps into his father's shoes and has to win a bloody war before he becomes the leader.",
        "The film opens in the year 1988 with the death of Mumbai's King of Dharavi (Asia biggest slum) Varadarajan Mudaliar. Following his death, the rival group goes on a rampage and we are introduced to Anna (Satyaraj) who takes the job of protecting Varadarajan's Dharavi in his hands and letting his son Vishwa (Vijay) to be brought up in Australia. Over there he leads a dance troop and falls in love with Meera (Amala Paul). Later, Vishwa finds that Meera is a Mumbai cop and she pretend to be in love with him just to know about the locality of his father. His father is later killed by the scums of Mumbai and how Vishwa avenge his father's death and how he leads the Dharavi people forms the rest of the story.::Sathya Kumar",
        "Vishwa, a dancer in Australia, lives a lives a peaceful life, and falls in love with Meera, one day and along with her dad and Meera, Vishwa comes to India, in order to discuss about their marriage. But upon landing in Mumbai, Vishwa realizes that his father has a dark past- he has no idea what and who he is, but he is confident that he's a good man, and a mass hero. In the process he ends up getting caught in several brawls and some big secrets unfold in front of him, which make him conscious that his real position should be in India, and not Australia. Upon realizing the dangers and encountering with thrilling events involving violence, Vishwa sets out to continue his father's legacy, and ends up becoming Anna: The mass leader, who had realized that he was \"Born To Lead\".::Prashast Singh",
        "A mafia don sends his son out of the country because he doesn't want even a shadow of his life falling on him. Destiny wills otherwise. The son makes an innocuous trip to Mumbai to visit his dad. And ends up filling his father's large shoes."
    ],
    "synopsis": "A dangerous riot takes place in a village in Mumbai. A Tamilian don and activist named Ramadorai and his men retaliate to save the civilians including his close friend Ratnam and the his son Logu. Ramadorai and his associates fight for the freedom rights of Tamil civilians that are attacked by dangerous family gangs who oppose. Ramadorai's rival Badhra challenges his power so his people suggest that he takes refuge in Chennai. He initially refuses hoping to continue helping them, but that night Badhra's men attempt to assassinate him and he's saved by his wife Ganga, who takes the bullets for him. Ramadorai angrily storms Badhra's house and murders his men and eventually him, right in front of his teenage son Bhima. Ramadorai hands over his young son Vishwa to Ratnam asking him to promise to take care of him as his life will be in constant danger with Ramadorai.Many years later, Ramadorai is shown to operate as a vigilante using violence to serve justice. He is informed by a fellow advocate that an actor had sexual assaulted a young maid but used his wealth and influence to cover any witnesses from seeing him. Ramadorai has his men disguise themselves as actors in the action movie he's filming and stab the actor for real in a duel scene. The director is horrified but is told to keep clear of the men. Ramadorai also rejects a dealer's proposal to build an apartment complex realizing he wishes to use any funds to invest to buy a port for profit. Ramadorai calls up Vishwa who is now grown up and living in Sydney, Australia as a famous single with his own dancing troupe called \"Tamil Pasanga\"(translating to Tamil kids/boys). They are rejected by a judge panel so Vishwa calls up Logu who is now his close friend and helps him run a water delivery business. They use his truck to make a public performance despite him having an assignment, and enter the competition with the judges approval, much to the frustration of a rival troupe. Ramadorai calls Viswha to check on him without revealing his work in Mumbai and advises him on being a kind and successful man. Since the performance impeded Logu's delivery, he's scolded by Vishwa in front of the client as if he doesn't know what happened.Vishwa and Logu later meet a girl named Meera Narayanan, and they become acquainted with her and her father who manage a restaurant in town. The food is proven to be terrible as their cook Mathandaram is new as is the resturant. Meera's father is actually one of their clients and Viswha tells him about how he named the company after his water. Logu has been seeking a girl for a while and attempts to ask her out, but finds that it's actually a regular trend with a lot of local bachelors. Meera becomes close friends with the troupe members and learns of their performances, and invites them to come to the restaurant to sample their food. They hate the food but Vishwa suppresses their comedic distaste just to impress Meera. Meera actually shows interest in joining the troupe and Vishwa decides to help teach her. In an attempt to get close Logu also decides to give it a shot. It doesn't stop there, as the bachelors Logu met earlier beg to join too. Meera also discloses that she is actually married to a well known singer Sam Andreson, which later turns out to be a ruse just to keep annoying guys off her trail as proven by Vishwa when he invites Sam just to disclose it. The two later develop feelings for each other and begin a relationship.Meera's father asks if they should pay visit to Ramadorai. Despite protest from his uncle Ranga due to the circumstances, Vishwa, Meera, and her dad fly to Mumbai. They are brought into the country and to Ramadorai's residence discretely, leading to all of them being suspicious of his activity. Their taxi is actually escorted by several others to an abandoned school and Vishwa's driver is shown to be armed. Ramadorai is escorted to his father's residence in secret by several of his contacts. When Vishwa finally sees his father again he demands to know what he is doing and Ramadorai tells him of his operation, protecting Tamil residents from ethnic and racial hate violence. He confirms how he murdered Badhra on the night Viswha was sent away and that his son Bhima retaliated. He starts a shoot out to kill Ramadorai but misses. Bhima is arrested but paroled after he's grown up. Bhima takes charge of his father's gang and uses his political contacts and influences to strategically frame Ramadorai for illegal drug and weapon smuggling in addition to many other false crimes. They use this to their advantage to kill Ramadorai's associates and even frame him for it. This drastically bashes his reputation in the city portraying him as a criminal. Ramadorai has since been a fugitive of the law and has gone into hiding refusing to surrender as it would mean abandoning his duties to protect his supporters from Bhima.Ramadorai tries to speak to Meera's father about his position but he is surrounded by armed men. Ramadorai fights them but is held back by Meera and her father, whose actually not her father at all. They're revealed to be police operatives and the man posing as a father is Meera's chief, and that the only reason they befriended Vishwa was to nab his father. Vishwa is angered at their deception as Ramadorai is taken to custody, and a bomb that was planted in the van goes off killing him. Vishwa sees on the other side of the smoke that Bhima and his men have planned the entire thing and escape in front of the public's eyes. Ramadorai's death causes conflict between the public and the law. Meera asks the chief to take action against Bhima as he begins to extort wealthy land owners for money in demonstration for power. Ramadorai's men and contacts wish to take Vishwa's leadership to help the people he supports. Despite Ranga's opposition for his safety Viswha chooses to stay behind when he sees Bhima's men assaulting a civilian, possibly an extortion victim who went against Bhima, and fends them off.This causes Bhima to recognize his ambition and he sends his men to kill Viswha. Viswha brutally murders all of the men and hangs them from a tree, and more of Bhima's men joined by police attempt to finish him when he impedes the earlier construction scheme. The people whom Ramadorai saved however stand by him. Viswha is beaten in police custody and is confronted by Bhima for interference. Bhima initially tries to kill him but the inspector stops him for legal reasons. He's also visited by Meera who intends to apologize but gets nothing. Vishsa is released after trial when Meera busts him out of the station where Bhima has loyal men and takes the mantle of leadership of his father's gang to stop any criminals in the city through violent means. Over time he gains popularity of the people.A cameraman named Kumar later overhears a plan by Bhima's men to draw him into a trap at a Maharashran protest, the group of people who are against Tamil residence. They disguise themselves as protesters and civilians to start a riot between both sides and plot to kill Viswha when he plans to interfere. As per plan he does and saves many civilians in addition to reforming the protestors. The whole plot is recorded by Kumar who escapes with the drive but is caught by Bhima's men. Logu later pays visit to Vishwa and finds out about his cause, and attempts to help in any way.Vishwa and Bhima simultaneously trace the owner of the lost video drive when they find out Kumar was pickpocketed. They are led to a thief named Nandhu and manage to intercept him before Bhima, but Viswha's men are taken by the police under Bhima's loyalty. Vishwa manages to jail Bhima for proving he authorized the riot. He actually escapes but by then Viswha kills one of the ministers who support him and blame that on him as well. The police loyal to Vishwa become independent after Bhima breaks from custody again.Later that night, Bhima's men brutally kill everyone of Ramadorai's friends who live with Viswha while he attends a party. A woman named Gowri saves his life when Vishsa saves hers at the riot. She too is killed and Vishwa heads to confront Bhima once and for all. He heads to an abandoned building where his uncle was apparently taken hostage. He saves Ranga and is surrounded by Bhima's troops. Vishwa is both literally and figuratively stabbed in the back by his uncle at the same time, and it's revealed that he's been a double agent working against his brother the whole time. Ranga exits the building leaving wounded Vishwa behind and finds Viswha's cousin, his son with him and tells him Vishwa offered to stay behind. He reveals that the whole time he's hated both gangs and wished to take charge himself when they dish it out. His son drives them both into a tanker truck and they are killed in an explosion.Vishwa hides himself and stealthily takes out each of Bhima's men and confronts him in a duel. He kills Bhima by stabbing him in the neck with his own blade. Meera is called to the scene and she saves Vishwa from murder charges by claiming to shoot Bhima in self defense after shooting the corpses. They have brought peace to Mumbai and years later, Vishwa is married to Meera and is the ruling don of the city."
}