{
    "id": "2638104",
    "localized title": "Biriyani",
    "cast": [
        "Karthi",
        "Hansika Motwani",
        "Premgi Amaren",
        "Ramki",
        "Nitin Sathya",
        "Madhumitha",
        "Mandy Takhar",
        "Nassar",
        "V. Jayaprakash",
        "Sampath Raj",
        "Shanmuga Sundharam",
        "Subbu Panchu",
        "Uma Riyaz Khan",
        "Prem Kumar",
        "Badava Gopi",
        "Tharika",
        "Sam Anderson",
        "Honey Rose",
        "Leena Maria Paul",
        "Aadhavan",
        "Mithun",
        "Jai",
        "Aravind Akash",
        "Vaibhav Reddy",
        "Vijay Vasanth",
        "Vijayalakshmi"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Thriller"
    ],
    "runtimes": "148",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Atmos",
    "certificates": [
        "Australia:M",
        "France:Tous Public",
        "India:UA",
        "Norway:15",
        "Singapore:PG13",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "20 Dec 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGUzNDFiOTUtZWM2ZS00ZjYwLTk4YjUtMDA5MTgzOTU4M2ZjXkEyXkFqcGdeQXVyODk1MzE5NDA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "2638104",
    "plot outline": "Karthi (Sugan), is a playboy who seems to have had a style makeover with his trendy clothes, new hairstyle and colored eye lens. Despite having a gorgeous girlfriend Priyanka (Hansika), Sugan flirts with all the pretty women he meets and they too, are besotted by him. Sugan, on a journey with his childhood friend Parasu (Premji) stops at a roadside eatery for biriyani (food), his weakness. But they gets into a problem after having the dish.",
    "languages": "Tamil",
    "title": "Biriyani",
    "kind": "movie",
    "directors": "Venkat Prabhu",
    "writers": [
        "D.S. Kannan",
        "",
        "Venkat Prabhu"
    ],
    "producers": [
        "K.E. Gnanavelraja",
        "S.R. Prabhu"
    ],
    "composers": "Yuvan Shankar Raja",
    "cinematographers": "Saravanan",
    "editors": [
        "Praveen K.L.",
        "Srikanth N.B."
    ],
    "sound department": "Vajjiravel Varun",
    "visual effects": [
        "Eran Dolev",
        "Harihara Suthan"
    ],
    "stunts": "Stunt Silva",
    "camera department": [
        "Sivasudhan Balamanohar",
        "A. Thamizhazhagan"
    ],
    "music department": [
        "Gangai Amaran",
        "Premgi Amaren",
        "Vijay Antony",
        "Gaana Bala",
        "Devan Ekambaram",
        "Priya Hemesh",
        "D. Imman",
        "Karthi",
        "G.V. Prakash Kumar",
        "Ramya N.S.",
        "Rahul Nambiar",
        "Bhavatharani R.",
        "Yuvan Shankar Raja",
        "Tanvi",
        "S. Thaman",
        "Psycho Unit",
        "Vaali",
        "Vilasini"
    ],
    "miscellaneous": [
        "Blanche Aurore Duault",
        "Gokulakrishnan",
        "Naveen Varadarajan"
    ],
    "akas": "Бирьяни (Russia)",
    "writer": [
        "D.S. Kannan",
        "Venkat Prabhu"
    ],
    "director": "Venkat Prabhu",
    "production companies": "Studio Green",
    "distributors": [
        "Night Ed Films",
        "Sun TV"
    ],
    "other companies": [
        "Dakshaa",
        "Sony Music India",
        "Unique Studios"
    ],
    "plot": [
        "The desire for biryani after drinks lands two friends in an endless frenzy as they get framed for a kidnapping and go on the run.",
        "Karthi (Sugan), is a playboy who seems to have had a style makeover with his trendy clothes, new hairstyle and colored eye lens. Despite having a gorgeous girlfriend Priyanka (Hansika), Sugan flirts with all the pretty women he meets and they too, are besotted by him. Sugan, on a journey with his childhood friend Parasu (Premji) stops at a roadside eatery for biriyani (food), his weakness. But they gets into a problem after having the dish.::Surya Kumar",
        "Sugan, a compulsive flirt, and his friend Parasu, go after Maya, a sexy woman they encounter at a biriyani eatery, in the hopes of a promiscuous night. They get drunk and pass out, and when they wake up, they find the cops on their heels, blaming them for the disappearance of business magnate Varadarajan.::Shrinivas G. Kulkarni"
    ],
    "synopsis": "The film opens with a car chase involving cops and two friends, Sugan and Parasuram. As their car jumps from the edge of a flyover, the film starts unfolding in flashback. It is shown that Sugan is a womanizer and this attitude gets him into trouble with his reporter girlfriend Priyanka and the childhood friend Parasu who is unable to get a girlfriend due to Sugan's playboy nature. One day, the duo visits a function for opening a branch of one of their offices, where they meet Varadharajan, the chief guest. In the meantime, a CBI officer Riyaz Ahmed has been deputed to track Varadharajan's illegal activities. Due to some error, Priyanka's paper containing questions for Varadharajan gets misplaced and realizing it's partly his fault, Sugan covers for her by interviewing Varadharajan. He tells everyone about him in detail, which impresses Varadharajan who has no idea Parasu is helping him with all the information via internet and an earpiece. Varadharajan is impressed with Sugan and wants to make him his son-in-law, which gets him into an argument with his elder son-in-law Vijaykrishna.Varadharajan later hosts a cocktail party and invites Sugan who craves biryani after getting drunk and while returning with Parasu, searches for a biryani shop. Finding one, the two stop to eat and Sugan spots an attractive young woman Maya. The two start driving after her and find her car broken down. They decide to give her a ride to her hotel, where she attracts the two men inside, dances with them and gets them drunk. Soon, Varadharajan arrives and it's revealed she's his mistress. Sugan sees him but being heavily drunk, is unable to explain the same to Parasu. The next morning, he wakes up in his car parked outside the Biryani shop and searches for Parasu. He returns to the hotel to find Parasu unconscious with a gun next to him. The duo then find some blood on the bed and as they're trying to flee, cops looking for Varadharajan since his unexpected disappearance nab them. Riyaz meets Vijaykrishna and AC Sampath, Varadharajan's family police officer, and decides to tag along as the latter leaves for the hotel. The cops, on the other hand, try to interrogate the duo, revealing the hotel was booked in Sugan's name and he was caught on camera bringing Varadharajan to the room. Realizing they're being framed, Sugan fights back. A fight ensues, resulting in their escape in the car inside the trunk of which they discover Varadharajan's corpse.Arriving at the crime scene, Sampath and the cops discover the evidence and conclude the friends are the perpetrators. Sugan and Parasu try to think of ways to dispose of the corpse, but run into trouble when the police vehicles chase after them. A huge car chase ensues, during which the two are publicly declared suspects and Varadharajan is considered kidnapped. Near the end of the car chase, the flyover reaches a dead end and their car jumps, leaving behind the cops and escaping. Back to the present time, the duo enlists the help of a friend, and forward Maya's photograph, clicked during her dance, to all their friends. The next day, one friend finds Maya at the Egmore Railway Station, where a female assassin disguised as a cop is ordered to take her out. As she pursues Maya, a flash mob creates public distraction and Sugan takes Maya inside the train, making her reveal she spiked their drinks on the orders of a cop. However, the assassin manages to kill Maya by pushing her in front of a train, and Sugan chases after her. Following a brief hand-to-hand fight, the assassin manages to escape but leaves her phone behind in a rush. Sugan retrieves it and gets it decoded with the help of a friend. They learn she is not a cop but an assassin whose next target is Sugan's sister Varalakshmi. Sugan tries to alert his friend and brother-in-law who are returning from a temple with Varalakshmi. The trio's vehicle is attacked by goons, the men are beaten up badly and Varalakshmi is taken away as Sugan arrives and helplessly chases after the van. However, the goons are ordered to return and get hold of Sugan instead, and this results in another big fight as an enraged Sugan beats up the goons while the assassin flees with the van containing Varalakshmi. Sugan realizes it but in vain. His brother-in-law is admitted to the hospital and somehow manages to survive. Sugan receives a call from Vijaykrishna asking him to hand over Varadharajan in exchange for Varalakshmi's return.Sugan decides to make Parasu impersonate Varadharajan for that to happen. They arrive at the chosen spot, where Sugan and Vijaykrishna start fighting while the assassin fights Sampath. Sugan's friends, lead by Priyanka, discover Varalakshmi and free her along with Riyaz. The plan plays out well when during the fight, Parasu emerges as Varadharajan and fakes his death before telling Viaykrishna he (Parasu) and Sugan are innocent. It is revealed that Vijaykrisha doesn't know anything about Varalakshmi's whereabouts and came because he believes Sugan asked for money in exchange for Varadharajan. Sugan also fights the assassin who is then shot by an officer named ACP Vikram. Sugan and Parasu's names are cleared, but are charged with attacking cops and property. A few days later at Varadharajan's funeral, Sugan learns the truth about Varadharajan's death. Avinash was in love with Varadharajan's daughter for money only, but Sugan and Parasu stopped their love on the way to the new branch opening. Avinash uses his brother to get his love back by bringing Sugan and Parasu using Maya and that Maya used drugs to make Sugan and Parasu very drunk. Then, the assassin comes by killing Maya so that she does not tell the truth to Sugan. Sugan figures out that it was no one other than Vikram, Avinash's brother who was behind everything. Soon Riyaz and Vijaykrishna also find out the truth. Riyaz tells Sugan to kill Vikram, Sugan fights with Vikram, and they both fall from the office into the swimming pool below. What happens to either of them is unknown."
}