{
    "id": "2934644",
    "localized title": "Kangal Malsat",
    "cast": [
        "Kamalika Banerjee",
        "Dibyendu Bhattacharya",
        "Joyraj Bhattacharya",
        "Kaushik Ganguly",
        "Santilal Mukherjee",
        "Dilip Sarkar",
        "Kabir Suman"
    ],
    "genres": "Fantasy",
    "runtimes": "113",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:A",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzc2NjY3MGEtNTRhYy00Yzc0LWFjNWYtZTY1NzRjYThiOGYwXkEyXkFqcGdeQXVyNjA3OTI5MjA@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "2934644",
    "plot outline": "Fyataroo: Flying human beings; Choktor: Black Magic sect Bhodi, the head of the Choktors, initiates a total war against the ruling communists of West Bengal, India. Fyataroos join hands with Choktors. Advised by Calcutta's progenitors Dandabayash (ageless primordial talking crow) and an Indo-colonial half-breed Begum Johnson(1732-1818) erupt a historic insurrection. They jointly launch guerrilla attacks against the Government. Skulls dance in crematoria and flying-discs flutter in the skies and cry anarchy, resident ghosts gossip and prattle, and the police is in total confusion. Government is forced to surrender and offer a peace proposal to the joint force. The film dissects almost everything wrong in the city with a cinematic knife sharpened on trenchant farce and fantasy. It is an anarchist film.",
    "languages": "Bangla",
    "title": "Kangal Malsat",
    "kind": "movie",
    "directors": "Suman Mukhopadhyay",
    "writers": [
        "Nabarun Bhattacharya",
        "",
        "Suman Mukhopadhyay"
    ],
    "producers": [
        "Mallika Jalan",
        "Pawan Kanodia"
    ],
    "composers": "Mayookh Bhaumik",
    "cinematographers": "Avik Mukhopadhyay",
    "editors": "Arghakamal Mitra",
    "production designers": "Sanchayan Ghosh",
    "make up department": "Mohammad Ali",
    "sound department": [
        "Sukanta Majumdar",
        "Adeep Singh Manki",
        "Anindit Roy"
    ],
    "visual effects": "Krishnendu Ghosh",
    "miscellaneous": "Anustup Basu",
    "akas": "Kangal Malsat (India)",
    "writer": [
        "Nabarun Bhattacharya",
        "Suman Mukhopadhyay"
    ],
    "director": "Suman Mukhopadhyay",
    "other companies": "Editfx Studios",
    "plot": "Fyataroo: Flying human beings; Choktor: Black Magic sect Bhodi, the head of the Choktors, initiates a total war against the ruling communists of West Bengal, India. Fyataroos join hands with Choktors. Advised by Calcutta's progenitors Dandabayash (ageless primordial talking crow) and an Indo-colonial half-breed Begum Johnson(1732-1818) erupt a historic insurrection. They jointly launch guerrilla attacks against the Government. Skulls dance in crematoria and flying-discs flutter in the skies and cry anarchy, resident ghosts gossip and prattle, and the police is in total confusion. Government is forced to surrender and offer a peace proposal to the joint force. The film dissects almost everything wrong in the city with a cinematic knife sharpened on trenchant farce and fantasy. It is an anarchist film.::Anonymous",
    "synopsis": "Fyataroos: Flying human beings. Choktors: Black Magic sect.\nBhodi, the head of Choktars, initiates a total war against the Communist Government of West Bengal. Fyataroos join hands with Choktors. Advised by Calcuttas progenitors Dandabayas (ageless primordial talking crow) and an Indo-colonial half-breed Begum Johnson (a contemporary of Job Charnock 1630-1692 and Warren Hastings 1732-1818) erupt a historic insurrection of Fyataroos and Choktors. They jointly launch guerrilla attacks against the Government. Total chaos is unleashed in the city of Calcutta. The film dissects almost everything wrong in the city with a cinematic knife sharpened on trenchant farce and fantasy. Collective schizophrenia sets in. There is hardly anything by way of a story, but what little there is involves two groups of rebels, the lowly Choktors and the aerial Fyataroos, mobilised by the quack occultist Bhodi Sarkar to fight against the West Bengal Government. In the melee that explodes, the Choktors unearth cannons underground, the Fyataroos bomb administrative buildings and the Police HQ with brickbats, and the poor cops have no answer to the assault. And that reflects the seething rage barely underlying the chaotic calm. Skulls dance in crematoria and fantastic flying-discs flutter in the skies and cry anarchy, resident ghosts gossip and prattle, and the police officers are in total confusion. Government and Police are forced to surrender and offer a peace proposal to the joint force. Peace comes to the city, but as a result of this mutiny, the Communist Government loses it power in the State."
}