{
    "id": "3028362",
    "localized title": "Shabdo",
    "cast": [
        "Ritwick Chakraborty",
        "Raima Sen",
        "Churni Ganguly",
        "Srijit Mukherji",
        "Victor Banerjee",
        "Pradip Rai",
        "Rajat Ganguly",
        "Arun Guhatharkurta",
        "Samita Saha",
        "Bidyut Das",
        "Manjula Poley",
        "Mridul Majumdar",
        "Piyali Basu",
        "Rana Paul",
        "Parna Ghatak",
        "Rajdeep Ghosh",
        "Chandrasish Ray",
        "Ashok Mukherjee",
        "Indranath Mukherjee",
        "Sanjoy Bhattacharjee",
        "Kaushik Ganguly"
    ],
    "genres": "Drama",
    "runtimes": "104",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "original air date": "12 Apr 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNWYzZjgyYzQtMTM3Mi00NzVkLWI1MWYtMzQ0Yzg0NTczYzgzXkEyXkFqcGdeQXVyNjA3OTI5MjA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3028362",
    "plot outline": "Tarak is a professional foley artist whose obsession with creating sound effects for films makes him oblivious to all the talking around him. As his family and friends struggle to cope up with his changing soundscape, Dr Swati tries to figure out the roots of his obsession and finally succeeds to identify. Yet, Tarak plunges deeper and deeper into the world of the unheard as his love for cinema is unplugged.",
    "languages": "Bangla",
    "title": "Shabdo",
    "kind": "movie",
    "directors": "Kaushik Ganguly",
    "writers": "Kaushik Ganguly",
    "producers": "Goutam Kundu",
    "cinematographers": "Sirsha Ray",
    "editors": "Mainak Bhaumik",
    "editorial department": "Srimanta Dolui",
    "production designers": [
        "Mridul Baidya",
        "Saswati Karmarkar"
    ],
    "art directors": [
        "Mridul Baidya",
        "Saswati Karmarkar"
    ],
    "assistant directors": "Rajdeep Ghosh",
    "sound department": [
        "Dipankar Chaki",
        "Adeep Singh Manki",
        "Anindit Roy",
        "Bhaskar Roy",
        "Anirban Sengupta"
    ],
    "visual effects": "Vaibhav Vaidya",
    "miscellaneous": "Soumya Sarkar",
    "akas": "Shabdo (India)",
    "writer": "Kaushik Ganguly",
    "director": "Kaushik Ganguly",
    "production companies": "Brand Value Communications",
    "plot": "Tarak is a professional foley artist whose obsession with creating sound effects for films makes him oblivious to all the talking around him. As his family and friends struggle to cope up with his changing soundscape, Dr Swati tries to figure out the roots of his obsession and finally succeeds to identify. Yet, Tarak plunges deeper and deeper into the world of the unheard as his love for cinema is unplugged.::soundthefilm.com Official Site for film",
    "synopsis": "The protagonist of the film is Tarak Dutta, a foley artist. He is so obsessed with his work that he loses his grip on words and his mind starts registering only foley sounds.The film starts showing Tarak's distraught wife who has taken him to a psychiatrist for treatment because she feels that he lives in a world of his own. The psychiatrist (Churni Ganguly) discovers that actually there is nothing wrong with Tarak's hearing ability. He just concentrates so much on background sounds that he does not pay attention to vocal sounds. While the doctor is speaking to him, Tarak is busy listening to the sounds of traffic in the streets or the sound of the Rubik's cube that she is holding in her hands. The doctor tries to convince Tarak that he has a serious problem and he needs treatment. But Tarak is not ready to believe that he has any problem. On the doctor's advice Tarak's wife take him to Siliguri for a short holiday. Even there Tarak keeps listening to all the natural sounds like the twittering of birds or the gush of water in a mountain spring. On the trip, Tarak tries to convince his wife that there is nothing wrong with him. He just keeps thinking about sounds because that's his job.Tarak starts rebelling against the doctor and refuse to take treatment. Things come to a head, when the doctor tries to talk to him through headphones at this recording studio and Tarak breaks the mike in anger. With all her efforts gone to waste the doctor refers him to her professor (Victor Banerjee). Tarak loses his job and becomes quite depressed. He is always haunted by sounds and without his job he starts feeling dis-oriented. One day he tries to commit suicide. Finally, the doctors send Tarak to a rehabilitation center where he is made to listen to recorded human voices daily to get back to normal."
}