{
    "id": "3037398",
    "localized title": "Ganesh Talkies",
    "cast": [
        "Biswajit Chakraborty",
        "Pallavi Chatterjee",
        "Rita Koiral",
        "Chandan Roy Sanyal",
        "Raima Sen",
        "Rajesh Sharma"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "132",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "India:UA",
        "Singapore:PG"
    ],
    "original air date": "21 Jun 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDIzZGUyODItYzkxMS00ODRjLTkxZWYtMWU1OTA3YTdkMWY5XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3037398",
    "plot outline": "Pashupati Ghosh (Bengali) and Pravin Agarwal (Marwari) are childhood friends living in the older part of Kolkata. Pasupati's ancestral business is in the doldrums. His only possession is his huge mansion, which the local promoter Sharma is after. Builder Sharma has employed the local hoodlum Keshto to forcibly vacate Pashupati's mansion. Pravin's ancestral business of manufacturing crackers is doing well. He also owns a cinema hall called Ganesh Talkies which is almost defunct. Pravin's NRI brother Navin, who has lost his job in the US is back and is secretly making a deal to sell Ganesh Talkies to builder Sharma and open up a restaurant. Sharma is using Navin to help him get Pashupati's mansion too. Pasupati's daughter Saban is getting married to a young NRI called Nicky from Boston. Pravin is bearing most of the cost. Parvin's carefree, unemployed son Arjun, is like Saban's brother who is taking care of all the arrangements such as catering, the construction of the shamiana, sending guest cards. Shibu, the sevant of Pasupati is secretly trying to elope with Manda, the maid of Pravin's house. Nicky arrives from the US. Nicky and Shaban, chaperoned by Arjun meet in a hotel to get to interact freely. Nicky is told that Saban is in love with Arjun. Since their fathers are like brothers and will not agree they wanted this marriage to be cancelled. And so they were waiting for Nicky to cancel it. All Nicky has to do is say he doesn't like Saban. Nicky is stunned and goes home to spill the beans... All hell breaks loose. The best of friends Pasupati and Pravin now show their true communal colors. The age old clash between the Marwari and the Bengali surfaces. All relationships are severed. Pashupati refuses Pravin's money and sells his house to Sharma to get money and is hell-bent to get Saban married to Nicky. Arjun and Saban plan to elope...So does Shibu and Manda... Ganesh Talkies is a comic drama about the love hate relationship between the two Hindu communities who finally through a lot of dramatic conflict, hilarious situations, even fights and action end up coming together. A story of true friendship and values that withstand the test of time.",
    "languages": "Bangla",
    "title": "Ganesh Talkies",
    "kind": "movie",
    "directors": "Anjan Dutt",
    "writers": "Anjan Dutt",
    "producers": [
        "Sanjay Pathak",
        "Mahesh Ramanathan",
        "Sani Ghosh Rao"
    ],
    "composers": "Neel Dutt",
    "cinematographers": "Indranil Mukherjee",
    "editors": "Arghakamal Mitra",
    "editorial department": [
        "Prosenjit Banerjee",
        "Gourab Dutta"
    ],
    "assistant directors": [
        "Dipak Bandyopadhyay",
        "Abhrajit Sen"
    ],
    "sound department": [
        "Adeep Singh Manki",
        "Anindit Roy"
    ],
    "camera department": [
        "Vikas Bajaj",
        "Stanley Mudda"
    ],
    "miscellaneous": "Sukalyan Bhattacharya",
    "akas": "Ganesh Talkies (India)",
    "writer": "Anjan Dutt",
    "director": "Anjan Dutt",
    "production companies": "Reliance Entertainment",
    "distributors": "Reliance Entertainment",
    "other companies": [
        "A Grinning Tree Production",
        "Editfx Studios",
        "Editfx Studios"
    ],
    "plot": [
        "Pashupati Ghosh (Bengali) and Pravin Agarwal (Marwari) are childhood friends living in the older part of Kolkata. Pasupati's ancestral business is in the doldrums. His only possession is his huge mansion, which the local promoter Sharma is after. Builder Sharma has employed the local hoodlum Keshto to forcibly vacate Pashupati's mansion. Pravin's ancestral business of manufacturing crackers is doing well. He also owns a cinema hall called _Ganesh Talkies_ (qv) which is almost defunct. Pravin's NRI brother Navin, who has lost his job in the US is back and is secretly making a deal to sell _Ganesh Talkies_ (qv) to builder Sharma and open up a restaurant. Sharma is using Navin to help him get Pashupati's mansion too. Pasupati's daughter Saban is getting married to a young NRI called Nicky from Boston. Pravin is bearing most of the cost. Parvin's carefree, unemployed son Arjun, is like Saban's brother who is taking care of all the arrangements such as catering, the construction of the shamiana, sending guest cards. Shibu, the sevant of Pasupati is secretly trying to elope with Manda, the maid of Pravin's house. Nicky arrives from the US. Nicky and Shaban, chaperoned by Arjun meet in a hotel to get to interact freely. Nicky is told that Saban is in love with Arjun. Since their fathers are like brothers and will not agree they wanted this marriage to be cancelled. And so they were waiting for Nicky to cancel it. All Nicky has to do is say he doesn't like Saban. Nicky is stunned and goes home to spill the beans... All hell breaks loose. The best of friends Pasupati and Pravin now show their true communal colors. The age old clash between the Marwari and the Bengali surfaces. All relationships are severed. Pashupati refuses Pravin's money and sells his house to Sharma to get money and is hell-bent to get Saban married to Nicky. Arjun and Saban plan to elope...So does Shibu and Manda... _Ganesh Talkies_ (qv) is a comic drama about the love hate relationship between the two Hindu communities who finally through a lot of dramatic conflict, hilarious situations, even fights and action end up coming together. A story of true friendship and values that withstand the test of time.::Anonymous",
        "A family drama based on two families belonging to the polar opposite Bengali and Marwari communities. The film centers on childhood friendship, a probable wedding and above of all the triumph of young love, Pashupati Ghosh the patriarch of the Bengali family lives gregariously but still in denial of his waning wealth. Whereas his neighbour Nitin Agarwal although has amassed a great deal of wealth over the course of years, lives a miserly life. Differences of opinions, scheming family members, shifting cultural dynamics and a secret love that has blossomed despite of all odds forms the crux of this film, the love between Saban and Arjun is one where Chana plays the messenger delivering clandestine notes from one lover to another. Drama unfolds when both the families come to know about Saban, Arjun, and their plan to elope. Just when Saban is to be married to a Bangalore based computer engineer Niky. Underlying tensions erupt and bubble to the surface, each family blames the other. Amidst this entire ruckus, Saban is locked inside her room and attempts suicide. She is rushed to the hospital where they refuse to let Arjun visit her. On the other hand, Pushupati is constantly threatened by the local goon Krishnagopal Das to vacate his property. Rajpal the nephew of Nitin Agarwal who has had his eyes set on the property for a long time is carrying out this plan. Arjun intervenes and is mortally injured, he is rushed to the I.C.U. where immediate blood in needed. Krishnagopal willingly steps in to donate blood and their blood groups miraculously match each other. In the process, Krishnagopal saves Arjun's life. The two families eventually unite and it seems that a wedding is in store after all!::Reliance Entertainment"
    ]
}