{
    "id": "3067260",
    "localized title": "Om 3D",
    "cast": [
        "Nandamuri Kalyan Ram",
        "Nikesha Patel",
        "Karthik",
        "Rao Ramesh",
        "Sithara",
        "Suresh",
        "Sampath Raj",
        "Raghu Kumar Karumanchi",
        "Aahuthi Prasad",
        "Chinna",
        "Anitha Chowdary",
        "Kriti Kharbanda",
        "Nagineedu",
        "Prabhakar",
        "Vijaya Sai",
        "Surya",
        "Surekha Vani"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "107",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "19 Jul 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYWVkMTg5YWMtNzQ3MS00OTBkLWIwNTMtNTgwNmI3OWVhZjUwXkEyXkFqcGdeQXVyNDY5MTUyNjU@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "3067260",
    "languages": "Telugu",
    "title": "Om 3D",
    "kind": "movie",
    "directors": "Sunil K. Reddy",
    "writers": [
        "Srinivas Chakravarthi",
        "",
        "Sunil K. Reddy"
    ],
    "producers": "Nandamuri Kalyan Ram",
    "composers": [
        "Achu",
        "Sai Karthik"
    ],
    "cinematographers": "Ajayan Vincent",
    "editors": "Gautham Raju",
    "editorial department": [
        "Maja Jacob",
        "Balaji Vathiyanathan"
    ],
    "art directors": "Kiran Kumar Manne",
    "assistant directors": "Kolipaka Raju",
    "visual effects": [
        "Antany Baskaran",
        "Balaji Chanda",
        "Suyash Chhabra",
        "Prateeti Khare",
        "Markus Lanxinger",
        "Avadhut Nerurkar",
        "Kokkula SaiPrasad",
        "Kalyana Sandeep",
        "Kalyan Sirna",
        "Harsha Vardhan"
    ],
    "camera department": [
        "Markus Lanxinger",
        "Ashish Mittal",
        "Surabhi Khetan Mittal"
    ],
    "animation department": "Kaithapulla Ramakrishna",
    "music department": [
        "Balaji",
        "Haricharan",
        "Priya Hemesh",
        "Bindhu Mahima",
        "Ramya N.S.",
        "Ranjith",
        "Ramajogayya Sastry",
        "Sirivennela Seetharama Sastry",
        "Baba Sehgal",
        "Chinmayee Sripada"
    ],
    "miscellaneous": [
        "Siva Kiran",
        "David Taylor"
    ],
    "akas": "Om",
    "writer": [
        "Srinivas Chakravarthi",
        "Sunil K. Reddy"
    ],
    "director": "Sunil K. Reddy",
    "production companies": "NTR Arts",
    "distributors": "Blue Sky Cinema",
    "special effects": "Prism & Pixels",
    "other companies": [
        "Puri Sangeet",
        "Skywork Studios"
    ],
    "plot": "Arjun shares a deep bond with his father Harishchandra, an influential man with many enemies. As Arjun sets out to thwart the plans of the enemies to kill his father, he learns a shocking truth.",
    "synopsis": "Arjun is filled with remorse after his father's death and sets out to kill those responsible.A flashback shows a rivalry between Harischandra Prasad, his father and Byreddy, a corrupt politician. The latter kidnaps the former in order to prevent himself from getting exposed, but Arjun fights the whole gang alone and rescues his father. An enraged Byreddy gets an years old rival, Bhavani, bailed from prison. Both of them join hands due to their common goal: killing Harishchandra Prasad.One day, while walking on the road, a woman named Anjali saves Hari from a car accident, causing Arjun to respect and eventually fall for her. One day, while she departs out of city, Arjun meets her and eventually a gunfight ensues between him and Bhavani. Arjun's uncle Lakshman saves him, and after being requested to do so, Hari tells Arjun the truth: Hari's father Vishnu Prasad used to be a revered man in their village, with Bhavani as his right hand. They used to share a deep bonding until the day Vishnu came to know about the illegal weapon trade Bhavani was involved in, causing the latter to kill Vishnu and then get arrested. Hari was the one who got him punished by the law, and that's the reason behind Bhavani chasing after his life.In the meanwhile, Riya, the daughter of Hari's friend Ajay arrives in India and starts staying with them. During Holi, Arjun invites Anjali to his house and introduces her to his mother who accepts their relationship. However, unaware of the truth, Hari wants Arjun to marry Riya. A heartbroken Anjali walks away and Arjun goes to stop her, during which Ajay gets killed by Bhavani who escapes without getting noticed. An enraged Ajay fights Byreddy's goons all by himself and arranges for a meeting with Bhavani. Lakshman accompanies him, but when the time comes to shoot, Bhavani uses Anjali as a shield and escapes away. It is then revealed that Anjali has been working for Bhavani.Arjun soon reveals to his father about his love for Anjali, but is shattered to learn from Lakshman the entire trap set by her and Bhavani. The story then cuts to the present time, where Arjun calls Riya to meet at the mountain area outside the city. He kills all the goons present there by himself, and then proceeds to shoot Riya in the head. In a car chase that ensues, he also kills Byreddy and his goons. Another flashback occurs, revealing how Anjali refused to work for Bhavani anymore after falling in love with Arjun for real. It's also revealed that Lakshman was involved in illegal weapon trade. Anjali meets Arjun and begs for forgiveness, but is interrupted by Riya. Arjun feels Anjali is not lying and Hari agrees to meet her. However, Riya gets Anjali injured in a car accident, following which she is admitted to the hospital where Byreddy and Lakshman convince Hari of Bhavani's involvement in the accident. Arjun goes alone and fights Bhavani's goons, but is knocked unconscious by Bhavani's friend Kaali. Another car chase ensues, resulting in a series of violent moments causing Bhavani to reveal himself as the real father of Arjun.After telling the truth, Bhavani saves Arjun by sacrificing himself and killing along Lakshman and his goons in an explosion. Kaali tells Arjun how Hari and his brothers used to be jealous of Bhavani's bonding with their father, and got him framed for illegal weapon trade. Hari even murdered Vishnu after the latter refused to accept Bhavani's involvement in any crimes. Bhavani's wife was also killed and Hari threatened to kill a baby Arjun if Bhavani didn't take the blame for both murders. Byreddy also became aware of this, following which Arjun started his killing spree.Back to present, Hari kidnaps Kaali and brings him to a factory, where Arjun arrives and fights his goons. He succeeds in killing them, but soon Hari uses Kaali as a shield, causing Arjun to drop his gun and get beaten up by Hari, only to fight back and kill the latter."
}