{
    "id": "3119074",
    "localized title": "Raja Huli",
    "cast": [
        "Yash",
        "Meghana Raj",
        "Harsha",
        "Harsha",
        "Chikkanna",
        "Charan Raj",
        "Vasishta"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "149",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "01 Nov 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTc4NTg4MjYwMV5BMl5BanBnXkFtZTgwMDUxMDA3MjE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "3119074",
    "plot outline": "Raja Huli comes from an affluent family and always there to help his friends. One day he sets out to convey the love on behalf of his friend to a girl, to his surprise he finds out that it is his ex-girlfriend. But instead of accepting the love of Raja's friend, the girl falls for Raja once again. This leads to a series of events. A murder that takes place and Raja is blamed for it.",
    "languages": "Kannada",
    "title": "Raja Huli",
    "kind": "movie",
    "directors": "Guru Deshpande",
    "writers": "S.R. Prabhakaran",
    "producers": "K. Manju",
    "composers": "Hamsalekha",
    "cinematographers": "K.M. Vishnuvardhan",
    "editors": "K.M. Prakash",
    "visual effects": "Bhuvaneswaran",
    "writer": "S.R. Prabhakaran",
    "director": "Guru Deshpande",
    "production companies": "Lakshmisri Combines",
    "plot": [
        "_Raja Huli_ (qv) comes from an affluent family and always there to help his friends. One day he sets out to convey the love on behalf of his friend to a girl, to his surprise he finds out that it is his ex-girlfriend. But instead of accepting the love of Raja's friend, the girl falls for Raja once again. This leads to a series of events. A murder that takes place and Raja is blamed for it.::Anonymous",
        "Rajahuli(Yash) is a degree graduate and a happy go lucky guy. He is ready to go to any extent to help his friends. One day, two of his friends falls in love with a girl named Kaveri(Megahana Raj) a student who is none other than Rajahuli's ex-girlfriend. But she reciprocates love towards him. This creates a jealous feeling among his friends. One day, he gets falsely charged for murder of one of his friends loving Kaveri. Is Rajahuli really responsible for the murder or someone is trying to frame him. How rajahuli wins his love also form the crux of the story::vamsi-68790"
    ]
}