{
    "id": "3119172",
    "localized title": "Bakita Byaktigoto",
    "original title": "Bakita Byaktigato",
    "cast": [
        "Sudipa Basu",
        "Ritwick Chakraborty",
        "Debesh Roy Chowdhury",
        "Aparajita Ghosh Das",
        "Supriyo Dutta",
        "Churni Ganguly",
        "Madhabi Mukherjee",
        "Monu Mukherjee",
        "Amit Saha"
    ],
    "genres": "Drama",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "original air date": "20 Sep 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjEzOGUyNjQtODhhNi00Mzk3LTllMmQtYzRjZjhlYmEzMjVmXkEyXkFqcGdeQXVyNjA3OTI5MjA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "3119172",
    "plot outline": "Pramit, an independent filmmaker who is yet to experience the spell of love in his otherwise not-so exciting life, starts shooting a documentary film on love. His exploration leads him to the baffling knowledge of an unforetold mysterious village, existent on what is believed to be the threshold of reality and fantasy. If anyone ever reaches there, stumbling upon a series of coincidences, cannot steer clear of the cupid's arrow, and readily falls in love. Pramit, along with his cameraperson starts looking for the village and subsequently passes through a succession of events which can be termed nothing but magical! Love, with all its colours - sublime as well as physical - doesn't fail to come his way too, or, does it really?",
    "languages": "Bangla",
    "title": "Bakita Byaktigato",
    "kind": "movie",
    "directors": "Pradipta Bhattacharyya",
    "writers": "Pradipta Bhattacharyya",
    "producers": [
        "Piyal Bhadra",
        "Arka Paul",
        "Roshni Sen",
        "Satrajit Sen"
    ],
    "cinematographers": "Subhankar Bhar",
    "editors": "Pradipta Bhattacharyya",
    "editorial department": "Prosenjit Banerjee",
    "art directors": "Subhashis Chakraborty",
    "make up department": "Ujjwal Roy",
    "assistant directors": "Susmita Sinha",
    "sound department": [
        "Partha Barman",
        "Alberto Doni",
        "Ivan Sibio"
    ],
    "music department": "Anindya Sundar Chakraborty",
    "miscellaneous": [
        "Kushal Chirimar",
        "Srijit Mukherji"
    ],
    "thanks": "Subhajit Singha",
    "akas": [
        "Bakita Byaktigoto (India, Bangla title)",
        "Rest Is Personal (World-wide, English title)"
    ],
    "writer": "Pradipta Bhattacharyya",
    "director": "Pradipta Bhattacharyya",
    "production companies": "Tripod entertainment",
    "other companies": "Editfx Studios",
    "plot": [
        "Pramit, an independent filmmaker who is yet to experience the spell of love in his otherwise not-so exciting life, starts shooting a documentary film on love. His exploration leads him to the baffling knowledge of an unforetold mysterious village, existent on what is believed to be the threshold of reality and fantasy. If anyone ever reaches there, stumbling upon a series of coincidences, cannot steer clear of the cupid's arrow, and readily falls in love. Pramit, along with his cameraperson starts looking for the village and subsequently passes through a succession of events which can be termed nothing but magical! Love, with all its colours - sublime as well as physical - doesn't fail to come his way too, or, does it really?::Arka Paul",
        "The protagonist ventures into the ultimate reality which surpasses his reel notions about a certain pre-conditioned reality, for example: Love is always thought to be a Venus affair but things might be contradicting when it comes to facing something truly real. Even Akaler Sandhane is a bit similar to this film, if not wholly, where the context is about discovering famine in Akaler Sandhane, a classic by Mrinal Sen.::Aneek Chaudhuri, Research Scholar"
    ],
    "synopsis": "Decoding the Mystery behind Bakita Byaktigoto: The National Award WinnerAneek ChaudhuriTaking human emotions as a whole, privacy and personal instincts form an interconnective linkage; much similar is the case with Cinema. In this article, Cinema has been depicted as a montage of personal experiences that lead a person to the world of Maya or illusion. Have one ever thought that Hindu mythology will be applied to a film of this era? Although, subtlety has been presented along with it. Bakita Byaktigoto is a film that is based on the expressionist style of cinema, which often reminds us of the Neo-realist era; but, what is more impressive is the utilization of moods in the film. Introduction\nBakita Byaktigoto literally means rest is personal; the theme of the movie was indeed a personal experience, when viewers found it quite tough to interpret its true form or meaning. Before beginning with a critical interpretation of Bakita Byaktigoto, I need to discuss the storyline of the film.Storyline Of Bakita Byaktigoto\nLove, the search for love is the direct theme of the film, where the protagonist (Promith) is projected as an independent filmmaker. From pavements to alternative classes, the protagonist captures others and their views on love, aided by a cameraman (Amit). Finally, they reach a melodramatic astrologer, who assures them of a satisfactory answer. He takes them to his place and addresses Mohini to be the destination of their treasure hunt on love. Mohini has been rather projected as an enigma, where Promith and Amit could reach after taking references from a number of people (as the exact address is not known to the astrologer). Finally, they reach there. There is something very peculiar about a certain awaited phase, if one needs to reach Mohini. A person needs to wait at a mentioned bus-stop from where he/she is expected to be picked up by a Rickshaw puller. When reached, Promith and Amit experienced events that acted as a trap for them. Soon, they fall in love in the land of love, Mohini and feelings of love, lust, passion handed them certain commitments. However, they return back to their native city, with a promise to return back soon to their beloveds. But, that is never going to be a word of mouth.Even after successive trials, they are not able to reach Mohini, once again. Soon, earlier references (that made them reach Mohini) kind of vanished, with no options left for them. It can be expressed as a sequence of intellectual montage, although, tough for a common cinephile to interpret. In the next section, I will encode the theme of Bakita Byaktigoto, making it a convenient piece for any xyz viewer.\nTo interpret this film, one surely need to have an idea of Hindu mythology. Now, in this part, I will discuss the relevance of Promith and Mohini in relevance with mythological evidences. As per Hindu beliefs, Samudramanthan (churning of ocean) took place around 5th century. During churning of ocean, Amrit emerged out of the ocean. Here, Amrit or elixir can be compared with the feeling of love. When we relate Amrit with love, then we are talking of the feeling of love that is deprived of lust and Kama (passion). Same is Promiths feeling about love, when he has not yet experienced Sangam (physical intimacy). After Amrit came out during Samudramanthan, angels and demons competed with each other to gain over the pot of Amrit. Then, Vishnu disguised himself in the form of Mohini, a glamorous lady and helped the gods to gain over the Amrit, by distracting the demons. It was then, when Lord Shiva had spotted Vishnu in her Mohini avatar and could not recognize the actuality behind her appearance. As mentioned in Brahmanda Purana, Shiva had longed to visit Mohini after getti ng bewildered with her illusionary effect. A much similar thing happened in Promiths life when he experienced the Maya (illusion) of love. Not to forget that Promith here has been depicted as searching for love which can be compared with Shivas search of the illusionary feeling. It has been mentioned above that Promith tried to reach Mohini once again, after returning back from there. This effort can be related to the mythological evidence, when Lord Shiva (desperately) tried to see the bewildering Mohini, once again. When Vishnu revealed himself in her illusionary form of Mohini, Shiva couldnt resist his Kama and grabbed Mohini in lust. Although, Mohini was able to run away from him, it is believed that Shivas seed feel down to the ground as a result of his violent grabbing. This incident reveals that the illusory power of Mohini could not even be surpassed by Shiva. Much same to this, Promith was tempted by the Maya of love, but couldnt infuse life into illusion. And yes, be it Mohini or the Maya of love, lust and Kama, all took the same path in both the cases; none of them got able to live life beyond the reality.\nAlthough, Bakita Byaktigoto has been made in this century, it has strong connections with the mythological aspects of Hindu religion. If we get to craft a clearer interpretation, one needs to take an alternative vision on Hindu gods, demi-gods, and goddesses. It is a fair believe that a film is interpreted respecting an individuals uses and gratifications, but the cumulative theme of a film remains the same. Hopefully, through this article, you have got a true and fair appreciation of Bakita Byaktigoto."
}