{
    "id": "3122380",
    "localized title": "Investment",
    "cast": [
        "Tushar Dalvi",
        "Sulabha Deshpande",
        "Soham Kolvankar",
        "Sanjay Mone",
        "Praharsh Naik",
        "Bhagyashree Pane",
        "Milind Pathak",
        "Sandeep Pathak",
        "Supriya Vinod"
    ],
    "runtimes": "122",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "20 Sep 2013 (India)",
    "imdbID": "3122380",
    "languages": "Marathi",
    "title": "Investment",
    "kind": "movie",
    "directors": "Ratnakar Matkari",
    "writers": "Ratnakar Matkari",
    "producers": [
        "Anish Joshi",
        "Pratibha Matkari",
        "Mandar Vaidya"
    ],
    "composers": "Madhav Vijay",
    "cinematographers": [
        "Amol Gole",
        "Amol Gole"
    ],
    "editors": "Sagar Vanjari",
    "editorial department": "Rohan Patil",
    "costume designers": [
        "Veena Dabholkar",
        "Supriya Vinod"
    ],
    "assistant directors": "Ganesh Matkari",
    "sound department": [
        "Shantanu Akerkar",
        "Dinesh Uchil"
    ],
    "visual effects": "Amin Kazi",
    "akas": "Investment (India)",
    "writer": "Ratnakar Matkari",
    "director": "Ratnakar Matkari",
    "production companies": [
        "INDU Enterprise",
        "Mahadwar Productions"
    ],
    "synopsis": "INVESTMENT tells us the story a typical upwardly mobile couple, Aashish, an ambitious young man, about to change his job for joining an American firm and his wife, Prachi, who is encouraging and eager to move into a higher class of society. (This couple is indicative of the young people in urban areas thriving to achieve more, albeit at cost of social values). The couple has a twelve-year old son, Sohel, who is being brought up with much care and with a dream of raising a successful Politian of the Future, a field, which they believe, is promising due to its lucrative opportunities of growth, power and finance. Sohel is a rather spoilt & self-centered brat who believes and follows his father's motto of always getting what he wants. He sends a love note to his classmate Deepa Gangan who hails from a totally different social strata and her father informs Ashish and Prachi to keep their son at bay. Deepa is found missing and Sohel claims that he is unaware of her whereabouts. Deepas dead body is found by the police, the next day. From this point forward in the film the issues of morality of different characters comes to the fore with the resolution of the crime while testing and making a remark on the materialistic point of view with which todays generation is approaching moral values. The aftermath represents the slow but sure criminalization accompanied by the total lack of regret of the educated young middle-class, with subsequent disregard for moral values, and thus forms the terribly realistic & therefore shocking climax of the film."
}