{
    "id": "3177080",
    "localized title": "Haridas",
    "cast": [
        "Kishore Kumar G.",
        "Sneha",
        "Prithviraj Das",
        "Soori",
        "Pradeep Singh Rawat",
        "Yugi Sethu",
        "Raj Kapoor",
        "Varadharajalu"
    ],
    "genres": [
        "Drama",
        "Sport",
        "Thriller"
    ],
    "runtimes": "146",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.39 : 1",
    "original air date": "22 Feb 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGEwZTgwYjMtNTU4Ni00MjIxLWJhZDItN2M3MWM3ODQxNTRmXkEyXkFqcGdeQXVyODk1MzE5NDA@._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "3177080",
    "plot outline": "Sivadas (Kishore) is tough-talking encounter specialist in the police department. He has a mission to pin down a gangster and mercenary and is hot on his trail. But life changes for the tough cop when he brings his only son Hari (Pritviraj Das) to Chennai from his village, where he was brought up by his grandmother. The young boy is autistic and now Siva has to take care of the boy and help him overcome his disability. He consults a doctor Ravi (Yugi Sethu) and admits Hari in a normal school where Amudhavalli (Sneha) is a trained teacher for special children.",
    "languages": "Tamil",
    "title": "Haridas",
    "kind": "movie",
    "directors": "Kumaravelan",
    "writers": [
        "Kumaravelan",
        "",
        "Venkatesan"
    ],
    "producers": "Ramadoss",
    "composers": "Vijay Antony",
    "cinematographers": "R. Rathnavelu",
    "editors": "Raja Mohammed",
    "editorial department": "Nitin Minz",
    "visual effects": "Harihara Suthan",
    "camera department": "Aravindkumar",
    "writer": [
        "Kumaravelan",
        "Venkatesan"
    ],
    "director": "Kumaravelan",
    "production companies": "DR V RAM Production Private Limited",
    "plot": [
        "Sivadas (Kishore) is tough-talking encounter specialist in the police department. He has a mission to pin down a gangster and mercenary and is hot on his trail. But life changes for the tough cop when he brings his only son Hari (Pritviraj Das) to Chennai from his village, where he was brought up by his grandmother. The young boy is autistic and now Siva has to take care of the boy and help him overcome his disability. He consults a doctor Ravi (Yugi Sethu) and admits Hari in a normal school where Amudhavalli (Sneha) is a trained teacher for special children.::Sify",
        "The bonding between a father and his 10-year old autistic son, and the boy and his empathetic school teacher forms the fulcrum of _Haridas_ (qv). Sivadas, the father, gropes in the dark, trying to understand the mind of his motherless son, Hari, who seems to live in a world of his own.::The Hindu",
        "Sivadas (Kishore) is a courageous and honest police officer, who has ruthlessly headed and investigation against the local goon Aadhi (Pradeep Rawat), and is on the words of nabbing the crook. However, he is forced to leave the force for a while to take care of his autistic son, _Haridas_ (qv) (Prithviraj Das) because of an unfortunate matter. With much difficulty he enrolls _Haridas_ (qv) in a normal school where Amudhavalli (Sneha) is a teacher specialized to deal with special children. Sivadas carries a lot of guilt that he has been an absentee parent, not sparing quality time for his family, when it mattered most, and tries to understand his son's problem step by step. He understands the fact that Autism is not a disease to brood over, it just needs the extra affection and care rather than feeling sympathetic. Over a period of time the bonding between the teacher and the student blossoms like a bright sunflower. Does the father succeed in lodging a room in his son's imagination? How does their relationship evolve, and what lies in store for this father-son team, forms the rest of this soulful tale.::Shrinivas G. Kulkarni"
    ]
}