{
    "id": "3187080",
    "localized title": "Potugadu",
    "cast": [
        "Manoj Kumar Manchu",
        "Simran Kaur Mundi",
        "Sakshi Chaudhary",
        "Anupriya Goenka",
        "Krishna Murali Posani",
        "Chandramohan",
        "Mohammad Ali",
        "Sayaji Shinde",
        "Raghu Babu",
        "Satyam Rajesh",
        "Narsing Yadav",
        "Srinivasa Reddy",
        "Kasi Vishwanath",
        "Pawan Wadeyar",
        "Rachel Wise"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:A",
    "original air date": "14 Sep 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjgxYmYxOWMtNGNhZS00MDM1LTg3NWMtMGI4ZWE0NzNkMDE1XkEyXkFqcGdeQXVyMjczODk3NjA@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "3187080",
    "languages": "Telugu",
    "title": "Potugadu",
    "kind": "movie",
    "directors": "Pawan Wadeyar",
    "writers": [
        "Sreedhar Seepana",
        "",
        "Pawan Wadeyar",
        "",
        "Pawan Wadeyar"
    ],
    "producers": [
        "Sarath Mandava",
        "Lagadapati Sirisha Sridhar",
        "Ahmer Shah Zia"
    ],
    "composers": "Achu",
    "cinematographers": "Srikanth Naroj",
    "editors": "M.R. Varma",
    "art directors": "Narayana Reddy",
    "costume designers": "Shravya Varma",
    "visual effects": [
        "E. Ramesh",
        "Shiva krishna Sadhanala"
    ],
    "stunts": "Ram Sunkara",
    "camera department": "Anantnag Kavuri",
    "music department": [
        "Achu",
        "Bhashyasree",
        "Karthik",
        "Paul Praveen Kumar",
        "Geetha Madhuri",
        "Manoj Kumar Manchu",
        "Indu Nagaraj",
        "Ramajogayya Sastry",
        "T.R. Silambarasan",
        "Tippu",
        "Hemachandra Vedala"
    ],
    "miscellaneous": [
        "Uday Bhanu Avirineni",
        "Anil Kumar Vanga"
    ],
    "akas": "Сорвиголова (Russia)",
    "writer": [
        "Sreedhar Seepana",
        "Pawan Wadeyar",
        "Pawan Wadeyar"
    ],
    "director": "Pawan Wadeyar",
    "production companies": "Ramalakshmi Cine Creations",
    "distributors": [
        "Blue Sky Cinema",
        "Sri Balaji Video"
    ],
    "other companies": "Aditya Music",
    "plot": "Venkata And Govinda Meet While They Are Both Attempting To Commit Suicide. However, Things Take A Turn When They Decide To Share Their Life Story With Each Other.",
    "synopsis": "Govinda Naama Sastry (Manoj Manchu) is a young man who decides to commit suicide. He goes to a lonely spot and decides to have one last drink. At about the same time, Venkata Rathnam (Posani Krishna Murali) also comes to the same spot to commit suicide. The two sit down for a chat to find out more about their respective life stories.While Venkata Rathnam decides to die as his lover ditched him, Govinda has four love stories to narrate. First up is his romantic track with Vaidehi (Simran Kaur Mundi), the daughter of a rich Brahmin. After a brief courtship, the love story fails because Vaidehi's father is against the alliance. Govinda moves on in life and this is where the second love story begins. He falls in love with Mumtaz (Sakshi Choudhary) and romance blossoms between them. However, Govinda throws away everything in a drunken stupor, where he makes some derogatory comments about Mumtaz.Venkata Rathnam gets furious and tries to bash Govinda. Govinda vomits blood admitting that he had poison mixed in the drink. Venkata Rathnam takes him to a hospital and gets him treated by a doctor. Mumtaz is working there as a nurse which is not known to either Govinda or Venkata Rathnam. Mumtaz hides behind a wall and starts listening to Govinda's story.Next up is a love story with a foreigner named Stacy (Rachel) who is engaged to his boss. In order to steal her ring costing 500,000 rupees he separates the couple but he ditches her after he comes to know that she threw the ring into a river out of frustration. The last and final love story involves Mary (Anupriya Goenka). For the first time in his life, Govinda experiences true love. He fully reforms himself and leads a normal life. The shocking truth about Mary is that she runs a brothel and traffics girls. Upon hearing this from the police, Govinda is heartbroken.On hiring Govinda for a job, Mary tells him that her task is upbringing talented girls from towns and his job is to transport them to her house. In the present, Govinda is informed by the police regarding this and after pleading strongly, police accept Govinda's favor in helping them in releasing the girls. The girls, all of them transported by Govinda, are in a container and after much bloodshed Govinda rescues all of them. Dejected and heartbroken by the betrayal and the sins he committed he decides to die.Govinda and Venkata Rathnam go out of the hospital and watch Vaidehi being taken to a room for her delivery and his boss along with his parents. Govinda tells two truths to Venkata Rathnam before suicide. One is that he left Vaidehi as he was aware that if they eloped, her parents would commit suicide. The other is that he separated his boss and Stacy as his boss would desert his parents after his marriage with her which didn't happen because of him.Mumtaz stops Govinda as Govinda confesses to Venkata Rathnam that Mumtaz was the only girl who showered unconditional love on him and he just left her in a drunken state. The pair reconciles and a frustrated Venkata Rathnam leaves the hospital with the hope of gaining love. He accidentally comes across a beautiful girl who accepts his proposal..."
}