{
    "id": "3198468",
    "localized title": "North 24 Kaatham",
    "cast": [
        "Fahadh Faasil",
        "Nedumudi Venu",
        "Swathi Reddy",
        "Sreenath Bhasi",
        "Geetha",
        "Thalaivasal Vijay",
        "Jinu Joseph",
        "Premgi Amaren",
        "Rajasekhar V. Das",
        "Shohaibkhan Hanifrawther",
        "Disney James",
        "Jiiva",
        "Chemban Vinod Jose",
        "Abraham Koshy",
        "Chinnu Kuruvila",
        "Kani Kusruti",
        "Leona Lishoy",
        "Pushpa Mathew",
        "Deepak Nathan",
        "Nirmal Palazhi",
        "Manju Pathrose",
        "Vijayan Peringode",
        "Khalid Rahman",
        "Sadiq",
        "Dileep Shankar",
        "Srindaa"
    ],
    "genres": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Singapore:PG"
    ],
    "original air date": "15 Sep 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDE1Y2YwZDItMGYxMC00OWQwLTk4MzItNGYzMDBlZTRmMWUwXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "3198468",
    "plot outline": "Fahad Fazil is a geeky software professional who suffers from an Obsessive-compulsive disorder. On a trip to Trivandrum for a conference, he ends up at Paravur railway station with two strangers - Nedumudi Venu a veteran politician and Swathi Reddy a social worker. Fahad has to interrupt his journey and go to the other side of the state to help Nedumudi Venu, reach his home in Kozhikode, where his wife is critically ill. The journey becomes a learning experience for Fahad. The film is about the interplay between the above three main characters.",
    "languages": "Malayalam",
    "title": "North 24 Kaatham",
    "kind": "movie",
    "directors": "Anil Radhakrishnan Menon",
    "writers": [
        "Anil Radhakrishnan Menon",
        "",
        "Anil Radhakrishnan Menon"
    ],
    "producers": "C.V. Sarathi",
    "composers": [
        "Govind Vasantha",
        "Rex Vijayan"
    ],
    "cinematographers": "Jayesh Nair",
    "editors": "Dilip",
    "editorial department": [
        "Nithish K.T.R.",
        "Raghuraman"
    ],
    "assistant directors": "Khalid Rahman",
    "sound department": [
        "Rajakrishnan M.R.",
        "Mesmin Santhosh",
        "Arun Seenu",
        "Vajjiravel Varun"
    ],
    "visual effects": "Raghuraman",
    "camera department": "Vishnu Thandasseery",
    "music department": [
        "Rafeeq Ahammed",
        "Sreenath Bhasi",
        "Bijibal",
        "Engandiyur Chandrasekharan",
        "Raghu Dixit",
        "Christin Jose",
        "Aneesh Krishnan",
        "Ranjini Menon",
        "Siddharth Menon",
        "Jeba Niyaz",
        "Liya Samuel",
        "Vinayak Sasikumar",
        "Govind Vasantha"
    ],
    "akas": "24 кадама на север (Russia)",
    "writer": [
        "Anil Radhakrishnan Menon",
        "Anil Radhakrishnan Menon"
    ],
    "director": "Anil Radhakrishnan Menon",
    "production companies": [
        "E4 Entertainment",
        "Sarathi"
    ],
    "distributors": "E4 Entertainment",
    "other companies": "AP International",
    "plot": [
        "Harikrishan, a software engineer who suffers from obsessive-compulsive personality disorder is asked to go on an assignment to Trivandrum, as his colleagues are not able to stand his behavior.",
        "Fahad Fazil is a geeky software professional who suffers from an Obsessive-compulsive disorder. On a trip to Trivandrum for a conference, he ends up at Paravur railway station with two strangers - Nedumudi Venu a veteran politician and Swathi Reddy a social worker. Fahad has to interrupt his journey and go to the other side of the state to help Nedumudi Venu, reach his home in Kozhikode, where his wife is critically ill. The journey becomes a learning experience for Fahad. The film is about the interplay between the above three main characters.::Anonymous",
        "Harikrishnan (Fahadh Faasil) is a nerdy programming draftsman who experiences Obsessive-compulsive identity issue. His partners think that its difficult to work with him because of his enthusiastic upheavals and odd characteristics, however the organization authority values him as a center resource for the association. His partners bring forth an arrangement to send him off to Trivandrum to exhibit on an online course, one of organization's top offering items, which additionally happens to be created by Hari. Sadly for him, the date of his trip corresponds with a harthal day. In transit to Trivandrum, amidst the night, his co-traveler Gopalan (Nedumudi Venu), a veteran legislator, gets a call educating him that his better half is truly sick. When the prepare leaves Kollam, Gopalan, developing worried about his better half's wellbeing chooses to change his arrangement and come back to the place where he grew up in Kozhikode to take care of his feeble spouse. Seeing the circumstance, another traveler Narayani a.k.a. Nani (Swathi Reddy), a social laborer, chooses to join Gopalan. They get down at Paravur railroad station. In the perplexity to get down at Paravur, Gopalan unintentionally drops his PDA on the prepare before landing. Hari sees the ringing telephone when Gopalan's companion Moidheen rings him to illuminate about his significant other's demise. Hari picks the call and hears the pitiful news. Not knowing how to respond in this circumstance, Hari additionally gets down at Paravur in the affection of overlooking his sack on the prepare. Hari chooses to take after Narayani and Gopalan on their arrival voyage to Kozhikode. The arrangement annoys his day by day routine and calendar, as well as aggravates his standard of cleanliness. Nani then again is lighthearted and not at all like Hari, makes a special effort to help other people. The voyage turns into a learning background for Hari and how he comprehends and defeats different attempting circumstances in life. The movies closes with Hari and Nani beginning to look all starry eyed at and him at last beating his OCPD.::Ayyappan",
        "Harikrishnan is a geeky software professional who suffers from an obsessive compulsive disorder. One day he travels to Trivandrum for a conference, and in the midst of the night, he ends up at Paravur railway station with two strangers - Gopalan a veteran politician and Narayani a social worker - for company."
    ]
}