{
    "id": "3208484",
    "localized title": "Anumati",
    "cast": [
        "Anand Abhyankar",
        "Subodh Bhave",
        "Vikram Gokhale",
        "Kishore Kadam",
        "Neena Kulkarni",
        "Reema Lagoo",
        "Rohan Mankani",
        "Arun Nalawade",
        "Neha Pendse",
        "Sai Tamhankar"
    ],
    "genres": "Drama",
    "runtimes": "107",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "14 Jun 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjk4ZTk0ZjAtZTdkNC00ZjEyLWE3OTUtZWY5YWY0NWY0MGRhXkEyXkFqcGdeQXVyMTgwMjgwMjM@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "3208484",
    "plot outline": "Movie tells a story of a man who struggles to save his wife's life. Lack of money makes him ask for help to his children and relatives. He even tries to sell his house in Kokan, which is filled with his wife's beautiful memories. But his old age makes him helpless. Vikram Gokhale has given justice to this character. His acting is astonishing as always.",
    "languages": "Marathi",
    "title": "Anumati",
    "kind": "movie",
    "directors": "Gajendra Ahire",
    "writers": "Gajendra Ahire",
    "producers": [
        "Vinay Waman Ganu",
        "Prashant Gokhale"
    ],
    "composers": "Narendra Bhide",
    "editors": "Santosh Gothoskar",
    "editorial department": "Meghnath Labde",
    "art directors": "Dutta Londhe",
    "costume designers": "Sapna Bansal",
    "sound department": [
        "Afsar Baig",
        "Sanket Dhotkar",
        "Tushar Pandit",
        "Anchal Srivastava"
    ],
    "visual effects": "P. Mohan",
    "camera department": "Yogesh Rajguru",
    "music department": "Gajendra Ahire",
    "akas": "Anumati (India)",
    "writer": "Gajendra Ahire",
    "director": "Gajendra Ahire",
    "production companies": "Sri Pant Production",
    "plot": [
        "Movie tells a story of a man who struggles to save his wife's life. Lack of money makes him ask for help to his children and relatives. He even tries to sell his house in Kokan, which is filled with his wife's beautiful memories. But his old age makes him helpless. Vikram Gokhale has given justice to this character. His acting is astonishing as always.::Trupti Sutar",
        "Ratankar Pathare a retired teacher leaves a retired life wit his wife Madhu and is soon to travel for a short trip to US.But Madhu slips in coma and her chances of survival are minimal she is kept on ventilator the doctors tell him to sign DNR form (do not resuscitate) which will allow Doctors to remove the Ventilator.His son Shrikant agrees but Ratankar refuses and asks financial help from his children and relatives and also plans to sell his house in Konkan which has memories of Madhu.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Anumati is the story of an old mans attempts to save his dying wife. For all practical reasons the doctors have given, but Ratnakar is desperate to hold on to the world his wife Madhu has woven. He is not ready to sign the DNR form that permits the doctors to remove external life support to the patient. In the face of absolute money shortage, Ratnakar tries everything - borrowing from relatives, appealing to charity trusts and coaxing insurance companies. He tries to raise money trying to sell the very house that he had built with his wife. His trauma of facing life without his life partner is unbearableHe is still hopeful that their proposed trip to America will actually become a reality when his wife recovers.\nAnumati is the consent that Ratnakar refuses to give to let his wife die. He finds himself in a corner, helplessly trapped between emotions and practicality, being forced against his wishes, to give up on his longlasting partnership a dilemma that only fate can solve."
}