{
    "id": "3332080",
    "localized title": "Love is Vaat",
    "cast": [
        "Amit Bhanushali",
        "Vijay Chavan",
        "Kranti Redkar",
        "Dr. Vilas Ujawane"
    ],
    "genres": "Comedy",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "aspect ratio": "1.33 : 1 (anamorphic)",
    "certificates": "India:UA",
    "original air date": "14 Feb 2013 (India)",
    "imdbID": "3332080",
    "plot outline": "In this genre of comedy films Love is Vaat comes with a simple Love Story about a couple who fall in Love but break up due to some misunderstandings. Are misunderstandings enough to break up a couple in love or does love run deeper to overcome misunderstandings. Also do families, friends and others in and around us change our thinking because of their greater hold over us or is true Love able to withstand all of them and claim the final victory. Watch a present time based Love story of the youth etched in the backdrop of the city with sweet and hummable music in Love is Vaat.",
    "languages": "Marathi",
    "title": "Love is Vaat",
    "kind": "movie",
    "directors": "Rohaan Satghare",
    "writers": "Rohaan Satghare",
    "producers": "Lavy Pinto",
    "composers": "Puspendra Makavana",
    "cinematographers": "Atul Jagdale",
    "editors": "Pranav Patel",
    "music department": "Pranav Vatsa",
    "miscellaneous": "Pradnya Sumati Shetty",
    "akas": "Love is Vaat (India)",
    "writer": "Rohaan Satghare",
    "director": "Rohaan Satghare",
    "plot": [
        "A couple gets separated due to misunderstanding's created between them by people around.",
        "In this genre of comedy films _Love is Vaat_ (qv) comes with a simple Love Story about a couple who fall in Love but break up due to some misunderstandings. Are misunderstandings enough to break up a couple in love or does love run deeper to overcome misunderstandings. Also do families, friends and others in and around us change our thinking because of their greater hold over us or is true Love able to withstand all of them and claim the final victory. Watch a present time based Love story of the youth etched in the backdrop of the city with sweet and hummable music in _Love is Vaat_ (qv).::Rohaan"
    ]
}