{
    "id": "3410654",
    "localized title": "Narbachi Wadi",
    "cast": [
        "Ambarish Deshpande",
        "Manoj Joshi",
        "Bhau Kadam",
        "Vikas Kadam",
        "Jyoti Malshe",
        "Atul Parchure",
        "Dilip Prabhavalkar",
        "Nikhil Ratnaparkhi",
        "Kamlakar Satputhe",
        "Kishori Shahane",
        "Suhas Shirsat"
    ],
    "genres": "Comedy",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "20 Sep 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2Q0OTgyNjYtNjk2OS00YjNhLTlmMmUtZGVkYWVkZThmYTFjXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "3410654",
    "plot outline": "A greedy landlord has his heart set on a grove owned by Narba. Narba refuses to sell it but the landlord will resort to every trick in the book to acquire this precious piece of land. Will Narba be successful in salvaging his father's inherited grove from the cruel landlord?",
    "languages": "Marathi",
    "title": "Narbachi Wadi",
    "kind": "movie",
    "directors": "Aditya Sarpotdar",
    "producers": [
        "Amit Chandra",
        "Kalyan Guha",
        "Rupali Guha"
    ],
    "composers": "Mangesh Dhakde",
    "cinematographers": "Rahul Jadhav",
    "editors": "Faisal Mahadik",
    "editorial department": "Tushar Jadhav",
    "casting directors": "Gaurrav Kaushal",
    "production managers": "Barun Jayparkash Maurya",
    "assistant directors": "Vivek Kamlakar Jadhav",
    "sound department": "Dipesh Sharma",
    "camera department": "Kiran Gunjal",
    "music department": [
        "Mangesh Dhakde",
        "Dipesh Sharma"
    ],
    "miscellaneous": [
        "Sameer Bhosle",
        "Sachin Suresh Gurav",
        "Ram Kondilkar",
        "Omkar Ranade"
    ],
    "akas": "Narbachi Wadi (India)",
    "director": "Aditya Sarpotdar",
    "production companies": [
        "FilmFarm India",
        "Video Palace"
    ],
    "distributors": "Video Palace (Bombay)",
    "plot": [
        "A greedy landlord tries to take over a beautiful grove in Konkan from its rightful ancestral owner.",
        "A greedy landlord has his heart set on a grove owned by Narba. Narba refuses to sell it but the landlord will resort to every trick in the book to acquire this precious piece of land. Will Narba be successful in salvaging his father's inherited grove from the cruel landlord?",
        "As it is rightly said 'Facts are stranger than the Fiction'... so true! Otherwise who would believe that a small time farmer with a tiny piece of land can not only survive the wrath of mighty 'Zhamindaars of the town but make them move like puppets at his will'...unbelievable...yes...but its true and this is the story of ' Narbas life! In his late eighties also he is still fit and fine and fighting with all the mighty big-wigs in the town his story goes like this so far.",
        "Narba owns a small piece of land which he has cultivated into heaven. He loves his land like his own blood or his skin. He works hard years after years in his garden. The garden was everything for him. But one day the fortune of Narba takes a turn. The cruel Zamindaar, Rangrao Khot sets his eyes on Narba's garden and demands that garden from him. Narba just could not take this thought. He refuses flatly. And the Zamindaar cant take this 'no' and he goes berserk. He sends some goons to kill Narba and poor Narba has to flee for his dear life. He runs away in a jungle where he meets a dacoit- Sattu Ramoshi, who has come there for hunting. He listens to Narba's story and gives a threat to the Zamindaar. The Zamindaar can't take this insult and commits suicide. And Narba comes back to his beloved garden. Years pass by and the son of the Zamindaar- Malhari, is now ruling the town. And Narba is considerably old and frail. Looking at his Narba's state the Zamindaar's son realizes that he would not live longer so he strikes a deal with Narba. He agrees to pay Narba a certain amount every month and in return he promises to name his garden in his name after his death. Realizing that he cannot match the Zamindaar in muscle or money power Narba accepts the proposition. And the son of the Zamindaar is extremely happy for fulfilling the dream of his father. Years pass by and the money of the Zamindaar keeps on vanishing. He keeps preying to the gods that one day Narba would die and he would become the owner of the land. But there is no sign. Finally he proposes Narba to take poison and end his life. Now it's really a tough time for old Narba. What happens next? Does Narba take the poison? Does he end his life? Or as usual he becomes successful to defeat the biggest tyrant called 'The death'? This and many more questions would find their answers in a hilarious and thought provoking manner as the story of Narba and his fight against all odds unfolds.",
        "Story set in British era 1946 in Konkan. Narba owns a coconut land,Rangarao Khot a greedy landlord wants Narba to transfer the land to him which was given by Rangarao's father to Narba's father after he saved his life during a hunting trip.Ragnarao tries many tricks to kill Narba but fails and he dies himself.Twenty years later his son Malhari Khot also tries tricks to get Narba's land and makes him sign a contact that after his death he will be owner of the land.::alex.mjacko@gmail.com"
    ]
}