{
    "id": "5300028",
    "localized title": "Misti Cheler Dustu Buddhi",
    "cast": [
        "Abhishek Chatterjee",
        "Hiran Chatterjee",
        "Anjana Das",
        "Prasun Gayen",
        "Ankit Seth",
        "Bhola Tamang"
    ],
    "genres": "Comedy",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "original air date": "04 Jan 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzUxMTI2N2MtMWM0Mi00MGZmLThkZDUtY2QyMjM2MTE0MzM2XkEyXkFqcGdeQXVyMTk0MzIwMTc@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "5300028",
    "plot outline": "Misti Cheler Dustu Buddhi is actually about three thieves, Kalicharan and his two sidekicks, Puti and Baka who decide to rob and go back to their old tricks after Kalicharan is released from jail. They decide to rob the occupants of the Mitra household: an elderly man, Pradosh Mitra, his two sons and their families. They decide to carry out the robbery at a time when the house will have no occupants according to information received by them. Accordingly they act. But they couldn't be successful because, unknown to them, Pradosh and one of his grandsons, 7 year old Som have decided to stay back and create havoc for them. All their efforts to rob the house are in vain as little Som turns out to be more than a handful for all of them.",
    "languages": "Bangla",
    "title": "Misti Cheler Dustu Buddhi",
    "kind": "movie",
    "directors": "Partha Sarathi Manna",
    "cinematographers": "Kunal Khatoi",
    "akas": "Misti Cheler Dustu Buddhi (India)",
    "director": "Partha Sarathi Manna",
    "plot": "_Misti Cheler Dustu Buddhi_ (qv) is actually about three thieves, Kalicharan and his two sidekicks, Puti and Baka who decide to rob and go back to their old tricks after Kalicharan is released from jail. They decide to rob the occupants of the Mitra household: an elderly man, Pradosh Mitra, his two sons and their families. They decide to carry out the robbery at a time when the house will have no occupants according to information received by them. Accordingly they act. But they couldn't be successful because, unknown to them, Pradosh and one of his grandsons, 7 year old Som have decided to stay back and create havoc for them. All their efforts to rob the house are in vain as little Som turns out to be more than a handful for all of them.::Partha sarathi Manna"
}