{
    "id": "6445398",
    "localized title": "I Don't Luv U",
    "cast": [
        "Jass Bhatia",
        "Alok Kumar",
        "Ruslaan Mumtaz",
        "Chetna Pande"
    ],
    "genres": "Romance",
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "United States:Not Rated",
    "original air date": "17 May 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDBkYTEyZTctNTU3OC00ZTYzLWI5MzQtNzZmMTQwZmE3ZGUyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "6445398",
    "plot outline": "'I Don't Luv U' focuses on the youth of today - the fun loving and frivolous lot, who are extremely casual in their relationships & do not want to delve into the intricacies of true love, commitments and fidelity. It is a blend of light-hearted witty moments as well as harsh unforeseen realities of life.Yuvaan, a young handsome boy and Aayra a beautiful NRI girl are just like any other teenagers of this generation, who want to experience their life by getting together in a relationship. They are willing to go through the most beautiful and much needed feeling called 'THE FEELING OF LOVE'. Without realizing what they are doing in the heat of adolescence and the curiosity of discovering each other closely. They end up in an uncontrollable and devastating ugly situation which shatters their life completely. Will Yuvaan fight back with circumstances to get his love and life back on track? I Don't Luv U also lays emphasis on the potential role of media in a common man's life. It elucidates that if misuse of media can jeopardize a commoner's life, at the same time, if used judiciously, it can act as a savior. Watch the full movie I Dont Luv U online, only on Eros Now.",
    "languages": "Hindi",
    "title": "I Don't Luv U",
    "kind": "movie",
    "directors": "Amit Kasaria",
    "writers": "Amit Kasaria",
    "producers": [
        "Lalit Kumar",
        "Anil Kumar Sharma",
        "Kapil Sharma",
        "Kala Singh"
    ],
    "editors": "Suvir Nath",
    "art directors": "Shekhar Ujjainwal",
    "make up department": "Lucky Sahu",
    "production managers": "Anil Sharma",
    "assistant directors": "Vishal Agrawal",
    "sound department": "Pingal Kalita",
    "animation department": "Jayant Raj",
    "writer": "Amit Kasaria",
    "director": "Amit Kasaria",
    "production companies": "Amrapali Media Vision",
    "plot": "'_I Don't Luv U_ (qv)' focuses on the youth of today - the fun loving and frivolous lot, who are extremely casual in their relationships & do not want to delve into the intricacies of true love, commitments and fidelity. It is a blend of light-hearted witty moments as well as harsh unforeseen realities of life.Yuvaan, a young handsome boy and Aayra a beautiful NRI girl are just like any other teenagers of this generation, who want to experience their life by getting together in a relationship. They are willing to go through the most beautiful and much needed feeling called 'THE FEELING OF LOVE'. Without realizing what they are doing in the heat of adolescence and the curiosity of discovering each other closely. They end up in an uncontrollable and devastating ugly situation which shatters their life completely. Will Yuvaan fight back with circumstances to get his love and life back on track? _I Don't Luv U_ (qv) also lays emphasis on the potential role of media in a common man's life. It elucidates that if misuse of media can jeopardize a commoner's life, at the same time, if used judiciously, it can act as a savior. Watch the full movie I Dont Luv U online, only on Eros Now."
}