{
    "id": "6923514",
    "localized title": "Dilli Gang",
    "cast": [
        "Darshan Jariwala",
        "Neena Kulkarni",
        "Asif Basra",
        "Aamir Dalvi",
        "Monika Misra",
        "Yashpal Sharma"
    ],
    "genres": "Thriller",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "25 Oct 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDAyMzg1M2UtNDA5Zi00ZDM3LTk4MzktN2I1OWM0MDAwODQwXkEyXkFqcGdeQXVyMzUzNDA2MjI@._V1_SY150_CR49,0,101,150_.jpg",
    "imdbID": "6923514",
    "plot outline": "Vishambar Prasad (Darshan Jariwala) and his wife Sujata (Neena Kulkarni) have just married off their younger daughter amidst much pomp and gaiety. Soon after the wedding their only son Ashish (Amir Dalvi) flies back to Germany from where he had come only to attend his sister's wedding. The old couple is left alone in their big mansion in Delhi. A few days down the line it is revealed that Sujata is afflicted with multiple myeloma, a rare type of cancer. Somewhere in this city there are four goons whose livelihood is to murder and loot hapless senior citizens in the city. They do this by pretending to be AC mechanics who offer free checks of ACs even when your AC could be working perfectly fine. Dilliwaalas open their doors to anybody who offers a free service. Then there are domestic servants and drivers who are hand-in-glove with the four criminals. This is not to say that such things do not happen. Newspapers are regularly full of crime stories about how senior citizens are cruelly murdered by thugs for money. The way the proceedings are carried out in this film is way too amateurish and even plain lame. That it employs supporting actors who don't look convincing doing their part only spoils things further for Dilli Gang. Vishambar hides the news of his mother's ailment from their son and daughter. Why? Because he thinks it will distract his son and stunt his career in Germany. However, he is quick to send Sujata's reports to Germany for a second opinion from doctors there, saying it is the reports of his friend's wife. Surely, either he conceals Sujata's name on the reports with a whitener before sending it or he gets a fresh one from the doctor (played like a true cardboard character by Asrani).",
    "languages": "Hindi",
    "title": "Dilli Gang",
    "kind": "movie",
    "directors": "Ashish Tyagi",
    "writers": "Rajeshwar Tyagi",
    "producers": [
        "Arshad Siddiqui",
        "Radha Tyagi",
        "Rajeshwar Tyagi"
    ],
    "composers": "Amjad Nadeem",
    "cinematographers": "Shakil A. Khan",
    "editors": "Mansoor Azmi",
    "sound department": [
        "Ameet Ahire",
        "Rupa Shukla Ahire"
    ],
    "akas": "Dilli Gang (India)",
    "writer": "Rajeshwar Tyagi",
    "director": "Ashish Tyagi",
    "production companies": "Radha Creations",
    "plot": [
        "_Dilli Gang_ (qv) is the story of an old man targeted by a dangerous gang which preys on senior citizens living alone. The film is based on true incidents of increasing murders of aged men and women staying alone in metropolitan cities.",
        "Vishambar Prasad (Darshan Jariwala) and his wife Sujata (Neena Kulkarni) have just married off their younger daughter amidst much pomp and gaiety. Soon after the wedding their only son Ashish (Amir Dalvi) flies back to Germany from where he had come only to attend his sister's wedding. The old couple is left alone in their big mansion in Delhi. A few days down the line it is revealed that Sujata is afflicted with multiple myeloma, a rare type of cancer. Somewhere in this city there are four goons whose livelihood is to murder and loot hapless senior citizens in the city. They do this by pretending to be AC mechanics who offer free checks of ACs even when your AC could be working perfectly fine. Dilliwaalas open their doors to anybody who offers a free service. Then there are domestic servants and drivers who are hand-in-glove with the four criminals. This is not to say that such things do not happen. _News_ (qv)papers are regularly full of crime stories about how senior citizens are cruelly murdered by thugs for money. The way the proceedings are carried out in this film is way too amateurish and even plain lame. That it employs supporting actors who don't look convincing doing their part only spoils things further for _Dilli Gang_ (qv). Vishambar hides the news of his mother's ailment from their son and daughter. Why? Because he thinks it will distract his son and stunt his career in Germany. However, he is quick to send Sujata's reports to Germany for a second opinion from doctors there, saying it is the reports of his friend's wife. Surely, either he conceals Sujata's name on the reports with a whitener before sending it or he gets a fresh one from the doctor (played like a true cardboard character by Asrani).::Rajeshwar Tyagi"
    ]
}