{
    "id": "8409530",
    "localized title": "Mandali Tumchyasathi Kay Pan",
    "cast": [
        "Ravindra Berde",
        "Suhasini Deshpande",
        "Bharat Jadhav",
        "Mrunali Jambale",
        "Kishore Nandlaskar",
        "Prasad Oak",
        "Sheetal Pathak",
        "Aditi Sarangdhar",
        "Ashok Shinde"
    ],
    "genres": "Comedy",
    "runtimes": "109",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": "India:U",
    "original air date": "08 Nov 2013 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMWFhNmEyMzUtNDQ2Yi00N2RlLThiODYtYzRlYTAyZmUwMjEwXkEyXkFqcGdeQXVyMTIxMTk1Njk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8409530",
    "plot outline": "Mandali Tumchyasathi Kay Pan Is A Marathi Comedy Movie, Directed By Anil Surve, Featuring Bharat Jadhav And Ashok Shinde. A Criminal Named Kantabhai Played By Bharat Jadhav Is Released From Jail During Diwali And Heads Straight To Meet His Sister. He Realises That His Sister Is Being Tortured By Her In-laws For Dowry. The Film Shows How Kantabhai Teaches Them A Lesson.",
    "languages": "Marathi",
    "title": "Mandali Tumchyasathi Kay Pan",
    "kind": "movie",
    "directors": "Anil Surve",
    "writers": "Sambhaji Sawant",
    "producers": [
        "Ashwini Dharmadhikari",
        "Mandar Dharmadhikari"
    ],
    "composers": "Satish Chandra",
    "cinematographers": "Sameer Athalye",
    "editors": "Sameer Shaikh",
    "thanks": "Yash Gupta",
    "akas": "Mandali Tumchyasathi Kay Pan (India)",
    "writer": "Sambhaji Sawant",
    "director": "Anil Surve",
    "production companies": "Dharmadhikari Production",
    "distributors": [
        "Ultra Media & Entertainment",
        "Pickle Entertainment"
    ],
    "plot": [
        "_Mandali Tumchyasathi Kay Pan_ (qv) Is A Marathi Comedy Movie, Directed By Anil Surve, Featuring Bharat Jadhav And Ashok Shinde. A Criminal Named Kantabhai Played By Bharat Jadhav Is Released From Jail During Diwali And Heads Straight To Meet His Sister. He Realises That His Sister Is Being Tortured By Her In-laws For Dowry. The Film Shows How Kantabhai Teaches Them A Lesson.",
        "Kanta a goon whose permitted from entering city limits comes to meet his Rakhi sister Pooja during Bhau Bheej and finds that she has returned home as her husband Mahesh and in laws were torturing her for dowry.Kanta pretends to be a servant Chandu and starts working in the house of Mane's who are in laws of Pooja where he finds that its a huge family where Nirmala Mane controls the house whose hungry for money while her husband does not have respect in the family and the one who respected him is Pooja and his wheel chair bound daughter.Kanta tries to make things well in the house and win everyone's heart but finds that Mane's want to re marry Mahesh.::alex.mjacko@gmail.com"
    ]
}