{
    "id": "0108778",
    "localized title": "Friends",
    "cast": [
        "Jennifer Aniston",
        "Courteney Cox",
        "Lisa Kudrow",
        "Matt LeBlanc",
        "Matthew Perry",
        "David Schwimmer",
        "James Michael Tyler",
        "Elliott Gould",
        "Christina Pickles",
        "Maggie Wheeler",
        "Paul Rudd",
        "Jane Sibbett",
        "Helen Baxendale",
        "Jessica Hecht",
        "June Gable",
        "Tom Selleck",
        "Aisha Tyler",
        "Giovanni Ribisi",
        "Lauren Tom",
        "Eddie Cahill",
        "Bonnie Somerville",
        "Cole Sprouse",
        "Jon Favreau",
        "Amanda Carlin",
        "Steven Eckholdt",
        "Paget Brewster",
        "Mitchell Whitfield",
        "Debra Jo Rupp",
        "Steve Ireland",
        "Hank Azaria",
        "Tate Donovan",
        "Elle Macpherson",
        "Alexandra Holden",
        "Larry Hankin",
        "Mike Hagerty",
        "Morgan Fairchild",
        "Charles Thomas Allen",
        "John Christopher Allen",
        "Cynthia Mann",
        "Michael Rapaport",
        "Anna Faris",
        "Ron Leibman",
        "Cosimo Fusco",
        "Laura Dean",
        "Kim Harris",
        "Joe Everett Michaels",
        "Douglas Looper",
        "Marlo Thomas",
        "Alison La Placa",
        "Bruce Willis"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "22",
    "countries": "United States",
    "country codes": "us",
    "language codes": [
        "en",
        "es",
        "it",
        "fr",
        "nl",
        "he"
    ],
    "color info": "Color",
    "aspect ratio": "1.78 : 1 (HDTV version)",
    "sound mix": "Stereo",
    "certificates": [
        "Argentina:Atp",
        "Australia:PG::(TV rating)",
        "Brazil:12",
        "Canada:PG::(Manitoba/Nova Scotia/Ontario)",
        "Canada:14A::(Ontario)",
        "Canada:G::(Quebec)",
        "Denmark:A",
        "Finland:S",
        "France:Tous publics",
        "Germany:0::(Season 2 - 4, 6 - 10)",
        "Germany:6::(season 1 & 5)",
        "Hungary:12",
        "Iceland:L",
        "India:13+::(self-applied)",
        "India:U::(some episodes)",
        "India:UA::(some episodes)",
        "Indonesia:13+::(self-applied)",
        "Ireland:PG::(some episodes)",
        "Ireland:G::(some episodes)",
        "Ireland:12::(some episodes, Season 1-10 DVD)",
        "Italy:T",
        "Japan:R18+::(self-applied)",
        "Malaysia:U::(Season 1 - 5)",
        "Malaysia:P13::(season 6 - 9)",
        "Malaysia:18::(seasons 9-10)",
        "Malaysia:18SX::(some episodes)",
        "Mexico:C",
        "Netherlands:AL",
        "Netherlands:6::(Season 5 & 8)",
        "New Zealand:PG::(Season 1-7, 9-10 DVD)",
        "New Zealand:M::(Season 8 DVD)",
        "New Zealand:G::(TV rating)",
        "Norway:7::(Netflix self-rating)",
        "Norway:A::(TV rating)",
        "Philippines:G::(Season 1 - 10)",
        "Philippines:G::(season 1 & 5)",
        "Philippines:PG-13::(season 6 - 9)",
        "Philippines:PG-13::(seasons 9-10)",
        "Poland:12",
        "Portugal:M/12::(DVD rating)",
        "Russia:16+",
        "Russia:0+::(Season 1 - 11)",
        "Russia:6+::(Season 1 - 5)",
        "Russia:12+::(season 6 - 9)",
        "Singapore:PG",
        "Singapore:PG13::(digital streaming)",
        "Singapore:NC-16::(season 9)",
        "South Korea:15",
        "Spain:7::(Netflix)",
        "Sweden:Btl",
        "Sweden:Btl::(Season 1 - 5)",
        "Sweden:7::(season 6 - 9)",
        "Turkey:7+",
        "United Kingdom:15::(Season 4 DVD, since re-rated 12)",
        "United Kingdom:U::(few episodes)",
        "United Kingdom:PG::(some episodes)",
        "United Kingdom:12::(some episodes, Season 1-3, 5-10 DVD)",
        "United States:TV-PG",
        "United States:TV-14::(most episodes)"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDVkYjU0MzctMWRmZi00NTkxLTgwZWEtOWVhYjZlYjllYmU4XkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "0108778",
    "plot outline": "Ross Geller, Rachel Green, Monica Geller, Joey Tribbiani, Chandler Bing, and Phoebe Buffay are six twenty-somethings living in New York City. Over the course of 10 years and seasons, these friends go through life lessons, family, love, drama, friendship, and comedy.",
    "languages": [
        "English",
        "Spanish",
        "Italian",
        "French",
        "Dutch",
        "Hebrew"
    ],
    "title": "Friends",
    "kind": "tv series",
    "series years": "1994-2004",
    "akas": [
        "Six of One (United States)",
        "F·R·I·E·N·D·S (United States)",
        "Friends Like Us (United States)",
        "Across the Hall (United States)",
        "Insomnia Café (United States)"
    ],
    "seasons": [
        "1",
        "2",
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10"
    ],
    "writer": [
        "David Crane",
        "David Crane",
        "David Crane"
    ],
    "production companies": [
        "Bright/Kauffman/Crane Productions",
        "Warner Bros. Television"
    ],
    "distributors": [
        "National Broadcasting Company (NBC)",
        "AB Distribution",
        "ABC 5",
        "ATV",
        "Amazon Prime Video",
        "CanWest Global Communications",
        "Canal Jimmy",
        "Canal+ España",
        "Channel 4 Television Corporation",
        "Channel 4",
        "Channel 5 Television",
        "China Central Television (CCTV)",
        "Comedy Max",
        "Crave",
        "Cuatro",
        "D17",
        "D8",
        "Disney Channel",
        "Dizimax Comedy",
        "E4",
        "ETC",
        "Fox Classics",
        "Fox",
        "France 2 (FR2)",
        "France 4",
        "HBO Max",
        "Kanal 2",
        "M6",
        "NRJ12",
        "NT1",
        "National Nine Network",
        "Netflix",
        "Pop TV",
        "ProSieben",
        "RTL 2",
        "RTL Entertainment",
        "Rai 2",
        "Rai 3",
        "Raidió Teilifís Éireann (RTÉ)",
        "Sat.1",
        "Seven Network",
        "Show TV",
        "Sky One",
        "TFX",
        "Televisión Federal (Telefe)",
        "Telewizja Polska (TVP)",
        "Turner Broadcasting System (TBS)",
        "Télé Monté Carlo (TMC)",
        "VT4",
        "Viasat3",
        "WOWOW",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Vídeo",
        "Yorin"
    ],
    "special effects": [
        "Anatomorphex",
        "Makeup Effects Laboratories"
    ],
    "other companies": [
        "Benay's Bird & Animal Source",
        "Chapman/Leonard Studio Equipment",
        "Complete Post",
        "Direct Tools & Fasteners",
        "MFX",
        "Modern VideoFilm",
        "Panavision",
        "Reprise Records",
        "Tohokushinsha Film Corporation (TFC)",
        "Warner Bros. Studios"
    ],
    "plot": [
        "Follows the personal and professional lives of six twenty to thirty-something-year-old friends living in Manhattan.",
        "Ross Geller, Rachel Green, Monica Geller, Joey Tribbiani, Chandler Bing, and Phoebe Buffay are six twenty-somethings living in New York City. Over the course of 10 years and seasons, these friends go through life lessons, family, love, drama, friendship, and comedy.",
        "The lives of twenty-something friends in New York City, each with their own dreams and drives: Joey a struggling actor, Monica a chef, Rachel a waitress who hopes to work in fashion, Ross a paleontologist, Chandler who hates his job in data processing, and Phoebe a masseuse/musician.",
        "\"With a Little Help From My _Friends_ (qv)\" is a song written by the Beatles (and expertly covered by Joe Cocker) and it could easily be the subtitle for the thirty minute comedy, \"_Friends_ (qv)\". In 1994, the idea was created for \"_Friends_ (qv)\": a show about six friends in New York as they navigate their way through life and learn to grow up as they approach the third decade of their life. All, with the help from each other to get them through the obstacles that life naturally has for us. Monica is the excessively neat and organized \"older sister\" of the group, who works as a chef while yearning to find her ideal love. Ross, Monica's older brother, is a paleontologist with a lifelong crush on Rachel. He is a laid-back man with low self esteem and a recent divorcee. Rachel is the pretty, bubbly girl who spent most of her life as a spoiled rich princess. Now she must learn to face the real world. Chandler is Ross' college buddy and the guy who will crack jokes at a moment's notice. Phoebe is a lovable eccentric masseuse who easily could have fit in with Haight Ashbury in the 1960s. And Joey, the friend who has an inverse relationship between his good looks and his intelligence. He dreams of becoming an actor. These six individuals make up the cast of _Friends_ (qv). In May 2004, _Friends_ (qv) officially ended it's phenomenal 10 year run. The show's time slot was taken over by a spin-off called Joey.::ahmetkozan",
        "Six young (20-something) people from New York City (Manhattan), on their own and struggling to survive in the real world, find the companionship, comfort and support they get from each other to be the perfect antidote to the pressures of life. This average group of buddies goes through massive mayhem, family trouble, past and future romances, fights, laughs, tears and surprises as they learn what it really means to be a friend.::ahmetkozan",
        "A Comedy Series based in Manhatten about 6 young friends, in the struggle to find success and happiness in life, but it is never that straight forward, is it? Rachel Green - A popular schoolgirl of the past, is now a spoiled brat living off her fathers finance. In an attempt to start a new life after running out on her wedding, she shares an apartment with an old best friend Monica Geller, and eventually befriends the other 4 and Monica's older brother, Ross. Monica Geller - A compulsive neat freak, who has trouble with her love life. Monica was teased when she was in high school for being overweight. However, now a head-chef at a top restaurant in Manhatten, she has lost all her excessive weight, and just wants to start a family with 'the right guy' to complete a happy life. Ross Geller - Older Brother of Monica, he has always had strong love feelings for Rachel. A successful professor of science leads him to be often teased by the other 5 friends about his profession. Ross has experienced many misfortunes in life, including 3 divorces and bringing up a child with his lesbian ex-wife. Ross now is devoted to finding a girl to settle down with, without a divorce, and makes it his personal goal to share happiness with Rachel. Phoebe Buffay - Brought up as a fatherless child, Phoebe is a ditzy yet loveable hippy, who has become a personal masseuse. Despite liking her profession, her dream is to become a star in the music industry and bases her songs on her life experiences. The other 5 friends secretly believe that Phoebe will never make it, but still encourage her to write. Phoebe often performs at the 'Central Perk' coffee house, and strongly believes in herself. Chandler Bing - A financially secure data processor, who relies on humor as a defense mechanism. Despite being rich, the other 5 have no idea what his profession is, and Chandler is a wimpy, average looking cigarette addict, who has never had a serious relationship. Will he ever get it, and is she just round the corner from him? Joey Tribiani - Despite being close to all the friends, he is especially open with Chandler, who his also his roommate. Joey is a small time actor, who desperately wants fame and fortune, and Chandler has high hopes of Joey, so helps Joey with money for acting lessons and professional photographs. Despite being a relatively bad actor, Joey is an adorable, sensitive guy, who is very successful with women, but needs to become famous and rich to complete his successful life.::Mekaeal Chaudary"
    ],
    "synopsis": "Comedy series about a tight-knit group of friends living in Manhattan. It also covers their interactions with their families, their lovers, and various colleagues over a period of several years.The series opens with runaway bride Rachel Green, who has just abandoned her fiance Barry Farber at the altar. Having no place to stay in New York City, she manages to locate Monica Geller. Monica used to be Rachel's best friend during their high school year, though they have not seen each other in several years. Rachel convinces Monica to take her in as her new roommate. They rekindle their friendship.Rachel used to be a \"daddy's girl\" who relied entirely on her wealthy father to cover her expenses. Having lost his favor, she gets her first real job as a waitress at the coffeehouse Central Perk. She has no actual skill at her job, but her manager Gunther has fallen for her and never fires her. In later seasons, Rachel is able to find a more lucrative job\nin a fashion company.Monica is a hardworking chef, who owns her own apartment. She is good at her job, but has men-related problems in her personal life. She also has her share of psychological problems, including an obsession with cleanliness, unreasonable levels of competitiveness and frequent signs of obsessive-compulsive behavior. Additional issues explored in the series involve her traumatic memories of her childhood obesity, and her poor relationship with her mother, who always criticizes her.The third member of the group is Ross Gellar, Monica's older brother. He is a paleontologist, who is trying to recover from the abrupt end of his first marriage. His wife Carol Willick came out as a lesbian, and moved in with her lover Susan Bunch. Ross and Carol have a son, Ben. Ross tries to be a good parent, but does not have full custody over him. Meanwhile, he pursues relationships with various women, and tries to advance his career.In later seasons, Ross impulsively marries twice, leading to two more divorces. His string of failed marriages somewhat damages his self-esteem. As explored throughout the series, he was always his parents' favorite and he had an inflated ego.The fourth member of the group is Chandler Bing, a lifelong friend of Ross. He works as a statistical analyst at a company. He resents his job, though it pays well and he is typically more affluent than his friends. He has a sarcastic sense of a humor. He is rather effeminate in behavior, though he is upset when people keep assuming that he is homosexual.As explored in the series, Chandler is the son of celebrity parents. His father is drag queen performer Charles Bing, a fixture of Las Vegas show business. His mother is erotic novelist Nora Tyler Bing, highly successful in her field. He grew up exposed to their respective sex lives, and their eccentricities. He has had more than his share of traumatic experiences and personal insecurities, and typically uses humor as a self-defense mechanism.The fifth member of the group is struggling actor Joey Tribbiani. He starts the series as Chandler's roommate and the two have a closer relationship to each other than anyone else. Joey experiences the unsteady nature of his profession, with relatively few high-profile roles and frequent periods of unemployment.Joey is depicted as rather dim-witted, but gregarious and quite charming. He is a ladies' man, and typically picks up dates or has sex more frequently than anyone else in the group. He has relatively few serious relationships. In his relations to others, he demonstrates a protective streak. He can act as a surrogate brother to his friends.The sixth member of the group is Phoebe Buffay, Monica's former roommate. She works as a masseuse and self-taught folk musician. Phoebe's mother committed suicide when Phoebe was 14-years-old. Phoebe has mostly fended for herself ever since, and reportedly committed a few crimes while living as a street kid. Grown-up Phoebe has instead become a pacifist, a vegetarian, and a tree hugger. She has picked up a few New Age ideas and superstitions, such as believing in spirits and reading in tea-leaves. To Ross' annoyance, Phoebe does not believe in the theory of evolution. Despite having little formal education, Phoebe is apparently fluent in French and Italian.Subplots involving Phoebe involve her relations with surviving members of her family, such as the father who abandoned her, and a kid brother who relies on her for help. Phoebe also has an identical twin sister, Ursula, who seemingly hates Phoebe for unknown reasons."
}