{
    "id": "0155961",
    "localized title": "Ponni",
    "cast": [
        "Kamal Haasan",
        "Lakshmi",
        "M.G. Soman",
        "J.A.R. Anand",
        "Bahadur",
        "C.A. Balan",
        "Paravoor Bharathan",
        "Adoor Bhasi",
        "Janardanan",
        "Manavalan Joseph",
        "K.P.A.C. Lalitha",
        "Muthukulam Raghavan Pillai",
        "Prathapachandran",
        "Sankaradi",
        "Pala Thankam",
        "Rajakumari Venu"
    ],
    "genres": "Drama",
    "runtimes": "100",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "ta"
    ],
    "color info": "Color",
    "certificates": [
        "India:U",
        "United States:Not Rated"
    ],
    "original air date": "03 Sep 1976 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDFjOTFjOTgtMTlmMC00NTU2LWI4YmItZjQ4NGFjNGY2ZmVjXkEyXkFqcGdeQXVyODEzOTQwNTY@._V1_SY150_CR11,0,101,150_.jpg",
    "imdbID": "0155961",
    "plot outline": "The film opens with an Independence Day celebrations organised by the Sub-Collector (Janardanan) of the area and the participation of various tribal groups of the region. Ponni (Lakshmi) belonging to the Mudhuga tribe and Maran (Kamal Haasan) belonging to the Irula tribe who danced on the day are introduced to each other by the Sub-Collector. Ponni and Maran fall in love at the first sight even as they willingly pose for the media. These two tribes are rivals, who follow separate faiths and traditions. The Independence Day photograph of Ponni and Maran are published in the newspapers next day. Chellan (Soman), a Mudhuga, is in love with Ponni, but she dislikes him. Ponni's friend Maashi (Rajakumari) loves Chellan. Tension and strained relations in the Mudhuga tribes is cleverly exploited by the landlords of the area. The tribals practice the 'slash-and-burn' cultivation method, which is resented by the landlords who needed the tribals as cheap labour. Ponni revolts against the attempts of the landlords to hamper their traditional agricultural activities. Maran also stands by Ponni. The Ponni-Maran love affair is met with widespread animosity and opposition. News is spread that the mountain god and the powers of Nature will not be pleased with the inter-tribe relationship. Hanuman (Paravur Bharathan), an tool in the hands of the landlords. He works for them against the tribals. The tribal chief (Muthukulam Raghavan Pillai) warns the Mudhugas that their settlement will be destroyed by natural calamities if Ponni marries Maran and she is banned from meeting Maran. Meanwhile, Ponni's father Nanjan (Sankaradi) decides to marry her to Chellan. The police arrest Maran on false charges of holding firearms without a licence. Ponni meets the Sub-Collector and pleads with him to save Maran and manages to get him freed. The Mudhuga priest Bomman (Adoor Bhasi), through the influence of the landlords and Hanuman, set a trap to kill Ponni. And Bomman makes a prediction that the tribal settlement will soon be destroyed by the anger of Jakkamma, the mountain goddess. Pretending to be possessed by the goddess, Bomman demands human sacrifice to appease the powers and save the tribe. Ponni is chosen for the sacrifice and arrangements are made for the ritual. Maran and Chellan reach the spot in time and save Ponni. The film draws to a happy ending, Maran and Chellan marrying Ponni and Maashi respectively.",
    "languages": [
        "Malayalam",
        "Tamil"
    ],
    "title": "Ponni",
    "kind": "movie",
    "directors": "Thoppil Bhasi",
    "writers": [
        "Thoppil Bhasi",
        "",
        "Malayattoor Ramakrishnan"
    ],
    "producers": "Mo Joseph",
    "composers": "Paravur Devarajan",
    "cinematographers": "Balu Mahendra",
    "editors": "M.S. Mani",
    "art directors": "Bharathan",
    "music department": [
        "C.O. Anto",
        "P. Bhaskaran",
        "Jayachandran",
        "P. Mathuri",
        "Leela P.",
        "P. Susheela",
        "K.J. Yesudas"
    ],
    "akas": [
        "Kollimalai Maaveeran (India, Tamil title)",
        "Kondaraju Koyapilla (India, Telugu title)"
    ],
    "writer": [
        "Thoppil Bhasi",
        "Malayattoor Ramakrishnan"
    ],
    "director": "Thoppil Bhasi",
    "plot": "The film opens with an Independence Day celebrations organised by the Sub-Collector (Janardanan) of the area and the participation of various tribal groups of the region. _Ponni_ (qv) (Lakshmi) belonging to the Mudhuga tribe and Maran (Kamal Haasan) belonging to the Irula tribe who danced on the day are introduced to each other by the Sub-Collector. _Ponni_ (qv) and Maran fall in love at the first sight even as they willingly pose for the media. These two tribes are rivals, who follow separate faiths and traditions. The Independence Day photograph of _Ponni_ (qv) and Maran are published in the newspapers next day. Chellan (Soman), a Mudhuga, is in love with _Ponni_ (qv), but she dislikes him. _Ponni_ (qv)'s friend Maashi (Rajakumari) loves Chellan. Tension and strained relations in the Mudhuga tribes is cleverly exploited by the landlords of the area. The tribals practice the 'slash-and-burn' cultivation method, which is resented by the landlords who needed the tribals as cheap labour. _Ponni_ (qv) revolts against the attempts of the landlords to hamper their traditional agricultural activities. Maran also stands by _Ponni_ (qv). The _Ponni_ (qv)-Maran love affair is met with widespread animosity and opposition. _News_ (qv) is spread that the mountain god and the powers of Nature will not be pleased with the inter-tribe relationship. Hanuman (Paravur Bharathan), an tool in the hands of the landlords. He works for them against the tribals. The tribal chief (Muthukulam Raghavan Pillai) warns the Mudhugas that their settlement will be destroyed by natural calamities if _Ponni_ (qv) marries Maran and she is banned from meeting Maran. Meanwhile, _Ponni_ (qv)'s father Nanjan (Sankaradi) decides to marry her to Chellan. The police arrest Maran on false charges of holding firearms without a licence. _Ponni_ (qv) meets the Sub-Collector and pleads with him to save Maran and manages to get him freed. The Mudhuga priest Bomman (Adoor Bhasi), through the influence of the landlords and Hanuman, set a trap to kill _Ponni_ (qv). And Bomman makes a prediction that the tribal settlement will soon be destroyed by the anger of Jakkamma, the mountain goddess. Pretending to be possessed by the goddess, Bomman demands human sacrifice to appease the powers and save the tribe. _Ponni_ (qv) is chosen for the sacrifice and arrangements are made for the ritual. Maran and Chellan reach the spot in time and save _Ponni_ (qv). The film draws to a happy ending, Maran and Chellan marrying _Ponni_ (qv) and Maashi respectively."
}