{
    "id": "0318593",
    "localized title": "Priyanka",
    "cast": [
        "Viji Chandrashekhar",
        "Delhi Ganesh",
        "Anuradha Hasan",
        "Jaishankar",
        "Jayaram",
        "Venniradai Moorthy",
        "Nassar",
        "Prabhu",
        "Nizhalgal Ravi",
        "Radha Ravi",
        "Revathi",
        "Arvind Swamy"
    ],
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ta",
        "hi"
    ],
    "certificates": "United States:Not Rated",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDhjZDU4NjMtNWMzMi00ZjA4LTlmZmYtMGRmMzBlMWMwYWEyXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0318593",
    "plot outline": "In the Southern part of India, there are two communities living - separated by caste and hatred of each other. The lower caste community has a young woman named Priyanka, who would like to reform and build relationship with both the communities. However, when the leader of the upper caste community proposes that she marry his younger brother, Priyanka refuses, for she loves Raju, an educated village orphan, As a result, the division between the two communities grows, so much so that Priyanka's dad is killed, and she herself is assaulted. Then the communities are hit by heavy torrential rain and floods, which lead to the collapse of the upper caste community, and the question remains: will the lower caste, who have always been oppressed by the upper caste people, forgo their differences and assist them, or will they stand by and watch them being swept away.",
    "languages": [
        "Tamil",
        "Hindi"
    ],
    "title": "Priyanka",
    "kind": "movie",
    "composers": "Ilaiyaraaja",
    "music department": "Ilaiyaraaja",
    "plot": "In the Southern part of India, there are two communities living - separated by caste and hatred of each other. The lower caste community has a young woman named _Priyanka_ (qv), who would like to reform and build relationship with both the communities. However, when the leader of the upper caste community proposes that she marry his younger brother, _Priyanka_ (qv) refuses, for she loves Raju, an educated village orphan, As a result, the division between the two communities grows, so much so that _Priyanka_ (qv)'s dad is killed, and she herself is assaulted. Then the communities are hit by heavy torrential rain and floods, which lead to the collapse of the upper caste community, and the question remains: will the lower caste, who have always been oppressed by the upper caste people, forgo their differences and assist them, or will they stand by and watch them being swept away.::rAjOo (gunwanti@hotmail.com)"
}