{
    "id": "14484662",
    "localized title": "Love U Baka",
    "cast": [
        "Rash Kavithiya",
        "Khyati Madhu",
        "Mukesh Rao"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "gu",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "19 Feb 2016 (India)",
    "imdbID": "14484662",
    "plot outline": "Love U Baka is the story of Baka who arrives in Ahmedabad from a village to pursue higher education and get a job. But as events unfold, he is made to live among two crooks, Sameer and Jigar. However, they become close friends after a series of comically unfriendly events. Life takes a u-turn for Baka when he falls in love with Gini, sister of Chote Dhirubhai, a land shark and a well connected don. Baka gets a make-over to pursue his lady love. But Chote Dhirubhai opposes the idea of Baka marrying his sister and starts to threaten them. As the conflict escalates, Baka discovers and befriend Pushpa, Dhirubhai's betrayed girlfriend. As the Goons chase them in a sequence of comical events, team Baka decides to teach Chote Dhirubhai a lesson of moral values and virtue.",
    "languages": "Gujarati",
    "title": "Love U Baka",
    "kind": "movie",
    "directors": "Utpal Modi",
    "composers": "Firdosh Dekhaiya",
    "akas": "Love U Baka (India)",
    "director": "Utpal Modi",
    "plot": "_Love U Baka_ (qv) is the story of Baka who arrives in Ahmedabad from a village to pursue higher education and get a job. But as events unfold, he is made to live among two crooks, Sameer and Jigar. However, they become close friends after a series of comically unfriendly events. Life takes a u-turn for Baka when he falls in love with Gini, sister of Chote Dhirubhai, a land shark and a well connected don. Baka gets a make-over to pursue his lady love. But Chote Dhirubhai opposes the idea of Baka marrying his sister and starts to threaten them. As the conflict escalates, Baka discovers and befriend Pushpa, Dhirubhai's betrayed girlfriend. As the Goons chase them in a sequence of comical events, team Baka decides to teach Chote Dhirubhai a lesson of moral values and virtue."
}