{
    "id": "1611004",
    "localized title": "ऑटोग्राफ",
    "original title": "Autograph",
    "cast": [
        "Prasenjit Chatterjee",
        "Indraneil Sengupta",
        "Nandana Sen",
        "Rudraprasad Sengupta",
        "Biswajit Chakraborty",
        "Pijush Ganguly",
        "Dwijen Banerjee",
        "Sohini Pal",
        "Dhruv Mookerji",
        "Dilip Roy",
        "Arindol Bagchi",
        "Kamalika Banerjee",
        "Abhrajit Chakraborty",
        "Sumit Samaddar",
        "Rii Sen",
        "Sanghasree Sinha"
    ],
    "genres": "Drama",
    "runtimes": "131",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Stereo",
    "certificates": "United Kingdom:18::(self-applied)",
    "original air date": "14 Oct 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTVlMjM2ODctZWFhZi00NjJhLWI5MDMtNzAwZTc2YmQzZjc5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "1611004",
    "plot outline": "The plot revolves around three lives - a superstar, a young director and a theatre actress - and how their coming together during the process of making a film, changes them forever. The film is also a humble tribute to Satyajit Ray's Nayak.",
    "languages": "Bangla",
    "title": "Autograph",
    "kind": "movie",
    "directors": "Srijit Mukherji",
    "writers": [
        "Srijit Mukherji",
        "",
        "Srijit Mukherji"
    ],
    "producers": [
        "Pritam Chowdhury",
        "Abhishek Daga",
        "Madhu Mantena Varma",
        "Shrikant Mohta",
        "Mahendra Soni"
    ],
    "composers": "Debojyoti Mishra",
    "cinematographers": "Soumik Haldar",
    "editors": "Bodhaditya Banerjee",
    "editorial department": [
        "Arijit Banerji",
        "Debojyoti Ghosh",
        "Nitin Minz"
    ],
    "production designers": "Goutam Basu",
    "art directors": "Ananda Adya",
    "costume designers": [
        "Pooja Chatterjee",
        "Shamlu Dudeja",
        "Abhishek Dutta"
    ],
    "make up department": "Ram Rajak",
    "assistant directors": "Soumyabrata Rakhsit",
    "sound department": [
        "Dipankar Chaki",
        "Justin Jose",
        "Abhijit Sarkar",
        "Anirban Sengupta"
    ],
    "visual effects": [
        "Salil Deshpande",
        "Aziz Merchant",
        "Rajiv Raghunathan",
        "Anuj Upadhyay"
    ],
    "music department": [
        "Shreya Ghoshal",
        "Rupam Islam",
        "Tajdar Junaid",
        "Shankar Mahadevan",
        "Debojyoti Mishra",
        "Priyam Mukherjee",
        "Saptarshi Mukherjee",
        "Srijit Mukherji",
        "Mohammed Rakib",
        "Anupam Roy",
        "Srijato"
    ],
    "miscellaneous": "Sohag Sen",
    "thanks": [
        "Uttam Kumar",
        "Satyajit Ray"
    ],
    "akas": [
        "ऑटोग्राफ (India, Hindi title)",
        "Автограф (Russia)"
    ],
    "writer": [
        "Srijit Mukherji",
        "Srijit Mukherji"
    ],
    "director": "Srijit Mukherji",
    "production companies": "SVF Entertainment",
    "distributors": "SVF Entertainment",
    "other companies": [
        "Brandwizz Communications",
        "A Grinning Tree Production",
        "Editfx Studios",
        "Editfx Studios"
    ],
    "plot": "The plot revolves around three lives - a superstar, a young director and a theatre actress - and how their coming together during the process of making a film, changes them forever. The film is also a humble tribute to 'Satyajit Ray' (qv)'s Nayak.::Anonymous",
    "synopsis": "Shubhabrata (Indraneil Sengupta), an ambitious but inexperienced filmmaker aims for success with his first venture into fiction, a remake of Satyajit Ray's Nayak (1966), replacing situations in the storyline with more contemporary ones, like the train journey with one by an airplane, and extends the ending of the original in his script. He makes several attempts to approach established star actor Arun Chatterjee (Prasenjit Chatterjee) to essay the hero's role (played by Uttam Kumar in the original) but is continually spurned by Arun's associates Ashish (Pijush Ganguly) and Partha (Dwijen Banerjee).Over time, Arun receives a severe jolt to his ego caused by a public putdown from successful producer Manoj Sarkar (Biswajit Chakraborty) on a TV channel. He decides to take it upon himself as a challenge to unilaterally churn out a hit movie, gets to learn of Shubhabrata's script and summons him. Enthused by Shubhabrata's passion and determination, he decides to finance the movie himself, besides playing the lead, and arranging for its production, overruling Ashish and Partha's objections. The film appears to him the ideal platform to prove his ability to deliver a hit single-handedly.After scouring among a few actresses for the lead actress' role (played by Sharmila Tagore in the Ray original), Shubhabrata decides to cast his live-in girlfriend Srinandita (Nandana Sen), Srin in short, an actress involved in translated European theatre, who he'd always had in mind while delineating the character in his script. After initial reservations, Srinandita agrees.Manoj comes to learn of the launch of the film and apporaches Shubhabrata with an offer to help out in case Arun subsequently falls out with Shubhabrata for some reason and decides to shelve the film, but is dismissed.While shooting progresses, Shubhabrata encourages the growing bonding between Arun and Srin in the interest of authenticity in the film. At the same time, however, he himself grows both in confidence and arrogance towards his cast and crew.Now the narrative of the film's storyline begins playing out parallelly in real life where the friendship between Srin and Arun grows to the extent that she turns from his companion into confidante. In a climactic moment, after the last day's shooting is over, Arun invites himself into Srin and Shubhabrata's apartment in a drunken state while the latter is away and confesses to having used an aspiring actress on the casting couch. Srin consoles him saying that his feeling of guilt signifies repentance and holds the promise of redemption.Accidentally, the confession gets recorded on Srin's handycam who's been using it to rehearse for her next stage appearance as Antigone. When Shubhabrata, who has meanwhile been searching for novel ideas to publicize his film, learns of its existence upon his return, he sees a golden opportunity to use it as publicity material and decides to grab it with both hands. Srin is aghast at the suggestion and dissuades him, extracting a promise from him to refrain.However, Shubhabrata soon breaks his promise, steals the clip from Srin's possession unbeknown to her and passes it on to a TV news channel. When Srin learns of this, she leaves him for an uncertain career as drama teacher in a girls' school away from the city.The next day, the channel plays the clip repeatedly and when Arun switches on the TV, he chances upon the clip. He holds both Shubhabrata and Srin guilty of betrayal and when Srin calls him trying to explain and apologise, disconnects. Asish fails to convince him to take legal action against the channel and assault Shubhabrata.When he finally confronts Shubhabrata and learns of Srin's departure, he realises her innocence. However, he decides to cancel the film, and warns Shubhabrata of using his influence to finish his career, short of causing him physical harm.As a final denouement, Shubhabrata, though he is shown to have begun missing Srin, is seen fixing an appointment with Manoj. The outcome of their meeting is however left undepicted, resulting in a partially open ending."
}