{
    "id": "2283748",
    "localized title": "OMG: Oh My God!",
    "cast": [
        "Paresh Rawal",
        "Abhinay Raj Singh",
        "Akshay Kumar",
        "Mithun Chakraborty",
        "Mahesh Manjrekar",
        "Govind Namdeo",
        "Om Puri",
        "Lubna Salim",
        "Nikhil Ratnaparkhi",
        "Murali Sharma",
        "Poonam Jhawer",
        "Yusuf Hussain",
        "Jaineeraj Rajpurohit",
        "Nidhi Subbaiah",
        "Apoorva Arora",
        "Azaan Shah",
        "Honey Chhaya",
        "Krunal Pandit",
        "Bhakti Ratnaparkhi",
        "Arun Bali",
        "Pradeep Vengurlekar",
        "Kukul Taramaster",
        "Nilesh Pandya",
        "Pravin Naik",
        "Puja Gupta",
        "Suneel Chouhan",
        "Shashi Omprakash Sati",
        "Vidya Patwardhan",
        "Vinad Khanna",
        "Karandeep Singh",
        "Chirag Vora",
        "Dimple Danda",
        "Abdul Majid Shiakha",
        "Ishita Vyas",
        "Anil Badola",
        "Tisca Chopra",
        "Jayesh More",
        "Hetal Puniwala",
        "Sameer Rajda",
        "Gaurav Sameley",
        "Jayshankar Tripathi",
        "Ajay Upadhyay",
        "Pathik Desai",
        "Prabhu Deva",
        "Bhavesh Mandalia",
        "Umesh Shukla",
        "Sonakshi Sinha",
        "Chirag Vohra"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "runtimes": "125",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "en"
    ],
    "color info": "Color",
    "certificates": [
        "Australia:PG",
        "Canada:PG::(Alberta)",
        "Canada:G::(British Columbia/Ontario/Quebec)",
        "India:U",
        "Ireland:PG",
        "Netherlands:9",
        "New Zealand:PG",
        "Philippines:G::(self-applied)",
        "Singapore:PG13",
        "South Africa:PG",
        "South Korea:12",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "28 Sep 2012 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGNhYjUwNmYtNDQxNi00NDdmLTljMDAtZWM1NDQyZTk3ZDYwXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "2283748",
    "plot outline": "Oh my God is a story about a person (Kanji Lalji Mehta) who loses his shop in an earthquake. The shop is located an area in Mumbai, known as chor bazaar. Kanji is a person, who even does not fear God and even puts God on ill usage, for his benefit. After disaster, Kanji lodges complaint against God as he does not get benefit of insurance due to act of God. The notice is sent to all bigger baba's. He first goes through a lot of resistance, but eventually people turn out in his favor. People from other religions also join him. Thus notice is sent to every religious head. Later its shown how Kanji wins and people who have lodged complaint against disaster caused get benefited. Its also shown how dongis are bought into vision of normal people.",
    "languages": [
        "Hindi",
        "English"
    ],
    "title": "OMG: Oh My God!",
    "kind": "movie",
    "directors": "Umesh Shukla",
    "writers": [
        "Alok Jha",
        "",
        "Saumya Joshi",
        "",
        "Bhavesh Mandalia",
        "",
        "Pranay Vivek Patil",
        "",
        "Umesh Shukla"
    ],
    "producers": [
        "Rajesh Bhatt",
        "Jyoti Kapur Das",
        "Shivaji Dasgupta",
        "Akshay Kumar",
        "Vikram Malhotra",
        "Kanchan Marathe",
        "B.K. Modi",
        "Paresh Rawal",
        "Mudit Vinayak",
        "Ashvini Yardi"
    ],
    "composers": [
        "Raj",
        "Himesh Reshammiya"
    ],
    "cinematographers": "Sethu Sriram",
    "editors": [
        "Rajesh Panchal",
        "Tushar Shivan"
    ],
    "editorial department": [
        "Kamlesh Parui",
        "Ganesh Shinde"
    ],
    "costume designers": [
        "Rahul Agasti",
        "Khatri Irfan",
        "Moiz Kapadia",
        "Dipti Mhatre",
        "Ajaz Shaikh"
    ],
    "assistant directors": [
        "Masum Ali",
        "Bhrigu Bali",
        "Yousuf S. Basrai",
        "Gunjan Chawla",
        "Pathik Desai",
        "Goldie Duggal",
        "Behzad Khambata",
        "Aditya Rawal",
        "Rushik Rawal",
        "Gaurav Sethi",
        "Awesh Siddiqui",
        "Natalia Sneh"
    ],
    "sound department": [
        "Aarv",
        "Joy Banerjee",
        "Pingal Kalita",
        "Gandhar Mokashi",
        "Ajay Kumar P.B.",
        "Mohammad Iqbal Paratwada",
        "Jitendra Vajpayee"
    ],
    "special effects": "Mahipal Tyagi",
    "visual effects": [
        "Prakash Aher",
        "Sultan Bal",
        "Tathagata Banerjee",
        "Praveen Bareria",
        "Indranil Bhattacharya",
        "Sachin Kumar Chauhan",
        "Dibbyo Choudhary",
        "Santosh Choudhary",
        "Vishal Darkunde",
        "Varadraj Deorukhkar",
        "Vishal Desale",
        "Swapnil Dhawre",
        "Liviu Dinu",
        "Karthik Kumar Durairaj",
        "Subroto Jalui",
        "Vinay Kadam",
        "Sudhakar Kankanampati",
        "Rajesh Kaushik",
        "Dam Khuman",
        "Pritesh Kotian",
        "Mithil Kotwal",
        "Bhuvnesh Kumar",
        "Vishal Kushwah",
        "Amit Malviya",
        "Aziz Merchant",
        "Rohit More",
        "Abhijit Mulye",
        "Sreedev J. Nair",
        "Kunjan Oza",
        "Atul Palande",
        "Amey Panchal",
        "Abhijeet Panda",
        "Vishal Parmar",
        "Prasad Patel",
        "Shritej Patvardhan",
        "Suresh Kumar Puppala",
        "Rambaboo",
        "Nishant Rastogi",
        "Rajeev Kumar Rastogi",
        "Supath Ray",
        "Pratik Redkar",
        "Indranil Roy",
        "Manoj Sakesh",
        "Swapnil Sargade",
        "V. Gouri Shankar Rao",
        "Harshal Shelkar",
        "Kishore Shetty",
        "Shubham.Gupta",
        "Mrityunjay Singh",
        "Hemang Somaiya",
        "Avadhoot Tambe",
        "Merzin Tavaria",
        "Abu Thahir",
        "Yogendra Tonke",
        "Rahul Toraskar",
        "Parikshat Tyagi",
        "Nilesh Uttarwar",
        "Venkatasubramanian",
        "Govardhan Vigraham",
        "Vikas Wadekar",
        "Sunil Kumar Yadav"
    ],
    "stunts": [
        "Parvez Shaikh",
        "Ashraf Stuntindia"
    ],
    "camera department": [
        "Shankar Babu",
        "Manish Mishra",
        "Vasa Srinu"
    ],
    "animation department": "Diganta Maun",
    "music department": [
        "Aarv",
        "Shabbir Ahmed",
        "Salil Amrute",
        "Sakar Apte",
        "Nilesh Dahanukar",
        "Raman Dandyan",
        "Zubeen Garg",
        "Shreya Ghoshal",
        "Amar Mohile",
        "Raj",
        "Salman Shaikh",
        "Aman Trikha"
    ],
    "miscellaneous": [
        "Mayank Badhwar",
        "Parakh Chouhan",
        "Avishek Ghosh",
        "Neo Juris Gitika Aggarwal",
        "Apoorv Singh Karki",
        "Alnoor Merchant",
        "Siddharth Pande",
        "Sahil Sai",
        "Abdul Haider Shaikh",
        "Rakesh Upadhyay"
    ],
    "thanks": [
        "Mihir Bhuta",
        "Tisca Chopra",
        "Prabhu Deva",
        "Salman Khan",
        "Om Puri",
        "Raj",
        "Chandu Shah",
        "Sonakshi Sinha",
        "Bharat Thakkar"
    ],
    "akas": [
        "OMG (United States)",
        "Боже мій! (Ukraine)",
        "OMG: Ó, Magasságos! (Hungary)",
        "Oh My God! (Australia)",
        "偶滴神啊 (Taiwan)"
    ],
    "writer": [
        "Alok Jha",
        "Saumya Joshi",
        "Bhavesh Mandalia"
    ],
    "director": "Umesh Shukla",
    "production companies": [
        "Grazing Goat Pictures",
        "Playtime Creations",
        "Spice Studios",
        "Viacom18 Motion Pictures"
    ],
    "distributors": [
        "Panorama Studios",
        "Video Palace House of Distribution",
        "Grazing Goat Pictures",
        "Viacom18 Motion Pictures"
    ],
    "special effects companies": "Prime Focus",
    "other companies": [
        "Spice PR",
        "T-Series"
    ],
    "plot": [
        "A shopkeeper takes God to court when his shop is destroyed by an earthquake.",
        "Oh my God is a story about a person (Kanji Lalji Mehta) who loses his shop in an earthquake. The shop is located an area in Mumbai, known as chor bazaar. Kanji is a person, who even does not fear God and even puts God on ill usage, for his benefit. After disaster, Kanji lodges complaint against God as he does not get benefit of insurance due to act of God. The notice is sent to all bigger baba's. He first goes through a lot of resistance, but eventually people turn out in his favor. People from other religions also join him. Thus notice is sent to every religious head. Later its shown how Kanji wins and people who have lodged complaint against disaster caused get benefited. Its also shown how dongis are bought into vision of normal people.::muvi-fan-73",
        "Kanji Lalji Mehta an atheist runs a religious article shop and makes fun of religious activities.Once during a natural calamity of earthquake his shop collapses but Kanji is cool as he had insured the shop.When Kanji reaches the insurance company he finds that his shop can't be covered in insurance as it had happened due to act of God.Kanji then decides to sue god in court following which his family leaves him thinking his gone insane.But he gets support from many people of different faith who have suffered in their community due to some wrong doings which happened in their community.But some religious head like Swamy decide to eliminate him as their business is in fear.Its then Lord Krishna himself comes on earth to save him and expose religious heads who run business in name of God.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Kanji Lalji Mehta (Paresh Rawal), a middle-class atheist Hindu owns a shop of Hindu idols and antiques in Mumbai. He is cursed by Siddheshwar Maharaj(Govind Namdeo)when he stopped his son from playing dahi handi. A low-intensity earthquake hits the city, and Kanji's shop is the only shop that is destroyed.Next day at the insurance office, Kanji and his neighbor-assistant Mahadev learn that the disaster claim does not cover any damage caused by natural calamities classified under \"Act of God\". Running out of options, Kanji decides to file a lawsuit against God but fails to find a lawyer for such a lawsuit. Finally, he meets Hanif Qureshi (Om Puri) and his daughter (Puja Gupta), a poor Muslim lawyer family. Qureshi, a disabled man, helps him file the case as Kanji decides to fight on his own. Legal notices are sent to the insurance company as well as to religious priests, Siddheshwar Maharaj,Gopi Maiyya (Poonam Jhawer) and their group's founder, Leeladhar Swamy (Mithun Chakraborty) summoning them to the court as representatives of God on earth.During the preliminary hearing, opposition lawyer Sardesai (Mahesh Manjrekar) asks the judge to dismiss the case. But Kanji points out that religious groups claim to represent God on Earth and speak on his behalf. Hence, they are answerable for his actions. The Judge agrees and the court accepts the case. However, Kanji soon finds himself trapped amongst armed fundamentalists, with his mortgage bank occupying the house, and his wife leaving him. In all instances, Kanji is rescued by Krishna Vasudev Yadav (Akshay Kumar), who claims to be a real estate agent, rides a hot-shot motorbike. Krishna buys Kanji's house from the bank, but allows Kanji to stay with him.The lawsuit causes a public outcry. As Kanji and Krishna watch this on TV, Krishna advises him to go to the media and present his views to the public. Kanji's interview receives wide coverage and public opinion swings in his favor. Meanwhile, hundreds of people, whose insurance claims were rejected due to \"Act Of God\" show up at Hanif Qureshi's house and join the lawsuit. Kanji agrees to fight on behalf of all of them. In the next court session, Catholic priests and Muslim Mullahs are also summoned to the court as defendants. However, lawyer Sardesai points out that Kanji has no document that can prove the disaster was an \"Act of God\". The judge orders Kanji to present a written proof that will support his claim.Kanji loses hope, but Krishna rescues the day again by advising Kanji to read the Bhagavad Gita, and the other holy books such as The Quran and The Bible, telling him that he would find the answer of all his questions. Kanji studies the books intensively for a month. In the next session, Kanji points out a passage present in all the holy books which says that \"This world is a creation of God, and it is his will to allow it to grow or destroy\", which strengthens his case. As he nears the end of his argument, he suddenly loses consciousness. He is rushed to the hospital, where doctors unsuccessfully try to revive him, leaving him comatose. They announce to the media that Kanji has been paralyzed, and that only God can now save him. When Kanji opens his eyes, he finds Krishna in front of him. Krishna caresses the left side of Kanji's body with his key chain and Kanji is able to walk again.Krishna then reveals to the confused Kanji that he himself is Lord Krishna, and he has saved Kanji to show him that God does exist. Kanji then learns that he has been in a coma for a month and that a lot of things have happened during the period. The lawsuit's verdict was in his favor and religious organizations were ordered by court to pay the compensation to all the plaintiffs; people have started calling Kanji a \"God\". Meanwhile, Leeladhar, Gopi Maiyya, and Siddheshwar have opened a temple dedicated to Kanji and accumulated millions in donations. He also learns that as per his own \"will\", he is about to be removed from the ventilator and thousands have gathered for his funeral procession. Krishna gives him a choice of stopping the procession or to sit back quietly. Kanji decides to fight and Krishna takes him on his motorbike to stop the procession. Kanji arrives to find his statues erected at the place where his shop once stood. He wades through the stunned crowd and breaks the statue, then admonishes the crowd about trusting in God-men. He advises them to search for God in themselves, not in statues. When the crowd's anger turns towards the collected God-men, he prevents them from further violence and tells them to allow the cheating group to leave peacefully, advising them not to believe in them anymore.After successfully completing the job, he goes back to Krishna to thank him, only to find him and his motorcycle disappeared. Kanji's family arrive and they are reunited. On their way home, Kanji sees Krishna's key chain on the floor. When he is about to secure it inside his jacket, he hears Krishna's voice, telling him to get rid of the key chain as fear of god was what he fought against all this time. Kanji smiles and throws it away and sees it disappear into the sky with a flash."
}