{
    "id": "3686256",
    "localized title": "Viraat",
    "cast": [
        "Darshan Thoogudeep",
        "Isha Chawla",
        "Vidisha Srivastav",
        "Chaitra Chandranath",
        "Suhasini",
        "Sumalatha",
        "P. Ravi Shankar",
        "Srinivasa Murthy",
        "Sadhu Kokila",
        "Bullet Prakash",
        "Shankanada Anjanappa",
        "Shankanada Aravind"
    ],
    "genres": "Action",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "29 Jan 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGU4ZDRkNzQtNzI0MC00M2ZlLWIzYzYtNTdhZDlhZTRjN2YxXkEyXkFqcGdeQXVyNjE2NDgyMzI@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "3686256",
    "plot outline": "The story thinly revolves around power shortage aptly freshened up by ample doses of action, comedy and love. Viraat Prasad (Darshan) is a businessman who wants to provide a solution to the existing power problem and in consultation with the chief minister, a role played by Suhasini, he plans to build a thermal power project. Enter Surendra Singh (Ravi Shankar), an opportunist, who tries to distract the chief minister and take over the project. But the project is handed over to Viraat which does not go down well with Singh. Balancing the friction and the action is romance involving three ladies - Keerthi (Chaitra Chandranath), Spoorthi (Vidisha Srivastava) and Preethi (Isha Chawla), who are head over heels for Viraat, but the latter chooses one among them, managing to maintain his friendship with the other two. How does he handle Singh and the thermal project and who does he select as his love runs in parallel and forms the crux of the film.",
    "languages": "Kannada",
    "title": "Viraat",
    "kind": "movie",
    "directors": "H. Vasu",
    "producers": [
        "Sandesh Nagaraj",
        "Rathnakumar"
    ],
    "composers": "V. Harikrishna",
    "cinematographers": "Krishna Kumar",
    "music department": "Paul Praveen Kumar",
    "akas": "Viraat (India)",
    "director": "H. Vasu",
    "production companies": "Kumar Brothers Cinema",
    "plot": [
        "A businessman strives to find the solution for the existing power cut problems present in his community.",
        "The story thinly revolves around power shortage aptly freshened up by ample doses of action, comedy and love. _Viraat_ (qv) Prasad (Darshan) is a businessman who wants to provide a solution to the existing power problem and in consultation with the chief minister, a role played by Suhasini, he plans to build a thermal power project. Enter Surendra Singh (Ravi Shankar), an opportunist, who tries to distract the chief minister and take over the project. But the project is handed over to _Viraat_ (qv) which does not go down well with Singh. Balancing the friction and the action is romance involving three ladies - Keerthi (Chaitra Chandranath), Spoorthi (Vidisha Srivastava) and Preethi (Isha Chawla), who are head over heels for _Viraat_ (qv), but the latter chooses one among them, managing to maintain his friendship with the other two. How does he handle Singh and the thermal project and who does he select as his love runs in parallel and forms the crux of the film."
    ]
}