{
    "id": "3740352",
    "localized title": "Kandethal",
    "cast": [
        "Dhananjayan V.P Natyacharya",
        "Geetha Poduval",
        "Devendranath S",
        "Sandeep Sreedhar"
    ],
    "genres": "Family",
    "runtimes": "115",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "original air date": "24 Jun 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjM0Yzk1ZTMtYjM5ZS00YzZkLWFkNmUtZmE4NDFjZmQ5N2NlXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "3740352",
    "plot outline": "Kandethal (Revelation) is a spiritual film deals with, the joys and sorrows of contemporary life to peace and calm in the light of ancient Indian Philosophy. Through personal experience a mother in this film realizes that the reason behind crises in life may not be searched in the exterior world, but in one's own interior world. Here, a mother whose agony on losing her son thinks that the whole children in the world are her own children and overcomes the sadness because of the previous jnana (inherited knowledge) and thus attains bliss.",
    "languages": "Malayalam",
    "title": "Kandethal",
    "kind": "movie",
    "directors": "Sukumarji M",
    "writers": "Sukumarji M",
    "cinematographers": "Shaji Jacob",
    "editors": "Vipin Mannur",
    "akas": "Kandethal (India)",
    "writer": "Sukumarji M",
    "director": "Sukumarji M",
    "plot": "_Kandethal_ (qv) (Revelation) is a spiritual film deals with, the joys and sorrows of contemporary life to peace and calm in the light of ancient Indian Philosophy. Through personal experience a mother in this film realizes that the reason behind crises in life may not be searched in the exterior world, but in one's own interior world. Here, a mother whose agony on losing her son thinks that the whole children in the world are her own children and overcomes the sadness because of the previous jnana (inherited knowledge) and thus attains bliss.::Anonymous"
}