{
    "id": "4387040",
    "localized title": "Airlift",
    "cast": [
        "Akshay Kumar",
        "Nimrat Kaur",
        "Kumud Mishra",
        "Prakash Belawadi",
        "Inaamulhaq",
        "Lena",
        "Nissar Khan",
        "Ninad Kamat",
        "Kaizaad Kotwal",
        "Feryna Wazheir",
        "Ajay Kumar",
        "Purab Kohli",
        "Gunjan Malhotra",
        "Pooja Nair",
        "Taranjit Kaur",
        "Ajay Arya",
        "Avtar Gill",
        "Pawan Chopra",
        "Arun Bali",
        "Surendra Pal",
        "Adiba Hussain",
        "Ritika Badiani",
        "Tvisha Bhavin Chopra",
        "Jiyaara Pitalia",
        "Masood Ahmed",
        "Kamal Karamchandani",
        "Jashan Singh Kohli",
        "Jennifer Mistry Bansiwal",
        "Bachan Pachehra",
        "Harshad Kumar",
        "Ahtesham Hussain",
        "M.G. Radhakrishnana",
        "Ruby Kushwah",
        "Jaiveer",
        "Kapil Punjabi",
        "Uday Bhardwaj",
        "Rajesh Jais",
        "Sanjay Bhatia",
        "Abhijit Bhor",
        "Aaradhna Uppal",
        "Shekhar Shukla",
        "Narendra Jetley",
        "Nithish",
        "Sonika Chopra",
        "Karim Hajee",
        "Parveen Kaur",
        "Sameer Ali Khan",
        "Ratnesh Mani",
        "Udai Singh Pawar",
        "Rockey Raina",
        "Satya Ranjan",
        "Robert Lang"
    ],
    "genres": [
        "Drama",
        "History"
    ],
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Atmos",
    "certificates": [
        "Australia:M",
        "Brazil:14",
        "Canada:PG::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:PG::(Manitoba)",
        "Canada:13+::(Quebec)",
        "France:Tous publics",
        "Hong Kong:IIA",
        "India:UA",
        "Indonesia:13+",
        "Ireland:12A",
        "Malaysia:P13",
        "Netherlands:12",
        "New Zealand:M",
        "Norway:12::(Netflix)",
        "Philippines:PG-13",
        "Singapore:PG13",
        "South Africa:10-12",
        "South Korea:12",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "22 Jan 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMGE1ZTkyOTMtMTdiZS00YzI2LTlmYWQtOTE5YWY0NWVlNjlmXkEyXkFqcGdeQXVyNjQ3ODkxMjE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "4387040",
    "plot outline": "It is in this scenario that Ranjit Katyal (played by Akshay Kumar), a wealthy and powerful Indian businessman, who has always seen himself as a Kuwaiti, rather than an Indian, realizes that he no longer wields any influence on the Iraqis, and that he and his family are in as much danger as anyone else. Ranjit unknowingly becomes the man who all 170,000 Indians look up to for getting them out safely from Kuwait. Airlift is the story of Indians stranded in Kuwait during this traumatic time. A story of how they, with the help of Ranjit Katyal, managed to survive the Iraqi invasion, and against all odds traveled a thousand kilometers across the border into Amman, Jordan. From Amman, 170,000 Indians were brought home by the largest and the most successful evacuation ever attempted by any country, in the history of the world. Over 59 days, the Indian government systematically flew over 488 Air India commercial flights into a war zone to evacuate all 170,000 Indians and safely bring them back home. Airlift is an uplifting and entertaining edge-of-the-seat thriller and is the story of the biggest ever human evacuation in the history of mankind.",
    "languages": "Hindi",
    "title": "Airlift",
    "kind": "movie",
    "directors": "Raja Menon",
    "writers": [
        "Raja Menon",
        "Sonu Sinha",
        "",
        "Ritesh Shah",
        "Suresh Nair",
        "Raja Menon",
        "Rahul Nangia",
        "",
        "Ritesh Shah"
    ],
    "producers": [
        "Monisha Advani",
        "Nikkhil Advani",
        "Aruna Bhatia",
        "Madhu Bhojwani",
        "Hanif Chunawala",
        "Shivaji Dasgupta",
        "Hemraj Dogra",
        "Karan Joshi",
        "Ajay Kapoor",
        "Akshay Kumar",
        "Bhushan Kumar",
        "Krishan Kumar",
        "Krishan Kumar",
        "Vikram Malhotra",
        "Suchit Mukherjee",
        "Gaurav Nanda",
        "Mini Purushot",
        "Sandeep Sharma",
        "Rameshchandra Yadav"
    ],
    "composers": [
        "Arijit Dutta",
        "Amaal Mallik",
        "Ankit Tiwari"
    ],
    "cinematographers": "Priya Seth",
    "editors": "Hemanti Sarkar",
    "editorial department": [
        "Robert Lang",
        "Aasif Pathan",
        "Rithesh Rai",
        "Ganesh Shinde"
    ],
    "casting directors": [
        "Amit R Kumar",
        "Vicky Sidana"
    ],
    "production designers": [
        "Manasi Jage",
        "Mustafa Stationwala"
    ],
    "set decorators": "Tapas Sarkar",
    "costume designers": "Sheetal Sharma",
    "production managers": [
        "Yogesh Yashwant Chavan",
        "Hemraj Dogra",
        "Vishwambhar Kokitkar",
        "Satish Poddar",
        "Jonty Singh Rawat",
        "Kirit Sahgal",
        "Rasdeep Vaishnav"
    ],
    "assistant directors": [
        "Angad Bawa",
        "Deepurani Bedage",
        "Ravish Bhatt",
        "Ragini Roy Choudhary",
        "Rishabh Ghelani",
        "Kriti Kapoor",
        "Manish Mahariya",
        "Kushal Mansukhani",
        "Rahul Nair",
        "Udai Singh Pawar",
        "Ansh Rathore",
        "Aditi Upadhayay",
        "Aditi Upadhyay",
        "Yash"
    ],
    "art department": [
        "Anuprita Ahale",
        "Ruchipujara"
    ],
    "sound department": [
        "Sajjan Choudhary",
        "Justin Jose",
        "Gokul K.R.",
        "Shashi Kasare",
        "Rajesh Kodadi",
        "Debasish Mishra",
        "Sarath Mohan",
        "Dipesh Patel",
        "Satyabhan Patel",
        "Samujjwal Shill",
        "Karnail Singh",
        "Avinash Sonawane",
        "Ashim Sonowal",
        "Vinay Upadhyay",
        "Varun Visoi"
    ],
    "visual effects": [
        "Jitendra Bhatt",
        "Dhiraj Chaudhari",
        "Prince Chaurasia",
        "Yogesh Chautel",
        "Ashok Devadiga",
        "Halder Dipansu",
        "Robin Gaikwad",
        "Swapnil Khotkar",
        "Rohit Korgaonkar",
        "Anup Kumar",
        "Umapathy Kumar",
        "Mahesh Kunder",
        "Sagar Mehta",
        "Vikas Surajbali Nag",
        "Amit Patil",
        "Nilesh Posnak",
        "Mohammad Qasim",
        "Rohit Rane",
        "Kirit Rathod",
        "Sheveta Raut",
        "Aritra Kumar Sarkar",
        "Rahul Saxena",
        "Sufiyan Sheikh",
        "Brijesh Singh",
        "Meera Sukhathankar",
        "Viral Thakkar",
        "Devendra Thakur",
        "Prashant Thakur",
        "Vinay Thakur",
        "Sudhir Trivedi",
        "Shivank Tyagi",
        "Vikram Verma",
        "Issac Vethanayagam",
        "Ashish Yadav",
        "Ashish Yadav"
    ],
    "stunts": [
        "Rais Abid Baluch",
        "Manohar Verma"
    ],
    "camera department": [
        "Abdul Rahim Ansari",
        "Daniell Ashby",
        "Devendra Dash",
        "Piyush Ghosh",
        "Marius Jansen",
        "Øystein Lundstrøm",
        "Ben Mathews",
        "Marius Jansen Panorama Norge",
        "Pranav Raval",
        "Sajid Sanwari"
    ],
    "animation department": "Nitin Bhalla",
    "casting department": [
        "Alex Gee",
        "Ratnesh Mani",
        "Ursula Manvatkar",
        "Sunny Saini",
        "Rakesh Yadav"
    ],
    "costume departmen": [
        "Tanvi Goel",
        "Pallavi Julaniya",
        "Arjun Pasi"
    ],
    "location management": [
        "Jeet Singhania",
        "Jitendra Singhania"
    ],
    "music department": [
        "Meghdeep Bose",
        "Sanjay Chandrasekhar",
        "Jake Charkey",
        "Khaled",
        "Kumaar",
        "Divya Kumar",
        "Tulsi Kumar",
        "Krishnakumar Kunnath",
        "Amaal Mallik",
        "Akash Noatia",
        "Brijesh Shandilya",
        "Arijit Singh",
        "Ankit Tiwari",
        "Abhijit Vaghani"
    ],
    "script department": "Ankit Dahiya",
    "miscellaneous": [
        "Vinod Bhanushali",
        "Harshit Desai",
        "Sonali Jerry",
        "Chandan Kachhawa",
        "Mahima Kaushal",
        "Ahmed Khan",
        "Gagan Meshram",
        "Suchit Mukherjee",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Calpesh Patil",
        "Keshav Purushot",
        "Raedita Tandan",
        "Arvind Thakur"
    ],
    "thanks": "Suleman Mobhani",
    "akas": [
        "撤離科威特 (Taiwan)",
        "Transporte Aéreo (Brazil)",
        "Gong-su-jak-jjeon (South Korea)",
        "Воздушная перевозка (Russia)",
        "Légihíd (Hungary)"
    ],
    "writer": [
        "Raja Menon",
        "Sonu Sinha",
        "Ritesh Shah"
    ],
    "director": "Raja Menon",
    "production companies": [
        "Cape of Good Films",
        "Emmay Entertainment",
        "T-Series"
    ],
    "distributors": [
        "Night Ed Films",
        "T-Series",
        "White Hill Production",
        "B4U Motion Pictures"
    ],
    "special effects": [
        "After",
        "Riva Animation"
    ],
    "other companies": [
        "After",
        "Hype",
        "Sterling Media",
        "T-Series",
        "Trigger Happy Entertainment",
        "Trigger Happy"
    ],
    "plot": [
        "When Iraq invades Kuwait in August 1990, a callous Indian businessman becomes the spokesperson for more than 170,000 stranded countrymen.",
        "It is in this scenario that Ranjit Katyal (played by Akshay Kumar), a wealthy and powerful Indian businessman, who has always seen himself as a Kuwaiti, rather than an Indian, realizes that he no longer wields any influence on the Iraqis, and that he and his family are in as much danger as anyone else. Ranjit unknowingly becomes the man who all 170,000 Indians look up to for getting them out safely from Kuwait. _Airlift_ (qv) is the story of Indians stranded in Kuwait during this traumatic time. A story of how they, with the help of Ranjit Katyal, managed to survive the Iraqi invasion, and against all odds traveled a thousand kilometers across the border into Amman, Jordan. From Amman, 170,000 Indians were brought home by the largest and the most successful evacuation ever attempted by any country, in the history of the world. Over 59 days, the Indian government systematically flew over 488 Air India commercial flights into a war zone to evacuate all 170,000 Indians and safely bring them back home. _Airlift_ (qv) is an uplifting and entertaining edge-of-the-seat thriller and is the story of the biggest ever human evacuation in the history of mankind.::T-Series",
        "Ranjit Katiyal is an influential businessman in Kuwait, who with his contacts and familiarity with the land, organizes a labor camp that shelters fleeing Indians during the 1990 war. He simultaneously negotiates with the Iraqi government and co-ordinates with the Indian government enabling the safe passage of Indians. The entire movement in real life took 488 Air India flights in 59 days and is the largest humanitarian evacuation in the world.::alex.mjacko@gmail.com",
        "_Airlift_ (qv) is a movie about about how 1 lac, 70 thousand Indians were safely moved out of war torn Kuwait in Year 1990. It is shown that one man named Ranjit Katyal (fictional character) was mainly responsible for safety of all this Indians in Kuwait. Ranjit could have fled to safety all alone but chooses to save life of other Indians First.::muvi-fan-73"
    ],
    "synopsis": "The film opens in Kuwait (Aug 1990) with Indian businessman Ranjit Katiyal clinching a business deal with the Emir of Kuwait. Katiyal is a ruthless businessman who will go to any lengths to make a profit. He is successful and well connected in Kuwait and Iraq. Katiyal calls himself a Kuwaiti and is generally derisive towards Indians. He has a large and well appointed mansion in Kuwait, he makes a happy home with his wife Amrita and his sweet little daughter Simu.Late that evening he receives word that Iraq has attacked Kuwait. (He explains that Iraq and Kuwait have had tense relations: Iraq owes a large dollar debt to Kuwait and Saddam has urged the Kuwaiti establishment to reduce oil supply so prices can rise. When Kuwait refused and remained defiant Saddam ordered the attack.) At this point Katiyal believes the attack is one of the many minor border skirmishes. He asks Amrita to take the child away to London for a few days until things cool down.In short order he discovers that the attack was not a minor skirmish. Iraqi soldiers are overruning Kuwait and plundering the city and indiscriminately targeting and murdering Kuwaiti citizens. Katiyal and Nair drive to the Indian Embassy. They are stopped by angry Iraqi soldiers (still in their teenage years) and when Nair begins pleading in Arabic he is shot dead. Katiyal manages to reach the Embassy. The consul, a friend of Katiyal, explains that the Kuwaiti government (the Emir family and others) has fled and Kuwaiti money is now worthless. The 170,000 Indians in Kuwait are now refugees until India decides its policy.Katiyal returns. He is pulled out at a checkpost and taken to the Emir palace. Iraqi Major Khalaf is now in charge. He chides Katiyal for not remembering him from his previous visits to Iraq. He explains that Iraq has always enjoyed good relations with India and now he extends his own personal friendship to Katiyal by which he means Katiyal should transact business with him; business now includes supplies, transport out of Kuwait and anything else that may be needed. Katiyal hurries home; his mansion is looted but his wife and child are safe at his office. Katiyal meets with his friends (one of them owns a supermarket). After some initial confusion he manages to convince them to stay together. A makeshift camp is set up at a nearby school and some 500 Indians move in. Amrita urges Katiyal to use his clout to extricate his own family but Katiyal (who ordinarily would have just looked to himself) appears to have a change of heart.Katiyal decides to stay and help the others get out. He eventually discovers that the Indian Embassy has been evacuated as well. He phones the Indian External Affairs Ministry in New Delhi where he reaches Joint Secretary Kohli who, as is common in the Ministry, redirects him to another officer. As Katiyal is trying to reach someone the camp is looted by Iraqi soldiers. Katiyal reaches the Major who explains that his soldiers need food and may return again. The Major also reveals that Saddam has already permitted Indians to leave Kuwait. Katiyal goes to Baghdad to try and set up a way out of Kuwait.Arriving in Baghdad Katiyal discovers that the Indian Embassy is of no help. (The consul explains that they cannot issue passports since many others - Pakistanis and Bangladeshis - use war as a convenient excuse to claim Indian nationality.) Kuwaitis in Iraq have also fled. The only remaining option, Iraqi Foreign Minister Aziz is somewhat helpful. He is a friend of Katiyal and is sympathetic to the cause. He discloses that an Indian merchant ship is due to arrive in Iraq and he will tacitly permit the 500 Indians to leave on the ship. Katiyal is grateful and returns to Kuwait with the news. But as soon as the buses are loaded and ready to leave Katiyal receives the distressing news that there is a UN embargo and ships are barred from entering or leaving Iraq. One of Katiyal's cantankerous employees rails against him. Amrita comes to his defense and after a loud argument everyone is resolutely supportive of Katiyal.Katiyal continues to keep in touch with the Indian Ministry officer Kohli but Kohli is somewhat of a sluggard. But when his own father recounts their tale of woe during the partition of India, Kohli awakens and begins to actively petition the Minister. The Minister sadly explains that they are in a weak coalition government and the Kuwaiti problem is not a high priority. But Kohli persists and the Minister, half in frustration and half in agreement, asks Kohli to handle it. Kohli approaches Air India (then national airline) and orchestrates an evacuation of the 170,000 Indians in Kuwait.The last part of the plan is arduous. Katiyal bluffs and threatens the Major to get him to let them leave. (The Major had thought he would have obtained more concessions from Katiyal.) Kohli pleads and wrangles the Indian establishment to get the Amman Embassy to issue permits. When Katiyal finally loads up the Indians and leaves he encounters hostile Iraqi soldiers who stop him at a border checkpoint and threaten to rape Amrita. Katiyal fights them off when he finds the Indian contingent right behind him. The Iraqi soldier drops his weapons and lets them pass. They all arrive in Jordan and the Amman Embassy receives word in the nick of time to let them leave for India. Kohli has successfully negotiated safe passage of all the Indians. Air India supplies the planes and the pilots, previously unwilling to fly over war zones, have had a change of heart towards their brethren. The Indian tricolor is hoisted over the Jordan airport.The film ends as the Indians salute Katiyal as they board the planes that will take them home.From Wikipedia"
}