{
    "id": "4799774",
    "localized title": "Devara Naadalli",
    "cast": [
        "Sihi Kahi Chandru",
        "Manu Hegde",
        "Achyuth Kumar",
        "Kiran Naik",
        "Prakash Raj",
        "Disha Ramesh",
        "Kiran Vati"
    ],
    "genres": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "105",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:UA",
    "original air date": "05 Feb 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTU3YzE3MDgtN2I5Ni00MmYzLTkxMzUtMjZhNzFiM2E4NWQ1XkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4799774",
    "plot outline": "Set against the coastal backdrop of North Karnataka , 'Devara Naadalli' is the classic reflection of a society's reaction during times of adversity. A crude bomb explodes in a small town college on the very day the local MLA & Industries Minister is scheduled for a visit. Though the explosion itself does little physical harm, it succeeds in unraveling tales of aspersions that is cast by different sections of the society and how truth remains in complete contradiction with the indictment. Mounting political pressure, communal disharmony and a young love story all come together to highlight the irony that results in this feature film with multiple timelines.",
    "languages": "Kannada",
    "title": "Devara Naadalli",
    "kind": "movie",
    "directors": "B. Suresha",
    "writers": [
        "Aravind Kuplikar",
        "",
        "B. Suresh"
    ],
    "producers": [
        "Shylaja Nag",
        "B. Suresha"
    ],
    "composers": [
        "Hamsalekha",
        "V. Harikrishna"
    ],
    "cinematographers": "Advaitha Gurumurthy",
    "editors": "Jo Ni Harsha",
    "art directors": "Shashidhara Adapa",
    "akas": "Devara Naadalli (India)",
    "writer": [
        "Aravind Kuplikar",
        "B. Suresh"
    ],
    "director": "B. Suresha",
    "production companies": "Media House Studio",
    "distributors": "Thoogudeepa Distributors",
    "plot": [
        "Based on true events, this incisive tale follows the complex sequence of events that are sparked off by a bomb explosion, at a school in a sleepy little coastal town of Karnataka. How will the community react to the event?",
        "Set against the coastal backdrop of North Karnataka , '_Devara Naadalli_ (qv)' is the classic reflection of a society's reaction during times of adversity. A crude bomb explodes in a small town college on the very day the local MLA & Industries Minister is scheduled for a visit. Though the explosion itself does little physical harm, it succeeds in unraveling tales of aspersions that is cast by different sections of the society and how truth remains in complete contradiction with the indictment. Mounting political pressure, communal disharmony and a young love story all come together to highlight the irony that results in this feature film with multiple timelines.::Harish Mallya",
        "Every small town in India is as heterogeneous as India.Various religions, castes and social differences work with each other or against each other to maintain equilibrium . Incidents do keep occurring to upset this equilibrium. Devaranadalli is a cinema that captures one such incident. A crudely made bomb explodes in an educational institute just before the local minister is expected to attend the college event. The film moving explores this incident from various perspectives across varied time lines . Three young people from three different religions and varied economic classes are really close friends without being restricted either by barriers of religion or the economic status. The rich boy Shankara played by Mannu Hegde falls in love with Savitha (played by Disha Ramesh). While in another time line there is a political and business interest collusion to promote an SEZ against the interests of the local people. What triggered the explosion of the country bomb? Who was behind the blast? What are the problems Prakash Rai faces as the investigating officer faces to conduct an impartial inquiry? Is an impartial enquiry finally possible? That is the story of Devara nadalli. In other words the story paints and constructs the DNA of a small town,::Mukund"
    ]
}