{
    "id": "4834850",
    "localized title": "Romance Complicated",
    "cast": [
        "Umang Acharya",
        "Haresh Daghiya",
        "Shweta Dhasmana",
        "Dhwani Gautam",
        "Nilofar Gesawat",
        "Darshan Jariwala",
        "Nisha Kalamdani",
        "Nilofar Khalid",
        "Divya Misra",
        "Maulik Nayak",
        "Nicole Crawford Nelson",
        "Emre Orun",
        "Malhar Pandya",
        "Riddhi Rawal Parikh",
        "Rutvij Patel",
        "Sameer Rajda",
        "Shekhar Shukla",
        "Rajesh Thakkar",
        "Nirmit Vaishnav",
        "Dharmesh Vyas",
        "Yulia Yanina"
    ],
    "genres": "Romance",
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": "gu",
    "color info": "Color",
    "original air date": "15 Jan 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2NmOGNlNTQtZWFjZC00MDBlLTk4NDEtMjZkM2UxYTFiOGQwXkEyXkFqcGdeQXVyNjQzNTMxNDQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "4834850",
    "plot outline": "Romance Complicated is a journey of exploring emotions, romance, friendship and life. When two opposite characters, Dev and Maahi meet under circumstances created by destiny, life takes them through paths never thought of. From virtual relations to encounters with reality, from arguments to friendship and from comedy to romance, a tale of emotions rather than a story of two people. Dev, the king of romance, flirtatious and a hardcore bollywood devotee yet innocent desi guy meets Maahi, the ultramodern, carefree, gorgeous and arrogant high society girl. Stuck together in pursuit of their selfish motives, they understand the true essence of their strange but irresistible bonding. Initial problems soon become a reason for living, and life takes a sharp bend when sparks arise, complicating things to the maximum and taking you through a roller coaster ride of emotions. The movie also portrays the transformation of all characters as they pass through different phases of the story. Bonding, Love, Realization and Separation, all aspects form the core essence of the story.",
    "languages": "Gujarati",
    "title": "Romance Complicated",
    "kind": "movie",
    "directors": "Dhwani Gautam",
    "writers": [
        "Dhwani Gautam",
        "",
        "Vipul Sharma"
    ],
    "producers": [
        "Dhwani Gautam",
        "Kirti Premraj Jain",
        "Nishit K. Jain",
        "Rajiv Sharma"
    ],
    "composers": [
        "Jatin-Pratik",
        "Darshan Raval"
    ],
    "cinematographers": "Prashant Gohel",
    "editors": "Harkirat Singh Lal",
    "editorial department": [
        "Nishit Mistry",
        "Santosh Pawar",
        "Nitin Singh"
    ],
    "casting directors": "Dhwani Gautam",
    "costume designers": [
        "Harshil Daxini",
        "Nilay Patel"
    ],
    "production managers": "Ishit Pathak",
    "assistant directors": [
        "Parth Patel",
        "Utapl Patel",
        "Siddharth Singh"
    ],
    "sound department": "Ravi Jasraj",
    "casting department": [
        "Rita Manyette",
        "Sanket Raval"
    ],
    "music department": [
        "Dave Jigar",
        "Urmila Sutar"
    ],
    "miscellaneous": [
        "Ankit Brahmbhatt",
        "Chetan Chauhan"
    ],
    "akas": "Meet Devda (Canada, English title)",
    "writer": [
        "Dhwani Gautam",
        "Vipul Sharma"
    ],
    "director": "Dhwani Gautam",
    "production companies": [
        "Dhwani Gautam Films",
        "Dhwani Gautam Films",
        "Dhwani Gautam Films",
        "Luminescence Films"
    ],
    "other companies": [
        "Blow Horn Media",
        "Blow Horn Media"
    ],
    "plot": [
        "As a favor to his father's best friend, a young man agrees to escort a woman to America where she's expected to devote herself to her studies.",
        "_Romance Complicated_ (qv) is a journey of exploring emotions, romance, friendship and life. When two opposite characters, Dev and Maahi meet under circumstances created by destiny, life takes them through paths never thought of. From virtual relations to encounters with reality, from arguments to friendship and from comedy to romance, a tale of emotions rather than a story of two people. Dev, the king of romance, flirtatious and a hardcore bollywood devotee yet innocent desi guy meets Maahi, the ultramodern, carefree, gorgeous and arrogant high society girl. Stuck together in pursuit of their selfish motives, they understand the true essence of their strange but irresistible bonding. Initial problems soon become a reason for living, and life takes a sharp bend when sparks arise, complicating things to the maximum and taking you through a roller coaster ride of emotions. The movie also portrays the transformation of all characters as they pass through different phases of the story. Bonding, Love, Realization and Separation, all aspects form the core essence of the story.::Dhwani Gautam",
        "_Romance Complicated_ (qv) is a journey of exploring emotions, romance, friendship and life. When two opposite characters, Dev and Maahi meet under circumstances created by destiny, life takes them through paths never thought of. From virtual relations to encounters with reality, from arguments to friendship and from comedy to romance, a tale of emotions rather than a story of two people.::Dhwani Gautam"
    ]
}