{
    "id": "5297256",
    "localized title": "Pulimurugan",
    "cast": [
        "Mohanlal",
        "Jagapathi Babu",
        "Kamalinee Mukherjee",
        "Lal",
        "Vinu Mohan",
        "Bala",
        "Suraj Venjaramoodu",
        "Kishore Kumar G.",
        "Siddique",
        "Makrand Deshpande",
        "Noby Marcose",
        "Ajaz Kollam",
        "M.R. Gopakumar",
        "Santhosh Keezhattoor",
        "Hareesh Peradi",
        "Nandu",
        "Sethu Lakshmi",
        "Namitha",
        "Said Alharbi",
        "Anjana Appukuttan",
        "Chempil Asokan",
        "Idavela Babu",
        "Eric Cullet",
        "Jayakrishnan",
        "Sasi Kalinga",
        "Sudheer Karamana",
        "Vinod Kedamangalam",
        "Anjali Nair",
        "Chali Pala",
        "Kannan Pattambi",
        "Antony Perumbavoor",
        "Durga Premjith",
        "V.A. Thajudeen",
        "Baiju V.K."
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "161",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "ta",
        "te"
    ],
    "color info": "Color",
    "certificates": [
        "Canada:14A::(Alberta)",
        "Canada:PG::(British Columbia)",
        "India:U::(CBFC)",
        "Ireland:12A::(theatrical)",
        "New Zealand:M",
        "Singapore:PG13",
        "United Kingdom:12A",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "07 Oct 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODUyYThiZmEtZDhlYy00NWMyLWJlZDktNDcxNzE0M2VkMzlhXkEyXkFqcGdeQXVyMzQ5Njc3NzU@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "5297256",
    "plot outline": "Murugan has a rivalry towards tigers from childhood. From childhood he gets trained to hunt tigers,which are danger to villagers. Now he is Pulimurugan, but he has to face the tigers as well as the dangerous humans, as he is forced to move out of forest. This forms the rest of the story.",
    "languages": [
        "Malayalam",
        "Tamil",
        "Telugu"
    ],
    "title": "Pulimurugan",
    "kind": "movie",
    "directors": "Vysakh",
    "writers": "Udaykrishnan",
    "producers": "Tommichan Mulakupadam",
    "composers": "Gopi Sundar",
    "cinematographers": "Shaji Kumar",
    "editors": "John Kutty",
    "editorial department": [
        "Siddique Hyder",
        "K.R. Midhun",
        "Shanu Stonedoor"
    ],
    "art directors": "Joseph Nellikkal",
    "costume designers": "Arun Manohar",
    "make up department": "Saji Koratty",
    "production managers": "Noble Jacob",
    "assistant directors": "Shaji Padoor",
    "sound department": [
        "Jyoti Chetia",
        "Subhashree Das",
        "Manoj M. Goswami",
        "Vimal Kumar",
        "Yadav Manoj",
        "Tapas Nayak",
        "P.V. Vaisakh"
    ],
    "visual effects": [
        "Bhuvaneswaran",
        "Jayadeep Chandran",
        "Jaiganesh",
        "Mehul Joshi",
        "Mehul Joshi",
        "Trinadha Rao Kolli",
        "Manavi",
        "Murali Manohar Reddy Penubadi",
        "Raju Purushothaman",
        "Manoj Sarkar",
        "Naresh Sattenapalli",
        "Arunachallam Sivaprasad",
        "P.N. Swathi",
        "Junaid Ullah",
        "Harsha Vardhan"
    ],
    "stunts": [
        "Yannick Ben",
        "Eric Cullet",
        "Peter Hein"
    ],
    "camera department": "Ramdas Mathur",
    "music department": [
        "Rafeeq Ahammed",
        "K.S. Chithra",
        "Vani Jairam",
        "Murukan Kattakkada",
        "Mohanlal",
        "Hari Narayanan",
        "Gopi Sundar",
        "K.J. Yesudas"
    ],
    "miscellaneous": [
        "Mehul Joshi",
        "Jissen Paul",
        "Sarathvinu",
        "Vysakh"
    ],
    "akas": "Manyam Puli (India, Telugu title)",
    "writer": "Udaykrishnan",
    "director": "Vysakh",
    "production companies": "Mulakuppadam Films",
    "distributors": [
        "Mulakuppadam Release",
        "Phars Film",
        "Phars Film",
        "Saraswati Films",
        "Hotstar",
        "Hotstar",
        "Star VijayTV"
    ],
    "special effects": [
        "Prism & Pixels",
        "Firefly"
    ],
    "other companies": "Millennium Audios",
    "plot": [
        "When a small village near a forest is under the threat of man eating tigers and a drug mafia, the villagers seek the help of an unstoppable force, a hunter invincible.",
        "Murugan has a rivalry towards tigers from childhood. From childhood he gets trained to hunt tigers,which are danger to villagers. Now he is _Pulimurugan_ (qv), but he has to face the tigers as well as the dangerous humans, as he is forced to move out of forest. This forms the rest of the story.::Akash M S"
    ],
    "synopsis": "Murugan (Mohanlal) lives in Puliyoor, a small forest village that is vulnerable to man-eating tigers- called Varayan Puli (striped leopard) by the villagers-and frequent human-wildlife conflicts. When he was young, Murugan's mother died after his brother Manikuttan was born. Soon after, his father was killed by a tiger; in vengeance, Murugan traps and kills the tiger with the help of his uncle Balaraman.Years later, Murugan is a lorry driver, has married Myna (Kamalini Mukherjee), and has a daughter, Chakki. He hunts and kills rogue tigers whenever they invade the village. Acknowledging his skills in hunting Varayan Puli, the villagers call him Pulimurugan (Leopard-Murugan). Murugan is grateful to the villagers who cared for him after his parents' deaths, and is obsessively protective of Manikuttan, who is about to finish his MBA graduation in Mangalore.One day, Kadutha, the village chief, meets a hooded stranger who asks the whereabouts of Murugan for a hunting assignment. Murugan has been away from Puliyoor for days and many people have been killed by tigers. According to Kadutha, Manikuttan's friends Benny and Shiva have arriving at Puliyoor, sent by Manikuttan to see Balaraman. Shiva's father Daddy Girija owns a pharmaceutical company that is developing a drug to treat cancer and they need ganja (marijuana) from the forest. If the medical research succeeds, Manikuttan will be offered a job in the company, so Balaraman helps them. They make a contract with Ramaiya, an illegal ganja dealer in the forest; on their return to the village they encounter a tiger but are saved by Murugan, who kills it.Meanwhile, Manikuttan returns home after his final examinations. The forest officials have found the dead tiger's carcass at Thookupara; its killing is a violation of the Indian Wildlife Protection Act, a non-bailable offense. Forest ranger R. K. is assigned to investigate; R.K. has a four-year-old grudge against Murugan. R.K. had once tried to molest Myna, only to be threatened by Murugan. Taking advantage on the present scenario, R.K. prepares to file a self-witness F. I. R. against Murugan, who is forced to hide. Meanwhile, ACP Iyep Zachariah arrives at Puliyoor, apparently for Murugan.The ganja is loaded into Murugan's lorry for transporting to Mangalore. Shiva and Benny hear that a confidant of Ramaiya is in police custody; seeing a possibility of leaking the information, they are forced to transport it overnight. Shiva offer Murugan sanctuary in Kasaragod under Daddy's protection and deceives him that the police are in pursuit to arrest him for the tiger killing. A team lead by Zachariya arrives at Murugan's home. Murugan with his family escape to Mangalore in the transport and manage to escape the police. He delivers the ganja and Manikuttan gets the job he was offered.Murugan impresses Daddy and earns his trust by helping in his business activities. Meanwhile, more people are killed by tigers at Puliyoor. In an encounter with Zachariya, Murugan learns that Daddy is illegally producing hash oil and exporting it under cover of the pharmacy where Manikuttan is working. Manikuttan co-operates with police to capture Daddy. Shiva catches Manikuttan extracting evidence of their activities and tortures him. Murugan rescues Manikuttan; in the ensuing fight, Shiva is accidentally killed by Murugan. Police ambush Daddy but he escapes.Murugan returns home; the hooded stranger is revealed to be Daddy, who is seeking revenge for his son's death. He assembles a group of henchmen and assassins, and ambushes Balaraman and villager Poongayi Sasi. Daddy and his gang take Balaraman and send Sasi back with severe injuries. Murugan decides to kill Daddy and a battle with the assassins ensues. Murugan kills them all and saves Balaraman. Daddy is killed by the tiger and Murugan kills it."
}