{
    "id": "5310090",
    "localized title": "Saala Khadoos",
    "cast": [
        "Madhavan",
        "Ritika Singh",
        "Mumtaz Sorcar",
        "Nassar",
        "Radha Ravi",
        "Zakhir Hussain",
        "Kaali Venkat",
        "Baljinder Kaur",
        "Bipin",
        "Bipin",
        "Olympic Devarajan",
        "Zakir Hussain",
        "Talib Mehdi",
        "M.K. Raina",
        "Ashiqa Salvan",
        "Raj Sharma",
        "Ravindra Vijay"
    ],
    "genres": [
        "Action",
        "Drama",
        "Sport"
    ],
    "runtimes": "109",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "ta"
    ],
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:PG::(British Columbia)",
        "Canada:PG::(Ontario)",
        "Canada:G::(Quebec)",
        "France:Tous publics",
        "India:UA",
        "India:UA",
        "India:U",
        "Indonesia:13+",
        "Malaysia:P13",
        "New Zealand:M",
        "Singapore:PG13",
        "Singapore:PG",
        "South Africa:13",
        "South Korea:15",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "29 Jan 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGE5Nzk5NDQtYjNmNi00ODE5LWEwNzktMTEwMTA4N2MyOGZmXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5310090",
    "plot outline": "An under-fire boxing coach, Prabhu is transferred from Hisar in Haryana to Chennai as his bosses at the Boxing Council do not like his disrespectful rule-breaking unconventional ways. In Chennai, he chances upon the raw fighting talent of Madhi, the sibling of aspiring boxer Lakshmi. He decides to put all his effort to tame Madhie and get her to shine but he is repeatedly put off by her playfulness & distrust.",
    "languages": [
        "Hindi",
        "Tamil"
    ],
    "title": "Saala Khadoos",
    "kind": "movie",
    "directors": "Sudha Kongara",
    "writers": [
        "Sudha Kongara",
        "",
        "Sudha Kongara",
        "",
        "Sudha Kongara",
        "",
        "Madhavan",
        "",
        "Arun Matheshwaran",
        "",
        "Manoj Tapadia",
        "",
        "Manoj Tripathi",
        "",
        "Amitabh Verma"
    ],
    "producers": [
        "Rajkumar Hirani",
        "C.V. Kumar",
        "Madhavan",
        "S. Sashikanth",
        "Avinash Viswanathan"
    ],
    "composers": "Santhosh Narayanan",
    "cinematographers": "Sivakumar Vijayan",
    "editors": "Sathish Suriya",
    "editorial department": "Deepak Shirsat",
    "production designers": "Gopi Prasannaa",
    "art directors": [
        "Santhanam",
        "Santhanam",
        "Sucha Singh"
    ],
    "production managers": "Abhay S. Dutta",
    "assistant directors": [
        "Vijay Boothalingam",
        "Tom Delmar",
        "Tom Delmar",
        "Amitabh Verma"
    ],
    "art department": "Manoj Kumar",
    "sound department": [
        "Aadi Arora",
        "Vishnu Govind",
        "Vignesh Guru",
        "Sree Sankar",
        "Samujjwal Shill",
        "S. Sivakumar",
        "G. Sreesan",
        "Krishnan Subramanian",
        "Vajjiravel Varun"
    ],
    "visual effects": [
        "Bhuvaneswaran",
        "Bintu Kharolia Parjapati",
        "Raju Purushothaman",
        "Srirengaraj"
    ],
    "stunts": [
        "Tom Delmar",
        "Tom Delmar",
        "Sam"
    ],
    "camera department": [
        "C.H. Balu",
        "Gopinath",
        "Aditya Terkar"
    ],
    "music department": [
        "Bhavesh Bhatt",
        "Dhee",
        "Pradeep Kumar",
        "Muthamil",
        "Santhosh Narayanan",
        "Sean Roldan",
        "Shyamalangan",
        "Vijay",
        "Vijaynarain",
        "Vivek"
    ],
    "miscellaneous": [
        "Alimbasha",
        "Khyati Madaan",
        "Gopi Prasannaa"
    ],
    "akas": [
        "Irudhi suttru (India, Hindi title)",
        "Irudhi Suttru (India, Tamil title)",
        "Final Round (United States)",
        "Особо упрямый (Russia)",
        "ファイナル・ラウンド (Japan, Japanese title)"
    ],
    "writer": [
        "Sudha Kongara",
        "Sudha Kongara",
        "Sudha Kongara"
    ],
    "director": "Sudha Kongara",
    "production companies": [
        "Oveyen Studio",
        "Rajkumar Hirani Films",
        "Thirukumaran Entertainment",
        "Tricolour Productions",
        "UTV Motion Pictures",
        "Y Not Studios"
    ],
    "distributors": [
        "AP International",
        "Dream Factory",
        "Night Ed Films",
        "Qentertainment",
        "Jaya TV",
        "Rajkumar Hirani Films",
        "Sony Max",
        "Tricolour Productions"
    ],
    "special effects": "Prism & Pixels",
    "other companies": [
        "AP International",
        "Lahari Music",
        "T-Series",
        "Trigger Happy Entertainment"
    ],
    "plot": [
        "The story of a former boxer who quits boxing following a fallout with the authorities over the underlying politics but goes on to coach a fisherwoman to fulfill his dream through her.",
        "An under-fire boxing coach, Prabhu is transferred from Hisar in Haryana to Chennai as his bosses at the Boxing Council do not like his disrespectful rule-breaking unconventional ways. In Chennai, he chances upon the raw fighting talent of Madhi, the sibling of aspiring boxer Lakshmi. He decides to put all his effort to tame Madhie and get her to shine but he is repeatedly put off by her playfulness & distrust.::PipingHotViews",
        "Prabhu (Madhavan) is an audacious boxing coach, who does not have a good name at Indian Boxing Federation. Least impressed by the existing boxers in Chennai, an intrepid fisher-woman Madhie (Ritika Singh), who accompanies her boxer sister Lux (Mumtaz Sorcar) for training grabs the attention of Prabhu. Prabhu feels that she is a naturally gifted boxer and even pays 500 bucks a day so that she undergoes training. At one point of time, Madhie falls in love with Prabhu and loses a qualifier, which in turn irks the latter and he sends her back to home. Can Madhi triumph against all the odds against her ?::Kamal",
        "Inspired by the Indian women boxing revolution and North Chennai's boxing culture. It tells the story of a former boxer Prabhu (R Madhavan) who failed to pursue his dreams due to the corruption in the national selection panel. Now he's assigned to coach a Chennai branch boxing association, where he finds Madhi (Ritika Singh), a young boxing enthusiastic and decides to assist her all the way. When the time comes to take her to the selection panel in the national capital, his old rivalry once again stands between their dreams.::Reno",
        "Irudhi Suttru is the story of Madhi and her travels from a poor fishergirl in North Chennai to the international boxing championship alongside an innocent but unrequited crush on her coach Prabhu. Prabhu is an irreverent ex-boxer whose career was stymied by politics in the boxing federation. He is obsessed with finding talent and coaching them to victory which eluded him and does it in an abrasive manner without caring about the consequences. Irudhi Suttru engages, moves and entertains. Carried substantively by the brilliant debutante and real-life MMA fighter, Madhi, the movie is the product of the skill, commitment to a good story and research by the team and cast.",
        "A failed boxer becomes a bitter alcoholic, but when he is forced to become the coach of the women's boxing team, he finds hope for redemption in the form of a fiery 17-year-old. Can he instill in her the skills she needs to become a champion?::Shrinivas G. Kulkarni"
    ],
    "synopsis": "Prabhu Selvaraj (Tamil version)/Adi Tomar (Hindi version) (Madhavan) is a failed boxer who, despite being very talented, falls victim to the dirty politics in the boxing association. Ten years later, he is a coach for the women's boxing teams but is extremely angry and frustrated with the partiality in selection. Due to his rift with the association head Dev Khatri (Zakir Hussain), he is falsely charged with sexual harassment and transferred to Chennai. Despite the very poor infrastructure, Prabhu/Adi manages to find talent in a roadside fish seller Madhi (Ritika Singh), who he notices while she is thrashing the judges during her sister's tournament.Ignoring Madhi's elder sister Lakshmi (Mumtaz Sorcar) who has been boxing for 8 years, Prabhu offers to train Madhi for a few hours daily. But the two don't get along due to Prabhu's/Adi's ruthless training methods and Madhi's aggressive nature. As a result, Madhi intentionally loses a local match. Prabhu later asks Lakshmi and Madhi's parents, Saamikannu (Kaali Venkat) and Damayanthi (Baljinder Kaur), to send them to stay in hostel with him so their daughters can work hard on training. Madhi misunderstands him, but later regrets when she finds out that Prabhu has sold his bike to buy new training equipment for her. Madhi then dedicatedly starts training with Prabhu and develops feelings for him. On the day of a qualifying match, she reveals her feelings to Prabhu and he promptly rejects her. During the warm-up before the match, a now jealous Lakshmi injures Madhi's hand causing Madhi to lose. Angry, Prabhu thinks that Madhi lost intentionally again and throws her out of training camp.Dev takes advantage of the situation by calling Madhi to Delhi for a cultural exchange tournament and makes her fight with a heavy weight Russian boxer, who knocks out Madhi in a few seconds. A demotivated Madhi is then approached by Dev with an indecent proposal, to which she reacts by injuring him. Dev takes revenge by getting her arrested on false theft charges.Prabhu comes to the rescue and bails her out. He later takes Madhi to Delhi to get her a wild-card entry into the World Boxing Championship. Many people in the association, including Lakshmi, accuse Madhi of offering sexual favours to Prabhu. Ignoring all the accusations Madhi works hard and goes on to win the semifinal. On the day of finals, Dev removes Madhi's name from the list and asks Prabhu to resign immediately if he wants to see Madhi in the final, with the same Russian boxer who knocked her out in Delhi. Madhi gets to fight in the final round but is dejected after learning about Prabhu's resignation. She keeps losing points in the early rounds and gets badly injured before Prabhu shows up at the stadium and indicates her to attack her opponent's arms to make her weak. Madhi follows the game plan and knocks out the opponent with seconds to go in the final round. Dev quickly jumps into the ring to take the credit for training Madhi but she punches him and runs to Prabhu. Madhi and Prabhu hug each other, showing their emotional reunion."
}