{
    "id": "5332246",
    "localized title": "Bisile",
    "cast": [
        "Diganth",
        "B.S. Dwarakish",
        "Jai Jagdeesh",
        "Jennifer Kotwal"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "128",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color::(CinemaScope)",
    "certificates": "India:U",
    "original air date": "26 Nov 2010 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTlhYmMxY2ItZjkxYS00MTVhLThiMDEtOTdhNWZhMDA5YTYyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5332246",
    "plot outline": "The story begins with Vicky (diganth) who is a careless and reckless guy with no respect for elders and indulges in all vices. His parents are miffed with him and he doesn't even know to treat his sister properly. However, his life takes a turn when he sees Anu (jennifer) who is a rather serious girl. Much to Vicky's luck, the families go for a picnic and in between, both of them get lost in the forest of Bisile ghat. Together, they spend three days and it is here that both of them fall in love. What happens after that forms the rest of the story.",
    "languages": "Kannada",
    "title": "Bisile",
    "kind": "movie",
    "directors": "Sandeep s Gowda",
    "writers": "Sandeep s Gowda",
    "producers": [
        "Chandru t Gowda",
        "Kiran p Reddy"
    ],
    "composers": [
        "Gagan Baderiya",
        "Rishikesh Hari"
    ],
    "cinematographers": "Niranjan Babu",
    "editors": "Shivaraj Mehu",
    "akas": "Bisile (India)",
    "writer": "Sandeep s Gowda",
    "director": "Sandeep s Gowda",
    "production companies": "Bisile Creations",
    "plot": "The story begins with Vicky (diganth) who is a careless and reckless guy with no respect for elders and indulges in all vices. His parents are miffed with him and he doesn't even know to treat his sister properly. However, his life takes a turn when he sees Anu (jennifer) who is a rather serious girl. Much to Vicky's luck, the families go for a picnic and in between, both of them get lost in the forest of _Bisile_ (qv) ghat. Together, they spend three days and it is here that both of them fall in love. What happens after that forms the rest of the story."
}