{
    "id": "5346970",
    "localized title": "Kadhantharam",
    "cast": [
        "Nedumudi Venu",
        "Rahul Madhav",
        "Vishnupriya",
        "Indrans",
        "Pradeep Kottayam",
        "Jaya Kumar",
        "Jayakumar Parameshwaran Pillai",
        "Santhakumari",
        "Sidhartha Siva",
        "Geetha Vijayan"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "original air date": "22 Jan 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjExOTAyZjctMmRiZS00ZWZiLWJkYzAtNjBiNjBiYzQ0MzNkXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "5346970",
    "languages": "Malayalam",
    "title": "Kadhantharam",
    "kind": "movie",
    "directors": "K.J. Bose",
    "writers": [
        "Murali K. Menon",
        "",
        "Murali K. Menon",
        "",
        "Murali K. Menon",
        "",
        "Murali K. Menon"
    ],
    "producers": [
        "Baburaj",
        "M. Lal",
        "O.K. Varghese"
    ],
    "composers": "Adarsh Abraham",
    "cinematographers": "Sadat",
    "editors": "Hemanth K. Harshan",
    "music department": "Adarsh Abraham",
    "akas": "Kathantharam (India, Malayalam title)",
    "writer": [
        "Murali K. Menon",
        "Murali K. Menon",
        "Murali K. Menon"
    ],
    "director": "K.J. Bose",
    "production companies": "M2B2 Movie Makers",
    "distributors": "M2B2 Movie Makers",
    "plot": "Rajaram, a writer and an orator has been fondling a dream around his son Sidharth. While the father is ensconced in these thoughts, the son Sidharth perceives such thoughts to be selfish and imprudent and dismisses them with contempt.",
    "synopsis": "Rajaram, a writer and an orator has been fondling a dream around his son Sidharth. A dream that his sontakes up a job as a teacher at the native place itself and being supportive to him and his wife at their old ages, as an ideal son. While the father is ensconced in these thoughts, the son Sidharth perceives such thoughts to be selfish and imprudent and dismisses them with contempt. Sidharth, who is in his youthful exuberance, weaves a dream of going abroad and becoming rich and leading a life with flourishing life style. He, therefore, gets readied to travel abroad to achieve this end.The father at his sun set years having left abandoned and neglected, feeling lonely and pine for the love of his only son. Aggrieved and dejected, he thought that he has two options before him; either to suicide and thereby putting an end to the ordeal or to join other aged people who are also similarly left abandoned by their near and dear ones in Shelter Homes. Ultimately, he opt for the latter choice thinking that living in the shelter homes he will be able to make some worthy contributions to the society and partake the worries and happiness of the inmates.By the time Sidharth realizes what he has lost all these years is peerless, it becomes too late for him to make a comeback and retrieve what he has lost. The dreams that spun by Rajaram had a wisdom behind it, the prejudgement of a father who has been denied of such love and affection by a son. Quite unexpectedly when this character appears on the scene, the storyline takes a new course quite intriguing and inquisitive."
}