{
    "id": "5373192",
    "localized title": "Ki Kore Toke Bolbo",
    "cast": [
        "Mimi Chakraborty",
        "Shankar Chakraborty",
        "Ankush Hazra",
        "Kaushik Mitra",
        "Kharaj Mukherjee",
        "Santilal Mukherjee",
        "Monir Uddin Niazy",
        "Alivia Sarker",
        "Reshmi Sen",
        "Simron Upadhyay"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "144",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:Not Rated"
    ],
    "original air date": "12 Feb 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDE0NTk1MmUtZDAzMC00ZjgzLTlkMWUtNDgyOGFmMWJkZjkyXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5373192",
    "languages": "Bangla",
    "title": "Ki Kore Toke Bolbo",
    "kind": "movie",
    "directors": "Rabi Kinagi",
    "writers": "Rabi Kinagi",
    "producers": [
        "Sahni Bob",
        "Shrikant Mohta",
        "Sudip Samanta"
    ],
    "composers": "Jeet Gannguli",
    "cinematographers": "Kumud Verma",
    "editors": "Md. Kalam",
    "editorial department": [
        "Sumit Chowdhury",
        "Srimanta Dolui",
        "Debakriti Kundu"
    ],
    "assistant directors": "Megha Agarwal",
    "visual effects": "Amit Chakraborty",
    "camera department": "Jayesh Sen",
    "music department": [
        "Madhurima Bhattacharya",
        "Adhyan Dhara",
        "Vicky a Khan",
        "Abir Sourav"
    ],
    "akas": "की कोरे तोके बोल्बो (India, Hindi title)",
    "writer": "Rabi Kinagi",
    "director": "Rabi Kinagi",
    "production companies": "SVF Entertainment",
    "distributors": "SVF Entertainment",
    "other companies": "Anonymous",
    "plot": "A woman wants to divorce her husband, but is forced to live with him for six months first. Will she long to be with the one she loves, or will she learn to love the one she's with?",
    "synopsis": "The movie starts in a police station where a police is beating a boy named Akash (Ankush) for loving a girl named Priya (Kinni). Akash is released from the jail and the police officer (Supriyo Dutta) says that Priya herself complains to the police officer. Akash goes to Priya's house to know the truth. Akash learns that Priya's marriage had been fixed with another man and this is why her father complains in the police station. Priya says that she hopes he would get a better wife. Akash is left heartbroken. His parents notice that and request to Akash marry. Akash calmly agrees and marries Anjali (Mimi), the girl his parents choose for him. But Anjali wants divorce in their first night and Akash agrees. Akash and Anjali go to divorce office and the court gives them six months to set things right between them.Akash then learns that Anjali loves a man named Vikram. But her father (Bharat Kaul) forces her to marry with Akash. One day Akash saves Anjali from local boys, who was teasing her in a harsh manner. Akash and Anjali goes to a mall and Anjali sees Vikram there. Akash then scarifies his married life and try to trace Vikram through a fake lottery contest in his radio channel, to contact Vikram. Later Akash takes Anjali to Vikram and they become reunited. One day Vikram tells Anjali to attend the valentine's day party. Anjali finds Vikram drunk and Vikram says that he took 50 lakh rupees from her father for Anjali's marriage with Akash. Anjali left heartbroken. Later Akash saves Anjali from humiliation in that party. After returning home Anjali tried to commit suicide but Akash saves her in time. Also he encouraged her to peruse dream of completing her MS degree from US and declare her as his Best Friend.After all incidents, gradually Anjali starts to fall in love with Akash. But she did not able to gather courage to express her love to Akash. When Akash's parents come to meet them, they have to act in front of their parents to make them happy. Then also Anjali starts to love Akash's parents as she lost her mother since childhood and also had bitter relationship with her father. One day, his mother gets the divorce paper. Akash then tells the whole matter to his mother. After Akash's parents left, he thanked Anjali to act perfectly, but Anjali tried to say Akash that she did not act and all her activities with his parents was real as she started to love Akash and his family. Later Akash also called Anjali's father to their house and after understanding her faults, she confessed to her father and felt guilty of all wrong doings she had done with Akash.When the six months given by the court is over they go to the court and they signed to the divorce paper. Anjali left heartbroken and she goes to airport with her father, asking Akash not to go with her to Airport. Divorce judge tells Akash that him and Anjali do not seem as other divorced couples, who don't even ready to see other again. After returning home Akash felt lonely and understands that he also loved Anjali. He rushed to the airport where Vikram and his henchmen come to beat Akash, but Akash fights with them. Then local Don (Shantilal Mukherjee) comes to his rescue and hence paid back his dues, as once Akash helped his sister's marriage. Akash goes to airport and find Anjali there. Anjali tells him that she can't leave him and Akash also express his love. They become reunited. Akash gave a good news to Anjali, that he actually got a better wife than Priya. On the other hand he has to eat Bread-Jam made by Anjali for whole life."
}