{
    "id": "5477250",
    "localized title": "Bhale Jodi",
    "cast": [
        "Sumanth Shailendra",
        "Shanvi Srivastava",
        "Haripriya",
        "Harshika Poonacha",
        "Sumalatha",
        "Sadhu Kokila",
        "P. Ravi Shankar",
        "Raj Surya"
    ],
    "genres": [
        "Comedy",
        "Drama"
    ],
    "runtimes": "133",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:U",
    "original air date": "19 Feb 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNjA0ZDZkZDAtZWQ0Yy00YTMyLTg0NWMtZjA4YjhhMzNkYjAzXkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5477250",
    "plot outline": "Bhale Jodi is all about love, misunderstanding, and separation told in flashback by Goutam (Sumanth Shailendra) who works as a reporter for a TV channel. In search of a soulmate, he goes through his first heart break with his girl friend (Harshika Ponacha). Having no choice, he is forced to attend her wedding where he meets Nitya (Shanvi Srivastava) who has also gone through a break-up. The duo hit off well and just when he wants to express his love, she introduces him to her fiancé. While trying to get out of the emotional trauma, he meets a veterinary doctor, a role played by Hariprriya. Meanwhile, Goutam and Nitya keep bumping into each but fate drifts them apart during crucial situations. Will Nitya and Gautam find their soul mates or will they realise that they are made for each other, forms the crux of the film.",
    "languages": "Kannada",
    "title": "Bhale Jodi",
    "kind": "movie",
    "directors": "Sadhu Kokila",
    "writers": [
        "Lakshmi Bhupala",
        "",
        "Raj Surya"
    ],
    "producers": "Shailendra Babu",
    "composers": "Sadhu Kokila",
    "cinematographers": "Jai Anand",
    "editors": "Jo Ni Harsha",
    "editorial department": "Suraj Ankolekar",
    "music department": "Lakshmi Vijay",
    "akas": "Bale Jodi (India, Kannada title)",
    "writer": [
        "Lakshmi Bhupala",
        "Raj Surya"
    ],
    "director": "Sadhu Kokila",
    "plot": [
        "After meeting at a mutual friend's wedding, an impulsive young man falls in love with a woman, who just happens to be previously engaged to be married. How will he react to this revelation? What will the future hold in store for them?",
        "_Bhale Jodi_ (qv) is all about love, misunderstanding, and separation told in flashback by Goutam (Sumanth Shailendra) who works as a reporter for a TV channel. In search of a soulmate, he goes through his first heart break with his girl friend (Harshika Ponacha). Having no choice, he is forced to attend her wedding where he meets Nitya (Shanvi Srivastava) who has also gone through a break-up. The duo hit off well and just when he wants to express his love, she introduces him to her fiancé. While trying to get out of the emotional trauma, he meets a veterinary doctor, a role played by Hariprriya. Meanwhile, Goutam and Nitya keep bumping into each but fate drifts them apart during crucial situations. Will Nitya and Gautam find their soul mates or will they realise that they are made for each other, forms the crux of the film."
    ]
}