{
    "id": "5477608",
    "localized title": "Kahaani 2",
    "cast": [
        "Vidya Balan",
        "Arjun Rampal",
        "Jugal Hansraj",
        "Kharaj Mukherjee",
        "Tota Roy Chowdhury",
        "Naisha Khanna",
        "Tunisha Sharma",
        "Manini Chadha",
        "Soma Adhikari",
        "Ardhendu Banerjee",
        "Biswajit Chakraborty",
        "Pradeep Chakraborty",
        "Haridas Chatterjee",
        "Michael Raymond Fox",
        "Nitya Ganguly",
        "Siddhant Ghegadmal",
        "Susanta Joddar",
        "Pradip Mukherjee",
        "Sanjay Paul",
        "Amba Sanyal",
        "Koushik Sen"
    ],
    "genres": [
        "Mystery",
        "Thriller"
    ],
    "runtimes": "127",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Belgium:KT/EA",
        "Canada:14A::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:G::(Quebec)",
        "Hong Kong:IIB",
        "India:UA",
        "Malaysia:P13",
        "Netherlands:16",
        "New Zealand:R13",
        "Portugal:M/12",
        "Singapore:NC16",
        "South Africa:10-12",
        "South Africa:13::(DVD rating)",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "02 Dec 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMzBiNzIxYTAtM2Y3OC00M2VjLTg0Y2EtOTgwM2Q5NzZhYWRkL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNTE0MDc0NTM@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "5477608",
    "plot outline": "Vidya Sinha and her daughter Mini live peacefully in the sleepy town of Chandan Nagore. Vidya's life revolves around Mini. Her greatest joys are the little things she does with her daughter, like playing little games and going for walks. However, life has other plans: Mini is kidnapped and while trying to locate her daughter, Vidya is in an accident and goes into a coma. As Inspector Inderjeet investigates the car accident, he discovers that Vidya Sinha may not be all she appears. She has a dark past linking her to Durga Rani Singh - a wanted criminal on the run for kidnapping and murder.",
    "languages": "Hindi",
    "title": "Kahaani 2",
    "kind": "movie",
    "directors": "Sujoy Ghosh",
    "writers": [
        "Sujoy Ghosh",
        "Suresh Nair",
        "",
        "Sujoy Ghosh",
        "",
        "Ritesh Shah",
        "Sujoy Ghosh"
    ],
    "producers": [
        "Mohammed Attarwala",
        "Saubhik Das",
        "Akshay Gada",
        "Jayantilal Gada",
        "Kushal Gada",
        "Sujoy Ghosh",
        "Jerrin Thomas Joseph",
        "Bendev Junior",
        "Reshmaa Kadakia",
        "Suresh Nair",
        "Ilana Rossein",
        "Shilpan Vyas Tinu"
    ],
    "composers": "Clinton Cerejo",
    "cinematographers": "Tapan Basu",
    "editors": "Namrata Rao",
    "editorial department": [
        "Saikishore Annamaraju",
        "Shruti Bora",
        "Rajiv Manahalli",
        "Prakash Perumal",
        "Anil Rodhan",
        "Zaheer Shaikh",
        "Navin Shetty"
    ],
    "casting directors": "Mukesh Chhabra",
    "production designers": [
        "Subrata Barik",
        "Kaushik Das"
    ],
    "costume designers": "Darshan Jalan",
    "production managers": [
        "Jerrin Thomas Joseph",
        "Arindam Sil",
        "Shilpan Vyas Tinu"
    ],
    "assistant directors": [
        "Rukhshida David",
        "Chirag Korde",
        "Shome Makhija",
        "Arjun Sen"
    ],
    "sound department": [
        "Curran Alphonso",
        "Nikunj Arora",
        "Aneesh Basu",
        "Sagnik Basu",
        "Kartik Kulkarni",
        "Uttam Naskar",
        "Ajay Kumar P.B.",
        "Koteshwara Rao",
        "Koteswara Rao S.V.",
        "Sudeepta Sadhukhan",
        "Chayan Sen",
        "Anirban Sengupta",
        "Justin E. Thomas",
        "Aravind Sundar"
    ],
    "visual effects": [
        "Raghuwanshi. Arun Singh",
        "Amarjyoti Borah",
        "Debasish Borah",
        "Soumen Das",
        "Atul Gavade",
        "Ravi Gulhane",
        "Ajay Jaiswar",
        "Sandeep Kamal",
        "Nitesh Kumar",
        "Nikhileshadhumale",
        "Raghav Rai",
        "Rajeev Kumar Rastogi",
        "Sameer Shaikh",
        "Piyush Tiwari",
        "Neel Trivedi",
        "Rahul Tyagi",
        "Sharvari Watak"
    ],
    "stunts": [
        "Sham Kaushal",
        "Sanober Pardiwalla",
        "Paramjeet Singh"
    ],
    "camera department": [
        "Ketan Mehta",
        "Rajesh Nare",
        "Anna O'Carroll",
        "Sumit Pandey"
    ],
    "animation department": "Chang Aniruddhya",
    "casting department": [
        "Bihaan Sen",
        "Indu Sharma"
    ],
    "music department": [
        "Amitabh Bhattacharya",
        "Clinton Cerejo",
        "Sunidhi Chauhan",
        "Amey Ghule",
        "Bianca Gomes",
        "George Joseph",
        "Ash King",
        "Simaab Sen",
        "Arijit Singh"
    ],
    "script department": "Vasundhara Koshy",
    "miscellaneous": [
        "Ganesh Ayare",
        "Avishek Ghosh",
        "Jeevan Khullar",
        "Binny Padda",
        "Ravi Padda",
        "Siddharth Pande",
        "Prasen Sharrma",
        "Natasha C. Smith"
    ],
    "akas": [
        "Kahaani 2: Durga Rani Singh (India, Hindi title)",
        "Durga Rani Singh (India, Hindi title)",
        "Kahaani - Schatten der Vergangenheit (Germany)",
        "ドゥルガー 女神の闘い (Japan, Japanese title)",
        "История 2 (Russia)"
    ],
    "writer": [
        "Sujoy Ghosh",
        "Suresh Nair",
        "Sujoy Ghosh"
    ],
    "director": "Sujoy Ghosh",
    "production companies": [
        "Boundscript",
        "Pen Movies"
    ],
    "special effects": [
        "Drishyam Studios",
        "InCandlelight"
    ],
    "other companies": [
        "Light & Grips Equipment Hirers India",
        "Pixel Digital Studios"
    ],
    "plot": [
        "A woman with a mysterious past is charged with kidnapping and murder.",
        "Vidya Sinha and her daughter Mini live peacefully in the sleepy town of Chandan Nagore. Vidya's life revolves around Mini. Her greatest joys are the little things she does with her daughter, like playing little games and going for walks. However, life has other plans: Mini is kidnapped and while trying to locate her daughter, Vidya is in an accident and goes into a coma. As Inspector Inderjeet investigates the car accident, he discovers that Vidya Sinha may not be all she appears. She has a dark past linking her to Durga Rani Singh - a wanted criminal on the run for kidnapping and murder.::Subrat Jain",
        "Vidya Sinha lives in Chandanagar with her teenage daughter Minnie whose paralyzed from waist she is working hard on saving money to take Minnie to America for her treatment.Once when Vidya reaches homes she finds that Minnie is missing and gets anonymous call asking her to come to a place on the way she is knocked by a taxi and goes in coma the taxi driver then leaves her to a nursing home.Inspector Indrajit Singh is put on the case where he finds Vidya's diary in her house,Indrajeet's senior Halder informs that a women name Durga Rani Singh is wanted in kidnapping and murder case.Indrajit when he starts to read the diary finds that Vidya Sinha is none other then Durga Devi Singh who worked as a school clerk some years back where Minnie was student.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Vidya Sinha (Vidya Balan) is a middle-class working mother who lives in Chandan Nagar, West Bengal with her teenage daughter Minnie (Tunisha Sharma), who is paralyzed from the waist down and uses a wheelchair. Minnie is a happy child and Vidya dotes on her, working hard to save money so that she can take Minnie to America in the hope that the girl will walk again.One day, Vidya returns home in the evening to find her daughter is missing. Vidya then receives a call from an unknown man asking her to come to an address if she does not want to see Mini dead. When she crosses the road, a taxi knocks her down, sending her into a coma. The taxi driver takes her to a nursing home run by Dr. Maity (Pradip Mukherjee). Police Sub-Inspector Inderjeet Singh (Arjun Rampal) is put on Vidya's case. He visits Vidya's home and finds her diary, which he takes as evidence. Inderjeet's senior, Pranab Halder (Kharaj Mukherjee), informs him that a woman named Durga Rani Singh is wanted for a kidnapping and murder case.As Inderjeet reads Vidya's diary, her past is revealed. She worked as a clerk in a school in Kalimpong as Durga Rani Singh. She is friendly with Arun (Tota Roychoudhury) and it is obvious that Arun has feelings for her. At school, she noticed that a student named Minnie Dewan (Naisha Khanna) was always punished for sleeping during classes. When after repeated attempts at befriending reclusive Minnie fail, Durga decides to visit Minnie's grandmother (Amba Sanyal), pretending to be a teacher. Durga's worst fears come true when Minnie confides that her uncle Mohit Dewan (Jugal Hansraj) was sexually abusing her. It is now clear from Durga's diary that she was also a survivor of child sex abuse and she informs Minnie's grandmother but she admonishes her. Durga tries to file a case with the police. But after an investigation made by a Police Officer (Koushik Sen), he finds Mohit Dewan (Jugal Hansraj) innocent and doesn't believe Durga. Minnie jumps off the terrace in desperation and becomes paralyzed from the waist down. A policewoman (Gargi Bharadwaj), taking the side of Minnie's grandmother, threatens Durga not to pursue the matter. Durga decides to save Minnie from her family and has a fight with her grandmother, who gets killed accidentally in the incident. Durga flees with Minnie, settling in Chandan Nagar, with a new name, Vidya Sinha. But Mohit hunts them down and gets Minnie kidnapped with the help of the police woman.In the present, the kidnapper policewoman comes to the nursing home and threatens Vidya to pay ransom to save Minnie, who has been kidnapped by Mohit and her. Terrified, Vidya escapes from the hospital after recovering from the coma and returns home in search of the address that the kidnapper asked her to come to. She is caught by Halder and Inderjeet at her home. However, she is successful in escaping from there, as she shoots Inderjeet in his arm. Vidya then arrives at Kolkata, where she goes to the docks as ordered by Mohit. Vidya offers to pay the ransom to the kidnapper policewoman. Mohit shoots the policewoman when she takes interest in the ransom money. He then tries to strangulate Vidya, but is shot dead by Minnie, who picked up his fallen revolver. Vidya then calls Inderjeet to seek his help, but Haldar and other police officer ask Inderjeet to call her to a place where they can arrest her. Inderjeet asks Vidya to come to his paternal house, where they are surrounded by the police force. Halder tries to come near to Vidya, but she shoots him in the leg. Later, she sets the house on fire.It is finally revealed that Vidya's real name is Durga Rani Singh and she was married to Inderjeet Singh at a very young age, but got separated later. Durga after recovering from the coma asked Inderjeet for his help and they planned her escape. It was Inderjeet, who helped Durga in arranging the real passports for Vidya and her adopted daughter. He helped her in escaping to Kolkata in the police Ambassador car, inside the car trunk, and he helped her escape from the burning house.It is seen that Durga is alive, (who is believed to be dead by the police) and is traveling to New York City for Minnie's operation. Inderjeet is seen happily driving with his family."
}