{
    "id": "5545894",
    "localized title": "Oyee",
    "cast": [
        "Geethan Britto",
        "Sangili Murugan",
        "Nagineedu",
        "Arjunan Nandakumar",
        "Eesha Rebba"
    ],
    "genres": "Comedy",
    "runtimes": "127",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:U",
        "Singapore:PG"
    ],
    "original air date": "08 Apr 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjQ1MWU0M2ItNzkyMi00ZGMzLWFiYWItZDE2OWNmMzY4OWY5XkEyXkFqcGdeQXVyNjU4NTE5MzE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "5545894",
    "plot outline": "Oyee is the story of Krishna and Swetha, two people on seemingly different tracks. Swetha yearns for her family while Krishna is trying to break away from his due to differences and the love of a woman, Gayatri. A chance meeting and unfortunate circumstances place Swetha in Krishna's world and chaos ensues as he tries to convince his family that she is not the one he is in love with. What is keeping Swetha at Krishna's house? What will happen when Gayatri arrives? What will the family make of all of this drama?",
    "languages": "Tamil",
    "title": "Oyee",
    "kind": "movie",
    "directors": "Francis Markus",
    "writers": "Francis Markus",
    "producers": [
        "Francis Bastiyan",
        "Francis Markus"
    ],
    "composers": "Ilaiyaraaja",
    "cinematographers": "Yugaraj",
    "editors": "Mani",
    "sound department": "Renjith Venugopal",
    "akas": "Oyee (India)",
    "writer": "Francis Markus",
    "director": "Francis Markus",
    "production companies": "Mark Studio",
    "plot": [
        "A 20 something girl who is out on parole for her sister's wedding, gets entangled in confusion after her visit to a joint family.",
        "_Oyee_ (qv) is the story of Krishna and Swetha, two people on seemingly different tracks. Swetha yearns for her family while Krishna is trying to break away from his due to differences and the love of a woman, Gayatri. A chance meeting and unfortunate circumstances place Swetha in Krishna's world and chaos ensues as he tries to convince his family that she is not the one he is in love with. What is keeping Swetha at Krishna's house? What will happen when Gayatri arrives? What will the family make of all of this drama?"
    ]
}