{
    "id": "5571734",
    "localized title": "Pink",
    "cast": [
        "Taapsee Pannu",
        "Amitabh Bachchan",
        "Kirti Kulhari",
        "Andrea Tariang",
        "Piyush Mishra",
        "Angad Bedi",
        "Vijay Varma",
        "Raashul Tandon",
        "Tushar Pandey",
        "Dhritiman Chatterjee",
        "Mamata Shankar",
        "Amit Baisoya",
        "S.K. Batra",
        "Prashant Bhagia",
        "Arjun Chakrabarty",
        "Alka Chatwal",
        "Sushil Dahiya",
        "Sudhanva Deshpande",
        "Dibang",
        "DJ Farman",
        "Swaroopa Ghosh",
        "Johar Kango",
        "Rita Kapoor",
        "Radha Khandelwal",
        "Shiva Kumar",
        "Pawan Mahendru",
        "Mamta Malik",
        "Jogi Mallang",
        "Sakshi Mehta",
        "Vinod Nagpal",
        "R. Pandey",
        "Sima Pari",
        "Arun Poorie",
        "Vinod Rai",
        "Ritesh Shah",
        "Savita Sharma"
    ],
    "genres": [
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "136",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(HD)",
    "aspect ratio": "2.35 : 1",
    "certificates": [
        "Australia:M",
        "Brazil:16",
        "Canada:14A::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Hong Kong:IIB",
        "India:UA",
        "Indonesia:17+",
        "Japan:Unrated",
        "Malaysia:P13",
        "Netherlands:12",
        "New Zealand:M",
        "Philippines:R-13",
        "Singapore:PG13",
        "South Africa:13",
        "South Korea:15",
        "United Kingdom:15",
        "United States:Not Rated",
        "United Arab Emirates:16+::(self-applied)"
    ],
    "original air date": "16 Sep 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNGI1MTI1YTQtY2QwYi00YzUzLTg3NWYtNzExZDlhOTZmZWU0XkEyXkFqcGdeQXVyMDkwNTkwNg@@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "5571734",
    "plot outline": "Deepak is a lawyer suffering from bipolar disorder who experiences frequent mood swings. One night, Rajveer and his friends get drunk and try to molest Miss Arora and her two roommates leading to an accident. The film revolves around how Deepak fights the girls' case against these influential boys.",
    "languages": "Hindi",
    "title": "Pink",
    "kind": "movie",
    "directors": "Aniruddha Roy Chowdhury",
    "writers": [
        "Shoojit Sircar",
        "Aniruddha Roy Chowdhury",
        "Ritesh Shah",
        "",
        "Ritesh Shah",
        "",
        "Ritesh Shah"
    ],
    "producers": [
        "Ashutosh Goswami",
        "Bendev Junior",
        "Hetvi Karia",
        "Sheel Kumar",
        "Ronnie Lahiri",
        "Rashmi Sharma",
        "Amit Singh",
        "Shoojit Sircar"
    ],
    "composers": [
        "Shantanu Moitra",
        "Faiza Mujahid",
        "Anupam Roy"
    ],
    "cinematographers": "Avik Mukhopadhyay",
    "editors": "Bodhaditya Banerjee",
    "editorial department": [
        "Vikas Bajaj",
        "Debojyoti Ghosh",
        "Debakriti Kundu"
    ],
    "casting directors": "Jogi Mallang",
    "production designers": "Meghna Gandhi",
    "costume designers": "Veera Kapur Ee",
    "production managers": "Jiten Nand Kishor Arora",
    "assistant directors": [
        "S. Ashwin",
        "Prashant Bhagia",
        "Albert Hungshi",
        "Tushar Sheetal Jain",
        "Sakshi Mehta",
        "Arianna Singhania"
    ],
    "sound department": [
        "Teja Asgk",
        "Sagnik Basu",
        "Dipankar Chaki",
        "Bishwadeep Chatterjee",
        "Yogi Dholakia",
        "Pragyan Gogoi",
        "Elias Issa",
        "Sinoy Joseph",
        "Gyana Mishra",
        "M. Lakshmi Naidu",
        "Uttam Naskar",
        "Nihar Ranjan Samal",
        "Koteswara Rao S.V.",
        "Sainathan",
        "Urmila Sutar",
        "Keshav Waghe",
        "Shantanu Yennemadi"
    ],
    "visual effects": [
        "Vikas Bajaj",
        "Amit Chakraborty",
        "Biswadeep Ghosh",
        "Ravi Gulhane",
        "Kuntal Guria",
        "Soumen Pramanik",
        "Joyeeta Roy",
        "Sudip Samanta"
    ],
    "camera department": [
        "Asit Biswas",
        "Sanjay Kumar Kesari",
        "Hussain Khwaja",
        "Ayan Saxena",
        "Shafi",
        "Anup Singh",
        "Rishabh Sood",
        "Adri Thakur",
        "Nawaraj Krishna Thapa",
        "Manas Tiwari"
    ],
    "casting department": [
        "Richa Gupta",
        "Mamta Malik"
    ],
    "music department": [
        "Amitabh Bachchan",
        "Quratulain Balouch",
        "Purbayan Chatterjee",
        "Kuntal De",
        "Jonita Gandhi",
        "Tanveer Ghazi",
        "Epr Iyer",
        "Santhanam Srinivasan Iyer",
        "George Joseph",
        "Shantanu Moitra",
        "Faiza Mujahid",
        "Kittu Myakal",
        "Akash Noatia",
        "Finix Ramdas",
        "Anupam Roy",
        "Urmila Sutar"
    ],
    "miscellaneous": [
        "Jeeten Bhardwaj",
        "Parag Desai",
        "Avishek Ghosh",
        "Sahil Sai",
        "Deepesh Shah",
        "Jigar Shah",
        "Shoojit Sircar"
    ],
    "akas": [
        "Рожевий (Ukraine)",
        "女生規則 (Taiwan)",
        "Розовый (Russia)",
        "ピンク (Japan, Japanese title)"
    ],
    "writer": [
        "Shoojit Sircar",
        "Aniruddha Roy Chowdhury",
        "Ritesh Shah"
    ],
    "director": "Aniruddha Roy Chowdhury",
    "production companies": [
        "NH Studioz",
        "Rashmi Sharma Telefilms"
    ],
    "distributors": [
        "HKC Entertainment",
        "NH Studioz",
        "Phars Film",
        "White Hill Production",
        "White Hill Production",
        "Hotstar"
    ],
    "special effects": "Editfx Studios",
    "other companies": [
        "Daufin Media",
        "Editfx Studios",
        "Editfx Studios",
        "Junglee Music",
        "Universal Communications",
        "Yellow inc."
    ],
    "plot": [
        "When three young women are implicated in a crime, a retired lawyer steps forward to help them clear their names.",
        "Deepak is a lawyer suffering from bipolar disorder who experiences frequent mood swings. One night, Rajveer and his friends get drunk and try to molest Miss Arora and her two roommates leading to an accident. The film revolves around how Deepak fights the girls' case against these influential boys.::Varunish Garg",
        "Meenal,Falak and Andrea three independent woman share an apartment after attending a rock show the trio go for a party at a resort with male friends who met them at the show through a common friend Vishwa where Rajveer tries to get cozy with Meenal following which she breaks a bottle on his face badly damaging his eye,the three girls are then constantly threatened by Rajveer 's cousin Ankit as they want to seek revenge, The girls don't give up and are ready to face Rajveer and his man, Meenal is soon arrested for attacking Rajveer and no lawyer wants to fight their case as Rajveer is a son of politician until their neighbor Deepak Sehgal decides to defend them who had quit his practice due to bipolar disorder.::alex.mjacko@gmail.com",
        "Minal, Falak and Andrea meet Rajveer and his friends through a mutual friend in a rock concert. They decide to have dinner after the concert. Rajveer and his friends misinterpret this as a sign and Rajveer tries to force himself on Minal. Minal in an act of self defence hits Rajveer, grievously injuring him in response to which he files an attempted murder case against them. The movie '_Pink_ (qv)' shows the legal battle of Minal and her friends to prove their innocence. The movie also portrays the perception of Indian society towards women who don't subscribe to societal standards of culture and morality.::Keith Francis",
        "Minal and her 2 friends, Andrea and Falak are working women and live together in a rented house. One night, they were molested by 3 boys, one of them being a politician's nephew. They try to file an FIR against the nephew but it fails. When the subsequent case gets rigged and the politician puts a case on them then a retired lawyer, Deepak Sehgal who lives nearby where the girls live, helps them to fight the case in court, coming out of his retirement to make a legal comeback for one last time.::Shaurya N. Singh"
    ],
    "synopsis": "Three young and affluent boys, Raunak (Raashul Tandon), Vishwajyoti (Tushar Pandey) and Rajveer Singh (Angad Bedi) rush to the nearest hospital because Rajveer is profusely bleeding from an injury to his head. They nervously refrain from filing a police complaint.On the other side of the same town, three young women - Minal (Taapsee Pannu), Falak (Kirti Kulhari) and Andrea - hurriedly travel in a taxi to their apartment. They look disoriented, and it is implied that they have something to do with the incident. Minal and her friends are shaken but try to carry on with their normal life.The story revolves around these three young women. They are independent and self-sufficient women living together in Faridabad.Minal goes out for her usual morning run, where she is constantly observed by an old man who lives in her neighbourhood, a man called Deepak (Amitabh Bachchan). He senses there is something wrong and introduces himself to these women as a reputable lawyer who is in retirement, and they enlist his help in the matter.Eventually, as Deepak had predicted to the women, a series of threats arise from Rajveer's friend Ankit (Vijay Varma), who pushes for revenge. The threats result in Andrea being stalked and Falak losing her job. They are discouraged by a police officer from filing a complaint stating it would make their daily lives more miserable unless they relocate to another town or city. In reality, the local police are aware that the young men are \"well connected\" and are backed-up by Rajveer's uncle Ranjit, a powerful influential politician from South Delhi.Nevertheless, Minal files a complaint.Immediately, the next day, Minal is kidnapped by Rajveer's friends during her morning run. Deepak witnesses the incident but is unable to help in the heat of the moment even though he notes down the details and number plate of the carMinal is threatened to stop filing complaints, blackmailed and is molested in the moving car and later dropped back home after all the commotion with a serious warning. A few days later, Minal is arrested by police from her apartment, based on a complaint from Rajveer labelling the women as prostitutes and charging Minal with attempted murder.At this point, Deepak says enough is enough and visits Falak and Andrea at their apartment. Soon enough he helps them with the bail procedures and also in representing them in the court to plead their case.In the courtroom, Rajveer's lawyer, Prashant Mehra (Piyush Mishra), presents the following version of events:Rajveer and his friends meet with Minal and her friends at a rock concert. The men invite the women for dinner at a hotel resort, where they have drinks. The women provoke the men, have intimate relations and thereafter demand money, all signs indicating that they are prostitutes. Rajveer refuses to pay and an enraged Minal hits him on the head with a bottle and flees. Prashant's argument focuses on the poor moral character of the women. He pushes the idea that the friendly manner of the women, the fact that they attended a rock concert and the fact that they had drinks with the men indicate that they were prostitutes. Prashant attacks the fact that Minal has family in Delhi but chooses to live alone, Falak is in a relationship with an older man, and Andrea has moved to the city from Northeast India.Contrary to this, Minal and her friends statement: that the men tried to sexually assault them. Minal alleges that Rajveer tried to rape her, and she attacked him with the bottle in self-defense.Deepak's argument focuses on the issue of consent and a woman's right to say no.A series of interesting and chilling courtroom arguments ensues in the following days.Towards the end of the trial, Rajveer becomes enraged and provoked by the reputable and respected lawyer Deepak, revealing the truth by stating that the women \"got what they deserved\".Deepak criticizes the regressed views of the society where women are stereotyped as prostitutes if they come home late, move out of their home, want to be independent, drink and so on, but none of these applies to men.In his closing remarks, Deepak mentions that his client said \"no\". No means no and does not require further explanation. The women are acquitted while Rajveer, Ankit, and Dumpy are charged, with the duration of their sentences pending. Vishwajyoti is let off with a warning."
}