{
    "id": "5584612",
    "localized title": "Cinema My Darling",
    "cast": [
        "Vihan Gowda",
        "Manojava Galagali",
        "Shashi Deshpande",
        "Shreyas",
        "Manasa",
        "Raju Talikote",
        "Gaurish Akki",
        "Sanjjanaa Galrani",
        "B. Jaya",
        "Kirik Keerthi",
        "Sampath Maitreya",
        "Ram Manjjonaath",
        "Mithra",
        "Suchendra Prasad"
    ],
    "genres": "Drama",
    "runtimes": "152",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:U",
    "original air date": "25 Mar 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTRiZThmNmYtZmUxMy00ZjgyLWJiMTgtYzdjNmM4ZjM5NzQ5XkEyXkFqcGdeQXVyNTE0NDY5Njc@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "5584612",
    "plot outline": "Four friends Satya an aspiring director, Basava Patil a budding Music Director, Aadarsh a camera man and Vishwa an aspiring actor come together to make a film. A famous dancer Devayani, a girl next door Pallavi, Savita Lakshmi an ex producers daughter and a unknown girl are love interests of the four boys. A thrilling off the camera story of four friends who want to make it big in the Kannada film industry. Directed by Gaurish Akki a veteran TV film journalist, the film revolves around a story of friendship, sacrifices and love for cinema. A total entertainer, will the four friends make it big or will they be lost in the ocean of the film world? What will they lose and what will they gain? Will they meet their dream Cinema My Darling and how?",
    "languages": "Kannada",
    "title": "Cinema My Darling",
    "kind": "movie",
    "directors": "Gaurish Akki",
    "writers": [
        "Gaurish Akki",
        "",
        "Gaurish Akki",
        "",
        "Gaurish Akki",
        "",
        "Jayanth Kaikini",
        "V. Nagendra Prasad",
        "Malavalli Saikrisna",
        "Gopal Vajpayee"
    ],
    "producers": "Gaurish Akki",
    "composers": "B. Ajaneesh Loknath",
    "cinematographers": "S.K. Rao",
    "editors": "Chandan",
    "production designers": "Nam Team",
    "art directors": "Pavan Kumar K.V.",
    "sound department": "Krishnanunni N.R.",
    "stunts": "Different Dyani",
    "music department": "Gopal Wajapeyi",
    "akas": "Cinema My Darling (India)",
    "writer": [
        "Gaurish Akki",
        "Gaurish Akki",
        "Gaurish Akki"
    ],
    "director": "Gaurish Akki",
    "production companies": "Gaurish Akki Cinemas",
    "plot": [
        "An actor, director, a music composer and a cinematographer live together and work towards fulfilling their dream of finding success in the film industry. Will their dreams become reality? If so, at what price?",
        "Four friends Satya an aspiring director, Basava Patil a budding Music Director, Aadarsh a camera man and Vishwa an aspiring actor come together to make a film. A famous dancer Devayani, a girl next door Pallavi, Savita Lakshmi an ex producers daughter and a unknown girl are love interests of the four boys. A thrilling off the camera story of four friends who want to make it big in the Kannada film industry. Directed by Gaurish Akki a veteran TV film journalist, the film revolves around a story of friendship, sacrifices and love for cinema. A total entertainer, will the four friends make it big or will they be lost in the ocean of the film world? What will they lose and what will they gain? Will they meet their dream _Cinema My Darling_ (qv) and how?"
    ]
}