{
    "id": "5597222",
    "localized title": "Narathan",
    "cast": [
        "Premgi Amaren",
        "M.S. Bhaskar",
        "Chetan",
        "Sonu Gowda",
        "Meera Krishnan",
        "Vishwa Kumar",
        "Mayilsamy",
        "Nakhul",
        "Subbu Panchu",
        "Pandu",
        "Nikesha Patel",
        "Ashvin Raja",
        "Nizhalgal Ravi",
        "Radha Ravi",
        "Srinivasan",
        "Vaiyapuri"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "original air date": "01 Apr 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BM2ZjYWM1ODItNjQwMy00MmMzLTlhZTItMTZiM2EyYWMyNDIzXkEyXkFqcGdeQXVyNTg2MDY2MDg@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "5597222",
    "plot outline": "Vishnu (Nakul) is on his way from Coimbatore for his new job and also to see his Fiance who is his uncle's daughter. During his journey he meets Pavitra (Nikesha Patel) and upon his arrival in Chennai, problems begin. Simultaneously Narathan (Premji) a renowned movie director is at his uncle's place who is also a movie producer. Narathan narrates his story to Vishnu's uncle and interestingly all the incidents have been happening in Vishnu's and all the other people's lives.",
    "languages": "Tamil",
    "title": "Narathan",
    "kind": "movie",
    "directors": "Naga Venkatesh",
    "producers": "Sajith V. Nambiar",
    "composers": "Mani Sharma",
    "cinematographers": "Sanjay Loknath",
    "editors": "Shyjith Kumaran",
    "director": "Naga Venkatesh",
    "production companies": "Vetrivel Film",
    "plot": [
        "Vishnu is on his way to Chennai from Coimbatore to join a new company and meet his fiancee. However, his plan is jeopardised upon meeting Pavithra on a train, who is stuck in a problem.",
        "Vishnu (Nakul) is on his way from Coimbatore for his new job and also to see his Fiance who is his uncle's daughter. During his journey he meets Pavitra (Nikesha Patel) and upon his arrival in Chennai, problems begin. Simultaneously _Narathan_ (qv) (Premji) a renowned movie director is at his uncle's place who is also a movie producer. _Narathan_ (qv) narrates his story to Vishnu's uncle and interestingly all the incidents have been happening in Vishnu's and all the other people's lives."
    ]
}