{
    "id": "5760490",
    "localized title": "Fredrick",
    "cast": [
        "Avinash Dhyani",
        "Prashant Narayanan",
        "Tulna Butalia",
        "Anna Ador",
        "Dipankar Bahalia",
        "Adil Feroz Khan"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "129",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:A",
        "India:A"
    ],
    "original air date": "27 May 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjg0NGRhNmItMDAxMS00ZjNhLWFjNTItMDhhODRjNzljY2Q2XkEyXkFqcGdeQXVyNDY5MTUyNjU@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "5760490",
    "plot outline": "19 years ago, a 16 year old boy faces the torment of his father due to his unusual bonding with another boy of his age. This leads to some unfortunate consequences and one realizes them as the story moves 19 years later, when an anonymous human trafficker Fredrick creates havoc in Mussoorie. Vikram, a suspended cop and his wife Amrita land in Mussoorie - only to be caught in this nexus, when Vikram's sister goes missing. But all this doesn't seem as simple as it just to read: Who's Fredrick, how will Vikram find him out and save everyone, how will he find his sister and what ends this journey filled with thrills, fights and battles, forms the crux of this psychological action thriller.",
    "languages": "Hindi",
    "title": "Fredrick",
    "kind": "movie",
    "directors": "Rajesh Butalia",
    "writers": "Rajesh Butalia",
    "producers": [
        "Meher Haque",
        "Sandeep Kale",
        "Rajeev Kapoor",
        "Manoj Kumar"
    ],
    "cinematographers": "Anubhav Bansal",
    "editors": "Sandeep Singh Bajeli",
    "editorial department": [
        "Sandeep Singh Bajeli",
        "Yogesh Kodag",
        "Shreelal Yadav"
    ],
    "casting directors": "Harry Parmar",
    "production designers": "Sukhvinder Singh",
    "costume designers": "Shivendu Shekhar",
    "production managers": [
        "Sunny Anand",
        "Yogesh Kodag",
        "Anil Kumar"
    ],
    "assistant directors": [
        "Dipankar Gupta",
        "Yogesh Kodag",
        "Alok Naik",
        "Manish Singh"
    ],
    "sound department": [
        "Aakash Chowdhary",
        "Alok De",
        "Ajit Singh Rathore",
        "Abhijeet V. Sapre"
    ],
    "visual effects": [
        "Shudhanshu Jaiswal",
        "Mohammad Saif"
    ],
    "stunts": "Vikram Dahiya",
    "camera department": [
        "David Basu",
        "Nitesh Jain",
        "Abhishek Salunke"
    ],
    "casting department": "Shivam Gupta",
    "music department": "Ryan Victor",
    "miscellaneous": [
        "Himanshu Jhunjhunwala",
        "Rohit Kumar"
    ],
    "akas": "Fredrick (India)",
    "writer": "Rajesh Butalia",
    "director": "Rajesh Butalia",
    "production companies": "Evana Entertainment",
    "plot": [
        "A suspended cop and his wife try to find out his sister when he gets caught in a human trafficking nexus. But the mastermind behind this is someone unknown to everyone.",
        "19 years ago, a 16 year old boy faces the torment of his father due to his unusual bonding with another boy of his age. This leads to some unfortunate consequences and one realizes them as the story moves 19 years later, when an anonymous human trafficker _Fredrick_ (qv) creates havoc in Mussoorie. Vikram, a suspended cop and his wife Amrita land in Mussoorie - only to be caught in this nexus, when Vikram's sister goes missing. But all this doesn't seem as simple as it just to read: Who's _Fredrick_ (qv), how will Vikram find him out and save everyone, how will he find his sister and what ends this journey filled with thrills, fights and battles, forms the crux of this psychological action thriller.::Prashast Singh"
    ],
    "synopsis": "19 years ago, a 16 year old boy faces the torment of his father due to his unusual bonding with another boy of his age. This leads to some unfortunate consequences and one realizes them as the story moves 19 years later, when an anonymous human trafficker Fredrick creates havoc in Mussoorie. Vikram, a suspended cop and his wife Amrita land in Mussoorie - only to be caught in this nexus, when Vikram's sister goes missing. But all this doesn't seem as simple as it just to read: Who's Fredrick, how will Vikram find him out and save everyone, how will he find his sister and what ends this journey filled with thrills, fights and battles, forms the crux of this psychological thriller."
}