{
    "id": "5959700",
    "localized title": "Thodari",
    "cast": [
        "Dhanush",
        "Keerthy Suresh",
        "Ganesh Venkatraman",
        "Imman Annachi",
        "Chinnijayanth",
        "Gnanasambandam",
        "Pooja Jhaveri",
        "Karunakaran",
        "Anu Mohan",
        "Nassar",
        "Thambi Ramaiah",
        "Radha Ravi",
        "Maya S. Krishnan",
        "Harish Uthaman",
        "Bose Venkat",
        "A. Venkatesh"
    ],
    "genres": [
        "Action",
        "Romance",
        "Thriller"
    ],
    "runtimes": "168",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:PG::(Ontario)",
        "Canada:G::(Quebec)",
        "France:Tous Public",
        "India:U",
        "Malaysia:P13",
        "New Zealand:M",
        "Norway:12",
        "Philippines:PG-13",
        "Singapore:PG",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "22 Sep 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODRhMzM1MWUtNjUzMi00ZmI3LWJlYWYtMjYwZWEwYTZiZWQzXkEyXkFqcGdeQXVyODk1MzE5NDA@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "5959700",
    "languages": "Tamil",
    "title": "Thodari",
    "kind": "movie",
    "directors": "Prabu Solomon",
    "writers": "Prabu Solomon",
    "composers": "D. Imman",
    "cinematographers": "Vetrivel Mahendran",
    "editors": "L.V.K. Doss",
    "camera department": [
        "Anand",
        "Nutakki Anoop",
        "Hayath Basha",
        "N. Bharathwaj",
        "Charlestead",
        "P. Govindaraj",
        "Gautam Kumar Jayaseelan",
        "Vishnu Kanth",
        "Sreedhar Karthavarayan",
        "P. Karthick",
        "S. Karthick",
        "Satish Kumar",
        "Padmanathan M.",
        "Umashankar M.",
        "K. Nirmal Venkatesh",
        "Prashanth",
        "Swathik Raj",
        "Karthick Subramaniyam",
        "Sudhakar",
        "Venkatesan",
        "Christye Xavier"
    ],
    "music department": [
        "Bhanuka Fernando",
        "Malin Samarasekara"
    ],
    "miscellaneous": "Sibi Pandian",
    "akas": [
        "Rail (India, Telugu title)",
        "Поезд (Russia)"
    ],
    "writer": "Prabu Solomon",
    "director": "Prabu Solomon",
    "production companies": "Sathya Jyothi Films",
    "distributors": [
        "Aanna Films",
        "Parasakthi Films",
        "Sathya Jyothi Films"
    ],
    "plot": "A train pantry worker and a young woman passenger fall in love aboard a runaway train and struggle to survive.",
    "synopsis": "The film starts in New Delhi Railway Station where Poochiyappan (Dhanush) is a server in a railway catering company and is on duty in the New Delhi-Chennai Express. He is working along with his team members and best friend Vairam (Karunakaran) under his supervisor Chandrakanth (Thambi Ramaiah).During the journey, he meets Saroja (Keerthy Suresh) and falls in love with her in the first sight. She is the make-up artist of the actress Srisha, and she wants to become a successful singer. Poochi tells about Saroja to Vairam who promises to help him woo her. Poochi then devises a plan, and makes her talk on the phone to a great poet Vairamuthu, who is actually Vairam. However, he soon realizes that Saroja is not good at singing from any angle though continuing to support her. Saroja remains close to Poochi as she wants to enter the singing industry without knowing the true fact.The train then stops at Jhansi where Central Minister Rangarajan (Radha Ravi) boards the train along with his two bodyguards. One of them, Nandhakumar (Harish Uthaman) doesn't get well along Poochi and Saroja. He also gets humiliated by the minister in front of Poochi and he wants to take revenge. Poochi asks him to apologize to Saroja for hitting her earlier to which he agrees in order to get his lost gun back. He soon realizes that the gun is with the minister and not with Poochi and Saroja. He vows to murder them. Meanwhile, at Nagpur Jn. few robbers board the train without the knowledge of anyone as the driver celebrates his retirement.Next morning, Srisha's mother spots Saroja along with Poochi and asks him to call singer Vairamuthu in front of them which leads to the truth. Saroja, now devastated asks him never to show his face again. When he tries to apologize her, he is confronted by Nandhakumar, who locks him in a room. The train is stopped midway after hitting some wild bulls, the reason for which was blamed upon the assistant driver who failed to alert the driver due to his sobriety. Nandhakumar tries to attack Saroja but she escapes. Due to a fight between the guard of the train and the assistant driver, a green flag was waved. The driver notices and thinking that the assistant driver has fully checked the brakes' connection, he starts the train. As the train starts accelerating, Saroja is unable to board the passenger compartment in the moving train so she boards on the engine. At the same time, the guard and the assistant driver fall off the train which leaves them behind. A message is passed onto the railway administrator that the guard is not on the train. However, the driver, numb from thinking of the incident does not hear it. After a few moments, the driver dies of heart attack, and while dying pushes the controls forward making the train speed up, which is watched by Saroja much to her horror. The train starts to skip stations much to the alarm of the station masters and the railway administrator. At the same time, the burglars attack the passengers, and order not to stop the train. The passengers get terrified due to the high speed. Poochi then overpowers Nandhakumar and attempts to save Saroja. He kills all the burglars and gives Saroja a walkie talkie for communication. Nandhakumar tries to kill Poochi but is himself killed by the edge of an oncoming rail tunnel.News spreads like fire that the train driver is dead and the train is hijacked. Many mistake the robbers for terrorists and Saroja as their leader. Officers from the police and railway administration are given responsibility to bring down the train. When they realize that the train is not hijacked but out of control, they take help from Poochi and Saroja to stop the train by guiding Saroja on how to turn on the emergency brake. However, due to a short circuit earlier, the brakes do not work. They devise a plan to detach the engine from the passenger compartment. Poochi is successful after a long attempt in doing so and he jumps to the locomotive to save Saroja. Saroja realizes her love for Poochi. At Chennai Central Railway Station, the whole station is evacuated as the oncoming train approaches. The locomotive crashes into the station and both Poochi and Saroja are injured, but alive. The detached passenger compartments arrive in Chennai, safe with passengers unscathed. They are interviewed by the media, and Poochi is named a national hero."
}