{
    "id": "6066012",
    "localized title": "Nirmala Convent",
    "cast": [
        "Nagarjuna Akkineni",
        "Indu Anand",
        "Bhargavi",
        "Jogi Brothers",
        "Chandrahasa",
        "Chitti",
        "Anitha Chowdhary",
        "Roshan Kanakala",
        "Satya Krishnan",
        "Prasanna Kumar",
        "Adithya Menon",
        "Prabhu",
        "Ravi Prakash",
        "Praveen",
        "Thagubothu Ramesh",
        "Ritesh",
        "Roshann",
        "Samir",
        "Lab Sharath",
        "Shriya Sharma",
        "L.B. Sreeram",
        "Pavan Sriram",
        "Surya"
    ],
    "genres": "Romance",
    "runtimes": "152",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "16 Sep 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDBkNjA4MmUtMzQ5ZC00MmM0LWEwYjYtOGQwNWMyZTZlMTZjXkEyXkFqcGdeQXVyMjY2MTgwNjc@._V1_SY150_CR47,0,101,150_.jpg",
    "imdbID": "6066012",
    "plot outline": "Samuel (Roshan Meka), son of a poor farmer, David Suri (Surya) whose livelihood is only 1-acre land. Samuel is a studious guy and highly intelligent who studies plus one in Nirmala Convent in a village Bhupati Nagaram near Samalkota in Andhra Pradesh. Shanti (Shriya Sharma), his classmate, daughter of rich landlord Bhupati Raja (Aditya Menon) of the same village studies in the same convent. Initially, their acquaintance begins with teasing and quarrel but slowly they fall in love. Upon knowing this Bhupati Raja strikes Samuel and also insults his father before everyone. Even then to make his son's love successful Samuel's father reaches Bhupati Raja with the marriage proposal, he agrees with it on one condition if Samuel acquires name and money. Now Samuel decides wants to become popular and lands in Hyderabad where he meets film star Nagarjuna Akkineni and asks him to conduct the Champion of Champions program in his village. After some drama, makes him accept. Rest of the story is how Samuel becomes the winner in this challenge and gains his love with Nagarjuna's support and cooperation.",
    "languages": "Telugu",
    "title": "Nirmala Convent",
    "kind": "movie",
    "directors": "G.N.K. Rao",
    "visual effects": "Naresh Sattenapalli",
    "music department": [
        "Sriram Anant",
        "Damini Bhatla",
        "Subhash ChandraBose",
        "Kailash Kher",
        "Siddharth Mahadevan",
        "Roshan Saluri"
    ],
    "miscellaneous": "Vijay Binni",
    "director": "G.N.K. Rao",
    "production companies": "Concept film Production",
    "plot": [
        "In this youthful romance, veteran actor Nagarjuna introduces a new actor to Tollywood.",
        "Samuel (Roshan Meka), son of a poor farmer, David Suri (Surya) whose livelihood is only 1-acre land. Samuel is a studious guy and highly intelligent who studies plus one in _Nirmala Convent_ (qv) in a village Bhupati Nagaram near Samalkota in Andhra Pradesh. Shanti (Shriya Sharma), his classmate, daughter of rich landlord Bhupati Raja (Aditya Menon) of the same village studies in the same convent. Initially, their acquaintance begins with teasing and quarrel but slowly they fall in love. Upon knowing this Bhupati Raja strikes Samuel and also insults his father before everyone. Even then to make his son's love successful Samuel's father reaches Bhupati Raja with the marriage proposal, he agrees with it on one condition if Samuel acquires name and money. Now Samuel decides wants to become popular and lands in Hyderabad where he meets film star Nagarjuna Akkineni and asks him to conduct the Champion of Champions program in his village. After some drama, makes him accept. Rest of the story is how Samuel becomes the winner in this challenge and gains his love with Nagarjuna's support and cooperation.::Diptesh"
    ]
}