{
    "id": "6264430",
    "localized title": "Kallattam",
    "cast": [
        "Nandha",
        "Richard Rishi",
        "Ilavarasu",
        "Ezhumalai",
        "Baby Rethva Isvar",
        "Kumar Natarajan",
        "Sharika",
        "Usha Shree"
    ],
    "genres": [
        "Action",
        "Crime",
        "Thriller"
    ],
    "runtimes": "92",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:U",
        "United Kingdom:Not Rated",
        "United States:Not Rated"
    ],
    "original air date": "30 Sep 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjlhMzIwMWYtYzQ3MS00ZGUzLTg2OTMtYWYyOWRhNTc1MmE4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "6264430",
    "plot outline": "Mahendran is an unemployed young man whose daughter meets with an accident. He needs money for her operation and somehow arranges it, but when it gets stolen, his only hope is Thamizh, an honest police officer who himself lost his daughter and doesn't want anyone else to go through the same pain. He starts investigating and races against time to catch the criminals. He soon realizes he's running out of time when he finds himself incapable of arranging the money himself.",
    "languages": "Tamil",
    "title": "Kallattam",
    "kind": "movie",
    "directors": "G. Ramesh",
    "producers": [
        "R. Prakash",
        "G. Soundian",
        "G. Suman"
    ],
    "composers": "Umar Ezhilan",
    "cinematographers": "G. Ramesh",
    "editors": [
        "S.R. Ganesh Babu",
        "V.T. Vijayan"
    ],
    "akas": "Kallattam (India)",
    "director": "G. Ramesh",
    "production companies": "White House Productions",
    "plot": [
        "An honest cop races against time to catch the culprits who stole an unemployed man's loan money needed for his daughter's operation.",
        "Mahendran is an unemployed young man whose daughter meets with an accident. He needs money for her operation and somehow arranges it, but when it gets stolen, his only hope is Thamizh, an honest police officer who himself lost his daughter and doesn't want anyone else to go through the same pain. He starts investigating and races against time to catch the criminals. He soon realizes he's running out of time when he finds himself incapable of arranging the money himself.::Prashast Singh"
    ],
    "synopsis": "Mahendran is an unemployed man whose daughter meets with an accident while being dropped to school. He admits her to Kaveri Hospital where he and his wife are told their daughter can be saved but they need to deposit 20 lakh rupees. He is told to register an FIR at the nearby police station, which he does with the help of a cop named Pazhani. A desperate Mahendran, along with his wife's jewels, reaches at the jewelry shop of Seth, who gives him the said amount in exchange for the jewels. Mahendran promises to repay when he gets his job, and boards an auto rickshaw. Seth, however, orders his boys to collect the amount. They intentionally crash their bikes with the auto rickshaw, and while they fight, the bag full of money is taken away. The auto driver refuses to charge Mahendran anything and flees away. Mahendran rushes back to the police station and meets Thamizh, an honest cop, who decides to help him. Thamizh, Pazhani and Mahendran manage to locate the auto rickshaw and its driver, Kannan, who is beaten up and spills out the truth. Seth is also beaten up and he ends up revealing that while he conspired to get back the money, the boys who extracted it didn't return it to him. He also reveals about a dancer in Nellore whom the boys often met from time to time. With the help of Pazhani and a friendly cop in Nellore, Thamizh traces the dancer and questions her, but doesn't find anything significant.Returning to Chennai, Thamizh asks his friends to arrange for money upon learning from Mahendran that the operation needs to be commenced soon. When he doesn't succeed in getting any money, his wife gives him their dead daughter's jewels and tells him to sell them. Thamizh hands over the jewels to Pazhani, who approaches Ezhumalai, a criminal, for money. Seeing Ezhumalai play with his daughter, Pazhani convinces him to save the life of the girl admitted in the hospital. The next day, he sends Thamizh a bag full of money under Pazhani's name, following which Thamizh is arrested by the Anti-Corruption Bureau for publicly accepting bribe. In prison, Pazhani apologizes to Thamizh and asks him about the enmity Ezhumalai has with him. He reveals that while he was in Madurai with his wife and daughter, he tried to help a woman being harassed for her property by Ezhumalai. However, he met various alibis whenever he tried to arrest him. When he was finally about to arrest him, he was handed over his transfer orders. In the meanwhile, Thamizh's daughter met with an accident at home, and when admitted to hospital, she couldn't survive. Thamizh learnt it through the nurses that the medicines were expired, and Ezhumalai's pharma agencies were responsible for more similar deaths. Following this, Thamizh decided to come to Chennai on request transfer. He is then freed due to his reputation in the department.Thamizh sets up a plan to lure Seth into giving a man 5 lakh rupees, following which Seth sends his boys to retrieve the money. The boys crash their vehicles into the auto rickshaw, but while trying to steal the bag, they are stopped by Thamizh, taken to a secret location and beaten up badly by an enraged Mahendran. The boys reveal everything about Ezhumalai's chain snatching and child kidnapping business, following which Thamizh conspires to kidnap Ezhumalai's daughter. He also joins hands with doctors at Kaveri Hospital. After a chase, he manages to get hold of Ravi, Ezhumalai's friend, and tells him to lure him into come to a spot, leaving behind his daughter. While going to school, Ezhumalai's daughter and wife are chased by bikers who end up in a crash, leaving the daughter injured. A worried Ezhumalai arrives at Kaveri Hospital and deposits the amount needed for the operation, which is used by the doctors to operate on Mahendran's daughter. She is saved, and in his next move, Thamizh tells the doctors to declare Ezhumalai's daughter dead. Upon hearing of her death, Ezhumalai and his wife break down, while his men start destroying the hospital. The doctor is almost attacked but Thamizh brings out Ezhumalai's doctor, verbally confronts and gets him arrested.During the end credits scene, Mahendran's daughter is seen dancing and Thamizh lifts her up in his arms."
}