{
    "id": "7473438",
    "localized title": "Well Done Bhalya",
    "cast": [
        "Ramesh Deo",
        "Namrata Jadhav",
        "Nitin Kamble",
        "Rajesh Kamble",
        "Saurabh Karvande",
        "Sanjay Khapre",
        "Alka Kubal",
        "Sanjay Narvekar",
        "Sharad Ponkshe",
        "Nandkumar Solkar",
        "Anshuman Vichare",
        "Ganesh Yadav"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "original air date": "18 Mar 2016 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2U3NTE3YTYtNDg3MC00MWQ5LThkYjUtMWY5YWIzZGViMjBlXkEyXkFqcGdeQXVyMTIxMTk1Njk@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "7473438",
    "plot outline": "Shukrya wants his son Bhalya to get good education and escape crisis face by his community.But Bhalya is just interested in Cricket.He excels in the game but needs a formal training.A local MLA Gajabahu hates the tribal community and has hi son enrolled to the school cricket team.",
    "languages": "Marathi",
    "title": "Well Done Bhalya",
    "kind": "movie",
    "directors": "Nitin Kamble",
    "writers": [
        "Nitin Kamble",
        "",
        "Nitin Kamble",
        "",
        "Nitin Supekar"
    ],
    "composers": "Trupti Chavan",
    "cinematographers": [
        "Shanu Singh Rajput",
        "Giridharan Swamy"
    ],
    "editors": "Sameer Shaikh",
    "costume designers": "Chaitrali Dongre",
    "production managers": "Sanjay Kamble",
    "assistant directors": [
        "Vishram Chavan",
        "Smruti Wakode"
    ],
    "miscellaneous": [
        "Santosh Bhangre",
        "Ganesh Gargote",
        "Sameer Gore",
        "Harshit Mhatre"
    ],
    "akas": "Well Done Bhalya (India)",
    "writer": [
        "Nitin Kamble",
        "Nitin Kamble",
        "Nitin Supekar"
    ],
    "director": "Nitin Kamble",
    "production companies": "Achintya Films",
    "other companies": "Media One",
    "plot": "Shukrya wants his son Bhalya to get good education and escape crisis face by his community.But Bhalya is just interested in Cricket.He excels in the game but needs a formal training.A local MLA Gajabahu hates the tribal community and has hi son enrolled to the school cricket team.::alex.mjacko@gmail.com",
    "synopsis": "The story of Well Done Bhalya starts on the outstays of village 'Pali' surrounded by natured beauty where'Bhalchandra' lives with his people. They all sell fruits, Flowers, Honey etc on Hill Station and Market to earn a living. Instead of taking education 'Bhalya' has to work because of his poverty. But in this situation also only a thing of pleasure for him is his passion for cricketBut his father 'Shukrya' hates cricket as Bhalya neglects working with him and spends his time in cricket and his father has to incur heavy losses. According to 'Shukrya' cricket means for rich society as well as he gets bad behavior from rich society.In this adverse condition Bhalya continues his love towards cricket. Gradually the cricket\nclub of Pali noticed Bhalya's passion for cricket Because of his batting they all come very close to Bhalya. Ignoring all the rules of their club they started to train Bhalya. But the founder of club and MLA Shri Gajabhao dosen't agree this as he has two obstacle in this political career and his son's cricket career are Bhaly's cricket and the other is tribal people and Shukrya has to listen a lot from Gajabhao and when when he comes to know that Bhaly's cricket is the main reason behind Gajbhao's anger and that's only rich society notice BHaly's tribe, he decides to support Bhalya. So there clashes between two father.In the pali cricket club Bhaly's has to face malice who is Gajabhao son. But to see\nBhalya's batting other players in the club decide to make (by hiding his iddentiey) Bhalya play under 16 team even though he is not a member of the club. In this match Bhalya's great batting wins the match in very difficult situation.Mr. Richanr Poal saw Bhalya's passion and hard work towards cricket in adverse situation and wrote a book named \"Wel done Bhalya'...."
}