{
    "id": "0068327",
    "localized title": "Cabaret",
    "cast": [
        "Liza Minnelli",
        "Michael York",
        "Helmut Griem",
        "Joel Grey",
        "Fritz Wepper",
        "Marisa Berenson",
        "Elisabeth Neumann-Viertel",
        "Helen Vita",
        "Sigrid von Richthofen",
        "Gerd Vespermann",
        "Ralf Wolter",
        "Georg Hartmann",
        "Ricky Renée",
        "Estrongo Nachama",
        "Kathryn Doby",
        "Inge Jaeger",
        "Angelika Koch",
        "Helen Velkovorska",
        "Gitta Schmidt",
        "Louise Quick",
        "Oliver Collignon",
        "Pierre Franckh",
        "Mark Lambert",
        "Ellen Umlauf"
    ],
    "genres": [
        "Drama",
        "Music",
        "Musical",
        "Romance"
    ],
    "runtimes": "124",
    "countries": "United States",
    "country codes": "us",
    "language codes": [
        "en",
        "de",
        "he",
        "fr"
    ],
    "color info": "Color::(Technicolor)",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Mono",
    "certificates": [
        "Argentina:16",
        "Australia:M",
        "Canada:18A",
        "Canada:PG::(Ontario)",
        "Canada:PG::(video rating)",
        "Finland:K-16",
        "France:Tous publics",
        "Iceland:L",
        "India:UA",
        "India:A",
        "Ireland:15",
        "Italy:T",
        "Netherlands:18",
        "Norway:16",
        "Peru:14",
        "Portugal:M/16",
        "Portugal:M/12::(DVD rating)",
        "Russia:12+",
        "Singapore:PG",
        "Sweden:15",
        "United Kingdom:X",
        "United Kingdom:15::(tv rating)",
        "United Kingdom:15",
        "United Kingdom:15::(video rating)",
        "United States:PG::(certificate.#23094)",
        "West Germany:16"
    ],
    "original air date": "13 Feb 1972 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTEyMzc0Mjk5MV5BMl5BanBnXkFtZTgwMjI2NDIwMTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0068327",
    "plot outline": "Cambridge University student Brian Roberts arrives in Berlin in 1931 to complete his German studies. Without much money, he plans on making a living teaching English while living in an inexpensive rooming house, where he befriends another of the tenants, American Sally Bowles. She is outwardly a flamboyant, perpetually happy person who works as a singer at the decadent Kit Kat Klub, a cabaret styled venue. Sally's outward façade is matched by that of the Klub, overseen by the omnipresent Master of Ceremonies. Sally draws Brian into her world, and initially wants him to be one of her many lovers, until she learns that he is a homosexual, albeit a celibate one. Among their other friends are his students, the poor Fritz Wendel, who wants to be a gigolo to live a comfortable life, and the straight-laced and beautiful Natalia Landauer, a Jewish heiress. Fritz initially sees Natalia as his money ticket, but eventually falls for her. However Natalia is suspect of his motives and cannot overcome their religious differences. Also into Sally and Brian's life comes the wealthy Baron Maximilian von Heune, who has the same outlook on life as Sally, but who has the money to support it. Max is willing to lavish his new friends with gifts and his favors. Around them all is the Nazi uprising, to which they seem to pay little attention or care. But they ultimately learn that life in all its good and particularly bad continues to happen to them and around them.",
    "languages": [
        "English",
        "German",
        "Hebrew",
        "French"
    ],
    "title": "Cabaret",
    "kind": "movie",
    "directors": "Bob Fosse",
    "writers": [
        "Joe Masteroff",
        "",
        "John Van Druten",
        "",
        "Christopher Isherwood",
        "",
        "Jay Presson Allen"
    ],
    "producers": [
        "Martin Baum",
        "Cy Feuer",
        "Harold Nebenzal"
    ],
    "composers": [
        "John Kander",
        "Ralph Burns"
    ],
    "cinematographers": "Geoffrey Unsworth",
    "editors": "David Bretherton",
    "editorial department": "David Ramirez",
    "casting directors": "Renate Neuchl",
    "production designers": "Rolf Zehetbauer",
    "art directors": "Hans Jürgen Kiebach",
    "costume designers": "Charlotte Flemming",
    "make up department": [
        "Susi Krause",
        "Gus Le Pre",
        "Christina Smith",
        "Raimund Stangl"
    ],
    "production managers": [
        "Pia Arnold",
        "Wolfram Kohtz"
    ],
    "assistant directors": [
        "Wolfgang Glattes",
        "Douglas Green",
        "Stefan Zürcher"
    ],
    "art department": [
        "Richard Eglseder",
        "Herbert Strabel"
    ],
    "sound department": [
        "David Hildyard",
        "Robert Knudson",
        "Arthur Piantadosi",
        "Doug Grindstaff",
        "Kitty Malone",
        "James Nelson"
    ],
    "camera department": [
        "Herbert Fischer",
        "Lars Looschen",
        "Peter MacDonald",
        "John Campbell"
    ],
    "costume departmen": [
        "Ille Sievers",
        "Ute Meyer-Martin"
    ],
    "music department": [
        "Ralph Burns",
        "Fred Ebb",
        "Illo Endrulat",
        "Bob Fosse",
        "John Kander",
        "Raoul Kraushaar",
        "Karola Storr",
        "Robert Tracy",
        "Fred Werner"
    ],
    "script department": "Trudy von Trotha",
    "miscellaneous": [
        "Jutta Beil",
        "Bob Fosse",
        "Vic Heutschy",
        "Jane Meagher",
        "Harold Prince",
        "Osman Ragheb",
        "John Sharpe",
        "Hugh Wheeler",
        "Michael Alpert",
        "Stephanie Daniel",
        "Virginia Lord",
        "Myrna Post"
    ],
    "akas": [
        "Cabaret, Adeus Berlim (Portugal)",
        "Kabaré (Hungary)",
        "Kabare - Elveda Berlin (Turkey, Turkish title)",
        "Kabaret (Slovenia)",
        "Kabare (Serbia)"
    ],
    "writer": [
        "Joe Masteroff",
        "John Van Druten",
        "Christopher Isherwood"
    ],
    "director": "Bob Fosse",
    "production companies": [
        "Allied Artists Pictures",
        "ABC Pictures",
        "A Feuer and Martin Production",
        "Bavaria Film"
    ],
    "distributors": [
        "Allied Artists Pictures",
        "20th Century Fox Hellas",
        "Centfox",
        "Filmes Castello Lopes",
        "Fox Norena Film A/S",
        "Fox-MGM Film",
        "Fox-Rank",
        "Hispamex Films",
        "International Film Distributors",
        "Netherlands Fox Film Corporation",
        "Twentieth Century Fox",
        "MGM-Fox Films",
        "American Broadcasting Company (ABC)",
        "20th Century Fox India",
        "Citadel Films",
        "InCine",
        "MGM/CBS Home Video",
        "Nord Video",
        "CBS Video",
        "Star Video",
        "Thorn EMI Video",
        "CBS/Fox",
        "CBS/Fox",
        "CEL Home Video",
        "Rank Video",
        "CBS/Fox",
        "CBS/Fox",
        "Video Elit",
        "Video Gems",
        "CBS/Fox",
        "CBS/Fox",
        "M6",
        "Atlas Films",
        "Braveworld",
        "Parkfield Entertainment",
        "Warner Home Video",
        "Warner Home Video",
        "4 Front Video",
        "PolyGram Video",
        "BMG Video",
        "Cinema Club",
        "Video Collection International",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Manga Films",
        "Scanbox Entertainment",
        "EuroVideo",
        "Fremantle Home Entertainment",
        "MRA Entertainment Group",
        "Warner Home Video",
        "Prism Leisure Corporation",
        "Fremantle Home Entertainment",
        "Warner Home Video",
        "Fremantle Home Entertainment",
        "Warner Home Video",
        "Warner Home Video",
        "Fremantle Home Entertainment",
        "Rai Movie",
        "Warner Archive Collection",
        "HBO Max",
        "F.J. Lucas"
    ],
    "other companies": [
        "Audiolink Radio Communications",
        "CBS",
        "Edit-Rite",
        "Modern Film Effects",
        "Todd-AO Studios"
    ],
    "plot": [
        "A female girlie club entertainer in Weimar Republic era Berlin romances two men while the Nazi Party rises to power around them.",
        "Cambridge University student Brian Roberts arrives in Berlin in 1931 to complete his German studies. Without much money, he plans on making a living teaching English while living in an inexpensive rooming house, where he befriends another of the tenants, American Sally Bowles. She is outwardly a flamboyant, perpetually happy person who works as a singer at the decadent Kit Kat Klub, a cabaret styled venue. Sally's outward façade is matched by that of the Klub, overseen by the omnipresent Master of Ceremonies. Sally draws Brian into her world, and initially wants him to be one of her many lovers, until she learns that he is a homosexual, albeit a celibate one. Among their other friends are his students, the poor Fritz Wendel, who wants to be a gigolo to live a comfortable life, and the straight-laced and beautiful Natalia Landauer, a Jewish heiress. Fritz initially sees Natalia as his money ticket, but eventually falls for her. However Natalia is suspect of his motives and cannot overcome their religious differences. Also into Sally and Brian's life comes the wealthy Baron Maximilian von Heune, who has the same outlook on life as Sally, but who has the money to support it. Max is willing to lavish his new friends with gifts and his favors. Around them all is the Nazi uprising, to which they seem to pay little attention or care. But they ultimately learn that life in all its good and particularly bad continues to happen to them and around them.::Huggo",
        "In 1931, in Berlin, the English professor from Cambridge Brian Roberts comes to the boarding house where the promiscuous American performer and singer of the _Cabaret_ (qv) Kit-Kat Club Sally Bowles lives. They befriend each other and soon Sally discovers that Brian is not attracted by women, but they have a love affair. When Sally meets the wealthy Baron Maximilian von Heune, both Sally and Brian are seduced by the baron. Meanwhile there is the ascension of the Nazi Party.::Claudio Carvalho, Rio de Janeiro, Brazil",
        "In 1930's Berlin, American Sally Bowles works as a singer in the Kit Kat club. At her rooming house she meets Englishman Brian Roberts who has come to Berlin to improve his German. He hopes to pay his expenses by giving English language lessons. Sally is unconventional and she and Robert have a number of adventures together. The romp continues with several of their friends, including the very rich Maximilian von Heune. Life takes a sudden turn for Sally however and throughout it all, the rise of Nazism casts a shadow over everyone.::garykmcd",
        "In Berlin in 1931, American cabaret singer Sally Bowles meets British academic Brian Roberts, who is finishing his university studies. Despite Brian's confusion over his sexuality, the pair become lovers, but the arrival of the wealthy and decadent playboy Maximilian von Heune complicates matters for them both. This love triangle plays out against the rise of the Nazi party and the collapse of the Weimar Republic.::Jwelch5742",
        "It is the city of Berlin in 1931, a time when political unrest racks the country, the economy has been destroyed, and millions of unemployed roam the streets. Enter into this chaos an American cabaret dancer, working at the downtown \"Kit-Kat club\" where anything goes on the stage. Into this young dancer's life come several characters such as a rich German politician, a young Jewish man struggling with his identity, an Englishman teacher from London, and of course the all-knowing, all-seeing Master of Ceremonies.::Anthony Hughes <husnock31@hotmail.com>"
    ],
    "synopsis": "Sally Bowles (Liza Minnelli) is an American-singer and dancer who lives in Germany in the between-wars period. She dreams of becoming rich and famous, but has a clear drinking problem. She works at the Kit-Kat cabaret, a seedy place with suggestive musical numbers. The Master of Ceremonies (Joel Grey), introduces and participates in the risque acts at the cabaret.We see Nazis asking for donations from the club patrons, but the owner throws them out.Sally meets Brian Roberts (Michael York) when he takes a room in a flat she shares with some older people. He is in Berlin to finish his PhD and teach English, but is currently penniless. They become friends, but fairly quickly Sally discovers that Brian has been \"unsuccessful\" with women, and it is implied that he is gay. The two become friends, with Sally doing much of the talking. She is loud, brash, an alcoholic always bumming cigarettes and dreaming of stardom (though her talent is apparent, she sells herself short and assumes a destructive lifestyle). We learn her father is a diplomat, but he misses a meeting with her, and has apparently been absent (if apologetic, but efficient to the point of counting words on telegrams) for much of her life.Through the other tenant's conversations, street shots, musical numbers and and a few seemingly random scenes or inserts in conversations, the growing influence of racist ideas and Nazism is foreshadowed.Brian is fascinated by Sally (she is edgy and outspoken and almost out of control, while he is composed and rational) and their friendship ends up as a sexual affair. However, Sally doesn't want to fall in love with him because she wants to marry big money. One day, while complaining at the laundrette because of problems with the timing of the cleaning of some garments, she bumps into Maximilian von Heune (Helmut Griem). He helps Sally by translating the attendant's German into English. Sally flirts with him, and he offers her a ride in his limousine. Sally falls dazzled when she notices the luxurious car. They go out (Brian, invited, refuses) and Max buys Sally perfume, a fur coat and treats her to a life of luxury.Meanwhile, Sally and Brian have been setting up one student of Brian's, a wanna-be gigolo who plans on meeting and wedding an ugly but rich woman, Fritz Wendel (Fritz Wepper), with a wealthy heiress, Natalia Landauer (Marisa Berenson). While Fritz was originally after Natalia's money, he finds he has really fallen for her - and she is in love with him. Ironically, it is Sally's bluntly sexual advice (that both seek) that bring them together.Max also buys Brian gifts and finally wins him over--Brian and Sally visit Max at his castle. Max gives them a first-class treatment, and Sally gets completely starry-eyed. However, there, they learn the truth: Max is married, but he and his wife have decided to lead separate lives with many different lovers and sexual adventures on either side, but never breaking up their marriage, as financially that would be an end to their flamboyant living. The three enjoy an evening of decadence.Later, Sally confesses to Brian that she has slept with Max. Brian confesses that he has too.The Nazis are gaining public acceptance and power. Max, Sally and Brian go to a beer garden and a Nazi youth starts singing a \"patriotic\" song; most of the people join in. On the way home, Brian suggests that the growing Nazi threat may not be contained (by people like Max, even). A Nazi gang beats up the club owner in revenge of their previous treatment. One of the acts in the club is a poignant and ironic \"ode\" to anti-Jew sentiment.Natalia finds her beloved dog dead on her door-step. Brian encourages Fritz to propose to her, as he knows she really does love him, and Fritz loves her as a person - not just for her fortune. Fritz says that it won't happen, because he's penniless. Because of the increasingly hostile atmosphere, Natalia rejects Fritz when he finally proposes. She tells him that the marriage can't take place because she is Jewish. Fritz confesses to Natalia that he is Jewish as well, and they get married in a traditional ceremony immediately.Max sends a note to Sally and Brian, saying that he has to leave the country on \"family business\". He includes money for each of them. Soon, she feels gloomy, and tells Brian that she is pregnant, but doesn't know who the father is. It could be Max or Brian's... She considers an abortion, but Brian asks her to marry him. He asks her to have the baby and tries to convince her that they could be happy together in spite of not being millionaires. His demeanor and expression, however, suggests that he is not pleased with this prospect, as Sally says that she'll think about it. It's implied through scenes of their past decadence, that, if she has a baby, she'll give up the only life she knows, nor ever never be able to become a star or marry a rich man.The next thing Brian notices is that Sally hasn't got the fur coat anymore. Brian realizes that she's given it to the doctor as payment for the abortion. Their relationship is over. Returning to his rational self and seeing Sally for who she is, and the rise of Nazism, he decides to return home.Brian and Sally head to the train station so Brian can return to England. Sally stays behind to keep up her performances at the club. She sings her final ode to fatalism and decadence, \"Cabaret\", and the MC closes the show. The atmosphere is not joyous anymore and Nazis are seen among the patrons in the warped mirror of the sax."
}