{
    "id": "0074958",
    "localized title": "Network",
    "cast": [
        "Faye Dunaway",
        "William Holden",
        "Peter Finch",
        "Robert Duvall",
        "Wesley Addy",
        "Ned Beatty",
        "Arthur Burghardt",
        "Bill Burrows",
        "John Carpenter",
        "Jordan Charney",
        "Kathy Cronkite",
        "Ed Crowley",
        "Jerome Dempsey",
        "Conchata Ferrell",
        "Gene Gross",
        "Stanley Grover",
        "Cindy Grover",
        "Darryl Hickman",
        "Mitchell Jason",
        "Paul Jenkins",
        "Ken Kercheval",
        "Kenneth Kimmins",
        "Lynn Klugman",
        "Carolyn Krigbaum",
        "Zane Lasky",
        "Michael Lipton",
        "Michael Lombard",
        "Pirie MacDonald",
        "Russ Petranto",
        "Bernard Pollock",
        "Roy Poole",
        "William Prince",
        "Sasha von Scherler",
        "Lane Smith",
        "Ted Sorel",
        "Beatrice Straight",
        "Fred Stuthman",
        "Cameron Thomas",
        "Marlene Warfield",
        "Lydia Wilen",
        "Lee Richardson",
        "John Chancellor",
        "Robert P. Cohen",
        "Walter Cronkite",
        "Andrew Duncan",
        "Todd Everett",
        "Betty Ford",
        "Gerald Ford",
        "John Gabriel",
        "Tom Gibney",
        "Lance Henriksen",
        "Raymond Martino",
        "John Pashley",
        "Howard K. Smith",
        "David Susskind",
        "Michael Tucker",
        "Ahmed Yamani"
    ],
    "genres": "Drama",
    "runtimes": "121",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color::(Metrocolor)",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Mono",
    "certificates": [
        "Argentina:16",
        "Australia:M",
        "Brazil:14",
        "Canada:PG::(Manitoba)",
        "Canada:R::(Nova Scotia/Ontario)",
        "Canada:14+::(Quebec)",
        "Canada:G::(Quebec)",
        "Denmark:15",
        "Finland:K-16",
        "France:Tous publics",
        "Iceland:12",
        "India:UA",
        "Ireland:15",
        "Italy:T",
        "Netherlands:14",
        "Netherlands:12",
        "New Zealand:R18",
        "Norway:15::(iTunes rating)",
        "Norway:16::(cinema rating)",
        "Poland:16::(self-applied)",
        "Portugal:M/12",
        "Singapore:M18",
        "South Korea:15",
        "South Korea:18",
        "Spain:18",
        "Sweden:15",
        "Turkey:15+::(DVD rating)",
        "United Kingdom:AA",
        "United Kingdom:15",
        "United States:R::(certificate no. 24546)",
        "West Germany:16"
    ],
    "original air date": "27 Nov 1976 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGNjYjM2MzItZGQzZi00NmY3LTgxOGUtMTQ2MWQxNWQ2MmMwXkEyXkFqcGdeQXVyNzM0MTUwNTY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0074958",
    "plot outline": "In the 1970s, terrorist violence is the stuff of networks' nightly news programming and the corporate structure of the UBS Television Network is changing. Meanwhile, Howard Beale, the aging UBS news anchor, has lost his once strong ratings share and so the network fires him. Beale reacts in an unexpected way. We then see how this affects the fortunes of Beale, his coworkers (Max Schumacher and Diana Christensen), and the network.",
    "languages": "English",
    "title": "Network",
    "kind": "movie",
    "directors": "Sidney Lumet",
    "writers": "Paddy Chayefsky",
    "producers": [
        "Fred C. Caruso",
        "Howard Gottfried"
    ],
    "composers": "Elliot Lawrence",
    "cinematographers": "Owen Roizman",
    "editors": "Alan Heim",
    "editorial department": [
        "Michael Jacobi",
        "Don Dittmar",
        "Norman Hollyn",
        "Jeffrey Wolf"
    ],
    "casting directors": "Juliet Taylor",
    "production designers": "Philip Rosenberg",
    "set decorators": "Edward Stewart",
    "costume designers": "Theoni V. Aldredge",
    "make up department": [
        "John Alese",
        "Susan Germaine",
        "Lee Harman",
        "Philip Leto",
        "Network",
        "Barbie Palmer"
    ],
    "assistant directors": [
        "Alan Hopkins",
        "Ralph S. Singleton"
    ],
    "art department": [
        "Connie Brink",
        "William F. Reynolds"
    ],
    "sound department": [
        "Jack Fitzstephens",
        "Marc Laub",
        "Sanford Rackow",
        "James Sabat",
        "Dick Vorisek",
        "Louis Cerborino",
        "Mel Zelniker"
    ],
    "camera department": [
        "Michael Ginsburg",
        "Kenneth Goss",
        "Norman Leigh",
        "Gary Muller",
        "Tom Prate",
        "Tom Priestley Jr.",
        "Fred Schuler"
    ],
    "costume departmen": [
        "George Newman",
        "Marilyn Putnam"
    ],
    "location management": "John H. Starke",
    "music department": "Elliot Lawrence",
    "script department": "Kay Chapin",
    "miscellaneous": [
        "Selma Brown",
        "Steve Rutt",
        "Connie Schoenberg",
        "Stephen Frankfurt",
        "Mark Hurwitz"
    ],
    "akas": [
        "Network - Main basse sur la TV (France)",
        "Network, un mundo implacable (Spain)",
        "电视台风云 (China, Mandarin title)",
        "螢光幕後 (Taiwan)",
        "Escândalo na TV (Portugal)"
    ],
    "writer": "Paddy Chayefsky",
    "director": "Sidney Lumet",
    "production companies": "Metro-Goldwyn-Mayer (MGM)",
    "distributors": [
        "Metro-Goldwyn-Mayer (MGM)",
        "United Artists",
        "United Artists",
        "United Artists",
        "United Artists",
        "United Artists",
        "United Artists",
        "United Artists",
        "Kommunenes Filmcentral (KF)",
        "United Artists",
        "United Artists",
        "United Artists",
        "Rank Filmes de Portugal",
        "Nova Film",
        "C.B. Films S.A.",
        "Home Box Office (HBO)",
        "United Artists (A-Asia)",
        "United Artists",
        "CBS",
        "Intervision Video",
        "MGM/CBS Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "MGM/UA Home Video",
        "MGM/UA Home Video",
        "Audio Visual Enterprises",
        "Turner Entertainment",
        "MGM/UA Home Video",
        "MGM/UA Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "ARTE",
        "MGM/UA Home Entertainment",
        "Chapel Distribution",
        "Warner Home Vídeo",
        "Warner Home Video",
        "MGM Home Entertainment",
        "MGM Home Entertainment",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Warner Home Video",
        "Arrow Films",
        "Arthaus",
        "Arthaus",
        "France 5",
        "CEL-MGM/UA Home Video"
    ],
    "other companies": [
        "Todd/Champion Ltd.",
        "Panavision",
        "Metrocolor",
        "EUE/Screen Gems Video Services",
        "International Alliance of Theatrical Stage Employees (IATSE)",
        "KO Creative"
    ],
    "plot": [
        "A television network cynically exploits a deranged former anchor's ravings and revelations about the news media for its own profit, but finds that his message may be difficult to control.",
        "In the 1970s, terrorist violence is the stuff of networks' nightly news programming and the corporate structure of the UBS Television _Network_ (qv) is changing. Meanwhile, Howard Beale, the aging UBS news anchor, has lost his once strong ratings share and so the network fires him. Beale reacts in an unexpected way. We then see how this affects the fortunes of Beale, his coworkers (Max Schumacher and Diana Christensen), and the network.::Bruce Janson <bruce@cs.su.oz.au>",
        "The Union Broadcasting System (UBS) is the floundering fourth place American network of only four. Howard Beale, the once popular news anchor for UBS, has seen his own declining fortunes of late. Personal problems have led to his performance slipping, which in turn has led to declining ratings. The network has fired him, effective in two weeks, the news given to him by the head of the network's news division and his long time friend, Max Schumacher. On his first broadcast following receiving this news, Beale announces on air that he will blow out his brains on the telecast in one week's time, and the reason for doing so. The network brass, incensed, pulls him off effective immediately, but Howard, stating he was drunk at the time over the news of his firing, pleads for one final telecast so that he can exit from news broadcasting with dignity. When on the broadcast Howard instead speaks candidly, emotionally and profanely about what he is feeling, Diana Christensen, the relatively new and ambitious vice-president in charge of programming, thinks that Howard is the panacea to all the network's rating problems as Howard is only stating what the public is feeling. She is interested in counter-establishment programming. With Max's blessing, she wants to hijack from the news division a television news show featuring Howard. Through this process, Diana tries to convince network brass to do what she wants not only with Howard's show but other counter-establishment programming, Max wants to preserve his reputation as a news man with integrity, and Howard tries to convince Max and Diana that he is imbued with messages from higher powers, which is making him seem insane to Max (who cares) and Diana (who cares only if his rantings from these higher powers increase ratings). Despite their differences in views, Max and Diana begin a September-May romance, which plays on Max's conscience as a faithful married man for twenty-five years and which Diana always refers to, as she does everything in life, in terms of a television show plot outline.::Huggo",
        "In this lauded satire, veteran news anchorman Howard Beale discovers that he's being put out to pasture, and he's none too happy about it. After threatening to shoot himself on live television, instead he launches into an angry televised rant, which turns out to be a huge ratings boost for the UBS network. This stunt allows ambitious producer Diana Christensen to develop even more outrageous programming, a concept that she takes to unsettling extremes.::Jwelch5742",
        "Howard Beale is an aging TV anchorman for UBS who is fired, effective in two weeks, after his ratings have been steadily deteriorating. He reacts to this by sensationally announcing on live television his intention to commit suicide on air. In doing so, Beale becomes a major TV icon and one of the most valuable assets to the Communications Corporation of America (CCA), the company that is gradually taking control of UBS. As a result he is given his own show as 'the mad prophet of the air-waves'. He appears live on television every week-day evening to tell the real truth to the people of America. The program is a huge success but Beale uses his power to make startling revelations about CCA, leaving the company executives with a serious problem.::David Claydon <dc6212@bristol.ac.uk>",
        "A fourth network is struggling for ratings and turns its news division over to the entertainment division. As one of the ramifications of this move the news Anchor is fired. He goes on the air with a wonderfully daffy rant and rave session culminating in his insisting that people go to the windows and yell, \"I'm as mad as hell, and I'm not going to take it anymore.\" His ravings make him an Icon as the need to sell begins to overwhelm everyone touched by the network.::John Vogel <jlvogel@comcast.net>"
    ],
    "synopsis": "The following synopsis has mostly been taken from the film's wikipedia page:Howard Beale (Peter Finch), the longtime anchor of the Union Broadcasting System's UBS Evening News, learns from the news division president, Max Schumacher (William Holden), that he has just two more weeks on the air because of declining ratings. The two old friends get roaring drunk and lament the state of their industry. The following night, Beale announces on live television that he will commit suicide on next Tuesday's broadcast. UBS fires him after this incident, but Schumacher intervenes so that Beale can have a dignified farewell. Beale promises he will apologise for his outburst, but once on the air, he launches back into a rant claiming that life is \"bullshit\". Beale's outburst causes the newscast's ratings to spike, and much to Schumacher's dismay, the upper echelons of UBS decide to exploit Beale's antics rather than pull him off the air. In one impassioned diatribe, Beale galvanises the nation, persuading his viewers to shout out of their windows \"I'm as mad as hell, and I'm not going to take this anymore!\"Diana Christensen (Faye Dunaway) heads the network's programming department; seeking just one hit show, she cuts a deal with a band of radical terrorists (a parody of the Symbionese Liberation Army called the \"Ecumenical Liberation Army\") for a new docudrama series called the Mao Tse-Tung Hour for the upcoming fall season. When Beale's ratings seem to have topped out, Christensen approaches Schumacher and offers to help him \"develop\" the news show. He says no to the professional offer, but not to the personal one, and the two begin an affair. When Schumacher decides to end the Howard as the \"Angry Man\" format, Christensen convinces her boss, Frank Hackett, to slot the evening news show under the entertainment division so she can develop it. Hackett agrees, bullies the UBS executives to consent, and fires Schumacher at the same time. Soon afterward, Beale is hosting a new program called The Howard Beale Show, top-billed as \"the mad prophet of the airwaves\". Ultimately, the show becomes the most highly rated program on television, and Beale finds new celebrity preaching his angry message in front of a live studio audience that, on cue, chants Beale's signature catchphrase en masse: \"We're as mad as hell, and we're not going to take this anymore.\" At first, Max and Diana's romance withers as the show flourishes, but in the flush of high ratings, the two ultimately find their way back together, and Schumacher leaves his wife of over 25 years for Christensen. But Christensen's fanatical devotion to her job and emotional emptiness ultimately drive Max back to his wife, and he warns his former lover that she will self-destruct at the pace she is running with her career. \"You are television incarnate, Diana,\" he tells her, \"indifferent to suffering, insensitive to joy. All of life is reduced to the common rubble of banality.\"When Beale discovers that Communications Corporation of America (CCA), the conglomerate that owns UBS, will be bought out by an even larger Saudi Arabian conglomerate, he launches an on-screen tirade against the deal, encouraging viewers to send telegrams to the White House telling them, \"I want the CCA deal stopped now!\" This throws the top network brass into a state of panic because the company's debt load has made merger essential for survival. Hackett takes Beale to meet with CCA chairman Arthur Jensen, who explicates his own \"corporate cosmology\" to the attentive Beale. Jensen delivers a tirade of his own in an \"appropriate setting\", the dramatically darkened CCA boardroom, that suggests to the docile Beale that Jensen may himself be some higher power describing the interrelatedness of the participants in the international economy and the illusory nature of nationality distinctions. Jensen persuades Beale to abandon the populist messages and preach his new \"evangel\". But television audiences find his new sermons on the dehumanisation of society depressing, and ratings begin to slide, yet Jensen will not allow UBS executives to fire Beale. Seeing its two-for-the-price-of-one value, solving the Beale problem plus sparking a boost in season-opener ratings. Christensen, Hackett, and the other executives decide to hire the Ecumenical Liberation Army to assassinate Beale on the air. The assassination succeeds, putting an end to The Howard Beale Show and kicking off a second season of The Mao Tse-Tung Hour.The film ends with the narrator stating:\"This was the story of Howard Beale, the first known instance of a man who was killed because he had lousy ratings.\""
}