{
    "id": "0246805",
    "localized title": "Navarathri",
    "cast": [
        "Shivaji Ganesan",
        "Aachi Manorama",
        "Nagesh",
        "V.K. Ramasamy",
        "Savitri"
    ],
    "genres": "Drama",
    "runtimes": "164",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "original air date": "03 Nov 1964 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTE4YjcyODktYjQ5Ny00MWIzLTg4MjgtZjI2ZjE1ZmViODM4XkEyXkFqcGdeQXVyMjA4OTI5NDQ@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0246805",
    "languages": "Tamil",
    "title": "Navarathri",
    "kind": "movie",
    "directors": "A.P. Nagarajan",
    "writers": "A.P. Nagarajan",
    "music department": [
        "L.R. Eswari",
        "Jamuna Rani",
        "T.M. Soundarajan",
        "P. Susheela"
    ],
    "akas": "Navarathri (India)",
    "writer": "A.P. Nagarajan",
    "director": "A.P. Nagarajan",
    "plot": "_Navarathri_ (qv) traces Nalina's (Savitri) experience of nine emotions on nine consecutive nights.",
    "synopsis": "The film opens with the narrator explaining that there are nine types of human behaviors (Navarasam) such as Wonder, Fear, Compassion, Anger, Equanimity, Disgust, Elegance, Bravery and Bliss and that Sivaji Ganesan's nine roles represents one character per role.Nalina (Savitri) is the only daughter of a rich man. When she happily celebrates Navaratri festival at her home with her friends her father informs about the visit of a groom and his parents for her wedding. Nalina is reluctant to the proposal as she wants to marry her college mate Anand. After arguments with her father, she leaves away from home without her father's knowledge at the first Navaratri night.First Night (Wonder): She searches for her lover in the college hostel but finds that he has gone to get married. Nalina felts cheated by Anand and attempts for suicide where she is stopped by a widower Arputharaj (Sivaji Ganesan). He takes her to his house and introduces her to his daughter. He urges her to tell her address to drop her safely. Unwilling to return home she leaves the place the next early morning.Second Night (Fear): The next day she damages the vegetables of a vendor. When vendor fights with her she was rescued by a homely looking woman. The woman takes Nalina to her home. Nalina meets several women in her house. But the house is actually a brothel house. She is trapped to a drunkard (Sivaji Ganesan). The drunkard justifies that he cannot seduce his own wife as she is a T.B patient. Though he does not want to betray his wife, he is not able to resist his feelings. Nalina advises and warns him in order to escape from him but he does not want to hear. After much struggle the drunkard falls into the floor and faints. Nalina escapes from the place.Third night (Compassion): After escaping from the brothel house, Nalina is caught by a patrol police for wandering into the road at unusual time. At police station she pretends to be a mentally ill woman. The police admits her at a mental hospital. The old aged lonely doctor Karunaagaran (Sivaji Ganesan) understands that Nalina is fine but pretends to escape from cops and so he helps her. She stays in the hospital the whole night. Doctor finds a newspaper with the photograph of hers the next morning. But Nalina escapes, while the doctor is still looking at the newspaper.Fourth Night (Anger): Nalina misunderstands the police jeep is coming for her. She dashes with a man with a gun (Sivaji Ganesan) and faints. The man takes her to his place. Nalina understands police is not looking for her but looking for the man as he is a killer who killed a rich businessman as a revenge for his brother's death. The gun man insists Nalina to leave. But she doesn't as she feels he is a good person and convinces him to surrender to police. In an attack the gunman is killed by the businessman's henchmen. Nalina escapes from the place.Fifth night (Equanimity): Fed up by the life Nalina runs into a track for attempting suicide. An innocent villager (Sivaji Ganesan), looks at her and rushes to the track to save her and succeeds. He takes to his house and introduces to his elder sister. A local priest (Nagesh) visits their home and tells that Nalina is possessed by a spirit in order to cheat for money by performing some fake rituals. Nalina gets irritated by their acts and escapes away that night.Sixth Night (Disgust): Nalina meets an old aged leper (Sivaji Ganesan), who once upon a time was a rich man. The man lost all his money in the treatment and charity (hoping that will help him from disease). He is disgusted by everyone including his own son who discarded him when his money ran out. Nalina helps him by taking him to a hospital. The doctor is surprised as he is one of the beneficiaries who was benefited with medicine degree by charity of the rich man. The doctor decides to stay with him until he is cured. Nalina leaves the hospital.Seventh Night (Elegance): Nalina feels very tired and asks for water from one of the houses. People offer water for her. One of the men \"Sathyavaan Singaaram\" (Sivaji Ganesan), is a director and actor of stage plays and road side plays. They have been committed for nine stage plays in the village on the account of Navaratri celebration. But the heroine falls sick and his whole troop are in critical position in search of a replacement for the seventh day play failing on which will make them to lose their money and reputation in the village. He asks Nalina to help by acting with him for the day's play. Nalina agrees on a condition that she should be let gone after the play is over. The play is successful that night. The agent tries to misbehave with Nalina and the actor pulls him from it and warns him. But finds Nalina has left.Eight Night (Bravery): Nalina disguises as a man and visits a house of a hunter Veerapan (Sivaji Ganesan). The hunter has been there for hunting a man-eater and for another purpose. Nalina introduces herself a Nathan a secret agent in search of a criminal. The hunter seems to believe her and gives a her an earnest welcome, feast and hospitality. Nalina finds that the hunter is actually a commissioner of police stayed in search of a criminal which actually faked by Nalina. She tries to escape from the place but she is caught by the hunter.The hunter introduces himself as the paternal uncle of the groom whom her father proposed for her and the groom is none other than her lover - Anand. Nalina has actually left her home before her father knew that she is in love with a person and the lover is the same man he has arranged for his daughter. Also Nalina misunderstands that Anand actually is going to marry another girl but the girl is actually herself. Nalina leaves for the Anand's place the ninth day.Ninth Day (Bliss): Anand (Sivaji Ganesan), looks pale and dull after Nalina left her home. He is neither interested to live usually nor to continue with his studies. His parents are worried and scolds him for wasting his life for a girl after all. Angered by this he shuts himself into a room. Nalina reaches his home that time. Anand's parents and Nalina fears that he is attempting suicide. But suddenly the room opens and Nalina runs inside.Anand actually wanted to surprise Nalina about their marriage and that is why he did not inform her about the engagement. Due to miscommunication Nalina left home on the first Navatri Night and comes back on ninth Navaratri night.Anand and Nalina happily marry. Except the dead gun man, her marriage is attended by the all the people she met during those eight days."
}