{
    "id": "0371735",
    "localized title": "Hungama",
    "cast": [
        "Akshaye Khanna",
        "Aftab Shivdasani",
        "Rimi Sen",
        "Paresh Rawal",
        "Shoma Anand",
        "Shakti Kapoor",
        "Rajpal Naurang Yadav",
        "Tiku Talsania",
        "Upasna Singh",
        "Sanjay Narvekar",
        "Amit Divatia",
        "Neena Kulkarni",
        "Manoj Joshi",
        "Jagadish",
        "Jyoti Joshi",
        "Amin Gazi",
        "Razak Khan",
        "Anu Ansari",
        "Jaydutt Vyas",
        "Sadhana Sargam",
        "Shaan",
        "Alka Yagnik"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "153",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Canada:G::(Quebec)",
        "India:U",
        "India:UA",
        "New Zealand:M",
        "United Kingdom:PG",
        "United States:Not Rated"
    ],
    "original air date": "01 Aug 2003 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTVjMWY5MGUtNjU2MS00NzgxLWJhZWUtM2VjMDE4YWRkOWFjXkEyXkFqcGdeQXVyODAzNzAwOTU@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0371735",
    "plot outline": "The story of a bunch of misfits whose misconception about each others backgrounds end up in a series of chaotic, yet comic outcomes. Aftab and Rimi play two strangers who have to pretend that are a married couple in order to get a place to live. Paresh Rawal plays a rich, yet ground to earth businessman whose business is named after his wife Anjali. Akshaye Khanna plays a young man starting a new business in electronic ware. Things get complicated when Rimi Sen goes to Paresh Rawal's house in search of a job & meets Akshaye Khanna who falls in love with her thinking she is Paresh Rawal's daughter. Paresh Rawal's wife thinks that he is having an affair with Rimi Sen & while Paresh Rawal thinks his wife is having an affair with Akshaye Khanna due to Rimi Sen and her having the same name. Then comes in Shakti Kapoor whose daughter falls in love with a guy pretending to be Paresh Rawal's son and soon everything gets out of control.",
    "languages": "Hindi",
    "title": "Hungama",
    "kind": "movie",
    "directors": "Priyadarshan",
    "writers": [
        "Priyadarshan",
        "",
        "Priyadarshan",
        "",
        "Neeraj Vora",
        "",
        "Jay Master"
    ],
    "producers": [
        "Pooja Galani",
        "Vijay Galani",
        "Ganesh Jain"
    ],
    "composers": [
        "Shravan Rathod",
        "Nadeem Saifi"
    ],
    "cinematographers": "S. Tirru",
    "editorial department": "Shakti Hasija",
    "art directors": "Sabu Cyril",
    "production managers": "Manivarma",
    "sound department": [
        "Naeem Shaikh",
        "Shamim Sharfuddin Shaikh"
    ],
    "visual effects": "Nitin Bhalla",
    "stunts": "Thyagarajan",
    "music department": [
        "Sunidhi Chauhan",
        "Udit Narayan",
        "Sonu Nigam",
        "Sameer",
        "Kumar Sanu",
        "Sadhana Sargam",
        "Shaan",
        "Richa Sharma",
        "Babul Supriyo",
        "Tabun Sutradhar",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Nabeel Abbas",
        "Raju Khan",
        "Alnoor Merchant",
        "Akash Patel",
        "Bharat S. Shah",
        "Devang Shah",
        "Mihir Shah",
        "Ramesh S. Sharma",
        "Pony Verma",
        "Jay Master"
    ],
    "akas": "Пустые хлопоты (Russia)",
    "writer": [
        "Priyadarshan",
        "Priyadarshan",
        "Neeraj Vora"
    ],
    "director": "Priyadarshan",
    "production companies": "Venus Worldwide Entertainment",
    "distributors": [
        "STAR India",
        "STAR India",
        "The Walt Disney company"
    ],
    "other companies": [
        "Epigram",
        "STAR India",
        "Venus Records & Tapes",
        "Websynergy"
    ],
    "plot": [
        "The story of a bunch of misfits whose misconception about each others backgrounds end up in a series of chaotic, yet comic outcomes.",
        "The story of a bunch of misfits whose misconception about each others backgrounds end up in a series of chaotic, yet comic outcomes. Aftab and Rimi play two strangers who have to pretend that are a married couple in order to get a place to live. Paresh Rawal plays a rich, yet ground to earth businessman whose business is named after his wife Anjali. Akshaye Khanna plays a young man starting a new business in electronic ware. Things get complicated when Rimi Sen goes to Paresh Rawal's house in search of a job & meets Akshaye Khanna who falls in love with her thinking she is Paresh Rawal's daughter. Paresh Rawal's wife thinks that he is having an affair with Rimi Sen & while Paresh Rawal thinks his wife is having an affair with Akshaye Khanna due to Rimi Sen and her having the same name. Then comes in Shakti Kapoor whose daughter falls in love with a guy pretending to be Paresh Rawal's son and soon everything gets out of control.::Neo, Wellington, NZ",
        "Inspector Waghmare has been assigned to investigate a case of a man who may be insane, and hence be a danger to himself and others. He meets with Anil (Sanjay Narula), and commences an investigation that will lead him to one Nandu (Aftab Shivdasani), son of a rich family, who has run from home to be near the girl, Anjali (Rima Sen) he loves; Jeetu (Akshaye Khanna) who is in love with Anjali and thinks she is the daughter of Radheyshyam Tiwari (Paresh Rawal); Popat Seth (Tiku Talsania) who is the landlord of Nandu, and finds out about the reward offered for his return home, and starts chasing Nandu all over the city on his bike; Gangster Tejabhai (Shakti Kapoor) who is out to protect the virtue of his daughter; Mrs. Tiwari (Shoma Anand) who thinks her husband may have an illegitimate child named Anjali; Chaos and hilarious scenes result.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Anjali (Rimi Sen) arrives in Mumbai looking for a job. Having run away from her village, she hopes to earn enough to pay off her family's debts to their landlord or risk marrying the landlord's son. With money running out, the only way she can find cheap lodging is by feigning marriage to a stranger, Nandu,(Aftab Shivdasani) an aspiring musician, an arrangement thought up by local milkman and fixer, Bholu (Amin Gazi). Anjali and Nandu initially don't get along but must make do to retain their low-rent accommodation.Meanwhile, Jeetu (Akshaye Khanna), an electronics salesman struggles to find a loan to start his own business. His wealthy and miserly father refuses to loan Jeetu money, instead encouraging him to steal. Jeetu discusses his situation with his friend Anil (Sanjay Narvekar) who tells him that the quickest way to wealth is marrying a rich man's daughter. He confides in Jeetu of his plan to marry the daughter of Kachara Seth (Shakti Kapoor), a rich businessman. To feign richness, he pretends to being Radheshyam Tiwari's son and conspires with Tiwari's servant Pandu to trick Kachara Seth into a quick engagement, hopeful that the father-in-law will be unable to do anything upon discovering the truth after marriage. He also nudges Jeetu to go ahead and steal. Following his advice, Jeetu ends up stealing from his parents' safe and opens his electronics store.Meanwhile, millionaire businessman Radheshyam Tiwari (Paresh Rawal), who lives in a village with his wife Anjali Tiwari (Shoma Anand) and retains the mannerisms of a villager despite his riches, decides to spend a few weeks in the city. With news of Tiwari's arrival, Pandu, fearful for his own employment, asks Anil to flee and make some excuse to Kachara Seth delaying the wedding.Anjali gets news of Tiwari's arrival from a friend and pays a visit to the villa hoping to land a job there. She meets Tiwari's wife who distrusts and rejects her. Desperate for a job, she decides to wait outside to meet Tiwari himself. At this point, Jeetu shows up at the villa to fix a stereo he sold to Tiwari. Seeing Anjali at the door, he mistakes her for Tiwari's daughter and instinctively starts wooing her.Unable to land a job at the Tiwari's, Anjali later bumps into Jeetu when she responds to a vacancy at his store. Already trying to woo Anjali for assuming her to be Tiwari's daughter, Jeetu hires her readily. Afraid of losing the job, Anjali continues the pretense. Every day after work, Jeetu drops Anjali off at the Tiwari villa believing she lives there with Anjali exiting the villa after Jeetu leaves. With Jeetu often showing up at Tiwari's villa asking for Anjali and Mrs. Tiwari spotting the real Anjali frequently outside the villa, the Tiwaris become convinced that each is having an affair with the younger counterparts. This results in several acrimonious arguments and much tantrum throwing between the elderly couple.Nandu, in the meantime, has begun to fall in love with Anjali. Nandu and Jeetu cross paths resulting in a very public verbal altercation between them. Meanwhile, Anjali receives a letter from home, informing her that the landlord's son Raja (Rajpal Yadav) is coming to visit her. Raja arrives the next day but is intercepted by Nandu at the train station, who teams up with Bholu to formulate a plan to scare the simpleton Raja away from the city before he can get in touch with Anjali.Agitated by Pandu and Anil absconding, Kachara Seth also makes several visits to the villa. Tiwari's attempts to explain to him that his only son is in London fall on deaf ears as Kachara's accusations create further rifts between Mr. & Mrs. Tiwari.Now Jeetu is after Tiwari for Anjali's hand in marriage, Tiwari is after Jeetu for his perceived dalliances with his wife, Kachara Seth is after Tiwari and his missing son Anil; and Nandu's landlord's wife has fallen for Nandu and is after him about eloping with her. All the major characters start chasing after each other and end up in a warehouse, where a big melee follows.In the end, Jeetu and Nandu confront Anjali and profess their love for her, forcing her to choose between them. Seemingly cornered, Anjali decides to write their names on paper chits, agreeing to marry the one whose name comes up. Jeetu picks out a chit, only to find Nandu's name on it, who then walks off with Anjali in tow. Left alone, Jeetu collapses to the floor, heartbroken and sitting amidst the remaining chits, opens another one, only to discover Nandu's name on that one too and then on all the other ones as well. He then realizes Anjali had fallen for Nandu along the way and she was never smitten to him to begin with."
}