{
    "id": "0414714",
    "localized title": "Girlfriend",
    "cast": [
        "Isha Koppikar",
        "Aashish Chaudhary",
        "Amrita Arora",
        "Sumit Nijhawan",
        "Shantanu Chappana",
        "Vineeta Malik",
        "Bhupinde Singh",
        "Sly Bhunjan",
        "Bhupindder Bhoopii",
        "Kiku Sharda",
        "Dolly Malhotra"
    ],
    "genres": "Drama",
    "runtimes": "126",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Germany:16",
        "India:A",
        "United States:Not Rated"
    ],
    "original air date": "17 Jun 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMTA5NzM4ODUxMzReQTJeQWpwZ15BbWU4MDc2ODc2MTUx._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "0414714",
    "plot outline": "'Girlfriend' is a story about two intimate friends Tanya (Isha Koppikar) and Sapna (Amrita Arora) who have always been together since they were in college. Now they live together and each one of them is fond of the other, to that extent that if one does something, the other follows. Sapna meets Rahul (Aashish Choudhary) when Tanya is out of town for some work. Sapna finds herself in a relationship with Rahul and by the time Tanya is back, Sapna has already fallen for Rahul and starts loving him. When Tanya learns of this relationship, she is jealous and reacts very adversely and in her jealousy and possessiveness comes out when she meets Rahul. Now Tanya goes all out to break Sapna's relationship with Rahul and her hidden agenda and desires come to light in the later part of the film.",
    "languages": "Hindi",
    "title": "Girlfriend",
    "kind": "movie",
    "directors": "Karan Razdan",
    "writers": "Karan Razdan",
    "producers": [
        "Firoz Bagban",
        "Pammi Baweja",
        "Bunty Juneja"
    ],
    "composers": "Daboo Malik",
    "cinematographers": "Choudrie Rajendra Prasad",
    "editors": "Sanjay Verma",
    "art directors": [
        "Kailash Sahu",
        "Ajay Verekar"
    ],
    "make up department": [
        "Shilpaben Prempuri Goswami",
        "Pompy Hans"
    ],
    "assistant directors": [
        "Sandeep Jain",
        "Mohan Singh Kang",
        "Dipk G.N. Nanglia",
        "Babloo Soni"
    ],
    "sound department": [
        "B.K. Chaturvedi",
        "Santosh Sahoo",
        "Subash Sahoo"
    ],
    "special effects": "Rajtaru",
    "visual effects": "Sarika Salian",
    "music department": [
        "Abhijeet",
        "Praveen Bhardwaj",
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Daboo Malik",
        "Sonu Nigam",
        "Sowmya Rao",
        "Vaishali Samant",
        "Kumar Sanu",
        "Shaan"
    ],
    "miscellaneous": [
        "Caesar Gonsalves",
        "Raju Karia",
        "Bosco Martis"
    ],
    "writer": "Karan Razdan",
    "director": "Karan Razdan",
    "production companies": "Baweja Movies",
    "distributors": [
        "Shemaroo Films",
        "Zee Networks"
    ],
    "other companies": "Glamsham.com",
    "plot": [
        "A man comes between two lesbian lovers, hence forming a triangle with bleak consequences.",
        "'_Girlfriend_ (qv)' is a story about two intimate friends Tanya (Isha Koppikar) and Sapna (Amrita Arora) who have always been together since they were in college. Now they live together and each one of them is fond of the other, to that extent that if one does something, the other follows. Sapna meets Rahul (Aashish Choudhary) when Tanya is out of town for some work. Sapna finds herself in a relationship with Rahul and by the time Tanya is back, Sapna has already fallen for Rahul and starts loving him. When Tanya learns of this relationship, she is jealous and reacts very adversely and in her jealousy and possessiveness comes out when she meets Rahul. Now Tanya goes all out to break Sapna's relationship with Rahul and her hidden agenda and desires come to light in the later part of the film.::gavin@sunny_deol2009@yahoo.com",
        "London-return shipping corporation business-man, Rahul Choudhory is in love at first sight with attractive Sapna, when Sapna gets to learn of this, she too is attracted to him. Rahul is soon introduced to Tanya; who is Sapna's best friend. After sometime Rahul became quite suspicious about Tanya that she maybe having an intimate relationship with Sapna under the pretext of friendship. Rahul then opens up an investigation where-by on one occasion he even gets Tanya to confess that she hated the male sex from an early age. On another occasion, Sapna confesses of physical intimacy with Tanya. With enough information to convince him that his girlfriend is involved with a transgender; Rahul attempts to put a stop to this by introducing Sapna to his mother thus talking her into marriage plans but when Tanya gets to learn of this she starts to show her true colors by openly confessing of her love for Sapna as well as scheming a devious plan to harm Rahul so that Sapna remains with her for a lifetime.::gavin (racktoo@hotmail.com)",
        "Tanya used to watch her father physically abuse her mother, leading to an early death. After this, she was the target, and when she got to be 18 years, she ran away from home. She hated men and all they stood for and learned kick-boxing and became an expert street-fighter, fighting equally for the money as well as physically injuring her male counterparts. Then she met Sapna and it was love at first sight. Things started to slowly improve for Tanya, and both her and Sapna settled in to a comfortable relationship for five years. But nothing lasts forever, and change came to their lives with the arrival of a London-based shipping company owner, Rahul Choudhary, who met with Sapna and both fell in love. Rahul even took Sapna for an introduction and approval of his mother. That settled, they planned for a marriage within three months. Tanya's world came crushing down, Sapna was her first love and she stood to lose everything. She then schemed a devious scheme that will not only separate Rahul and Sapna, but also ensure that Sapna never even thinks of leaving her again.::rAjOo (gunwanti@hotmail.com)"
    ]
}