{
    "id": "10122504",
    "localized title": "Rampaat",
    "cast": [
        "Kushal Badrike",
        "Abhinay Berde",
        "Priya Arun Berde",
        "Ankush Chaudhari",
        "Abhijeet Chavan",
        "Anand Ingle",
        "Amruta Khanvilkar",
        "Vaibhav Mangale",
        "Kashmira Pardeshi",
        "Sumeet Raghavan",
        "Prashant Tapasvi"
    ],
    "genres": "Comedy",
    "runtimes": "130",
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "17 May 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzg1MDQ4MGYtY2JlZi00YjIzLTkxZTEtMmI5ODE0MWE2NjM3XkEyXkFqcGdeQXVyMTAwMzMzNzQ3._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "10122504",
    "plot outline": "We all dream differently. But there are some dreams that are larger - than - life, that have no limits and yet we continue to chase those dreams regardless of it's relativity to the real life. One of such larger - than - life dreams that have mesmerized countless youngsters today is the dream of 'Stardom'!. And In this age where everything is instant and fleeting the youth today expect the same from their dreams. They want it right away, super-fast viz. Rampaat !! Mumbai being the 'city of dreams' the youth from various villages, cities, every nook, and cranny in India arrive in Mumbai to pursue this dream. But is that all it takes? Or does it require immense dedication, hard work and seeking the right direction to achieve this dream? This is what Rampaat portrays. With the dream of Instant stardom, earning quick money and making their parents proud - Mithun from Solapur and Munni from Kolhapur come to Mumbai and that's when the bittersweet struggle of their journey to achieving their dreams begin. This amusing journey teaches them to work harder and hustle for an 'All time hit' rather than a 'One-time hit ' Telling the youth their own story in an upbeat manner along with rhythmic music, the fast-moving story does justice to its title. Rampaat is the 70 mm projection of and for the young ambitious dreamers today.",
    "title": "Rampaat",
    "kind": "movie",
    "directors": "Ravi Jadhav",
    "writers": "Ravi Jadhav",
    "producers": [
        "Rohan Godambe",
        "Meghana Jadhav"
    ],
    "composers": "Chinar-Mahesh",
    "editors": [
        "Abhijit Deshpande",
        "Sourabh Prabhudesai"
    ],
    "assistant directors": [
        "Pradip Kore",
        "Prashant Shiroor"
    ],
    "sound department": [
        "Nageshwar Rao Choudhary",
        "Kunal Dhabade",
        "Nikhil Dhamapurkar",
        "Vitthal Gore",
        "Utsav Mistry",
        "Kartik Sharma V",
        "Sujit Shingare"
    ],
    "visual effects": "Abhay Thakur",
    "camera department": "RohitKarle",
    "music department": [
        "Nilesh Dahanukar",
        "Mangesh Kangane",
        "Adwait Walujkar"
    ],
    "miscellaneous": [
        "Vizual Junkies",
        "Shivkumar Parthasarathy",
        "Deepak Parulekar",
        "Calpesh Patil",
        "Abhishek Vaidya"
    ],
    "writer": "Ravi Jadhav",
    "director": "Ravi Jadhav",
    "plot": [
        "We all dream differently. But there are some dreams that are larger - than - life, that have no limits and yet we continue to chase those dreams regardless of it's relativity to the real life. One of such larger - than - life dreams that have mesmerized countless youngsters today is the dream of 'Stardom'!. And In this age where everything is instant and fleeting the youth today expect the same from their dreams. They want it right away, super-fast viz. _Rampaat_ (qv) !! Mumbai being the 'city of dreams' the youth from various villages, cities, every nook, and cranny in India arrive in Mumbai to pursue this dream. But is that all it takes? Or does it require immense dedication, hard work and seeking the right direction to achieve this dream? This is what _Rampaat_ (qv) portrays. With the dream of Instant stardom, earning quick money and making their parents proud - Mithun from Solapur and Munni from Kolhapur come to Mumbai and that's when the bittersweet struggle of their journey to achieving their dreams begin. This amusing journey teaches them to work harder and hustle for an 'All time hit' rather than a 'One-time hit ' Telling the youth their own story in an upbeat manner along with rhythmic music, the fast-moving story does justice to its title. _Rampaat_ (qv) is the 70 mm projection of and for the young ambitious dreamers today.",
        "Mithun son of a filmy mother and Munni a wrestler from Kolhapur are bitten by Filmi bug and decide to to Mumbai to pursue their dreams.They both feel that their very first audition will leave them to stardom.But it's not easy as they are feeling and get conned in city of dreams.They come across a photographer Fatafat who tries to help dejected actors who helps them pursue their dreams.::alex.mjacko@gmail.com",
        "A pregnant Kalubai is about to commit suicide when few women ask her to accompany them to watch films together which will reduce her stress and she becomes a Filmy women.Kalubai delivers a baby boy and names him Mithun after Mithun Chakraborty who grows up to be extreme talented in his village and favorite for every function.Vijaya is also bitten by bug of acting but her wrestler father Pandba wants to make her wrestler.Both travel to Mumbai to fulfill their dreams and are conned on their very first audition leaving them helpless.Until they meet Fatafat who arranges to give them small jobs of acting.Kalubai turns to Mumbai when she sees Mithun playing smaller roles while Pandba also reaches Mumbai to take back Vijaya as he hates the world of cinema.::alex.mjacko@gmail.com"
    ]
}