{
    "id": "10127302",
    "localized title": "Aatpadi Nights",
    "cast": [
        "Subodh Bhave",
        "Jatin Inamdar",
        "Yogesh Iratkar",
        "Chhaya Kadam",
        "Vitthal Kale",
        "Sanjay Kulkarni",
        "Pranav Raorane",
        "Sayali Sanjeev",
        "Aarti Wadagbalkar"
    ],
    "genres": "Comedy",
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "mr",
    "color info": "Color",
    "certificates": "India:UA::(self-applied)",
    "original air date": "27 Dec 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDAyMTRhYWMtNjBkOC00MmY0LWIzMTAtMGM0ZDQxN2FiNjc5XkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "10127302",
    "plot outline": "There is an important place for matrimonial in Indian society. After marriage, the first night of honeymoon is must there along with great excitement and nervousness too. 'Aatpadi Nights' tells us about the excitement, nervousness and the ignorance of the first night of marriage. Vasant Khatmode (Vashya) is the hero of the film who is also very excited but he has doubts as other grooms, due to lack of knowledge of the first night of the Honeymoon. He loves very much of his becoming wife and he is very excited and nervous for a honeymoon. Due to this phobia, he goes to his friends to clear the doubts about the first night. The friends give advice and the drama of the story is started here - senseless advice given by friends and the ignorance put Vashya into great trouble. Alimentally the first night of the honeymoon in his life goes bitterly horrible and terrible. After that night Vashya's life is changed and the private issue becomes public. This is what the spicy and the interesting story of 'Aatpadi Nights'.",
    "languages": "Marathi",
    "title": "Aatpadi Nights",
    "kind": "movie",
    "directors": "Nitin Supekar",
    "writers": "Nitin Supekar",
    "cinematographers": [
        "Nagaraj Diwakar",
        "Viru Patil"
    ],
    "editors": "Nilesh Navnath Gavand",
    "editorial department": [
        "Suresh Mahajan",
        "Vinod Raje"
    ],
    "art directors": "Sandeep Inamke",
    "costume designers": "Namdeo Waghmare",
    "make up department": [
        "Mahesh Barate",
        "Girish Shinde"
    ],
    "production managers": [
        "Ajay Bhat",
        "Vishnu Ghorpade",
        "Sachin Dubale Patil",
        "Qadri Rashidul"
    ],
    "sound department": [
        "Rashi Butte",
        "Sanket Dhotkar",
        "Ameya Ghatpande",
        "Tushar Pandit"
    ],
    "visual effects": [
        "Sarang Gangapurkar",
        "Vikram Kale"
    ],
    "camera department": [
        "Hussain Khwaja",
        "Ranjit Singh"
    ],
    "music department": [
        "Sidharth Dukthe",
        "Vijay Narayan Gavande"
    ],
    "miscellaneous": [
        "Abhijeet Kulkarni",
        "Mandar Shailesh Pimple",
        "Rahul Thombre"
    ],
    "writer": "Nitin Supekar",
    "director": "Nitin Supekar",
    "production companies": "Maaydesh Media",
    "plot": [
        "There is an important place for matrimonial in Indian society. After marriage, the first night of honeymoon is must there along with great excitement and nervousness too. '_Aatpadi Nights_ (qv)' tells us about the excitement, nervousness and the ignorance of the first night of marriage. Vasant Khatmode (Vashya) is the hero of the film who is also very excited but he has doubts as other grooms, due to lack of knowledge of the first night of the Honeymoon. He loves very much of his becoming wife and he is very excited and nervous for a honeymoon. Due to this phobia, he goes to his friends to clear the doubts about the first night. The friends give advice and the drama of the story is started here - senseless advice given by friends and the ignorance put Vashya into great trouble. Alimentally the first night of the honeymoon in his life goes bitterly horrible and terrible. After that night Vashya's life is changed and the private issue becomes public. This is what the spicy and the interesting story of '_Aatpadi Nights_ (qv)'.::Krishna Jannu",
        "Vashya is of marriageable age but is rejected by many girls.Haripriya agrees to marry him but Vashya is worried and nervous about his first night.As he belongs to a village which lacks knowledge related to sex education.He takes help from some of his friends on how to make his first night exciting.But the information given by friends goes haywire screwing his first night and making this issue a public issue from personal due to lack of sex education.::alex.mjacko@gmail.com"
    ]
}