{
    "id": "10257110",
    "localized title": "Manaroopa",
    "cast": [
        "Dileep Kumar",
        "Anusha Rao",
        "Nisha",
        "Aryan",
        "Shiva Prasad",
        "B. Suresh",
        "Amogh Siddarth",
        "Gaja Ninasam",
        "Prajwal Gowda",
        "Ramananand Ainakai",
        "Satish Golikoppa",
        "Manjunath Bangalore",
        "Sathya Bhat",
        "Kn Hegde",
        "Venki Hegde",
        "Yashodha Hosakatta",
        "Pawan Kalmane",
        "Bagirathi Kannadathi",
        "Gangadhara Kattinahakkalu"
    ],
    "genres": [
        "Adventure",
        "Crime",
        "Family",
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "124",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color::(HD)",
    "aspect ratio": "2.39 : 1",
    "certificates": "India:UA",
    "original air date": "22 Nov 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDY1YWI2M2EtZWQ0OS00ZDhiLTgwNzEtOGI3NTVkMjUwMGI1XkEyXkFqcGdeQXVyMTAxNzg4OTE3._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "10257110",
    "languages": "Kannada",
    "title": "Manaroopa",
    "kind": "movie",
    "directors": "Kiran Hegde",
    "writers": "Kiran Hegde",
    "producers": "Kiran Hegde",
    "composers": "Nagaraj Hulivan",
    "cinematographers": "Govinda Raj",
    "editors": [
        "Loki",
        "Suri"
    ],
    "visual effects": "Nagesh Basavaraju",
    "music department": "Saravana",
    "akas": "Reflection of Mind (Europe, English title)",
    "writer": "Kiran Hegde",
    "director": "Kiran Hegde",
    "production companies": "CMCR Movies",
    "distributors": "Truefix Studios",
    "plot": "A group of old college friends decide to plan a reunion after they have graduated. They hope for the get-together to be a time to reminisce about their past and celebrate their success but unexpected challenges are thrown their way.",
    "synopsis": "This movie showcases a planned get-together of five youngsters as friends after some time since they parted their ways post college graduation. They presumed that union to bring innumerable memories of their past after each of them are already settled in their respective professions. To celebrate such floodgates of memories as friends and to turn a reunion into a more exciting one, they lead to the dense forests of the Western Ghats. They are excited that such a unique get-together would unwind their kinds of pasts college friends. Their trip is aimed at many angles. They preferred going to KaradiGuhe (Bear cave) instead to share the old memories through juxtaposing friendship, love, pranks and even hatred besides discussing each other's future plans as well.The moment, all five friends begin their travel to join each other, they express a sheer nostalgia of the good old days they once enjoyed besides discussing some of their setbacks how they lost opportunities in life. They faced a typical situation of feeling amused of binding from old relationships yet certain remorse literally causing a few conflicts. Keeping the conflicts aside, all friends commit to strive to keep their excitement for this visit to KaradiGuheintact. During their travel to the daunting terrains and in their way, they face impromptu challenges which they didn't expect and neither any one of them were prepared for that. None of them have an iota of realization that their entire trip would be snooped without their knowledge.The panorama of events in a journey to KaradiGuhewhile encountering several challenges which they didn't expect earlier besides encountering Maskaphobiasto their firmness for tactful handling of such situations, the story is mind blowing filming of events. The thrill is maintained until the story escalates to its end.A jaw-dropping thriller, the story of this movie until all friends literally struggling to come out of KaradiGuhetrapping remains hypnotic. A plot of this story revolves on a one-day journey of a strange experience of all five friends. It keeps the audiences hooked as they too feel as if it is their own self-obsessions having a causal relation with the story of this movie."
}