{
    "id": "10515954",
    "localized title": "Olessia",
    "cast": [
        "Afzal Ali Kerala",
        "Bindu Aneesh",
        "Divya Das",
        "Anson Paul",
        "K.J. Yesudas"
    ],
    "genres": [
        "Drama",
        "Musical"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "original air date": "09 Aug 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2QyNTVlMjAtMDU1Zi00MWJlLTk2ZjUtNjg5OWRhN2NjODJmXkEyXkFqcGdeQXVyNjgxNDU4MTQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "10515954",
    "plot outline": "Olessia, an Anglican girl left over with a care taker in Kerala by their business parents settled in Germany. As time pass by, when they had a new born, the infant (Hash) of 2 months old is also left over with 8 years Olessia. Olessia has become the lonely care taker of Hash and relationship has build into even a motherly nature. Transaction Analysis explains three states of ego for any person. Child, Adult and Parental egos are three transactional states. When Olessia rears Hash, she has directly transformed from Child to Parental state without experiencing any Adult hood. This is a prime reason. Her situations leads Olessia into a chronic and acute depression. Even after the teenage, there is no difference in her life style. Finally, great tragedies and mishaps which comes before her including a strange person, bring back Olessia to her life. Even though he tries with his skills, it was ultimately the Almighty God has shown the right solution. The movie depicts various other incidents. But the core story is about the depression of Olessia. The ultimate solution is a Gods gift..",
    "languages": "Malayalam",
    "title": "Olessia",
    "kind": "movie",
    "directors": "Nazrudinsha",
    "writers": "Nazrudinsha",
    "producers": "Nazrudinsha",
    "composers": "Nazrudinsha",
    "cinematographers": [
        "Prasant C. Bose",
        "Rajesh Manassery"
    ],
    "editors": "Rizal Jainy",
    "art directors": "Dani Muziris",
    "costume designers": "Lekha Mohan",
    "make up department": "S. George",
    "production managers": "Hochimin K.C.",
    "assistant directors": "Sunoj Pottekad",
    "sound department": [
        "Sheffin Nayan",
        "Prashanth Sasidharan"
    ],
    "music department": [
        "K.S. Chithra",
        "Jyotsna Radhakrishnan",
        "G. Venugopal"
    ],
    "akas": "Olessia (India)",
    "writer": "Nazrudinsha",
    "director": "Nazrudinsha",
    "production companies": "Media Mation",
    "plot": [
        "A drama film directed by Nazrudinsha, _Olessia_ (qv) tells the story of an Anglican girl who has to cope with loneliness and depression after being neglected by her parents. The film features Anson Paul, Divya Das and Afsal Ali in central roles.",
        "_Olessia_ (qv), an Anglican girl left over with a care taker in Kerala by their business parents settled in Germany. As time pass by, when they had a new born, the infant (Hash) of 2 months old is also left over with 8 years _Olessia_ (qv). _Olessia_ (qv) has become the lonely care taker of Hash and relationship has build into even a motherly nature. Transaction Analysis explains three states of ego for any person. Child, Adult and Parental egos are three transactional states. When _Olessia_ (qv) rears Hash, she has directly transformed from Child to Parental state without experiencing any Adult hood. This is a prime reason. Her situations leads _Olessia_ (qv) into a chronic and acute depression. Even after the teenage, there is no difference in her life style. Finally, great tragedies and mishaps which comes before her including a strange person, bring back _Olessia_ (qv) to her life. Even though he tries with his skills, it was ultimately the Almighty God has shown the right solution. The movie depicts various other incidents. But the core story is about the depression of _Olessia_ (qv). The ultimate solution is a Gods gift..::casablanca film factory"
    ]
}