{
    "id": "10740846",
    "localized title": "Sivaranjani",
    "cast": [
        "Rashmi Gautam",
        "Nandu Vijay Krishna",
        "Nandini Rai",
        "Akhil Karthik",
        "Dhanraj",
        "Chakri",
        "Bhargav Chippada",
        "Srinivas Galabha",
        "Shrutika Gaokkar",
        "Shrutika Gowkar",
        "Richa Gulati",
        "Indra",
        "Roshan Katakam",
        "Raghu",
        "Rajendra",
        "Delhi Rajeshwari",
        "Karthika Singh Rajput",
        "Varalakshmi Reddy",
        "Shaking Seshu",
        "Divya Shree",
        "Priya Singh",
        "Nalla Subbarao",
        "Sunitha"
    ],
    "genres": "Horror",
    "runtimes": "116",
    "countries": "India",
    "country codes": "in",
    "language codes": "te",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "DTS",
    "certificates": "India:UA",
    "original air date": "02 Aug 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDQ4MmE2ZmMtMTIzMy00NzMxLWE5OWMtYzBjN2YzYTk2ZGRjXkEyXkFqcGdeQXVyMTAwNDA4NDky._V1_SY150_CR9,0,101,150_.jpg",
    "imdbID": "10740846",
    "plot outline": "Karthik (Nandu) is a Creative Director and Chairman of U and I advertising Agency. When he is coming back from work his car become break down in midnight due to less coolant. While searching for the water he found a girl (Rashmi Gautam) in water pond. Karthik joined her in Hospital. She gets cured but lost her memory. Since her memory loss she forgot her name, and then Karthik named her as Madhu. Frequently few unknown recollections are bothering her intense. Karthik took her to a place where his brother and sister-in-law stay along with him. Sivaranjani have been saved from Durga Bhai (Delhi Rajeswari) and Malhotra's (Rajendra) magical powers. Karthik and Madhu were in deep love and they tend to get marry soon. All of a sudden, a stranger name called Rishi came to Madhu and revealed that she is his wife and her name is Sivaranjani. In the mean time Madhu had a doubt on him. Madhu alias Sivaranjani fiercely shifted to Rishi's house with some evidences shown by Rishi. But still unknown recollections are influencing her to found some hidden facts. In that process she found wrist watch with blood stains in Rishi's car back side of the trunk. When she questioned Rishi, he told that \"you had an illegal affair with my partner kaushik (Indra) who came from US. You killed koushik because of his cheating attitude. When I have tried to save you, I took out his body and burnt him in the city outskirts.. May be during that time my watch might have fallen in that place\". Do you think.. Sivaranjani is a culprit? - Why unknown recollections are bothering her quite often?? What was the hidden truth???",
    "languages": "Telugu",
    "title": "Sivaranjani",
    "kind": "movie",
    "directors": "Naaga Prabhakkar",
    "writers": "Naaga Prabhakkar",
    "producers": [
        "Nalla Ayyanna Naidu",
        "Padmanabha Reddy"
    ],
    "cinematographers": "T. Surendra Reddy",
    "editors": "Devendra",
    "akas": "Sivaranjani (India)",
    "writer": "Naaga Prabhakkar",
    "director": "Naaga Prabhakkar",
    "production companies": "U&I Entertainments",
    "distributors": "iDream Media",
    "other companies": [
        "U&I Entertainments",
        "U&I Entertainments"
    ],
    "plot": "Karthik (Nandu) is a Creative Director and Chairman of U and I advertising Agency. When he is coming back from work his car become break down in midnight due to less coolant. While searching for the water he found a girl (Rashmi Gautam) in water pond. Karthik joined her in Hospital. She gets cured but lost her memory. Since her memory loss she forgot her name, and then Karthik named her as Madhu. Frequently few unknown recollections are bothering her intense. Karthik took her to a place where his brother and sister-in-law stay along with him. _Sivaranjani_ (qv) have been saved from Durga Bhai (Delhi Rajeswari) and Malhotra's (Rajendra) magical powers. Karthik and Madhu were in deep love and they tend to get marry soon. All of a sudden, a stranger name called Rishi came to Madhu and revealed that she is his wife and her name is _Sivaranjani_ (qv). In the mean time Madhu had a doubt on him. Madhu alias _Sivaranjani_ (qv) fiercely shifted to Rishi's house with some evidences shown by Rishi. But still unknown recollections are influencing her to found some hidden facts. In that process she found wrist watch with blood stains in Rishi's car back side of the trunk. When she questioned Rishi, he told that \"you had an illegal affair with my partner kaushik (Indra) who came from US. You killed koushik because of his cheating attitude. When I have tried to save you, I took out his body and burnt him in the city outskirts.. May be during that time my watch might have fallen in that place\". Do you think.. _Sivaranjani_ (qv) is a culprit? - Why unknown recollections are bothering her quite often?? What was the hidden truth???::V. Indira"
}