{
    "id": "10961232",
    "localized title": "Ranganayaki",
    "cast": [
        "Aditi Prabhudeva",
        "Suchendra Prasad",
        "Shivaram",
        "Lasya Nagaraj",
        "Srinivas",
        "Sundar Raj",
        "Trivikram",
        "Shruthi Nayak"
    ],
    "genres": [
        "Crime",
        "Drama"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "sound mix": "Dolby Digital::(Dolby 5.1)",
    "certificates": "India:UA",
    "original air date": "01 Nov 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjU3NzhlZjUtNjMyYy00ZTgyLTg2NzAtZGIxN2JhZjcyZjcwXkEyXkFqcGdeQXVyODk4NTI4NDA@._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "10961232",
    "plot outline": "Ranganayaki is a music teacher in a reputed Bengaluru school. Madhav, a colleague, is in love with her. His family, though orthodox, approves of their marriage. Another colleague Krishnamurthy is silently in love with her. One day, Ranganayaki is invited by four students staying in a flat opposite hers for a birthday party, where she is sedated and gang raped. The abuse results in collapse of her social support system. Now, who between Madhav and Krishnamurthy will support Ranganayaki? What will the people around her and the society at large do?",
    "languages": "Kannada",
    "title": "Ranganayaki",
    "kind": "movie",
    "directors": "Dayal Padmanabhan",
    "composers": "Manikanth Kadri",
    "cinematographers": "Rakesh B",
    "editors": "Suneil Kashyap",
    "editorial department": "Suneil Kashyap",
    "production managers": "Raju",
    "sound department": "Pradeep G.",
    "visual effects": [
        "Karthik Ananth",
        "Suraj Kiran"
    ],
    "music department": "Rahul Rajan",
    "director": "Dayal Padmanabhan",
    "production companies": "Yes Vee Entertainment",
    "plot": [
        "This story deals with a gang-rape victim who boldly handles the \"after effects\" of the incident in the social structure along with the other characters that surround her. All this, apart from pursuing the related legal case.",
        "_Ranganayaki_ (qv) is a music teacher in a reputed Bengaluru school. Madhav, a colleague, is in love with her. His family, though orthodox, approves of their marriage. Another colleague Krishnamurthy is silently in love with her. One day, _Ranganayaki_ (qv) is invited by four students staying in a flat opposite hers for a birthday party, where she is sedated and gang raped. The abuse results in collapse of her social support system. Now, who between Madhav and Krishnamurthy will support _Ranganayaki_ (qv)? What will the people around her and the society at large do?::Shrinivas G. Kulkarni"
    ]
}