{
    "id": "11091676",
    "localized title": "Siddhi Seere",
    "cast": [
        "Sudha Narasimharaju",
        "Mahalakshmi Urs",
        "Ravishankar Mirle",
        "Swarnachandra",
        "Krishna Nayak",
        "Keerthi",
        "Harshavardhan",
        "Lakshman Pujari",
        "Kavita Shetty",
        "Sukumar"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.39 : 1",
    "certificates": [
        "Canada:PG::(British Columbia)",
        "Canada:PG::(Ontario)"
    ],
    "original air date": "11 Oct 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNTcwNjFhMjAtMTRjYS00MmQ3LWE2MTUtMzBmM2JlOWExYTY1XkEyXkFqcGdeQXVyNzc4NzEwNTc@._V1_SY150_CR83,0,101,150_.jpg",
    "imdbID": "11091676",
    "plot outline": "An old widow named Siddhi, a deemed untouchable, realizes the need for a rich saree to robe her corpse when she dies, as she believes the only way her soul will make its way to Kailasa - the abode of Lord Shiva. In the process of earning one, she experiences a lot of troubles, gets opposed by her family and even the entire village.",
    "languages": "Kannada",
    "title": "Siddhi Seere",
    "kind": "movie",
    "directors": "Brahmanand Reddy",
    "writers": "Ravishankar Mirle",
    "producers": "Naveen Kumar",
    "cinematographers": "Jai Kriplani",
    "visual effects": "Jai Kriplani",
    "animation department": "Jai Kriplani",
    "music department": "Naveen Kumar",
    "akas": "Siddhi Seere (India)",
    "writer": "Ravishankar Mirle",
    "director": "Brahmanand Reddy",
    "production companies": "Kiss International",
    "plot": [
        "An old widow decides to steal a rich saree to adorn her corpse with when she dies as she believes that it's the only way her soul can get to Kailasa.",
        "An old widow named Siddhi, a deemed untouchable, realizes the need for a rich saree to robe her corpse when she dies, as she believes the only way her soul will make its way to Kailasa - the abode of Lord Shiva. In the process of earning one, she experiences a lot of troubles, gets opposed by her family and even the entire village."
    ],
    "synopsis": "A true story about Siddhi, a deemed UNTOUCHABLE; old aged widow, daughter of freedom fighter living in a small village Mirle in Karnataka state, India. She lives on begging alms after she was accidentally granted Deekshe (religious initiation) by village spiritual Guru thus making her \"Sharane\" - The Renounced ONE. While attending the funeral of another \"Sharane\", she realizes the need for a rich Saree to robe her body when she dies. She thinks only rich saree would pave the way easily to KAILASA - Abode of Lord Shiva. This poor innocent old woman starts her journey of earning it. In the process, she encounters a lot of troubles including differences with her family and the entire village.\nHer story about Saree spreads like a wildfire. The news even touches the government. Some news channels get interested in telecasting her interview.This story evokes forgotten human values and grabs attention towards extremely neglected rural populace. The film has been critically acclaimed by many Hollywood and Sandalwood celebrities. There are lots of specialties in this film. The director has used digital transformation makeup in order to make all the artists look like real villagers. Siddhi's house has been constructed. Many houses in the village actually sets. Many villagers seen in the background are real actors. Director Brahmanand Reddy wanted to portray a real flavor of rural India. The film is a sheer blend of art and commercial elements. As this is a true story, the hut where Siddhi resided has now been turned into a water treatment plant."
}