{
    "id": "11167286",
    "localized title": "Vattamesha Sammelanam",
    "cast": [
        "Vipin Atley",
        "Dominic Dom",
        "Gokulan",
        "Jude Anthany Joseph",
        "Sudhi Koppa",
        "Noby Marcose",
        "Mareena",
        "Saju Navodaya",
        "Major Ravi",
        "Jagadeesh Sankaran",
        "Sohan Seenulal"
    ],
    "genres": "Comedy",
    "runtimes": "136",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "India:UA::(CBFC)"
    ],
    "original air date": "25 Oct 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDM5ZTgwODUtYjgzOS00MWIxLWIwMDktN2E2YTI2NDQ3ZDNmXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "11167286",
    "plot outline": "It feels like that old psychological trick. Lower expectations by suggesting that something is the pits and then, people will feel that, 'hey, actually it is not bad in the least'. That conceit doesn't quite work with Vattamesha Sammelanam, an anthology of six shorts, surprisingly featuring some big names like filmmakers Jibu Jacob, Jude Anthany Joseph and Major Ravi, who makes a jibe on himself. While the slogan boldly suggests it is 'The Flop Film', the film ends (and don't worry about the spoiler alert) saying that actually it is a hit and much enjoyed by audiences. The film is about an underworld don from Mumbai named Jaggubhai Khurana Saheb (Shashi Kalinga) who is in Kerala to produce a flop film to write off his black money. Based on the advice of a famous astrologer, he sets out to produce an anthology of shorts, with the worst scripts, cast and crew. Humour based on stomach upset is funny in general, but it is also the last resort of a comedian. Atley uses the trope in two of the short films here, one that he directed and another that he wrote. And both of them were unfunny and devoid of any deeper meaning. Known for his meta humour, Atley uses a lot of movie references, mostly to dismal effect. And since the film is made by the Kochi fraternity, they also make snide remarks about southern districts in Kerala. The attempt to satirise Kannada and Telugu films misses the mark. The makers could have easily kept it under 120 minutes and spared the audience the torture-the supposed comical pursuit of Jaggubhai by Major Ravi playing a police officer.",
    "languages": "Malayalam",
    "title": "Vattamesha Sammelanam",
    "kind": "movie",
    "directors": "Vipin Atley",
    "writers": "Vipin Atley",
    "producers": "Baiju Amarendran",
    "composers": "Vipin Atley",
    "cinematographers": "Eugene Issac",
    "editors": "Rajesh Kodoth",
    "sound department": "Amal Antony",
    "writer": "Vipin Atley",
    "director": "Vipin Atley",
    "production companies": "MCC Cinema Company",
    "plot": [
        "It feels like that old psychological trick. Lower expectations by suggesting that something is the pits and then, people will feel that, 'hey, actually it is not bad in the least'. That conceit doesn't quite work with _Vattamesha Sammelanam_ (qv), an anthology of six shorts, surprisingly featuring some big names like filmmakers Jibu Jacob, Jude Anthany Joseph and Major Ravi, who makes a jibe on himself. While the slogan boldly suggests it is 'The Flop Film', the film ends (and don't worry about the spoiler alert) saying that actually it is a hit and much enjoyed by audiences. The film is about an underworld don from Mumbai named Jaggubhai Khurana Saheb (Shashi Kalinga) who is in Kerala to produce a flop film to write off his black money. Based on the advice of a famous astrologer, he sets out to produce an anthology of shorts, with the worst scripts, cast and crew. Humour based on stomach upset is funny in general, but it is also the last resort of a comedian. Atley uses the trope in two of the short films here, one that he directed and another that he wrote. And both of them were unfunny and devoid of any deeper meaning. Known for his meta humour, Atley uses a lot of movie references, mostly to dismal effect. And since the film is made by the Kochi fraternity, they also make snide remarks about southern districts in Kerala. The attempt to satirise Kannada and Telugu films misses the mark. The makers could have easily kept it under 120 minutes and spared the audience the torture-the supposed comical pursuit of Jaggubhai by Major Ravi playing a police officer.",
        "Six stories that are a satire on society. The anthology falls in the comedy entertainer genre and includes Saju Navodaya's debut directorial and Immanuel scriptwriter AC Vijeesh's film. Major Ravi, Jibu Jacob, Jude Anthany Joseph, Jismon, Noby, Mareena Michael, Sasi Kalinga and several other actors are part of the film, which is produced by Amarendran Baiju under the banner of MCC Cinema Company It feels like that old psychological trick. Lower expectations by suggesting that something is the pits and then, people will feel that, 'hey, actually it is not bad in the least'. That conceit doesn't quite work with _Vattamesha Sammelanam_ (qv), an anthology of six shorts, surprisingly featuring some big names like filmmakers Jibu Jacob, Jude Anthany Joseph and Major Ravi, who makes a jibe on himself. While the slogan boldly suggests it is 'The Flop Film', the film ends (and don't worry about the spoiler alert) saying that actually it is a hit and much enjoyed by audiences. The late American comedian Andy Kaufman is considered by many as a misunderstood genius. He stretched the limits to breaking points with his sketches and totally bonkers alter-egos. Atley's _Vattamesha Sammelanam_ (qv) takes the audience, especially his loyal fans, for granted. Honestly, it felt like an elaborate set up for a joke. And it begs the question of what they were smoking while making this one. It can be debated that this was an attempt at being hyper-meta but failing to entertain is a cardinal sin as far as film making is concerned. And I must say that Atley has certainly tarnished the goodwill he had earned over the years. It will take considerable effort from his part to rectify this seemingly deliberate attempt to make fools out of the audience."
    ]
}