{
    "id": "12188246",
    "localized title": "Sivasakthi",
    "cast": [
        "Sabitha Anand",
        "Poovilangu Mohan",
        "Shamitha Shreekumar",
        "Shanthy Anand",
        "Kannan",
        "Vija Krishnaraj",
        "Sandha",
        "Shreekumar",
        "Saakshi Siva",
        "Umamaheswari"
    ],
    "genres": "Drama",
    "runtimes": "22",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "imdbID": "12188246",
    "plot outline": "It is a story about Single mother Sivagami and daughter Shakthi had been leading a happy life, though not doing well financially, life had been smooth for them both. Sivagami had a secret hidden behind her and daughter Sakthi does not know about it. Sakthi had always longed to have a big family like her best friend Parimala (Umamaheswari). One day Sivagami falls sick and that is when Sivasakthi learns the truth. Truth about her father, and her other four siblings. Sakthi promise her mother to find her siblings and bring them back to her. On her search, she goes through lot of difficulties. Lost her love life and yet carried on with her search for her siblings.",
    "languages": "Tamil",
    "title": "Sivasakthi",
    "kind": "tv series",
    "series years": "2008-2009",
    "akas": "Sivasakthi (India)",
    "writer": "Pa. Raghavan",
    "production companies": "Home Media",
    "plot": "It is a story about Single mother Sivagami and daughter Shakthi had been leading a happy life, though not doing well financially, life had been smooth for them both. Sivagami had a secret hidden behind her and daughter Sakthi does not know about it. Sakthi had always longed to have a big family like her best friend Parimala (Umamaheswari). One day Sivagami falls sick and that is when _Sivasakthi_ (qv) learns the truth. Truth about her father, and her other four siblings. Sakthi promise her mother to find her siblings and bring them back to her. On her search, she goes through lot of difficulties. Lost her love life and yet carried on with her search for her siblings."
}