{
    "id": "12269484",
    "localized title": "Old Is Gold",
    "cast": [
        "Estovan Reizo Cheah",
        "Hanwei Chen",
        "Li Ping Chen",
        "Shucheng Chen",
        "Felicia Chin",
        "Marcus Chin",
        "Hou Ren Choo",
        "Rui En",
        "Edwin Goh",
        "Yinji Jin",
        "Sze-Kei Lee",
        "Wenhai Li",
        "Yinzhu Li",
        "Bonnie Loo",
        "Richard Low",
        "Chantalle Ng",
        "Desmond Ng",
        "Elvin Ng",
        "Ayden Sng",
        "Bin Xu"
    ],
    "genres": "Drama",
    "runtimes": "30",
    "countries": "Singapore",
    "country codes": "sg",
    "language codes": "zh",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDA5ZWZiMTAtZjUwMC00MThlLWJhZWQtOTU0M2VkZjM0MGQyXkEyXkFqcGdeQXVyMTE0OTAwNjA1._V1_SY150_CR24,0,101,150_.jpg",
    "imdbID": "12269484",
    "plot outline": "Centenarian Home is a nursing home and elderly day care centre managed by Aunty Shan (Sze-Kei Lee). The residents come from all walks of life, each with their own stories to tell. What secrets does the model resident of the nursing home hide? Why is a cheeky grandfather with many grandchildren staying in the nursing home? What does a long lost son hope to gain from a father suffering from dementia? Why does an old architect with a seemingly good life keep telling lies? When Aunty Shan was diagnosed with a terminal illness, she decides to pass the management of her beloved nursing home to a newly recruited nurse Xin Xin (Rui En). Without much experience coupled with her own set of personal problems, can Xin Xin rise to the occasion and hold the fort until Aunty Shan is back?",
    "languages": "Chinese",
    "title": "Old Is Gold",
    "kind": "tv series",
    "series years": "2019-2019",
    "akas": [
        "老友万岁 (Singapore, Mandarin title)",
        "老友万岁 (China, Mandarin title)",
        "老友万岁 (Malaysia, Mandarin title)",
        "老友萬歲 (Taiwan)"
    ],
    "writer": [
        "Wee Ming Lee",
        "Choon Guan Seah",
        "Choon Guan Seah"
    ],
    "production companies": "MediaCorp",
    "distributors": "MediaCorp",
    "plot": "Centenarian Home is a nursing home and elderly day care centre managed by Aunty Shan ('Sze-Kei Lee' (qv)). The residents come from all walks of life, each with their own stories to tell. What secrets does the model resident of the nursing home hide? Why is a cheeky grandfather with many grandchildren staying in the nursing home? What does a long lost son hope to gain from a father suffering from dementia? Why does an old architect with a seemingly good life keep telling lies? When Aunty Shan was diagnosed with a terminal illness, she decides to pass the management of her beloved nursing home to a newly recruited nurse Xin Xin ('Rui En' (qv)). Without much experience coupled with her own set of personal problems, can Xin Xin rise to the occasion and hold the fort until Aunty Shan is back?"
}