{
    "id": "12363246",
    "localized title": "Majjige Huli",
    "cast": [
        "Ramesh Bhat",
        "Venkatesh Dixit",
        "Suchendra Prasad",
        "Manasa Radhakrishnan",
        "Roopika"
    ],
    "genres": "Comedy",
    "runtimes": "123",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "original air date": "07 Jun 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYjkxYmU2MDYtYjM2OC00MjQ5LWE3MGYtODE5ZGEzNzQ0Njc3XkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SY150_CR62,0,101,150_.jpg",
    "imdbID": "12363246",
    "plot outline": "Majjige Huli is mostly shot in a bedroom of a posh hotel in Goa and revolves around the newly-wedded couple, Karthik and Vaishali. They wait to begin their first night at a particular time ascribed by the boy's grandmother. The couple, who are trying to settle themselves, are often disturbed by visitors - the room service boy, a drunkard, an Ayurvedic doctor, and a team of enthusiastic filmmakers. Whether the husband and wife get to consummate their marriage on their first intimate meeting or not, is shown through a series of situations, that ends in an absurd climax.",
    "languages": "Kannada",
    "title": "Majjige Huli",
    "kind": "movie",
    "directors": [
        "Ravindra Kotaki",
        "Srinivas Kumar"
    ],
    "writers": "Ravindra Kotaki",
    "producers": [
        "Narsimh Murthy",
        "Shyam Sindhanuru"
    ],
    "composers": "Sanjeev Rao",
    "cinematographers": [
        "Narsimh Murthy",
        "Shyam Sindhanuru"
    ],
    "editors": "Sanjeev Reddy",
    "akas": "Majjige Huli (India)",
    "writer": "Ravindra Kotaki",
    "director": [
        "Ravindra Kotaki",
        "Srinivas Kumar"
    ],
    "plot": [
        "the importance of the first night after marriage for a couple.",
        "_Majjige Huli_ (qv) is mostly shot in a bedroom of a posh hotel in Goa and revolves around the newly-wedded couple, Karthik and Vaishali. They wait to begin their first night at a particular time ascribed by the boy's grandmother. The couple, who are trying to settle themselves, are often disturbed by visitors - the room service boy, a drunkard, an Ayurvedic doctor, and a team of enthusiastic filmmakers. Whether the husband and wife get to consummate their marriage on their first intimate meeting or not, is shown through a series of situations, that ends in an absurd climax.::Shrinivas G. Kulkarni"
    ]
}