{
    "id": "12587414",
    "localized title": "Gowdru Cycle",
    "cast": [
        "Mata Koppala",
        "Bimbashri Neenasam",
        "Shasikanth"
    ],
    "genres": "Comedy",
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:UA",
    "original air date": "05 Apr 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2M4ODhmNDYtYmI2NS00MjllLTliYzQtYjdlYmY5OGU4Y2ZhXkEyXkFqcGdeQXVyNjkwOTg4MTA@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "12587414",
    "plot outline": "Gowdru Cycle is set in a tiny village, where the village head, Kempegowda, has a strong bond with a vintage bicycle, on which he travels to sort out differences among villagers. His love for the cycle is so much that Kempegowda doesn't tolerate anyone making a derogatory comment about it. Kempegowda suffers heart attack after his bicycle is stolen. This becomes the talk of the village. Krishna, Kempegowda's son, leaves no stone unturned to trace the cycle. When Kempegowda's family members gets to know the heritage value of the cycle, they start demanding their pound of flesh from the prize money the cycle gets at a heritage exhibition. A cycle race is held to resolve the issue.",
    "languages": "Kannada",
    "title": "Gowdru Cycle",
    "kind": "movie",
    "directors": "Prashanth K. Yallampalli",
    "writers": [
        "Prashanth K. Yallampalli",
        "",
        "Prashanth K. Yallampalli"
    ],
    "producers": "Savitha Rajesh Chowta",
    "composers": "Sai Sarvesh",
    "cinematographers": [
        "Poornachandra Baikadi",
        "Ravi Kishore"
    ],
    "akas": "Gowdru Cycle (India)",
    "writer": [
        "Prashanth K. Yallampalli",
        "Prashanth K. Yallampalli"
    ],
    "director": "Prashanth K. Yallampalli",
    "production companies": "Adyar M3 International Films",
    "plot": [
        "When a village head's beloved bicycle is stolen, it triggers a series of events that snowball out of control.",
        "_Gowdru Cycle_ (qv) is set in a tiny village, where the village head, Kempegowda, has a strong bond with a vintage bicycle, on which he travels to sort out differences among villagers. His love for the cycle is so much that Kempegowda doesn't tolerate anyone making a derogatory comment about it. Kempegowda suffers heart attack after his bicycle is stolen. This becomes the talk of the village. Krishna, Kempegowda's son, leaves no stone unturned to trace the cycle. When Kempegowda's family members gets to know the heritage value of the cycle, they start demanding their pound of flesh from the prize money the cycle gets at a heritage exhibition. A cycle race is held to resolve the issue.::Vinay Lokesh"
    ]
}