{
    "id": "14773358",
    "localized title": "Udgharsha",
    "cast": [
        "Shraddha Das",
        "Dhansika",
        "Kishore Kumar G.",
        "Tanya Hope",
        "Vamsi Krishna",
        "Harshika Poonacha",
        "Kabir Duhan Singh",
        "Thakur Anoop Singh"
    ],
    "genres": "Drama",
    "runtimes": "130",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "original air date": "22 Mar 2019 (India)",
    "imdbID": "14773358",
    "plot outline": "Rashmi pays the price for capturing an incident on her mobile phone at a resort, where she had gone along with her boyfriend, Aditya. A gang leader Dharmendra, tries to kill her and destroy the evidence. Rashmi hides herself in a car, which then happens to travel to Madikeri. Aditya, in order to follow her has no option but to take the help of a passerby, Karishma, ends up in the woods and a cat-and-mouse game begins. In parallel, Vijay Menon and his secretary Krithika vent on vacation. Dharmendra assigns Krithika to kill Vijay, and she commits the murder. But to Dharmendra's shock, Vijay is alive, which is known towards the end. What becomes of Rashmi and Aditya, and who is the person murdered by Krithika, forms the crux of Udgharsha.",
    "languages": "Kannada",
    "title": "Udgharsha",
    "kind": "movie",
    "directors": "Sunil Kumar Desai",
    "writers": "Sunil Kumar Desai",
    "producers": "Devaraj .D.",
    "composers": "Sanjoy Chowdhury",
    "akas": "Udgharsha (India)",
    "writer": "Sunil Kumar Desai",
    "director": "Sunil Kumar Desai",
    "production companies": "D Creations",
    "plot": "Rashmi pays the price for capturing an incident on her mobile phone at a resort, where she had gone along with her boyfriend, Aditya. A gang leader Dharmendra, tries to kill her and destroy the evidence. Rashmi hides herself in a car, which then happens to travel to Madikeri. Aditya, in order to follow her has no option but to take the help of a passerby, Karishma, ends up in the woods and a cat-and-mouse game begins. In parallel, Vijay Menon and his secretary Krithika vent on vacation. Dharmendra assigns Krithika to kill Vijay, and she commits the murder. But to Dharmendra's shock, Vijay is alive, which is known towards the end. What becomes of Rashmi and Aditya, and who is the person murdered by Krithika, forms the crux of _Udgharsha_ (qv)."
}