{
    "id": "4835940",
    "localized title": "Face 2 Face",
    "cast": [
        "Daniela Bobadilla",
        "Daniel Amerman",
        "Kevin McCorkle",
        "Emily Jordan",
        "Mary Gordon Murray",
        "Karrie Cox",
        "Nicholas James Reilly",
        "Enspirit",
        "Sheldon A. Smith",
        "Michael Soulema",
        "Chelsea Alden",
        "Matthew Amerman",
        "Oscar Camacho",
        "Lindsay Elston",
        "Jonathan Jennings",
        "Gino Lee",
        "Hayley McLaughlin",
        "Thomas McNamara",
        "Sam Meader",
        "Anthony Robles",
        "Russell Stout"
    ],
    "genres": "Drama",
    "runtimes": "88",
    "countries": "United States",
    "country codes": "us",
    "language codes": "en",
    "color info": "Color",
    "certificates": "United States:TV-MA",
    "original air date": "2016 (USA)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODU4OWM1NmItM2RmZS00MWM5LWI1ZjEtOTA2YzFlMjYzNTk2XkEyXkFqcGdeQXVyMjMwNjY1MDA@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "4835940",
    "plot outline": "Having rekindled their childhood friendship, Teel and Madison begin sharing their lives over the internet as a means of coping with the typical problems of adolescent life. Though they are on opposite ends of the popularity spectrum, Madison, the A-list party girl, takes pity on Teel, the social outcast, vowing to help him win friends on social media. As their relationship deepens, Madison falls for Teel, forcing him to confess the hidden cause of the bullying he faces at school. His admission sets off a sequence of events that ultimately motivates Madison to expose her own devastating secret in a disturbing cry for help. This digital coming of age story examines some of the most pressing and pernicious social issues facing the world's teenagers today - and all of it viewed through the brutally honest lens of an online video chat.",
    "languages": "English",
    "title": "Face 2 Face",
    "kind": "movie",
    "directors": "Matthew Toronto",
    "writers": [
        "Aaron Toronto",
        "",
        "Matthew Toronto"
    ],
    "producers": [
        "Joseph Barone",
        "Ian Michaels",
        "Michael Soulema",
        "Aaron Toronto",
        "Jordan Toronto",
        "Matthew Toronto"
    ],
    "cinematographers": "Kristoffer Carrillo",
    "editors": "Justine Gendron",
    "editorial department": "Bryan Smaller",
    "production designers": "Susannah Lowber",
    "costume designers": "Meghan Anderson",
    "make up department": "Laura Salinas",
    "assistant directors": [
        "Elliott Barker",
        "Ethan Redman"
    ],
    "sound department": [
        "Kevin Coons",
        "Maui Holcomb",
        "Anthony Kozlowski"
    ],
    "camera department": [
        "Ely Gonzalez",
        "Harrison Hudson",
        "Kokoro Lee",
        "Joanna Nguyen",
        "Jonathan Wang"
    ],
    "costume departmen": [
        "Christy Barnes",
        "Rebecca Carr"
    ],
    "music department": "Andrea von Foerster",
    "miscellaneous": [
        "Tiffany Boyle",
        "Katherine Imp"
    ],
    "akas": "Лицом к лицу (Russia)",
    "writer": [
        "Aaron Toronto",
        "Matthew Toronto"
    ],
    "director": "Matthew Toronto",
    "production companies": "Green Step Productions",
    "distributors": "Screen Media Films",
    "other companies": [
        "ABS Payroll & Production Accounting Services",
        "Ramo Law",
        "The Clearance Lab"
    ],
    "plot": [
        "Over a series of video chats, a teenage outcast reaches out to his childhood friend, but finds that behind the veneer of popularity and a seemingly perfect life, she hides a disturbing secret.",
        "Having rekindled their childhood friendship, Teel and Madison begin sharing their lives over the internet as a means of coping with the typical problems of adolescent life. Though they are on opposite ends of the popularity spectrum, Madison, the A-list party girl, takes pity on Teel, the social outcast, vowing to help him win friends on social media. As their relationship deepens, Madison falls for Teel, forcing him to confess the hidden cause of the bullying he faces at school. His admission sets off a sequence of events that ultimately motivates Madison to expose her own devastating secret in a disturbing cry for help. This digital coming of age story examines some of the most pressing and pernicious social issues facing the world's teenagers today - and all of it viewed through the brutally honest lens of an online video chat.::Annoymous"
    ],
    "synopsis": "Teel is a comic book nerd who lives in Michigan. While his real name is Terrence, he does not like to be called that. As a child, he put on a cape and called himself the Man of Teel. At the start of the movie, Teel is in his room alone on his computer and he has located his former neighbor Madison, who he used to play with. She lives in California now with her widowed father, a high school principal.. After sending several text messages to Madison, Teel finally gets a response.Madison calls Teel and they can see each other. Up until now the audience has seen only what is on Teel's computer screen. Eventually some of what the audience sees is video with audio sent to Teel from whatever device Madison is using, or whatever video with audio Madison can see from Teel. But most of the movie is only video with audio that is sent from on person to the other, or when they are not connected, Teel's computer screen is shown. Sometimes there is a split screen so the audience can see what each person is seeing.Madison is excited to reunite with her old friend and wants to socialize, but she is disappointed to learn that on a Saturday night, Teel is staying home. Teel claims to have friends but they can't do anything with him on this night. Madison goes with her friend Sophie to a party and Madison \"brings\" Teel along and introduces him to some of her friends. Later, Madison calls in the middle of the night saying she ended up in the pool and even though she broke curfew, her father goes to sleep so early he'll never know.When Teel's mom comes in his room she says the doctor told him about making stuff up but he shows her Madison is really there and that she is real. Also, Teel has been shown several times with a bottle of pills.Madison ends up grounded but she has her computer, if not her phone. Her father thinks she is doing homework. Madison begins working to help Teel make friends. For example, he's not on Facebook. She helps him gets started there and becomes his first friend. After time has passed, Teel still has no Facebook friends that he knows in real life, but Sonny is a possibility. He sits behind Teel in biology and they have been accused of cheating. Sonny is a jock and quite good looking, as Madison learns when she sees him for the first time when Sonny comes over and Teel answers the door carrying his phone.Teel is no athlete but his parents, mainly his mother, want him to participate in sports. He would rather act in plays and he has auditioned, or tried to. He missed one audition to visit his grandmother but she could no longer drive and his family got her car, so when it is time for Teel to drive, that is what he will drive. Teel says the only thing he can do in sports is wear a terrible mascot costume.Madison has helped Teel, so now Teel will help Madison. She seemed insecure when he didn't say her beach photos made her look hot. More than once, though she is beautiful, Madison indicates she does not believe she is. But the truth is she wears too much makeup and Teel only saw her without makeup after she had been in the pool at the party. Teel's mom has appeared on screen several times and she seems nice. Teel says she is a hairdresser and does makeup and he has learned things from her. He teaches Madison how to look good with less makeup and she reluctantly agrees.One day Teel has been beat up and claims he fell. Madison has her own problems but is very concerned about Teel. She explains that her father is retiring and it is her job to plan the retirement party, and also to bake a cake because no one likes the cakes baked by the person who actually does it. At some point Madison reveals that she has taken the place of her late mother, and it is eventually revealed this means more than just cooking and cleaning.There is an assembly where Madison's father speaks and a duo sings. Madison likes Cole and wants to go out with him. When he invites her out, she doesn't realize it's a party with a lot of people, and she later learns Cole likes Sophie and they have been together.Teel auditions for Romeo in \"Romeo and Juliet\" and practices with Madison. She things he is quite good.Teel finally explains why he not attracted to Madison but only considers her a friend. She was hurt before that he didn't comment on how hot she was. Teel believes he is gay. Madison tries to get him to come out to others but he is unwilling. She even tries to get him to start a gay-straight alliance that can help him and people like him, but he is unwilling. Actually, Madison is not the first to know. ,Teel reveals that he and Sonny kissed that one time when Sonny came over. And Teel finally shows a video from his phone from when he was beat up, by Sonny's friends who suspected they knew what he wanted.There is video of the retirement party on Facebook where Madison comments on her wish that one person could be there who isn't. But Teel and Madison \"break up\" when Madison sends him a link that she believes will lead to his getting help. Although Teel could have just deleted it, he believes all his Facebook friends will see it and know, though it doesn't prove anything.Madison and Teel get back together later. Madison previously admitted she wasn't a virgin and now she is ready to reveal the painful story of her first time. But she doesn't say the words. She says he is with her all the time. Then she goes to bed, leaving her camera on so he can watch, and she pleads with him to continue watching. The audience sees her father come in the bedroom and Madison pulls the covers down. Then the audience only sees Teel's shocked reaction. He calls the police.Madison is not pleased at what Teel did and explains that when the cops showed up, they managed to convince the cops nothing bad was happening.On another occasion Teel confesses that he was ready to commit suicide and that he almost took a bottle of pills when she called after the party.Now it is time for Teel to save Madison. He gets in his grandmother's car and drives to California. He shows up at Madison's house and sneaks into her room. There is a confrontation but everything turns out all right and the two go back to communicating online."
}