{
    "id": "6999026",
    "localized title": "Rajlokhi O Srikanto",
    "cast": [
        "Ritwick Chakraborty",
        "Rahul Banerjee",
        "Aparajita Ghosh Das",
        "Jyotika Jyoti",
        "Soham Maitra",
        "Sayan Ghosh",
        "Sayan Ghosh",
        "Gargi Maji"
    ],
    "genres": "Drama",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "sound mix": "Dolby",
    "certificates": "India:UA",
    "original air date": "2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODJkNzQ1ZWEtMDM1Mi00YjJlLTk0ZGQtOWFmZWUwMWQ2ZDNiXkEyXkFqcGdeQXVyMjkxNjUyMzQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "6999026",
    "plot outline": "This film is partially inspired by the first volume of renowned Bengali author Sarat Chandra Chattapadhyay's seminal novel Srikanto. On an idyllic retreat sponsored by an influential friend, Srikanto, the drifter-protagonist, comes across the beautiful Rajlokhi, his friend's mistress. The chance encounter suddenly jettisons them into a past they had both long left behind as well as memories of people they had long forgotten. He is a man who has battled complex psychological issues after being subject to a traumatic incident as a child; she is a woman who has been betrayed by and exploited repeatedly by men like her father and her husband. Faced with mortal peril and impossible odds, the two are forced to make choices with potentially life-altering consequences. Part love story, part character study of protagonists who wish to break free of the expectations of society, Rajlokhi O Srikanto is a searing study of how ideas of love, masculinity and violence have always been incredibly entangled across generations.",
    "languages": "Bangla",
    "title": "Rajlokhi O Srikanto",
    "kind": "movie",
    "directors": "Pradipta Bhattacharyya",
    "writers": [
        "Pradipta Bhattacharyya",
        "",
        "Saratchandra Chatterjee"
    ],
    "producers": "Sujoy Nag",
    "cinematographers": "Subhadeep Dey",
    "editors": "Pradipta Bhattacharyya",
    "editorial department": "Banamali Sarkar",
    "music department": [
        "Timir Biswas",
        "Anirban Das"
    ],
    "writer": [
        "Pradipta Bhattacharyya",
        "Saratchandra Chatterjee"
    ],
    "director": "Pradipta Bhattacharyya",
    "production companies": "Reelistic",
    "distributors": "SVF Entertainment",
    "plot": "This film is partially inspired by the first volume of renowned Bengali author Sarat Chandra Chattapadhyay's seminal novel Srikanto. On an idyllic retreat sponsored by an influential friend, Srikanto, the drifter-protagonist, comes across the beautiful Rajlokhi, his friend's mistress. The chance encounter suddenly jettisons them into a past they had both long left behind as well as memories of people they had long forgotten. He is a man who has battled complex psychological issues after being subject to a traumatic incident as a child; she is a woman who has been betrayed by and exploited repeatedly by men like her father and her husband. Faced with mortal peril and impossible odds, the two are forced to make choices with potentially life-altering consequences. Part love story, part character study of protagonists who wish to break free of the expectations of society, _Rajlokhi O Srikanto_ (qv) is a searing study of how ideas of love, masculinity and violence have always been incredibly entangled across generations.::Sujoy Nag"
}