{
    "id": "7822474",
    "localized title": "Suvarna Sundari",
    "cast": [
        "Shamna Kasim",
        "Sakshi Chaudhary",
        "Jaya Prada",
        "Avinash",
        "Indra",
        "Sai Kumar",
        "Ram Maddukuri",
        "Nagineedu",
        "Sathya Prakash",
        "Raam",
        "Kota Srinivasa Rao"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "te",
        "kn"
    ],
    "color info": "Color",
    "certificates": "India:UA",
    "original air date": "31 May 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWVmOWRmMWMtMDc2OC00NGM2LTllOTAtMmY5NjVhM2YzYjVlXkEyXkFqcGdeQXVyOTc2MTgwNjY@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "7822474",
    "plot outline": "The movie revolves around an idol, Suvarna Sundari and the effects of it. The idol, also known as Trinetri, dates back to 15th century. Whoever possesses the idol, becomes a victim of destruction because of the history the idol has. On the other hand, a gang desperately seeks the idol as it can fetch them a lot of money in the international market. They also believe that possessing the idol brings people good luck. An archaeologist, played by Jaya Prada, knows the history of Suvarna Sundari and vows to prevent the damage it causes to people. Meanwhile, a couple - Anjali and Ram - visit a company to strike a deal, but they get stuck in a lift along with five different people. What follows next is a series of deaths, that adds to the mystery. Will the archaeologist succeed in her mission?",
    "languages": [
        "Telugu",
        "Kannada"
    ],
    "title": "Suvarna Sundari",
    "kind": "movie",
    "directors": "Msn Surya",
    "writers": "Msn Surya",
    "producers": "M.l.Lakshmi",
    "composers": "Sai Karthik",
    "cinematographers": "Eshwar Yellumahanthi",
    "editors": "Prawin Pudi",
    "visual effects": "Rajeshsai Athmuri",
    "akas": "Золотая красавица (Russia)",
    "writer": "Msn Surya",
    "director": "Msn Surya",
    "production companies": "S Team Pictures",
    "plot": [
        "An ancient idol causes mysterious events to unfold upon various characters who come in its vicinity. Can the damages it cause be prevented? Will it be smuggled out for a huge price? What is the history of the idol?",
        "The movie revolves around an idol, _Suvarna Sundari_ (qv) and the effects of it. The idol, also known as Trinetri, dates back to 15th century. Whoever possesses the idol, becomes a victim of destruction because of the history the idol has. On the other hand, a gang desperately seeks the idol as it can fetch them a lot of money in the international market. They also believe that possessing the idol brings people good luck. An archaeologist, played by Jaya Prada, knows the history of _Suvarna Sundari_ (qv) and vows to prevent the damage it causes to people. Meanwhile, a couple - Anjali and Ram - visit a company to strike a deal, but they get stuck in a lift along with five different people. What follows next is a series of deaths, that adds to the mystery. Will the archaeologist succeed in her mission?::Vinay Lokesh"
    ]
}