{
    "id": "8396492",
    "localized title": "The Great Indian Road Movie",
    "cast": [
        "Vijay Anand",
        "Anila",
        "Master Ashray",
        "Madhupal",
        "Prem Manoj",
        "Sunil Sukhada"
    ],
    "genres": [
        "Adventure",
        "Drama",
        "Family"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "ml",
        "hi",
        "ta",
        "pa",
        "as"
    ],
    "color info": "Color",
    "aspect ratio": "16 : 9",
    "sound mix": "D-Cinema 96kHz 5.1",
    "certificates": "India:U::(CBFC)",
    "original air date": "10 May 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDRjNjljOWEtOWRiZC00ZjZmLWFmYTAtOWY5Mzk3MmEyZjY5XkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "8396492",
    "plot outline": "On the Life Road 'The Great Indian Road Movie'was visualized by travelling over fifteen thousand kilometres across seventeen states of India. This is the story of a nine year old blind boy who lives in the state of Kerala, his desire to see and to know the truth about his life. The boy's father with the help of some well-wishers arranges for a cornea transplantation surgery which brings life back to his eyes. Upon regaining vision the boy develops a wish, a wish to travel and explore the whole of India. The boy's father, though financially weak, sets upon this mammoth journey to fulfil his child dream. On this soul searching journey the boy is exposed to a kaleidoscope of people, cultures, languages, lifestyle and food. On another plane this pan Indian journey is the quest of the boy to unravel the truth, the truth about self. At the end of this karmic journey through Vedic lands the boy realizes the truth.",
    "languages": [
        "Malayalam",
        "Hindi",
        "Tamil",
        "Punjabi",
        "Assamese"
    ],
    "title": "The Great Indian Road Movie",
    "kind": "movie",
    "directors": "Sohan Lal India",
    "writers": [
        "Sohan Lal India",
        "",
        "Sohan Lal India",
        "",
        "Sohan Lal"
    ],
    "producers": "Abhilash S. Pillai",
    "composers": "Sreevalsan J. Menon",
    "cinematographers": [
        "Harish Babu",
        "Ratheesh Mangalath"
    ],
    "editors": "Harihara Puthran",
    "editorial department": "M. Mahadevan",
    "costume designers": "Indrans Jayan",
    "production managers": "Vijay G.S.",
    "assistant directors": "Samraj",
    "sound department": "Vinod Sivaram",
    "visual effects": "Chintha Raj",
    "music department": [
        "Rafeeq Ahammed",
        "Amal Antony",
        "Rabindranath Tagore"
    ],
    "miscellaneous": [
        "Vazhoor Jose",
        "Rajesh Keshav",
        "Jissen Paul",
        "Raju Ranganath",
        "R. Vijayan"
    ],
    "akas": "The Great Indian Road Movie (India)",
    "writer": [
        "Sohan Lal India",
        "Sohan Lal India",
        "Sohan Lal"
    ],
    "director": "Sohan Lal India",
    "production companies": "Olive International",
    "other companies": "KSFDC",
    "plot": [
        "On regaining his vision after a cornea transplant, a nine-year-old boy embarks on a journey to explore India along with his father.",
        "On the Life Road '_The Great Indian Road Movie_ (qv)'was visualized by travelling over fifteen thousand kilometres across seventeen states of India. This is the story of a nine year old blind boy who lives in the state of Kerala, his desire to see and to know the truth about his life. The boy's father with the help of some well-wishers arranges for a cornea transplantation surgery which brings life back to his eyes. Upon regaining vision the boy develops a wish, a wish to travel and explore the whole of India. The boy's father, though financially weak, sets upon this mammoth journey to fulfil his child dream. On this soul searching journey the boy is exposed to a kaleidoscope of people, cultures, languages, lifestyle and food. On another plane this pan Indian journey is the quest of the boy to unravel the truth, the truth about self. At the end of this karmic journey through Vedic lands the boy realizes the truth.::Sohan Lal"
    ]
}