{
    "id": "8426772",
    "localized title": "Anukta",
    "cast": [
        "Karthik Attavr",
        "Sangeetha Bhat",
        "Sinchana Gowda",
        "Anu Prabhakar",
        "Sampath Raj",
        "Sidlingu Sridhar"
    ],
    "genres": "Thriller",
    "runtimes": "135",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Animatophone::(Western Electric Recording)",
    "certificates": "India:UA",
    "original air date": "07 Jun 2018 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZGE1OWY4MDUtMDIxNC00MmJlLTkxNjktNTUyMjg4YmU1N2IyXkEyXkFqcGdeQXVyODgwNzg0Mzk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8426772",
    "plot outline": "Anukta which revolve around a crime investigation of a murder mystery set up in coastal region of Karnataka . With perspective narration in the screenplay movie keeps audience guessing about the big surprises involved in the multiple layers of the plot. Daivakola a devine culture of tulunadu plays an interesting part. With a proper blend of psychological aspects of human emotions in the form of dreams and crime investigation of an intelligent COP behind a murder mystery Anukta will be a new experience to watch.",
    "languages": "Kannada",
    "title": "Anukta",
    "kind": "movie",
    "directors": "Ashwath Samuel",
    "composers": "Nobin Paul",
    "cinematographers": "Manohar Joshi",
    "editorial department": "Tom C. Jose",
    "sound department": [
        "Raju Albert",
        "Arun S. Mani",
        "Babychen Paul",
        "P.C. Vishnu"
    ],
    "akas": "Anukta (India)",
    "director": "Ashwath Samuel",
    "production companies": "Deyi Production",
    "plot": [
        "With a proper blend of psychological aspects of human emotions in the form of dreams and crime investigation of an intelligent COP behind a murder mystery _Anukta_ (qv) will be a new experience to watch.",
        "_Anukta_ (qv) which revolve around a crime investigation of a murder mystery set up in coastal region of Karnataka . With perspective narration in the screenplay movie keeps audience guessing about the big surprises involved in the multiple layers of the plot. Daivakola a devine culture of tulunadu plays an interesting part. With a proper blend of psychological aspects of human emotions in the form of dreams and crime investigation of an intelligent COP behind a murder mystery _Anukta_ (qv) will be a new experience to watch.",
        "The film begins with the murder of a political leader, which is blamed on Guttinamane, a house that the locals believe is haunted with the spirit of the landlord's wife. Special officer Karthik is assigned to investigate the case of the suspicious murder, during which he discovers a shocking truth. When he is asked to leave for further investigations, he leaves behind his wife, Tanvi. Strange things begin to happen after Tanvi receives a courier.::Sunayana Suresh"
    ]
}