{
    "id": "8427252",
    "localized title": "Kolkatay Kohinoor",
    "cast": [
        "Sabyasachi Chakrabarty",
        "Barun Chanda",
        "Soumitra Chatterjee",
        "Indrani Dutta",
        "Mona Dutta",
        "Debdut Ghosh",
        "Ankita Majumdar",
        "Anup Pan"
    ],
    "genres": "Drama",
    "runtimes": "129",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "15 Mar 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BN2U3NmJlYmMtNDZlNS00YzhkLTlkYWEtNzU2M2EwMWZmMDFiXkEyXkFqcGdeQXVyODY2OTc4NTY@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8427252",
    "languages": "Bangla",
    "title": "Kolkatay Kohinoor",
    "kind": "movie",
    "directors": "Santanu Ghosh",
    "costume designers": "Sanchari Chowdhury",
    "sound department": [
        "Shishir Sarkar",
        "Rohit Sengupta"
    ],
    "director": "Santanu Ghosh",
    "production companies": "Angur Bala Films",
    "synopsis": "History unfolds many truths. The more we dig in, the more we come to know about the realities of the past. But sometimes, some truths remain hidden and unventured. It is our wisdom and sixth sense with which we discover those hidden truths. The history of Kohinoor is one such example. Is the Kohinoor we know truly the Babur's stone? The hard facts of past strongly raises this question. What if the original Babur's stone is in our city of joy?Dr Sayan who happens to be a Freemason ( Member of one of world's oldest secret society) is assigned to hand over two gifts, a box of wisdom and box of wealth to young Avantika on her 18th birthday. The historical crevice in the form of treasures are left behind by the Late renowned archaeologist Prof Tapash Sarker for his granddaughter to unearth as he had very less confidence on his own daughter Anamika who was more fond of building a career in films than carrying forward his father's legacy. Boarding a train on his way back, Dr.Sayan happens to meet his co-passenger Anindya. The journey turns out to be horrendous and dreaded as Sayan goes missing and Anindya gets drugged. Just then, Satyaki Basu, Anindya's historian uncle gets involved in the matter and tries to trace the motive behind the conspiracy. The mishap brings the Sarkar family closer with Anamika and her cousin cum secretary Madhu paying more attention to Avantika after a decade. With his sharp instincts, Satyaki manages to decode the messages of Prof.Sarkar which leads to the indication of a precious diamond being left behind by the Prof. for his granddaughter. His quest for truth and above par intellect indicates him of the possibility of the diamond being \"The Kohinoor \". With the hunger of a historian and tenacity to see the end, he seeks help of one of his brightest student Arnab, popularly known as \"The Kohinoor specialist\" Arnab digs the gem's travel and peels back layers of history to bring forward the controversies associated with the diamond. With the support of Aninda, Satyaki finally locates Sayan after a spine chilling mission, pins down the mastermind behind the crime and eventually discovers the truth that Prof. Sarkar has left behind.Is the truth \" The Kohinoor\" that Satyaki is anticipating? Or is something different but equally precious waiting for him? The nail-biting end reveals an ultimate hidden truth, a lost wisdom, perhaps a true light on our ancient past. It is indeed a light, Mountain of light."
}