{
    "id": "8947660",
    "localized title": "Goyenda Tatar",
    "cast": [
        "Debapriya Basu",
        "Joybrata Das",
        "Rajatabha Dutta",
        "Adhiraj Ganguly",
        "Swarnava Goswami",
        "Deep Mitra",
        "Monu Mukherjee",
        "Santilal Mukherjee",
        "Rupayan Pal",
        "Sridatri Sarkar"
    ],
    "genres": "Adventure",
    "runtimes": "92",
    "countries": "India",
    "country codes": "in",
    "language codes": "bn",
    "color info": "Color",
    "certificates": "India:U",
    "original air date": "04 Jan 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDllNWZhNTAtZWYwNi00MmRmLWI5YmEtMzJkYjcwMWZiNTkxXkEyXkFqcGdeQXVyODc0ODEwODk@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "8947660",
    "languages": "Bangla",
    "title": "Goyenda Tatar",
    "kind": "movie",
    "directors": "Srikanta Galui",
    "writers": "Sashthi Pada Chattapaddhyay",
    "producers": [
        "Anshuman Pandey",
        "Binod Kumar Pandey",
        "Usha Pandey"
    ],
    "composers": "Monsur Rahaman",
    "cinematographers": "Ratan Mandal",
    "akas": "Goyenda Tatar (India)",
    "writer": "Sashthi Pada Chattapaddhyay",
    "director": "Srikanta Galui",
    "production companies": [
        "G V Tech Solutions",
        "G V Tech Solutions"
    ],
    "plot": "A bunch of adventurous kids and detective Tatar are dragged into a mysterious kidnapping case. They are helped by an ex-dacoit, Suleiman, in solving the case.",
    "synopsis": "The Bengali feature film 'Goyenda Tatar' has been extracted from the story 'Chotur Goyenda Choturabhijan', written by Sashthipada Chattapadhyay, the famous writer of 'Pandob Goyenda'.\nAnirban Mukherjee, better known as Tatar by his nick name, is a smart, lively, couregious boy of 13years old. He goes beyond the traditional concept of being a doctor or engineer, rather he wants to be a successful detective. Thus he is attracted by magazines and others external books instead of text books. His naughty younger sister Tinku is no less than Tatar. She likes to assist her brother when ever some mystery takes place. Jayanta Mukherjee and Nanda Devi leve peacefully with their two children at Mukherjee colony of Murshidabad district.\nOne day in a fine afternoon a strong showman named Soleman cames to entertain people with Dogger(Dog), Malini(Monkey), Sonai, his daughter, in a field, just few yards away from Tatar's house. Soleman starts beating the dhol in a beautiful rhyme of which Sonai starts showing rope balancing following the rhyme. Like other villagers Tatar too cames to enjoy the game with close friends Jonti, Babai, Piku. Suddenly a stranger enters into the house of Upen Babu. Tatar watches it and by applying an innovative strategy Tatar catches the notorious Chhottu. Soleman too joins them. Chhottu is a well-known enemy of Soleman. So finding an opportunity Chhottu hits hard on Soleman's head and he is cought red handed by the people present there. They handover Chhottu to the police. On the next day news paper covers the story of Tatar and group's brarery. Their joy knows no bound.\nBut in between these an unnatural happening takes place. Sonku is kidnapped. Every body blames Tatar for this. Finding no means Tatar approach Sentu Da, a couregious, helpful youth of the village. Once he was an antisocial. But now he gets engaged in performing drama. Sentu Da promise to help Tatar. Sonai gives Tatar a strong clue regarding all these. Tatar starts his vigorous journey with this clue. Debu, Jonti, Babai,Sonai,Tinku, Dogger, Malini, Sentu Da join Tatar.\nIt is story of friendship, it is story to fight together, a story of victory......."
}