{
    "id": "9109906",
    "localized title": "Mahira",
    "cast": [
        "Chaitra Achar",
        "Gopalkrishna Deshpande",
        "Mahesh Gowda",
        "Balaji Manohar",
        "Dileep Raj",
        "Virginia Rodrigues",
        "Raj B. Shetty"
    ],
    "genres": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "runtimes": "129",
    "countries": "India",
    "country codes": "in",
    "language codes": "kn",
    "color info": "Color",
    "aspect ratio": "2.39 : 1",
    "certificates": [
        "India:UA",
        "United Kingdom:15"
    ],
    "original air date": "26 Jul 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNGE0MWY3ZDgtYTJjYS00MWQwLWJhYTEtNDAxYzU1Zjk1Y2I1XkEyXkFqcGdeQXVyOTE5MzY4MDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "9109906",
    "plot outline": "Maya and Adya, a mother-daughter duo, live a happy existence in a coastal Karnataka town, running their beach cafe. Though, this idyllic life is disrupted when both police and some criminals set out in the hunt of Maya. What is Maya's real identity? Why are these people after her?",
    "languages": "Kannada",
    "title": "Mahira",
    "kind": "movie",
    "directors": "Mahesh Gowda",
    "writers": "Mahesh Gowda",
    "producers": [
        "Mahesh Gowda",
        "Vivek Kodappa"
    ],
    "composers": "Nilima Rao",
    "cinematographers": "Keertan Poojary",
    "production designers": "Mahesh Gowda",
    "sound department": [
        "Sankaran A.S.",
        "Hari Haran",
        "Tony Joy",
        "Sandeep Kumar",
        "Aravind Menon",
        "K.C. Sidharthan",
        "Sachin Sudhakaran",
        "Vajjiravel Varun"
    ],
    "stunts": "Chethan Dsouza",
    "writer": "Mahesh Gowda",
    "director": "Mahesh Gowda",
    "production companies": "The JackFruit Productions",
    "plot": [
        "A women with a mysterious past goes to extreme lengths to protect her daughter from the assassins who are after them.",
        "Maya and Adya, a mother-daughter duo, live a happy existence in a coastal Karnataka town, running their beach cafe. Though, this idyllic life is disrupted when both police and some criminals set out in the hunt of Maya. What is Maya's real identity? Why are these people after her?"
    ],
    "synopsis": "SYNOPSIS\nIt's the story of a mother and daughter who are on the run from a group of assassins. The reason is known only to the mother and situation is not in favor to explain anything to her daughter. As the film progresses, hitherto unseen qualities and expert survival skills of the mother in protecting herself and her daughter will surprise the audience and the daughter alike. Why is the daughter being targeted.? Who is this mother.? what's her actual identity and why are these assassins hired to kill them and by who? This is what keeps the audience on the edge of their seat.\nA investigating officer who is in charge to investigate the case uncovers a few hidden truths of the daughter, mother and her past, which brings a new thrilling twist to the story. Further, a rather intelligent unseen man who plays the death game with the mother and daughters life becomes their destiny, who must be destroyed in order to survive. Will the mother and daughter succeed in surviving and living? Will the investigating officer be able to do his duty and investigate the case?\nIt's a story strong on facts, emotions, relationships, suspense and a sense of duty and takes a different turn at every stage of the film. It is a story packed with unique action sequences, powerful, intense, and thrilling scenes.\nIt is definitely a kind of cinema where people from all category can watch and enjoy. It is a never said before style of story telling and never shown before kind of female character. Film promises to entertain people with many factors like, songs, lyrics, simplicity in dialogue and action being the key elements"
}