{
    "id": "9664420",
    "localized title": "Nalla Vishesham",
    "cast": [
        "Biju Sopanam",
        "Indrans",
        "Sreeji Gopinathan",
        "Anisha Seena",
        "Aparna Nair",
        "Dinesh Panicker",
        "Chempil Asokan",
        "Kalabhavan Narayanan Kutty",
        "Thirumala Ramachandran"
    ],
    "genres": "Drama",
    "runtimes": "102",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:U",
        "India:UA::(CBFC)"
    ],
    "original air date": "25 Jan 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BODk4YjYyOWYtY2JlMS00YTcxLWFjYzYtYWFhYmNmNDQ3NjNkXkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "9664420",
    "plot outline": "'Water is the Basis of Life' - based on this fact, Nalla Vishesham revolves around the lives of people on the banks of river Njavaroorkadavu. With the help of Ajayan, businessman Divakara Panicker is building up wealth by exploiting the natural resources of the village area and are polluting the river by irresponsible farming using harmful chemicals and pesticides. The villagers decide to fight against these people and start protesting against any misuse in the name of development especially when it was risking the river water and immediate environment. Meanwhile, a college group visits the village to study on the environmental aspects. Things take a turn when a mishap happens and the story goes through an emotional turmoil. The question is whether Panicker and Ajayan realize the bad effects of their deeds and change. And whether the villagers will win in protecting their natural environment which is core to their living.",
    "languages": "Malayalam",
    "title": "Nalla Vishesham",
    "kind": "movie",
    "directors": "Ajithan",
    "writers": [
        "Ajithan",
        "",
        "Vinod Viswan",
        "",
        "Vinod Viswan"
    ],
    "producers": "Sreeji Gopinathan",
    "composers": [
        "Sooraj s Nair",
        "Sujith Nair",
        "Prince Rex"
    ],
    "cinematographers": "Noorudheen Bava",
    "editors": "Sujith Sahadev",
    "costume designers": "Aji Mulamoottil",
    "make up department": "Mahesh Cherthala",
    "production managers": "Shyam Saras",
    "assistant directors": [
        "Maneesh Bhargavan",
        "Praveen Vijay"
    ],
    "camera department": "Shalu Peyad",
    "music department": [
        "Najim Arshad",
        "Amrita Jayakumar",
        "Anoop Kammaran",
        "Murukan Kattakkada",
        "Usha Menon"
    ],
    "miscellaneous": [
        "Sajeesh M.",
        "Ajay Thundathil"
    ],
    "akas": "Nalla Visesham (India, Malayalam title)",
    "writer": [
        "Ajithan",
        "Vinod Viswan",
        "Vinod Viswan"
    ],
    "director": "Ajithan",
    "production companies": "Pravasi FIlms",
    "distributors": "Pravasi FIlms",
    "plot": "'Water is the Basis of Life' - based on this fact, _Nalla Vishesham_ (qv) revolves around the lives of people on the banks of river Njavaroorkadavu. With the help of Ajayan, businessman Divakara Panicker is building up wealth by exploiting the natural resources of the village area and are polluting the river by irresponsible farming using harmful chemicals and pesticides. The villagers decide to fight against these people and start protesting against any misuse in the name of development especially when it was risking the river water and immediate environment. Meanwhile, a college group visits the village to study on the environmental aspects. Things take a turn when a mishap happens and the story goes through an emotional turmoil. The question is whether Panicker and Ajayan realize the bad effects of their deeds and change. And whether the villagers will win in protecting their natural environment which is core to their living.::Sreeji Gopinathan"
}