{
    "id": "9795174",
    "localized title": "Chennai Palani Mars",
    "cast": [
        "Praveen Raja",
        "Rajesh Giriprasad",
        "Vasant Marimuthu",
        "A. Ravikumar",
        "Madhan Kumar Dhakshinamoorthy",
        "Pari Elavazhagan",
        "R. Krishnamoorthy",
        "Imthiyas Mohammed",
        "Vin Haadri",
        "Allwin Ramaiah"
    ],
    "genres": [
        "Adventure",
        "Comedy",
        "Drama",
        "Fantasy"
    ],
    "runtimes": "120",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "certificates": "India:U",
    "original air date": "26 Jul 2019 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZjFkM2U2NjctNGI3My00MmU2LTlhZDAtNmI0NzEwMGZhNGJkXkEyXkFqcGdeQXVyMTEzNDUwNzg@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "9795174",
    "plot outline": "An astrophysics student and an eccentric singer hatch an outlandish plan to travel to Mars. But all visionaries must face impediments before accomplishing their dreams; in this case, the duo will have to deal with brain-dead cops, Dons with trust issues and suicidal IT employees before pulling off the impossible.",
    "languages": "Tamil",
    "title": "Chennai Palani Mars",
    "kind": "movie",
    "directors": "Biju Viswanath",
    "writers": [
        "Vijay Sethupathi",
        "",
        "Biju Viswanath"
    ],
    "producers": [
        "Christopher Annino",
        "Vijay Sethupathi",
        "Biju Viswanath"
    ],
    "composers": "Niranjan Babu",
    "editors": "Biju Viswanath",
    "editorial department": [
        "Gopal Balaji",
        "Adithya Krishnan"
    ],
    "sound department": "Francis",
    "visual effects": "Vishnu Puliyara",
    "music department": "Vignesh Jeyapal",
    "writer": [
        "Vijay Sethupathi",
        "Biju Viswanath"
    ],
    "director": "Biju Viswanath",
    "production companies": [
        "Orange Mittai Productions",
        "Vijay Sethupathi Productions"
    ],
    "plot": [
        "An aspiring scientist and a musician, both peculiar by nature, set out on an ambitiouscf trip to Mars.",
        "An astrophysics student and an eccentric singer hatch an outlandish plan to travel to Mars. But all visionaries must face impediments before accomplishing their dreams; in this case, the duo will have to deal with brain-dead cops, Dons with trust issues and suicidal IT employees before pulling off the impossible.::laura andrews",
        "An astrophysics student and an eccentric singer meet each other at a de-addiction center where they conceive a crazy plan to travel to mars. On their way to achieve this mission the brilliant minds must encounter shady cops, paranoid crime lords and the suicidal IT technicians.::Santhosh"
    ],
    "synopsis": "Akash an astrophysics student and his scientist Dad believes that, one can travel anywhere in this universe using power of thoughts.\nFor past 20 years his father has been trying to travel to Mars using power of thoughts but in vain.\nThings takes a different turn when Aakash becomes prime suspect for the murder of his own friend.\nWhile stuck in a deaddiction centre, Akash befriends Aandava Perumal, an eccentric singer.\nHe is the only person who believes in the concept of travelling to mars, using power of thoughts .They escape from the de addiction centre and travel toward Palani .\nThe holy hill Palani ,according Aakash is the best take off point to Mars ;\nbecause that holy place has the maximum impact of planet mars on earth.The two policeman who handle the murder investigation are after them. The constable Velu is unhappy with his superior Thiruppa.\nHe had tried different schemes to get rid of his superior; but for some weird twist of fate, nothing happens to Thiruppa.\nAlong the journey to nab Aakash, Velu makes it a point that Thiruppa's mind gets screwed up,\nso that thiruppa is unable to differentiate between illusion and reality.\nVelu the constable uses \"gaslighting\" a form of psychological manipulation to achieve his aim.Aakash and his singer friend continues the journey unaware of all this.\nAll visionaries must face impediments before accomplishing their dreams;\nin this case, the duo will have to deal with brain-dead cops, Dons with trust issues and a suicidal IT employee.\nHow far will you travel to achieve your dream ,is the question which the duo has to find the answer."
}