{
    "id": "10840884",
    "localized title": "Taish",
    "cast": [
        "Harshvardhan Rane",
        "Jim Sarbh",
        "Pulkit Samrat",
        "Kriti Kharbanda",
        "Sanjeeda Sheikh",
        "Saloni Batra",
        "Zoa Morani",
        "Abhimanyu Singh",
        "Saurabh Sachdeva",
        "Viraf Patel",
        "Ankur Rathee",
        "Armaan Khera",
        "Kunika Sadanand",
        "Mahabir Bhullar",
        "Ikhlaque Khan",
        "Monisha Hassen",
        "Suresh",
        "Mohanjit Kaur Basra",
        "Ekansh Kumar",
        "Melissa Raju Thomas",
        "Sid Ghai",
        "Shivanshu Pandey",
        "Hiten Patel",
        "Colin Murtagh",
        "Vinita Sharma",
        "Jatinder Rehal",
        "Bikramjit Gurm",
        "John Aubrey",
        "Arjun Chudasama",
        "Faheem Hussain",
        "Bharat Jha",
        "Lucy Lewendon",
        "Ramzan Miah",
        "Sisi Miller",
        "Shreya Navile",
        "Natasha Singh",
        "Chris Wilson"
    ],
    "genres": [
        "Action",
        "Thriller"
    ],
    "runtimes": "143",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "pa"
    ],
    "color info": "Color",
    "certificates": "India:A",
    "original air date": "29 Oct 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzQ2NjcyMmItYzBjMy00ZGRhLTliYmYtMGYyYjEzNWIyNTI4XkEyXkFqcGdeQXVyMTIzMzg0MTM2._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "10840884",
    "plot outline": "Rohan and Sunny are best friends from their childhood days. Sunny goes to attend Rohan's younger brother's weeklong wedding in a scenic country estate in UK. The boys look at this as an opportunity to catch up and let loose - unabashed and fun revelry dotting the weeklong affair. Somewhere else in the dark grimy corners of South Hall London, a violent criminal family of moneylenders is headed by Kuljinder with his two brothers Pali and Jassi. Pali has been planning to quit the family business and start life afresh with Kuljnder's wife Jahaan with whom he has been having an affair. But fate has other plans for him. Both these world collides when Kuljinder comes to attend the wedding in the country side. A past secret connected to Rohan and Kuljinder sparks an incident of violence which then kick starts a chain of violence changing all their lives drastically. Taish is a story of friendship and loss of innocence narrated in the format of intense thriller.",
    "languages": [
        "Hindi",
        "Punjabi"
    ],
    "title": "Taish",
    "kind": "movie",
    "directors": "Bejoy Nambiar",
    "writers": [
        "Bejoy Nambiar",
        "",
        "Anjali Nair",
        "Kartik R. Iyer",
        "Bejoy Nambiar",
        "Nicola Louise Taylor",
        "",
        "Gunjit Chopra",
        "Bejoy Nambiar",
        "",
        "Kartik R. Iyer",
        "Priyesh Kaushik"
    ],
    "producers": [
        "Gitika Aggarwal",
        "Shivam Anand",
        "Vijay Gulawani",
        "Anil Jain",
        "Anil Kar",
        "Sheetal Menon",
        "Neha Mishra",
        "Deepak Mukut",
        "Bejoy Nambiar",
        "Shivanshu Pandey",
        "Nishant Pitti",
        "Rikant Pitti",
        "Gursimranjit Singh",
        "Neelam R. Singh",
        "Saurabh M. Vanzara",
        "Sarmad Varraich"
    ],
    "composers": [
        "Enbee",
        "Gaurav Godkhindi",
        "Prashant Pillai",
        "Raghav Sachar",
        "Govind Vasantha"
    ],
    "cinematographers": "Harshvir Oberai",
    "editors": [
        "Priyank Prem Kumar",
        "Ajay Soni"
    ],
    "editorial department": [
        "Shriram Badave",
        "Mahak Gupta",
        "Sidharth Meer",
        "Viraj Mukesh Shah",
        "Akshay Dinesh Vaishnav"
    ],
    "casting directors": [
        "Karan Mally",
        "Nandini Shrikent"
    ],
    "production designers": "Mandar Nagaonkar",
    "costume designers": "Gopika Gulwadi",
    "make up department": [
        "Priya Lahon",
        "Hrishikesh Naskar",
        "Baljinder Sandher"
    ],
    "production managers": [
        "Prabhav Chaturvedi",
        "Arjun Chudasama",
        "Zeerak Seharai",
        "Naman Shaw"
    ],
    "assistant directors": [
        "Yazad Anklesaria",
        "Shubhankar Chaudhary",
        "Lakshay Kumar",
        "Tushar Kunder",
        "Radhika Malhotra",
        "Mohit Punj",
        "Eshan Shah"
    ],
    "art department": [
        "Rishikesh Patil",
        "Kaushal Rawal"
    ],
    "sound department": [
        "ThomasAjay Abraham",
        "Sushant Amin",
        "Kriti Kamal Das",
        "Vishnu Das",
        "Shashwath Jagadeesh",
        "Sinoy Joseph",
        "Shashank Kothari",
        "Athul Krishna",
        "Ajeesh Omanakuttan",
        "Vipul Pol",
        "Deepak S.R.",
        "Imran Shaikh",
        "Justin E. Thomas"
    ],
    "special effects": [
        "Scott MacIntyre",
        "Eddy Popplewell"
    ],
    "visual effects": [
        "Jishnu Chatterjee",
        "Vrajesh Pithadiya",
        "Sourav Sonawane",
        "Nilesh Tarle",
        "Rahul Tyagi"
    ],
    "stunts": [
        "Tristan Adams",
        "David Anders",
        "Andy Butcher",
        "Ashley Darkwood",
        "Dominic Kinnaird",
        "Renars Latkovskis",
        "Rob Pavey",
        "Tiger Rudge",
        "Ian van Temperley",
        "Shiraz Yasin"
    ],
    "camera department": [
        "Rohit Murarka",
        "Parth Navle",
        "Arun Ramachandran"
    ],
    "casting department": [
        "David John Jeffery",
        "Sahil Baber Khan",
        "Nischay Malik",
        "Naila Mughal",
        "Aditya Pandya"
    ],
    "location management": "Jason Ash",
    "music department": [
        "Enbee",
        "Ashwin Gopakumar",
        "Hussain Haidry",
        "Prarthna Indrajith",
        "Mohan Kannan",
        "Armaan Khera",
        "Sona Mahapatra",
        "Preeti Pillai",
        "Raahi",
        "Rohit Sharma",
        "Indrajeet Singh",
        "Jyotica Tangri",
        "Govind Vasantha"
    ],
    "transportation department": "Nitin Upadhyaya",
    "miscellaneous": [
        "Kanishka Aggarwal",
        "Sindy Campbell",
        "Bharat Jha",
        "Jay Pandya",
        "Romany Potts",
        "Rachit Singh",
        "Danny Sura",
        "Sandra Urbanik",
        "Saurabh M. Vanzara"
    ],
    "thanks": [
        "Kiran Arya",
        "Bharat Jha"
    ],
    "writer": [
        "Bejoy Nambiar",
        "Anjali Nair",
        "Kartik R. Iyer"
    ],
    "director": "Bejoy Nambiar",
    "production companies": [
        "EaseMyTrip.com",
        "Getaway Films",
        "Soham Rockstar Entertainment"
    ],
    "distributors": "Zee5",
    "special effects companies": "After Studios",
    "other companies": "Spectacle Tradelinks",
    "plot": [
        "A story of friendship and loss of innocence when two worlds clash amid a wedding when a secret exposes a betrayal, and innocent friends converge with dangerous criminals and intense violence.",
        "Rohan and Sunny are best friends from their childhood days. Sunny goes to attend Rohan's younger brother's weeklong wedding in a scenic country estate in UK. The boys look at this as an opportunity to catch up and let loose - unabashed and fun revelry dotting the weeklong affair. Somewhere else in the dark grimy corners of South Hall London, a violent criminal family of moneylenders is headed by Kuljinder with his two brothers Pali and Jassi. Pali has been planning to quit the family business and start life afresh with Kuljnder's wife Jahaan with whom he has been having an affair. But fate has other plans for him. Both these world collides when Kuljinder comes to attend the wedding in the country side. A past secret connected to Rohan and Kuljinder sparks an incident of violence which then kick starts a chain of violence changing all their lives drastically. _Taish_ (qv) is a story of friendship and loss of innocence narrated in the format of intense thriller.::Devdeepa Mukherjee",
        "Sunny bashes a criminal don Kuljinder in the rest room of a hotel grievously injuring him and leaving to die 10 days flashback revels Dr Rohan Kalra is all set to attend his younger brother Krrish's week long wedding at Southall but feels distressed to take his fiance Aarfa long wit him as she is from Pakistan.The wedding suddenly gets spark with arrival of Rohan's best friend Sunny while everyone is in celebration mood Sunny gets Aarfa to the wedding so Rohan can introduce her to his parents.Southhall has a criminal family ruled by Kuljinder and his brothers Jassi and Pali at one of the wedding party Rohan sees Kuljinder with his father and collapses as his haunting past comes forward when sunny finds about it he decides to revenge on Kuljinder.In present day Krrish is killed on the wedding day and Sunny is left badly injured by Pali the court manages to sentence Pali to jail but nothing remains same for Rohan who decides to part way from everyone an will have nothing to do with Sunny.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Episode 1: The Grand Wedding:\nA violent altercation kickstarts this story of revenge and redemption. A family feud between two warring brothers - Pali and Kuljinder from the darker corners of Southall London comes to a boil while another elitist family prepares for a grand wedding by the English countryside. The eldest sibling Rohan and his best friend Sunny, along with the groom Krish, turn up the fun while Pali and Kuljinder try to mediate with the help of a mentor. The two worlds collide when Sunny and Kuljinder get into a fight for reasons unknown.Episode 2: Jahaan's conflict:\nWhile the reasons for the fight between Sunny and Kuljinder are still unknown - the days leading up to the fight show the wedding prep in full swing. Sunny convinces Rohan's girlfriend Arfa to attend the wedding leading to some funny and awkward situations with Rohan and his parents who were unaware of the relationship. The war between Pali and Kuljinder intensifies while Jahaan goes and tells Pali about her pregnancy.Episode 3: The Past Revealed:\nPali has a setback when Jahaan refuses to leave with him. Meanwhile Rohan has a panic attack on seeing Kuljinder at the sangeet. A past revelation by Rohan propels Sunny into confronting Kuljinder. A violent fight ensues with Sunny badly injuring Kuljinder. This kickstarts a cycle of violence. Pali in order to prove his innocence- retaliates, leading to a tragic turn of events.Episode 4: Unstoppable Pali:\nThe aftermath of Krish's murder puts Pali in jail and creates a rift between Rohan and Sunny. Years go by as Pali finds his groove in prison and manages to run the family business from inside the prison while Sanober and Sukhi manage the show outside. Sunny's sister Vaibhavi along with Arfa come to meet Rohan to ask his help to find Sunny. Rohan confronts Shozi to track Sunny's whereabouts. Shozi's revelation about Sunny shocks Rohan.Episode 5: Sunny Strikes Again\nSunny in prison, plots to kill Pali with Ismail's help. A foiled attempt and sudden bail by Rohan gets Sunny to be unhinged. Unable to convince him to give up his lofty plans of revenge- Rohan walks away from Sunny. In prison, another planned attack on Pali by Ismail fails. Pali and Sunny face off in the meeting room of the prison. Pali contacts Sukhi and tells him to kill Sunny. The retaliation by Sukhi is brutal, putting Rohan, Arfa, Vaibhavi , Shozi and Sunny in danger.Episode 6: The Final Face-off:\nThe attack has shaken up Rohan and Sunny. Rohan pretends to back Sunny's revenge ideas while going behind his back to meet Pali in prison to request and ask him to back off. Despite getting an assurance from Pali- Rohan's plans to getaway with Sunny fail miserably when Sunny proactively attacks and kills Pali's brother Jassi. Pali goes berserk and escapes from prison leading to a climatic battle with Rohan and Sunny."
}