{
    "id": "11651796",
    "localized title": "AK vs AK",
    "cast": [
        "Anil Kapoor",
        "Anurag Kashyap",
        "Sonam Kapoor",
        "Harshvardhan Kapoor",
        "Boney Kapoor",
        "Yogita Bihani",
        "Nawazuddin Siddiqui",
        "Sucharita Tyagi",
        "Raghav Aggarwal",
        "Sakshi Benipuri",
        "Saidujjaman Durjoy",
        "Anil Kumar",
        "Manoj Mathew",
        "Priyanshu Parashar",
        "Pavan Rao",
        "Pawan Singh",
        "Sanjay Verma"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "108",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:M",
        "Brazil:14::(self-applied)",
        "Germany:12::(self-applied)",
        "India:16::(self-applied)",
        "Italy:VM14::(self-applied)",
        "Japan:R15+::(self-applied)",
        "Mexico:TV-MA::(self-applied)",
        "Netherlands:12",
        "Singapore:NC16",
        "South Korea:18",
        "Spain:12",
        "United Kingdom:15",
        "United States:TV-MA::(self-applied)"
    ],
    "original air date": "24 Dec 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNDJkOTVkYTMtMTk2OC00YTkyLThjMGYtMTdiYWRjYTQ1YTYzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "11651796",
    "plot outline": "Anurag Kashyap and Anil Kapoor haven't worked together since their shelved film Allwyn Kalicharan in 2003. They get into a tiff at a talk show when Anurag spills water on Anil's face in front of the whole media. Laer, Anurag decides to apologize to Anil, and on his birthday he visits his film set and tries to convince him to take the lead role in his new film. Anil is not willing, but Anurag has pre-planed everything by kidnapping his daughter Sonam and he must find his daughter before sunrise--while Anurag's camera rolls on him to get that realistic feel according to the script.",
    "languages": "Hindi",
    "title": "AK vs AK",
    "kind": "movie",
    "directors": "Vikramaditya Motwane",
    "writers": [
        "Anurag Kashyap",
        "",
        "Vikramaditya Motwane",
        "",
        "Avinash Sampath",
        "",
        "Avinash Sampath"
    ],
    "producers": [
        "Dipa De Motwane",
        "Pawan Jam",
        "Hetvi Karia",
        "Anurag Kashyap",
        "Probir Sabnis",
        "David Taghioff"
    ],
    "composers": "Alokananda Dasgupta",
    "cinematographers": [
        "Amir Malik",
        "Swapnil S. Sonawane"
    ],
    "editors": "Bunty Bhansali",
    "editorial department": [
        "Abhishek Gupta",
        "Uday Javkar",
        "Sidharth Meer",
        "Manish Naidu"
    ],
    "casting directors": "Mukesh Chhabra",
    "art directors": "Pranjal Singh Thakur",
    "set decorators": "Prachi Deshpande",
    "costume designers": "Shruti Kapoor",
    "make up department": [
        "Zuby Johal",
        "Rajiv Subba"
    ],
    "production managers": [
        "Gagandeep Singh Bedi",
        "Rochan Ganu",
        "Manish Naidu",
        "Aparajita Sahay"
    ],
    "assistant directors": [
        "Ridhi Anand",
        "Tavishi Ghosh",
        "Rahil Hussain",
        "Zubair Khan",
        "Rohin Raveendran",
        "Akshat Ajay Sharma",
        "Gaurav P. Singh"
    ],
    "art department": [
        "Aditya Jawalkar",
        "Devina Sarawgi",
        "Amrisha Vindal"
    ],
    "sound department": [
        "Curran Alphonso",
        "Ateesh Chattopadhyay",
        "Justin Jose",
        "Dhruv Parekh",
        "Rushik Patel",
        "Anupam Sathe",
        "Omkar Tamhan",
        "Vajjiravel Varun",
        "Santosh Verma"
    ],
    "visual effects": [
        "Subhanshu Gajbhiye",
        "Kulbhushan Kale",
        "Faryaan Rustomjee",
        "Dhrutiranjan Sahoo",
        "Devina Sarawgi"
    ],
    "stunts": "Stunt Rider Sufi",
    "camera department": [
        "Sajjad Anwar",
        "Prewes Bohra",
        "Johny Francis",
        "Rohin Raveendran"
    ],
    "casting department": [
        "Aman Devgan",
        "Diksha Jain",
        "Siddharth Malik",
        "Alok Singh"
    ],
    "location management": "Amit Rai",
    "music department": [
        "Nakash Aziz",
        "Kaam Bhaari",
        "Arunansh Bhatt",
        "Meghdeep Bose",
        "Rajeshwari Dasgupta Ghose",
        "Augustus Henry",
        "Anil Kapoor",
        "Amar Kashyap",
        "Amit Trivedi"
    ],
    "script department": "Gaurav Mane",
    "miscellaneous": [
        "Rohit Ganeriwal",
        "Rochan Ganu",
        "Swapnil Gujar",
        "Rajul Mishra",
        "Jasmin A. Singh",
        "Pradeep Singh"
    ],
    "akas": [
        "AK contra AK (Spain)",
        "ΑΚ εναντίον ΑΚ (Greece)",
        "AK vs. AK (Mexico)",
        "Lányom nyomában (Hungary)",
        "А.К. против А.К. (Russia)"
    ],
    "writer": [
        "Anurag Kashyap",
        "Vikramaditya Motwane",
        "Avinash Sampath"
    ],
    "director": "Vikramaditya Motwane",
    "production companies": "Andolan Films",
    "distributors": "Netflix",
    "other companies": "Light & Grips Equipment Hirers India",
    "plot": [
        "A filmmaker kidnaps the daughter of a movie star, and while the star searches for his daughter the director films the desperate search in real time for his next blockbuster movie.",
        "Anurag Kashyap and Anil Kapoor haven't worked together since their shelved film Allwyn Kalicharan in 2003. They get into a tiff at a talk show when Anurag spills water on Anil's face in front of the whole media. Laer, Anurag decides to apologize to Anil, and on his birthday he visits his film set and tries to convince him to take the lead role in his new film. Anil is not willing, but Anurag has pre-planed everything by kidnapping his daughter Sonam and he must find his daughter before sunrise--while Anurag's camera rolls on him to get that realistic feel according to the script.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Anurag Kashyap gets an aspiring filmmaker, Yogita, to document his life. One day, Kashyap and Anil Kapoor are interviewed on a variety show. After an audience member asks if the director or the actor is more important, they start arguing about the question and insulting each other's careers, eventually culminating in Kashyap throwing a glass of water in Kapoor's face. This becomes a major scandal for Kashyap and causes actors to back out of his projects. As he sits in his bedroom enraged, Yogita says that she has an idea.Later, on Christmas Eve and Kapoor's birthday, Kashyap goes to his set along with Yogita (whose camera the audience is seeing from) and tries to pitch him a new story about a mad director who kidnaps the daughter of an aging actor, who has to find her. Kapoor is not interested at first, but realizes that his daughter, Sonam, has actually been kidnapped by Kashyap, who wants to capture his real actions and emotions. Kashyap tells him the rules: he has ten hours (until sunrise the next day) to find her, he can't get the police or anyone else involved, all calls he makes must be on speakerphone, and that Yogita's camera must always be recording.Kapoor first tries going to the police, but Kashyap and Yogita catch up and convince them it is just a rehearsal for their film. Kapoor is still somewhat unconvinced that Sonam was actually kidnapped, so Kashyap shows a live feed of her being held by a masked man with a knife. After talking to his son Harshvardhan, Kapoor finds out through her driver that she was last seen at the hotel Crescent. At the hotel, he bribes the manager with an endorsement to access the CCTV footage, where the driver of the taxi used was captured. He searches for him on the streets of Mumbai with little success. Kapoor goes home and tries to text Harshvardhan under the table, but Harshvardan reacts with confusion, leading to Kashyap confronting Kapoor upstairs and the masked man cutting Sonam's finger off. After more searching, someone directs him to a Christmas celebration to find the driver, named Javed. After spotting him through the camera's viewfinder finding him, Kapoor chases him through and around Mumbai Central but is hit by a car and loses him. At the Christmas celebration, Kapoor has to dance for the crowd until someone tells him where Javed lives, and Kapoor finally catches up to him.Javed directs them to where he was told to take Sonam, but Kashyap begins to insist that the place he is talking about was not the one in the script. The place turns out to be Kashyap's house, and another call confirms that Sonam has been held in his DVD room. When they get there, not only is Sonam gone, but Kashyap's parents have also been kidnapped. After a struggle between the trio, Kashyap reveals the original site he had planned and they rush to it as time runs out. A mysterious second cameraman shows up, but they don't find any of the kidnapped. Although Kashyap repeatedly insists that the plan has not been going according to his script, Kapoor discovers a copy and forces him to read it, which supposedly reveals that Kashyap intentionally diverted him and was going to force Kapoor tho choose between shooting himself or Kashyap with a gun in his bag. As Kapoor interrogates an increasing agitated Kashyap, he accidentally shoots him.The perspective shifts to a neutral POV as they take Kashyap to the hospital. Sonam and Kashyap's parents were actually found in the basement of Kashyap's home, and Kashyap is to be convicted for their kidnapping. As he lays in the hospital bed, Kapoor reveals that the whole film was his own plan all along: he convinced Yogita to help frame Kashyap in exchange for an opportunity to break into the industry, arranged the flow of events, and involved his family in the act. Months later, the resulting film wins Yogita, credited as the director, and Kapoor awards at the Filmfare ceremony, while Kashyap, now in a mental asylum, is seen to be in a deranged state plotting vengeance."
}