{
    "id": "12117528",
    "localized title": "Kanni Maadam",
    "cast": [
        "Chaya Devi",
        "Sriram Karthik",
        "Murugadass",
        "Vishnu Ramaswamy",
        "Priyanka Robo Shankar",
        "Supergood Subramani"
    ],
    "genres": [
        "Drama",
        "Romance"
    ],
    "runtimes": "132",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "India:UA",
        "United States:TV-MA"
    ],
    "original air date": "21 Feb 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZDhjNWQyNzktZmQyYy00ZDdiLTk0MzUtMDRmZjBmMjY1MmZlXkEyXkFqcGdeQXVyMTA5NjUxNTg5._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "12117528",
    "plot outline": "Kanni Maadam narrates the tale of a Madurai-based couple who runs for their life to Chennai as the relatives of the boy are quite enraged by their act. When both of them start a new life slowly and steadily, a tragedy hits them in the form of a road accident. Malar (Saya Devi) takes quite some time to come to terms with Kathir's (Vishnu) demise, but struggles hard to come up in life when she realizes that she is going to be a mother. Two auto rickshaw drivers, who live nearby her home, come he her rescue (Sreeram and Murugadoss). How she faces various challenges from different quarters form the rest of the story.",
    "languages": "Tamil",
    "title": "Kanni Maadam",
    "kind": "movie",
    "directors": "Bose Venkat",
    "writers": "Bose Venkat",
    "producers": "Hasheer",
    "composers": "Hari Sai",
    "cinematographers": "Iniyan Harish",
    "editors": "Rizal Jainy",
    "editorial department": "Ashish Joseph",
    "sound department": "Ramachandran Anand",
    "writer": "Bose Venkat",
    "director": "Bose Venkat",
    "production companies": "Rooby Films",
    "distributors": "Rooby Films",
    "plot": "_Kanni Maadam_ (qv) narrates the tale of a Madurai-based couple who runs for their life to Chennai as the relatives of the boy are quite enraged by their act. When both of them start a new life slowly and steadily, a tragedy hits them in the form of a road accident. Malar (Saya Devi) takes quite some time to come to terms with Kathir's (Vishnu) demise, but struggles hard to come up in life when she realizes that she is going to be a mother. Two auto rickshaw drivers, who live nearby her home, come he her rescue (Sreeram and Murugadoss). How she faces various challenges from different quarters form the rest of the story."
}