{
    "id": "12505468",
    "localized title": "Kadakh",
    "cast": [
        "Ranvir Shorey",
        "Mansi Multani",
        "Palomi Ghosh",
        "Rajat Kapoor",
        "Shruti Seth",
        "Cyrus Sahukar",
        "Tara Sharma",
        "Sagar Deshmukh",
        "Nupur Asthana",
        "Kalki Koechlin",
        "Chandrachoor Rai",
        "Manoj Pahwa",
        "Yamini Das",
        "Sheena Khalid",
        "Kaizaad Kotwal",
        "Brijesh Karanwal",
        "Krishna Raaz",
        "Minty Tejpal",
        "Abhishek Sharrma"
    ],
    "genres": [
        "Comedy",
        "Drama",
        "Thriller"
    ],
    "runtimes": "108",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Brazil:14",
        "India:18::(self-applied)"
    ],
    "original air date": "18 Jun 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTQzMWE4NDYtMWQ3Ni00MGVmLTk1ZTgtYTQ3ZDQ5NzY2Zjg5XkEyXkFqcGdeQXVyMTE5ODY5OTcz._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "12505468",
    "plot outline": "On the day Sunil (Ranvir Shorey) and Malti (Mansi Multani) are hosting a Diwali party, Sunil is visited by an uninvited guest - the husband of the woman he is having an extramarital affair with. What follows is a series of events that turns their festival of lights into a night of dark revelations.",
    "languages": "Hindi",
    "title": "Kadakh",
    "kind": "movie",
    "directors": "Rajat Kapoor",
    "writers": "Rajat Kapoor",
    "producers": [
        "Nikhil Chaudhary",
        "Dinesh Kasana",
        "Gurudas Damodar Pai",
        "Sameer Shaikh",
        "Kala Singh"
    ],
    "composers": "Sagar Desai",
    "cinematographers": "Rafey Mehmood",
    "editors": "Suresh Pai",
    "editorial department": [
        "Tushar Jadhav",
        "Nitin Minz",
        "Kabir Ulhas"
    ],
    "make up department": "Antara Bahuguna-Ghosh",
    "assistant directors": [
        "Shraddha Bilwal",
        "Aditya Kelgaonkar",
        "Ena Marley",
        "Sameer Shaikh",
        "Ankit Singh",
        "Waris Ahmed Zaidi"
    ],
    "art department": "Tushar Kapoor",
    "sound department": [
        "Boloy Kumar Doloi",
        "Arunav Dutta",
        "Surabhi Pandit",
        "Amala Popuri"
    ],
    "camera department": [
        "Abhishek Basu Roy",
        "Naiyer Ghufran",
        "Satyajit Hajarnis",
        "Pranav Sharma",
        "Sudhanshu Singh"
    ],
    "music department": [
        "Hussain Haidry",
        "Almudena Longares",
        "Ena Marley"
    ],
    "writer": "Rajat Kapoor",
    "director": "Rajat Kapoor",
    "production companies": [
        "Mithya Talkies",
        "Sony Liv"
    ],
    "distributors": [
        "SonyLiv_India",
        "Sonyliv"
    ],
    "plot": [
        "Sunil is home alone when the doorbell rings. The stranger at the door is the husband of Chhaya, a woman that Sunil is having an affair with. The man asks many uncomfortable questions about their affair, becoming more and more intrusive.",
        "On the day Sunil (Ranvir Shorey) and Malti (Mansi Multani) are hosting a Diwali party, Sunil is visited by an uninvited guest - the husband of the woman he is having an extramarital affair with. What follows is a series of events that turns their festival of lights into a night of dark revelations.::SonyLiv_India",
        "Sunil and Malti have kept Diwali bash at their apartment earlier in the day while Malti is away a stranger arrives in the house.The stranger calls himself Raghav husband of Chayya whose having affair with Sunil during and argument between the two Raghav shoots himself. Malti arrives and Sunil tells her that the dead body is of Anand whom he had fired from work. Sunil intends to cancel the party but one by one the guests start to arrive while he and Malti have to take care of the situation.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Kadakh is an edge-of-the-seat dark comedy that trails a day in the life of Sunil (Ranvir Shorey), who with his wife Malti (Mansi Multani), is planning a Diwali party for that evening.Sunil is home alone when the doorbell rings. The stranger at the door introduces himself as Raghav, a seemingly friendly man. Turns out he is the husband of Chhaya - a woman Sunil is having an extramarital affair with. Sunil is shocked as Raghav explains he came to meet him out of 'curiosity'. As the conversation continues, Raghav's questions become painfully intrusive, as he asks about 'all the details' of Sunil's affair with his cheating wife. Things take a deadly turn, and now Sunil and Malti are faced with getting rid of the invited guest while entertaining a house full of friends at their Diwali party.A sharply written film bursting with the signature wit of Bheja Fry and Raghu Romeo, Kadakh explores relationships and their foundations, secrets, and loyalty, cheating, and relationship suicide - all through the lens of humour. Based in an urban setting, the film asks explores all areas of a relationship - the right thing to do, the ethically wrong, and the morally ambiguous.Written and directed by Rajat Kapoor, Kadakh brings together an ensemble cast of India's finest actors. With Ranvir Shorey in the lead role, the film stars Mansi Multani, Cyrus Sahukar, Shruti Seth, Rajat Kapoor, Tara Sharma Saluja, Sagar Deshmukh, Nupur Asthana, Kalki Koechlin, Chandrachoor Rai, Palomi Ghosh, Manoj Pahwa and Yamini Das in pivotal roles.With each new guest in Sunil and Malti's home comes another twist, turning their festival of lights into a night of dark revelations."
}