{
    "id": "12677092",
    "localized title": "CU Soon",
    "original title": "C U Soon",
    "cast": [
        "Fahadh Faasil",
        "Roshan Mathew",
        "Darshana Rajendran",
        "Saiju Kurup",
        "Maala Parvathi",
        "Kottayam Ramesh",
        "Amalda Liz",
        "Vaishnavi Venugopal",
        "Raj Krishnan",
        "Shibu Mathai",
        "Naveen Nazim",
        "Urmila Krishnan",
        "Neeraja Rajendran",
        "Lakshmi Venugopal",
        "Rajesh Vypin",
        "Abdhul Salaam",
        "Beljith Singh",
        "Fathima Althaf",
        "Maaya",
        "Baby",
        "Mahi Manoharan",
        "Tim V. Mathew"
    ],
    "genres": [
        "Drama",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "98",
    "countries": "India",
    "country codes": "in",
    "language codes": "ml",
    "color info": "Color",
    "certificates": [
        "India:Not Rated",
        "Singapore:M18"
    ],
    "original air date": "01 Sep 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzkwMzgwODAtZmI1Zi00ZjcyLThkYTYtNTg0YTM3ZGRlNGQ3XkEyXkFqcGdeQXVyMjkxNzQ1NDI@._V1_SY150_CR0,0,101,150_.jpg",
    "imdbID": "12677092",
    "plot outline": "Jimmy meets Anu on an online dating website and decides to marry her. Jimmy's mother entrusts his cousin Kevin to get details about Anu. Now its Kevin's turn to search for his cousin's fiancee who vanished without a trace, only to discover dark, shocking truths about her.",
    "languages": "Malayalam",
    "title": "C U Soon",
    "kind": "movie",
    "directors": "Mahesh Narayanan",
    "writers": "Mahesh Narayanan",
    "producers": [
        "Fahadh Faasil",
        "Nazriya Nazim",
        "P.K. Sreekumar"
    ],
    "composers": "Gopi Sundar",
    "cinematographers": [
        "Mahesh Narayanan",
        "Sabin Uralikandy"
    ],
    "editors": "Mahesh Narayanan",
    "editorial department": [
        "Arju Benn",
        "Rahul Radhakrishnan"
    ],
    "production designers": "Nazriya Nazim",
    "make up department": "Akhil Sivan",
    "production managers": "Abin Edavanakkad",
    "assistant directors": [
        "Uthara Krishnan",
        "V.P. Sajimon"
    ],
    "sound department": [
        "Jonathan Coomes",
        "Vishnu Govind",
        "Mark Lanza",
        "Vysakh P.V.",
        "Kunal Rajan",
        "Sapthaa Records",
        "Subin Sojan",
        "Justin W. Walker"
    ],
    "visual effects": "Sarathvinu",
    "costume departmen": "Shukkur Ahammed",
    "miscellaneous": [
        "Ajay s Nair",
        "Arshin S.",
        "Shaheen Thaha"
    ],
    "akas": [
        "CU Soon (India, English title)",
        "CU Soon",
        "Скоро увидимся (Russia)"
    ],
    "writer": "Mahesh Narayanan",
    "director": "Mahesh Narayanan",
    "production companies": "Fahadh Faasil and Friends",
    "distributors": "Amazon Prime Video",
    "other companies": "Sapthaa Records",
    "plot": [
        "A software engineer, living in Kerala, is prompted by his family to look for his cousin's missing fiancee. As they stumble upon her video-based suicide note, he races against time to find her.",
        "Jimmy meets Anu on an online dating website and decides to marry her. Jimmy's mother entrusts his cousin Kevin to get details about Anu. Now its Kevin's turn to search for his cousin's fiancee who vanished without a trace, only to discover dark, shocking truths about her.",
        "Jimmy Kurian, bank employee in UAE falls for Anumol, whom he met over a dating app and jumps into further commitment in lieu of proper information, soon does he realize the consequences of his choices and it is past time contemplating them.::AKJ",
        "Jimmy working for a bank in UAE meets Anu over a dating app they regularly chat over the phone and Jimmy falls in love with her without even meeting her.Jimmy's mother asks his cousin Kevin to find more details about her while Kevin's company and partner Sanjana bug his phone as they find that he is more interested in Anu over his work.Anu and Jimmy start to live in relationship after she is beaten by her father soon after a week she goes missing leaving suicidal video for Jimmy leading him into trouble.Kevin then hacks necessary devices and social media to trace Anu and finds a shocking truth about her.::alex.mjacko@gmail.com"
    ],
    "synopsis": "The movie shows the daily lives of some people through internet. The entire movie is shot like in the web cam.The main characters are Jimmy, Tommy and Anu. Tommy meets Anu through internet and falls in love with her. He tells her that he wants to marry her and introduces her to his family. But though chatted through the internet Tommy knew very less about the background of Anu and the truth about her is somewhat twisted . So one day he gets a call from her saying that their relationship has been known in her home and that her father has beaten her and she asks Tommy to pick her up. Tommy picks her up and brings to his apartment and he asks his friend Prasanth who is a doctor to help with Anu's injuries. After few days Tommy meets Anu's father and they talk and Tommy gives him Anu's new number , however Anu was not happy about this. After that Anu goes missing and Tommy and Jimmy tries to find her and unravel her mysteries. Apart from this Jimmy is having his own issues in the office. He deals with both of this at the same time. So both of them try to find her and Jimmy asks Tommy to get the CCTV footage of his flat. They find that Anu's father had visited her and given her some package. In the meanwhile police comes and takes Tommy away for questioning, Prasanth also joins Tommy in the station and the police leaves them after questioning. They reach home and in the meantime Jimmy finds some clues about who this Anu really is. He finds her Facebook password and logs in to her account and finds some strange things about her. Is she really the person they think she is?"
}