{
    "id": "8366590",
    "localized title": "Baaghi 3",
    "cast": [
        "Tiger Shroff",
        "Riteish Deshmukh",
        "Shraddha Kapoor",
        "Ankita Lokhande",
        "Jameel Khoury",
        "Vijay Varma",
        "Bhawani Singh Rathore",
        "Jaideep Ahlawat",
        "Shifuji Shaurya Bharadwaj",
        "Danish Bhatt",
        "Manav Gohil",
        "Pradeep Kabra",
        "Slavisha Kajevski",
        "Satish Kaushik",
        "Ivan Kostadinov",
        "Sunit Morarjee",
        "Disha Patani",
        "Virendra Saxena",
        "Amit Sharma",
        "Jackie Shroff",
        "Shriswara",
        "Navdeep Tomar",
        "Yash Bhojwani",
        "Katarina Orlandic",
        "Ayaan Zubair Rahmani",
        "Pradeep Rajput",
        "Suraj Rana",
        "Hani Yadav"
    ],
    "genres": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "runtimes": "143",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:13+::(Quebec)",
        "India:UA",
        "Ireland:12A",
        "Singapore:PG13",
        "Spain:16::(ICAA)",
        "United Kingdom:12A",
        "United States:Not Rated"
    ],
    "original air date": "06 Mar 2020 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTAxNWE2MDItZWFlNS00MWM1LWI1ZjQtN2I5NDBhNWYzZjNhXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "8366590",
    "plot outline": "Ronnie and Vikram are brothers who share an unbreakable bond. Their journey begins when a certain turn in events, leads Vikram to travel. On this trip, he gets kidnapped by people. Ronnie witnesses his brother getting beaten and kidnapped, Ronnie will do whatever it takes to destroy anyone and anything that stands in the way of Vikram's safety. Ronnie goes on a rampage of destruction to see his brother safe, even if it means that he independently has to take on an entire country.",
    "languages": "Hindi",
    "title": "Baaghi 3",
    "kind": "movie",
    "directors": "Ahmed Khan",
    "writers": [
        "Sajid Nadiadwala",
        "",
        "Farhad Samji",
        "",
        "Farhad Samji"
    ],
    "producers": [
        "Bharat Bohra",
        "Alek Conic",
        "Dipti Jindal",
        "Sajid Nadiadwala",
        "Vikram Razdan"
    ],
    "composers": [
        "Tanishk Bagchi",
        "Vishal Dadlani",
        "Rochak Kohli",
        "Bappi Lahiri",
        "Pranaay",
        "Shekhar Ravjiani",
        "Sandeep Shirodkar",
        "Sachet Tandon",
        "Parampara Thakur"
    ],
    "cinematographers": "Santhana Krishnan Ravichandran",
    "editors": "Rameshwar S. Bhagat",
    "editorial department": [
        "Niranjan Devaramane",
        "Omkar Gawli",
        "Manoj Magarr",
        "Kamlesh Parui",
        "Sajith Rajendran"
    ],
    "casting directors": "Mukesh Chhabra",
    "production designers": "Manini Mishra",
    "art directors": "Nenad Zdero",
    "set decorators": [
        "Alen Hasanovic",
        "Jelena Mirkovic"
    ],
    "costume designers": [
        "Karishma Gulati",
        "Ashish Sharma"
    ],
    "production managers": [
        "Aditi Bazazaya",
        "Ramjanam Dubey",
        "Sasa Radulovic",
        "Ronit Sadh",
        "Priyanshu Sharma",
        "Djurdjica Vitorovic"
    ],
    "assistant directors": [
        "Abeer Abhyankar",
        "Fazl Khan",
        "Darja Markovic",
        "Adnan A. Shaikh",
        "Shukti Sharma",
        "Jelena Tvrdisic",
        "Nikola Zdravkovic"
    ],
    "art department": [
        "Nikola Jovanovic",
        "Sagar.Maheshri",
        "Narinder Singh Sidhu",
        "Vladimir Vicentic"
    ],
    "sound department": [
        "Curran Alphonso",
        "Yash Darji",
        "Divyank Dubey",
        "Justin Jose",
        "Burhan Kundawala",
        "Parikshit Lalwani",
        "Dewashish Mandal",
        "Rohit Meena",
        "Hiru Paban",
        "Arun Rana",
        "Salmanshaikh-Boomoperator",
        "Omkar Tamhan"
    ],
    "special effects": [
        "Muhamed M'Barek",
        "Babu Tyagi"
    ],
    "visual effects": [
        "Shudhdodhan Milind Ambhore",
        "Sumit Milind Ambhore",
        "Samuel Bantu",
        "Mahesh Baria",
        "Yatin Bhave",
        "Abhishek Bhoyar",
        "David Bobb Chandy",
        "Suvojit Dari",
        "Prasad Deshmukh",
        "Rahul Dhanwe",
        "Halder Dipansu",
        "Avinash Gharule",
        "Ravi Gulhane",
        "Vinod Gundre",
        "Nilesh Jokhan Gupta",
        "Chandan Howal",
        "Anjalika Jain",
        "Aakash Jaisinghani",
        "Saurabh Kadam",
        "Apurba Kalita",
        "Sanjeev Kandulna",
        "Ravi Kori",
        "Dhiraj Kumar",
        "Midhun Mathews",
        "Chandan Mehta",
        "Raj Mittal",
        "Rajesh Moopanar",
        "Mujammil Mulla",
        "Kamlesh Pandit",
        "Hitesh Patel",
        "Anil Prajapati",
        "Anil Vimal Prajapati",
        "S.N.V. Ramana",
        "Akul Ratra",
        "Vinay Krishan Rohilla",
        "Sagar.Maheshri",
        "Sujeet Samant",
        "Allan Sequeira",
        "Mujawar Shadab",
        "Jimit Shah",
        "Ruchi Shetye",
        "Suraj Avinashrao Shrikhande",
        "Arup Sinha",
        "Ashutosh Surawshi",
        "Chandrashekhar Thanvi",
        "Aditi Tiwari",
        "Raghav Verma"
    ],
    "stunts": [
        "Milan Alavanja",
        "Daniel Bodlák",
        "Lakshman Chella",
        "Ram Chella",
        "Melroy Dsilva",
        "Slavisa Ivanovic",
        "Srdjan Rale Jovanovic",
        "Kecha Khamphakdee",
        "Dalibor Kostic",
        "Jaroslav Shvets",
        "Filip Todorovic",
        "Luka Todorovic",
        "Nenad Todorovic"
    ],
    "camera department": [
        "Shitij Arora",
        "Ales Belak",
        "Nikola Boskovic",
        "Sunny Devkar",
        "Trifunovic Dragan",
        "Dragoljub Eric",
        "Sagar Jeswani",
        "Parvaez K.",
        "Grover Kashish",
        "Sameer Kharatmal",
        "Saroj Kumar",
        "Aleksandar Letic",
        "Nenad Maksimovic",
        "Bhatt Mihir",
        "Rohan Mugullu",
        "Sushil Mugullu",
        "Sahil Nagpal",
        "Parth Navle",
        "Nikola Obradovic",
        "Piyush Parmar",
        "Biswanath Pattanaik",
        "Ruchit Rajguru",
        "Lakhan Rathod",
        "Vikas Kumar Seth",
        "Sandeep Shetty",
        "Nandkishor Shigvan",
        "Laxman Suthar",
        "Kapil Verma",
        "Emir Bihorac"
    ],
    "casting department": "Siddhartha Sharma",
    "costume departmen": [
        "Kristina Savic",
        "Ashish Sharma",
        "Ankita Surana"
    ],
    "music department": [
        "Sparsh Agrawal",
        "Shabbir Ahmed",
        "Mukund Ambarish",
        "Tanishk Bagchi",
        "Siddharth Basrur",
        "Bashab Bhattacharjee",
        "Meghdeep Bose",
        "Vishal Dadlani",
        "Ginny Diwan",
        "Jonita Gandhi",
        "Nikhita Gandhi",
        "Indivar",
        "Panchhi Jalonvi",
        "Rochak Kohli",
        "Tulsi Kumar",
        "Krishnakumar Kunnath",
        "Dev Negi",
        "Akash Prajapati",
        "Shekhar Ravjiani",
        "Gurpreet Saini",
        "Advait Sawant",
        "Shaan",
        "Gautam Govind Sharma",
        "Sachet Tandon",
        "Divyanshu Tejwani",
        "Joel Crasto"
    ],
    "script department": "Sukriti Rahul Sharma",
    "transportation department": [
        "Djordje Minic",
        "Vukasin Mrdjic"
    ],
    "miscellaneous": [
        "Deven Bapna",
        "Darshan Bhanushali",
        "Navnish Bhardwaj",
        "Sagar Choudhary",
        "Lachlan Delchau-Jones",
        "Ivana Zoe Jovanovic",
        "Naushad Kasmani",
        "Chandan Kumar",
        "Imran Manzoor",
        "Prince R. Gupta",
        "Nikul Sachdev",
        "Aditi Sekhri",
        "Raj Surani",
        "Zoja Tomasevic",
        "Akhilesh Yadav"
    ],
    "thanks": [
        "Taresh Goyal",
        "Arham Surana"
    ],
    "akas": "Бунтарь 3 (Russia)",
    "writer": [
        "Sajid Nadiadwala",
        "Farhad Samji",
        "Farhad Samji"
    ],
    "director": "Ahmed Khan",
    "production companies": [
        "Fox Star Studios",
        "Nadiadwala Grandson Entertainment"
    ],
    "distributors": [
        "Bollywood Movies in Spain (Pavan Kumar Mulukala)",
        "Night Ed Films",
        "Twentieth Century Fox",
        "NN Films"
    ],
    "other companies": [
        "Clockwork Film",
        "Hotstar",
        "Star Gold",
        "T-Series"
    ],
    "plot": [
        "A man embarks on a bloody rampage to save his kidnapped brother.",
        "Ronnie and Vikram are brothers who share an unbreakable bond. Their journey begins when a certain turn in events, leads Vikram to travel. On this trip, he gets kidnapped by people. Ronnie witnesses his brother getting beaten and kidnapped, Ronnie will do whatever it takes to destroy anyone and anything that stands in the way of Vikram's safety. Ronnie goes on a rampage of destruction to see his brother safe, even if it means that he independently has to take on an entire country.::Fox Star Hindi",
        "It's a story of two brothers, Vikram and Ronnie who share an unbreakable bond. A certain turn in events, leads Vikram to travel in Syria to complete some work. On this trip, Vikram gets kidnapped by ISIS. Ronnie goes on a rampage of destruction to see his brother safe again, even if it means that he independently has to take on an entire country.",
        "Ronnie and Vikram share an inseparable sibling bond and Ronnie always comes to the rescue of Vikram whenever he falls into trouble. When Vikram is sent to Syria to complete some of his work, Ranveer witnesses Vikram getting kidnapped by some dangerous people while he was on the video call. He goes on a destructive rampage and does everything he can to find his Vikram and bring him back to safety even if it means that he has to independently take on an entire country.::Santhosh",
        "Inspector Charan Chaturvedi lives with his two sons Vikram and Rony he passes away after being killed in riots.Vikram and Rony are taken care by their uncle while Vikram is simpleton and whenever he falls in trouble Rony comes to his rescue.Vikram becomes a police officer and In his name Rony eliminates criminals making him famous.Vikram gets married to Ruchi while Rony falls for her sister Siya.After seeing Vikram's progress in department he is sent to mission in Syria where he gets kidnapped by Abu Jalal's gang .Rony and Siya reach Syria to search him and Rony swears to eliminate anyone who comes between him while searching Vikram.::alex.mjacko@gmail.com"
    ],
    "synopsis": "The film opens with Ronnie running towards a corpse and grieving the person's death before Siya arrives at the spot. A flashback begins.15 years ago, young Ronnie used to protect his innocent elder brother Vikram from those bothering him. When Vikram got beaten up and troubled by some boys, Ronnie arrived and rescued him by fighting off the boys. His father, Inspector Charan Chaturvedi, didn't approve of his behavior. One day, Charan went out to rescue people from a riot and ended up getting fatally shot. He made Ronnie promise to be Vikram's protector forever, which he did. Following their father's death, Ronnie and Vikram grew up together with their uncle, also a police officer.Years later, some goons trouble Vikram in a movie theater after he mistakenly spoils their leader's shirt. Siya, who has just met him, tries to help him but the goons beat him up. Ronnie arrives to help him and sensing threat decides to leave with an apology. However, when he sees blood near Vikram's ears, Ronnie beats up the goons and is about to nearly kill one of them, before Vikram and their uncle stop him. The uncle offers a police job to the brothers, and Vikram declines. With a number of cases registered against him, Ronnie tells Vikram he can't join the police force. He convinces Vikram to become a police officer in Agra. Upon joining his duty, he sees the henchmen of a criminal named IPL burn a man to death in front of the police. Vikram is terrified and expresses disgust at the cops' failure to stop the criminals. He learns an elder cop in their station just thought of bringing those criminals to justice and suffered the consequences by seeing his daughter get killed by one of the criminals.It is then revealed IPL works for a Syrian terrorist named Abu Jalal Gaza who kidnaps families to use them for terrorism. Soon, the cops find out about the location where IPL's men have kidnapped families. Since one of them has to necessarily go, Vikram is made the scapegoat but with Ronnie's assurance, he goes alone at the location. Ronnie meets him secretly, and instructs him to turn lights on and off upon hearing him whistle every single time. Using this technique, Ronnie fights off the henchmen and helps Vikram rescue the kidnapped families. This process is repeated, and Vikram soon becomes a famous cop. Learning that his henchmen are unable to stop Vikram, IPL instructs them to kidnap Ronnie, whom they believe to be an innocent and timid man. They succeed in kidnapping him and ask Vikram to come with the seized commodity and rescue Ronnie. The elder cop tells Vikram to go and save Ronnie, who pretends to be scared and tells Vikram via phone to come in 10 minutes. During that time, IPL instructs his henchmen to chop Ronnie's thumb if Vikram doesn't show up, and leaves. However, Ronnie fights them all off and lets Vikram arrest the goon (who killed the elder cop's daughter). When the goon is being taken to court, Ronnie and Vikram stage a fake arrest sequence in which Ronnie is taken in and cuffed with the goon. During the traffic jam, Ronnie runs with the goon, and Vikram hands over the elder cop a gun to shoot the goon. The goon is killed publicly.Vikram continues to gain popularity and respect for his sincere behavior. After getting married with Siya's sister Ruchi, Vikram is told by the government to go for a routine paperwork in Syria. Happily leaving behind Ronnie, Siya and a pregnant Ruchi with a promise to return soon, Vikram goes to Syria and during a video call tells Ronnie someone picked his pocket as he couldn't be recognized as a cop. When there's a knock on the door, Vikram goes to attend it and gets brutally beaten up. Seeing this on camera, Ronnie pleads the men to spare Vikram, but they don't comply. Ronnie vows to rip apart their self-made nation if anything happens to Vikram, and hiding the truth from Ruchi, arrives in Syria with Siya. They try to enlist police help, but to no avail. A Pakistani man named Akhtar Lahori helps the duo track Vikram when Ronnie recalls Vikram's pocket was picked. Vikram's wallet is found with a pickpocket, and the cops start chasing after the trio who visit Vikram's hotel room to find Vikram's damaged phone. The cops arrive at the hotel to catch the trio, who successfully escape. The trio then starts to search for Vikram with his photos in their hands, and end up finding the attacker. Ronnie beats him up and chases him, exhausting him in the process. Ronnie pleads him to tell Vikram's location. However, the attacker gets hit by a truck and dies.The opening scene then plays again, and the story continues from there.Siya retrieves the attacker's phone from his corpse and texts IPL to meet him at a hotel, where Abu Jalal Gaza, the attacker's brother, has also arrived to kill Ronnie (unaware that it's him). He tells IPL that he has been texted by the killer instead of his brother, and leaves upon seeing the cops arrive. The main cop, however, sides with Ronnie and team, and captures IPL while Jalal escapes in disguise. Feeling IPL might betray him since he has been captured, Jalal orders his men to follow the police vehicle carrying IPL and kill him. Ronnie and team stage a series of events making Jalal's henchmen believe IPL has switched sides. The henchmen attempt to kill him, and Ronnie rescues him. Feeling betrayed himself, IPL decides to expose Jalal's plans. It is then revealed that Vikram's friend Asif and his family have also been kidnapped and kept with him. Asif is made to carry a bomb and explode it in return for his family's safety. However, Siya arrives and the police frees Asif's family while she tells him to stop and gets the bomb removed. Ronnie, on the other hand, attacks Jalal's army in the ensuing prolonged battle. He blows up vehicles, crashes helicopters and battles gunfire with an improvised shield. On the other hand, armed hostages rescued by Ronnie are being taken safely by IPL and Lahori while a girl steps on a landmine. IPL quickly switches positions with the girl, and forces Lahori to leave with the hostages. IPL sacrifices himself when Jalal's henchmen show up, and he steps off the landmine, killing everyone in the explosion. Ronnie then arrives at the spot where Vikram has been held captive. He fights off some of the henchmen, and Jalal (who met Ronnie at the hotel and promised him to find his brother without knowing him) frees everyone including Vikram, but takes Siya hostage. As Vikram and Siya are caged, Ronnie starts fighting but gets badly hit. While trying to fight back, he sees a sudden transformation in Vikram, who is now enraged to see Ronnie get beaten. Ronnie smiles and stops fighting back, eventually getting stabbed. Vikram escapes from the cage and beats the henchmen to death with a stone, and impales Jalal on steel rods.Freeing Siya from the cage, Vikram tries to revive Ronnie but nearly fails, with both believing he has succumbed to his wounds. However, as Jalal arrives to attack them, Ronnie suddenly gets up and strangles him to death. Back in India, Vikram is honored for his bravery while Ronnie imagines his father saluting him for keeping his promise and hugging him."
}