{
    "id": "0075651",
    "localized title": "Schock",
    "cast": [
        "Daria Nicolodi",
        "John Steiner",
        "David Colin Jr.",
        "Ivan Rassimov",
        "Lamberto Bava",
        "Paul Costello",
        "Nicola Salerno"
    ],
    "genres": "Horror",
    "runtimes": "95",
    "countries": "Italy",
    "country codes": "it",
    "language codes": [
        "en",
        "it"
    ],
    "color info": "Color::(Eastmancolor)",
    "aspect ratio": "1.85 : 1",
    "sound mix": "Mono::(Westrex Sound System)",
    "certificates": [
        "Australia:MA",
        "Canada:13+::(Quebec)",
        "Germany:BPjM Restricted",
        "Italy:VM14",
        "New Zealand:R16",
        "Spain:18",
        "United Kingdom:18",
        "United Kingdom:X",
        "United States:R"
    ],
    "original air date": "12 Aug 1977 (Italy)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzYzNTc4ZDYtMDk5MS00OTc1LWIzODYtOGU4Y2YxYWM0ZTI5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0075651",
    "plot outline": "Dora Baldini, her husband Bruno, and her son Marco move to a huge house that belongs to her; she used to live there with Marco and her former husband, a drug addict who committed suicide. The house has stood empty since then, and Bruno, a pilot, has decided that they should move in since it is close to the airport. Soon Marco is possessed by the ghost of his father and Dora is haunted by the house. She tells Bruno that they need to leave the house and she is afraid of her son, but he believes she's relapsing since she had a breakdown when her husband died. Why is the vengeful spirit seeking revenge?",
    "languages": [
        "English",
        "Italian"
    ],
    "title": "Shock",
    "kind": "movie",
    "directors": [
        "Mario Bava",
        "Lamberto Bava"
    ],
    "writers": [
        "Lamberto Bava",
        "Gianfranco Barberi",
        "Alessandro Parenzo",
        "Dardano Sacchetti",
        "",
        "Hillary Waugh"
    ],
    "producers": [
        "Ugo Valenti",
        "Turi Vasile"
    ],
    "composers": [
        "Dino Cappa",
        "Alessandro Centofanti",
        "Walter Martino"
    ],
    "cinematographers": [
        "Alberto Spagnoli",
        "Mario Bava"
    ],
    "editors": "Roberto Sterbini",
    "editorial department": [
        "Sandro Broglio",
        "Mario Recupito"
    ],
    "production designers": "Franco Vanorio",
    "art directors": "Franco Vanorio",
    "set decorators": "Pietro Spadoni",
    "costume designers": "Massimo Lentini",
    "make up department": "Marisa Tilly",
    "production managers": [
        "Giuseppe Mangogna",
        "Naldo Nibbi"
    ],
    "assistant directors": [
        "Lamberto Bava",
        "Nicola Salerno"
    ],
    "art department": [
        "Nicola Salerno",
        "Franco Vanorio"
    ],
    "sound department": "Pietro Spadoni",
    "special effects": "Mario Bava",
    "camera department": [
        "Giuseppe Alberti",
        "Giuliana De Rossi",
        "Sante Federici",
        "Giuseppe Maccari",
        "Sergio Serantoni"
    ],
    "costume departmen": [
        "Massimo Lentini",
        "Franca Lulli"
    ],
    "music department": [
        "Dino Cappa",
        "Alessandro Centofanti",
        "Walter Martino",
        "Maurizio Guarini",
        "Walter Martino",
        "Carlo Pennisi"
    ],
    "script department": "Rossana Rocchi",
    "miscellaneous": "Pino Locchi",
    "akas": [
        "Shock (Italy)",
        "Al 33 di Via Orologio fa sempre freddo (Italy)",
        "Shock (United States)",
        "Beyond the Door II (United States)",
        "Beyond the Door II (United Kingdom)"
    ],
    "writer": [
        "Lamberto Bava",
        "Gianfranco Barberi",
        "Alessandro Parenzo"
    ],
    "director": [
        "Mario Bava",
        "Lamberto Bava"
    ],
    "production companies": "Laser Films",
    "distributors": [
        "Eagle Films",
        "Film Ventures International (FVI)",
        "New World-Mutual",
        "Hispamex Films",
        "Marvin Films",
        "Nippon Herald Films",
        "Titanus",
        "Anchor Bay Entertainment",
        "Anchor Bay Entertainment",
        "Beam Entertainment",
        "Blue Underground",
        "Culture Publishers (CP)",
        "DTP Entertainment",
        "Hollywood DVD",
        "Imagica Corp.",
        "K & C Video",
        "Kinokuniya",
        "Media Home Entertainment",
        "Toshiba Eizo Soft",
        "Umbrella Entertainment"
    ],
    "other companies": [
        "Bixio C.E.M.S.A",
        "Vides Cinematografica",
        "C.D.S.",
        "Westrex Recording System",
        "Technospes"
    ],
    "plot": [
        "A couple is terrorized in their new house haunted by the vengeful ghost of the woman's former husband, who possesses their young son.",
        "Dora Baldini, her husband Bruno, and her son Marco move to a huge house that belongs to her; she used to live there with Marco and her former husband, a drug addict who committed suicide. The house has stood empty since then, and Bruno, a pilot, has decided that they should move in since it is close to the airport. Soon Marco is possessed by the ghost of his father and Dora is haunted by the house. She tells Bruno that they need to leave the house and she is afraid of her son, but he believes she's relapsing since she had a breakdown when her husband died. Why is the vengeful spirit seeking revenge?::Claudio Carvalho, Rio de Janeiro, Brazil",
        "After a stay in a psychiatric institution, Dora Baldini moves back to her old memory-ridden house with her young son Marco and her new husband Bruno. It's been seven painful years already since her first husband's gruesome death, and now an eerie supernatural presence emerges, affecting innocent Marco more and more. Before long, violently-vivid hallucinations torment Dora, and little by little she creeps to the brink of insanity. Is she going crazy, or are preternatural evil forces at work?::Nick Riganas"
    ],
    "synopsis": "Dora (Daria Nicolodi), is a woman who has suffered a nervous breakdown following the death of her husband Carlo, a drug addict who abused her. Carlo died under mysterious circumstances; he apparently committed suicide by throwing himself off a boat while at sea. After an year-long extended stay in a sanatorium, Dora is released into the care of her new husband Bruno (John Steiner).Despite the bad memories connected to her old house, Bruno insists that they, together with Dora and Carlo's young son Marco (David Colin Jr.), settle down there until a more convenient location can be found. Dora reluctantly agrees, and soon after resettling down into their home, mysterious events begin to happen. Marco strikes up a conversation with a unnamed, imaginary friend possible the spirit of his dead father. Later that night, Marco spies on his parents having sex on a couch in the living room. This voyeuristic scene unhinges the boy as he hisses \"Pigs! Pigs!\"When Bruno, a commercial airline pilot, goes away on business with the TWA Airline, Dora is left alone for a whole week. One evening, Marco asks if he could sleep in the bed next to her and she agrees. As she sleeps, Marco crouches over her body, and begins caressing her. Hallucinated, his hand takes on a putrid, rotting appearance.The next morning, Dora finds a pair of her panties, ripped to shreds, in Marco's dresser, and later catches him spying on her as she showers. The boy's behavior becomes more and more aggressive when he starts jumping out at her from the shadows, further unsettling his already nervous mother. Another day later, Dora notices a photo of her and Bruno is missing. Marco is shown with the photo, playfully cutting their images out of the photo with scissors and decapitating them.When Bruno returns, a fearful Dora tells him about whats going on. Bruno insists that shes only imagining things, and begs her to calm down. When this fails, he administers her sleeping pills to help her sleep. Dora begins to suffer from terrible nightmares which includes ghastly visions of her dead husband.In an effort to clear things up, Dora takes Marco to a psychiatrist (Ivan Rassimov). The doctor tells Dora that, based on his conversations with the boy, she has been neglecting her son and he is simply seeking attention. Dora insists that Marco is lying. A little later at home, when Marco accuses her mother of murdering Carlo, she comes to believe that the child is possessed by the dead mans spirit. Dora confides her fears to Bruno, who promises to take her away from the house as soon as possible.That night, Dora is awakened by sounds coming from the basement. She goes to investigate and finds Bruno tearing down a brick wall in the basement with a pickax. When Bruno notices her, he tells her to return to bed, but she demands to know the truth about what's going on. Finally, Bruno tells her that she did indeed murder Carlo after he beat and raped her. But she defended herself by gaping a utility razor and slashing him to death, before lapsing into some kind of coma. As he is in love with her, Bruno covered up the crime by pushing the dead man's boat out to sea to make it appear that he committed suicide by drowning, and then walled up the mutilated body in a false basement wall. It is for this reason that Bruno insisted that they return to the house for rather than someone discovering the body, he planed to use the time to dispose of it.But Bruno fails to realize that, by this point, Dora is completely out of her mind. She goes berserk and axes him to death, pushing his body into the same niche that hides the remains of her first husband. Soon after, Dora is assailed by a series of macabre hallucinations throughout the house by Marco who is using the power of the vengeful spirit of Carlos to use against her. In one of them, Marco runs towards his mother, only to transform into the ghastly corpse of Carlos. Dora retreats back to the basement where after seeing all the furniture in the house move toward her, she slashes her own neck with the same utility razor, imagining that Carlo's hands are controlling the blade.The next morning, Marco enters the basement where he moves his dead mother into the niche in the basement wall where his dead father and stepfather are, and walls it up himself. Marco then goes outside where he enjoys a cup of tea on the front lawn of the house with his unseen friend."
}