{
    "id": "0110942",
    "localized title": "Raja Babu",
    "cast": [
        "Govinda",
        "Karisma Kapoor",
        "Shakti Kapoor",
        "Kader Khan",
        "Aruna Irani",
        "Gulshan Grover",
        "Prem Chopra",
        "Sameer Khakhar",
        "Vikas Anand",
        "Arun Bakshi",
        "Beena Banerjee",
        "Javed Khan Amrohi",
        "Shashi Kiran",
        "Yunus Parvez",
        "Dina Pathak",
        "Kedarnath Saigal",
        "Mahavir Shah",
        "Sudhir",
        "Babbanlal Yadav"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Drama",
        "Romance"
    ],
    "runtimes": "161",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(Eastmancolor)",
    "certificates": [
        "India:U",
        "United Kingdom:PG"
    ],
    "original air date": "10 Jan 1994 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BZTQyMDBjMmMtMjdlYy00NjI4LWIwMDctMzU0YzcyM2NkNGU2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR7,0,101,150_.jpg",
    "imdbID": "0110942",
    "plot outline": "Raja Babu (Govinda) is a poor orphan adopted by a wealthy village couple (Kadar Khan and Aruna Irani). He is a typical country bumpkin, good-hearted but lacking in urban manners. He falls for Madhu (Karishma Kapoor) when he sees her photograph in a studio and chases her on his bike decorated with plastic flowers with his sidekick, played by Shakti Kapoor. Taken in by his smart appearance and impressive talks, she reciprocates his love but walks out on him with all villagers watching when she learns that he is no match to her urbane, well-educated self. It was particularly humilitating for his father as it happened in front of villagers who respected him highly. The movies takes several twists with a typical Bollywoodesque happy ending. Villains are nabbed by police but not before being beaten black and blue by the hero, boy gets his girl and parents are reunited with their son.",
    "languages": "Hindi",
    "title": "Raja Babu",
    "kind": "movie",
    "directors": "David Dhawan",
    "writers": [
        "Anees Bazmee",
        "",
        "Bhagyaraj",
        "",
        "Bhagyaraj"
    ],
    "producers": "Nandu G. Tolani",
    "composers": [
        "Anand Chitragupth",
        "Milind Chitragupth",
        "Amar Haldipur"
    ],
    "cinematographers": "Rajan Kinagi",
    "editors": "A. Muthu",
    "art directors": "R. Verman Shetty",
    "make up department": [
        "Raju Naag",
        "Pradeep Pemgirikar"
    ],
    "production managers": "Dilip Soni",
    "assistant directors": "A.K. Rana",
    "sound department": [
        "Jagmohan Anand",
        "Anup Dev",
        "Jassi Sokhi",
        "Kuldip Sood",
        "B.N. Tiwari",
        "Alok De"
    ],
    "visual effects": "Sanjay Naik",
    "stunts": "Mahendra Verma",
    "camera department": [
        "Harish Joshi",
        "Sureshchandra J. Yadav"
    ],
    "costume departmen": "Manikrao Jagtap",
    "music department": [
        "Abhijeet",
        "Anand",
        "Kavita Krishnamurthy",
        "Amar Mohile",
        "Jolly Mukherjee",
        "Udit Narayan",
        "Poornima",
        "Vinod Rathod",
        "Pradip Routray",
        "Sameer",
        "Kumar Sanu",
        "Sandeep Shirodkar",
        "Sushma Shreshta"
    ],
    "miscellaneous": [
        "Manoj Chaturvedi",
        "Pankaj Chaturvedi",
        "B.H. Tharun Kumar",
        "Ravi",
        "Gopaldas Tolani"
    ],
    "thanks": [
        "Pandav Brothers",
        "Dilip Bulchandani",
        "Harish Bulchandani",
        "Ratan Choudhury",
        "Narendra Kumar",
        "Viju Lakhani",
        "Daman Prakash",
        "Chanda Tolani",
        "Ashok Tulsiani"
    ],
    "akas": [
        "राजा बाबू (India, Hindi title)",
        "Раджа Бабу (Russia)"
    ],
    "writer": [
        "Anees Bazmee",
        "Bhagyaraj",
        "Bhagyaraj"
    ],
    "director": "David Dhawan",
    "production companies": "Sapna Arts",
    "distributors": "Ultra Media & Entertainment",
    "other companies": [
        "Anand Recording Studios",
        "Pandav Brothers"
    ],
    "plot": [
        "A man tries to become a better son after his intended bride rejects him and he learns he was adopted from a poor family.",
        "_Raja Babu_ (qv) (Govinda) is a poor orphan adopted by a wealthy village couple (Kadar Khan and Aruna Irani). He is a typical country bumpkin, good-hearted but lacking in urban manners. He falls for Madhu (Karishma Kapoor) when he sees her photograph in a studio and chases her on his bike decorated with plastic flowers with his sidekick, played by Shakti Kapoor. Taken in by his smart appearance and impressive talks, she reciprocates his love but walks out on him with all villagers watching when she learns that he is no match to her urbane, well-educated self. It was particularly humilitating for his father as it happened in front of villagers who respected him highly. The movies takes several twists with a typical Bollywoodesque happy ending. Villains are nabbed by police but not before being beaten black and blue by the hero, boy gets his girl and parents are reunited with their son.::gavin@sunny_deol2009@yahoo.com",
        "As an infant a young boy is adopted from a poor house-hold by a wealthy couple Kishan and his wife, Janki who christen the boy with the name Raja. Raja grows up to be the apple of his foster parents' eyes and is given as much liberty to prankster about the village with his side-kick, Nandu alias Veeru; he meets city-bred Madhubala only to fall in love with her. In order to impress her Raja decides to pose as a smart and handsome young man who eventually win the approval of Madhubala; when she goes to his house to arrange the marriage she gets to find out the reality of Raja who happens to be uneducated and according to her he stands no match for her. She then humiliates his parents among a huge gathering. An enraged Kishan decides to not only go against the relationship but arranges Raja's marriage elsewhere; when Raja learns of the doings of Madhubala he decides he will make something of himself by working so that he can get married only to her.::gavin (racktoo@hotmail.com)",
        "Raaja Babu is live a free care luxury lifestyle in his village with his parents Kishen and Janki.Janki is very possessive about him and cant take a word for him he is always accompanied by his servant come friend Nandu where ever he goes.Raja has a hobby of clicking photos in different professional get up at a village photo studio where he once sees photo of Madhu and falls in love with her and finally traces her.Madhu and Raja fall in love and decide to get married but when Madhu visits his house few days before the wedding she sees Raja's photos in different get and find from Nandu that Raja is uneducated and loves to click such photos.Madhu there itself breaks her marriage and insults his parents.But Raja still decides to marry her also finds that he is the adopted son of parents.Raja then decides to forget Madhu and starts to do all his household work believing he doesn't belong to all the luxury.Madhu realizes her mistake and decides to marry Raja.But he is no more interested in her and decides to marry a mentally disturbed girl.::alex.mjacko@gmail.com",
        "Kishan Singh lives a comfortable existence in a small town with his son, Raja, and wife, Janki. He had finalized Raja's marriage, when he still a child, with a young woman named Madhubala. Now when Raja and Madhubala are both grown up, Kishan goes to them to arrange their marriage. He is insulted and humiliated by city-bred Madhubala, who refuses to marry an ignorant illiterate like Raja. Enraged at this, Raja vows to make her his wife at any costs, and sets out to do so. After several misunderstandings and misadventures, he convinces her that they are suitable for each other. He returns home to give this news to his father, only to find out that his father has arranged his marriage with a senile young woman, and he will never permit Madhubala to become his daughter-in-law. Now Raja has a choice - give up his parents and marry Madhubala - or stay with his parents and marry a senile woman he does not love.::rAjOo (gunwanti@hotmail.com)"
    ]
}