{
    "id": "0157358",
    "localized title": "Barood",
    "cast": [
        "Rishi Kapoor",
        "Shoma Anand",
        "Reena Roy",
        "Ashok Kumar",
        "Ajit Khan",
        "Prem Chopra",
        "Madan Puri",
        "David Abraham",
        "Govardhan Asrani",
        "Birbal",
        "Azaad Irani",
        "Sujit Kumar",
        "Shreeram Lagoo",
        "Manmohan",
        "Raj Mehra",
        "Raju Shrestha",
        "Dharmendra",
        "Jullian",
        "Rajendranath Malhotra",
        "Hema Malini",
        "Asit Kumar Sen",
        "Om Shivpuri"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "140",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Mono",
    "certificates": "United States:Not Rated",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOWExMjAyMTQtMzA5Ny00ZDQ3LTljMWMtYWYxMzIzN2M1OWMwXkEyXkFqcGdeQXVyNjQ1MDcxNzM@._V1_SY150_CR4,0,101,150_.jpg",
    "imdbID": "0157358",
    "plot outline": "Young Anup Saxena lives a middle-classed lifestyle in Bombay along with his widower dad, Durgaprasad, who works as a Police Inspector. Anup's life is turned upside down when he witnesses four men assault and kill his father. He spends the rest of his childhood acquiring money and athletic ability to avenge his father's death - a decision that will take him to Las Vegas, New York, Geneva, Madrid and Paris - where he will find his life threatened by his father's assailants as well as a New York-based detective who is determined to arrest him at any and all costs.",
    "languages": "Hindi",
    "title": "Barood",
    "kind": "movie",
    "directors": "Pramod Chakravorty",
    "writers": [
        "Sachin Bhowmick",
        "",
        "Ehsan Rizvi"
    ],
    "producers": [
        "J.C. Bhagat",
        "H.S. Bhattacharya",
        "Jitu Thakar"
    ],
    "composers": "Sachin Dev Burman",
    "cinematographers": "V.K. Murthy",
    "editors": "Narendra Arora",
    "art directors": "Shanti Dass",
    "music department": [
        "Anand Bakshi",
        "Asha Bhosle",
        "Shivangi Kapoor",
        "Kishore Kumar",
        "Lata Mangeshkar",
        "Mukesh",
        "Sushma Shreshta"
    ],
    "akas": "Dynamite",
    "writer": [
        "Sachin Bhowmick",
        "Ehsan Rizvi"
    ],
    "director": "Pramod Chakravorty",
    "production companies": "Jugnu Enterprises",
    "distributors": "Esquire (Electronics) Ltd.",
    "plot": [
        "Young Anup Saxena lives a middle-classed lifestyle in Bombay along with his widower dad, Durgaprasad, who works as a Police Inspector. Anup's life is turned upside down when he witnesses four men assault and kill his father. He spends the rest of his childhood acquiring money and athletic ability to avenge his father's death - a decision that will take him to Las Vegas, New York, Geneva, Madrid and Paris - where he will find his life threatened by his father's assailants as well as a New York-based detective who is determined to arrest him at any and all costs.::rAjOo (gunwanti@hotmail.com)",
        "Bombay-based police inspector, Durgaprasad Saxena receives a medal for his honesty, long and dedicated services to the force. His tenure comes to an end when he is attacked, beaten and killed by four gangsters in the presence of his young son, Anup. Anup matures with this on his mind and years later travels to different foreign countries around the world to locate his dad's killers and cold-bloodily murder them. He finds life threatened as he target these murderers while private detective, Balraj Gupta shadows his every move and will not hesitate to prosecute him to the fullest extent of the law.::gavin (racktoo@hotmail.com)",
        "Inspector Durga Prasad Saxena is killed by four men Bakshi,Jagdish,Ratan and Prem his son Anup witness the murder and his only mission is to revenge his fathers death.Years later he kills one buy one who killed his father in different countries like Ratan in Las Vegas,Jagdish in Newyork and Prem in Geneva,he tries to woo Sapna assistant of Bakshi in order to get his details and kill him.Bakshi survives an attack and Anup comes under the scanner of detective Gupta whose investigating the case of his dead friends,Anup then kidnaps Bakshi's only daughter Seema an takes her to an island and asks Bakshi to follow his instructions but is frequently traced by Gupta.::alex.mjacko@gmail.com"
    ],
    "synopsis": "A eight-year-old boy is witness to his father, a reputed police officer, being murdered in broad daylight by four notorious smugglers on Juhu beach, Bombay, India,.Fourteen years later, the boy is now a champion motor cyclist and a breeder of Labradors. He, with the assistance of his pet Labrador Django, seeks revenge. In true Hollywood style, he beings to track down and eliminate the gang of smugglers. His endeavor leads to various places like Vegas, Madrid, Paris, Barcelona, and the coastal areas of Spain. A retired police detective is asked by another member of the gang who was not involved in the killings to investigate the series of murders. Along with him is the Mafia boss who heads the gang. The twosome are hell bent in their mission to stop him hammer the last nail in the coffin by killing the Mafia Boss, who incidentally is now a reputed vineyard owner cum wine manufacturer operating out of Madrid. The mafia boss incidentally has a lovely daughter who strips in true Core-de-Azur fashion to the delight of the Indian viewers. Little wonder that the hero falls for her.and all hells break loose. The climax is predictable, in the tradition of Indian mainstream masala hindi cinema."
}