{
    "id": "0355374",
    "localized title": "Dharma",
    "cast": [
        "Pran Sikand",
        "Navin Nischol",
        "Rekha Ganesan",
        "Ajit Khan",
        "Madan Puri",
        "Ramesh Deo",
        "Bindu Desai",
        "Mohan Choti",
        "Asit Kumar Sen",
        "Sonia Sahni",
        "Faryal",
        "Jayshree Talpade",
        "Anjali Kadam",
        "Chandrashekhar Vaidya",
        "Rajan Haksar",
        "Murad",
        "Paro",
        "Jagdish Bhalla",
        "Uma Dutt",
        "Master Mohit",
        "Master Chand",
        "Johnny",
        "Moolchand",
        "Jankidas",
        "Randhir",
        "Harbans Darshan M. Arora",
        "Helen"
    ],
    "genres": [
        "Action",
        "Comedy",
        "Crime",
        "Drama"
    ],
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color::(Eastmancolour)",
    "sound mix": "Mono",
    "certificates": "India:U",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOTM3YTc4YTAtMTY3MC00NzdmLTkwNmMtMWU5MDIzOWVmNTI2XkEyXkFqcGdeQXVyNDQwOTAzNw@@._V1_SY150_CR8,0,101,150_.jpg",
    "imdbID": "0355374",
    "plot outline": "Chandan Singh is a dacoit living with in isolation with his followers Bhairav Singh, Mangal Singh and his wife Parvati amongst others. The police, led by Inspector Ajit Singh are fast on the track of Chandan Singh, and soon catch up with him. Chandan Singh is betrayed by his follower Bhairav Singh, who is killed by Chandan Singh, after he attempts molest Parvati. Mangal Singh shields and protects the son of Bhairav, Chaman, and both swear vengeance against Chandan Singh. Meanwhile, while escaping from the police in a boat, Ajit Singh shoots at Chandan Singh and the shot hits Parvati, who falls into the water, and her son, Suraj plunges in after her. Chandan Singh too dives in after them, but is unable to find them. Chandan Singh takes revenge on Ajit Singh's family and abducts his daughter, Radha, and Ajit's wife, Asha gets killed accidentally. Years later Chandan Singh emerges as Dharma as well as Nawab Sikander, while Ajit Singh is now the Insepctor General of Police. Nawab Sikander goes to the prostitutions area and there finds Radha, who he recognizes and buys from the Madame, and brings her home, and asks Ajit Singh to be her father, to which he readily agrees as she looks just like his wife, Asha. Rajoo is a small time crook who works with Dharma, but has a change of heart when he falls in love with Radha, and swears to be a good person and through the guiding hands of his to-be father-in-law becomes a police inspector, and vows to arrest Chandan Singh. In the meantime, Mangal Singh, Chaman, and Chaman's girlfriend come upon Parvati, who lives in a temple. Chaman decides to impersonate himself as her son Suraj, and after successfully doing this he also manages to fool Dharma into believing that he is indeed their long lost son, vouched for by Mangal Singh. Will Dharma ever be apprehended by the authorities? Will Parvati ever meet her real son? What are the plans of Chaman and Mangal Singh?",
    "languages": "Hindi",
    "title": "Dharma",
    "kind": "movie",
    "directors": "Chand",
    "writers": "Chand",
    "producers": "S.K. Kapur",
    "composers": [
        "Manohar Lal Sonik",
        "Om Prakash Sonik"
    ],
    "assistant directors": "Prakash Jha",
    "sound department": "Harbans Singh",
    "music department": [
        "Asha Bhosle",
        "Verma Malik",
        "Mohammad Rafi",
        "Lata Mangeshkar",
        "Om Prakash Sonik"
    ],
    "writer": "Chand",
    "director": "Chand",
    "production companies": "Kapoor Films",
    "distributors": "Ultra Media & Entertainment",
    "plot": "Chandan Singh is a dacoit living with in isolation with his followers Bhairav Singh, Mangal Singh and his wife Parvati amongst others. The police, led by Inspector Ajit Singh are fast on the track of Chandan Singh, and soon catch up with him. Chandan Singh is betrayed by his follower Bhairav Singh, who is killed by Chandan Singh, after he attempts molest Parvati. Mangal Singh shields and protects the son of Bhairav, Chaman, and both swear vengeance against Chandan Singh. Meanwhile, while escaping from the police in a boat, Ajit Singh shoots at Chandan Singh and the shot hits Parvati, who falls into the water, and her son, Suraj plunges in after her. Chandan Singh too dives in after them, but is unable to find them. Chandan Singh takes revenge on Ajit Singh's family and abducts his daughter, Radha, and Ajit's wife, Asha gets killed accidentally. Years later Chandan Singh emerges as _Dharma_ (qv) as well as Nawab Sikander, while Ajit Singh is now the Insepctor General of Police. Nawab Sikander goes to the prostitutions area and there finds Radha, who he recognizes and buys from the Madame, and brings her home, and asks Ajit Singh to be her father, to which he readily agrees as she looks just like his wife, Asha. Rajoo is a small time crook who works with _Dharma_ (qv), but has a change of heart when he falls in love with Radha, and swears to be a good person and through the guiding hands of his to-be father-in-law becomes a police inspector, and vows to arrest Chandan Singh. In the meantime, Mangal Singh, Chaman, and Chaman's girlfriend come upon Parvati, who lives in a temple. Chaman decides to impersonate himself as her son Suraj, and after successfully doing this he also manages to fool _Dharma_ (qv) into believing that he is indeed their long lost son, vouched for by Mangal Singh. Will _Dharma_ (qv) ever be apprehended by the authorities? Will Parvati ever meet her real son? What are the plans of Chaman and Mangal Singh?::rAjOo (gunwanti@hotmail.com)"
}