{
    "id": "0406977",
    "localized title": "Masti",
    "cast": [
        "Ajay Devgn",
        "Vivek Oberoi",
        "Aftab Shivdasani",
        "Riteish Deshmukh",
        "Lara Dutta",
        "Amrita Rao",
        "Tara Sharma",
        "Genelia D'Souza",
        "Archana Puran Singh",
        "Satish Shah",
        "Suresh Menon",
        "Rakhi Sawant",
        "Shahbaaz Khan",
        "Divya Palat",
        "Seema Pandey",
        "Meenal Pendse",
        "Murali Sharma",
        "Aarti Damania",
        "Dinesh Lamba",
        "Disha",
        "Anoop Karan",
        "Mohit",
        "Adesh Bhardwaj",
        "Micky Mazumdar",
        "Sayyed Ilahabadi",
        "Melissa Pais",
        "Meru Vernekar",
        "Ekram Kashmiri"
    ],
    "genres": [
        "Comedy",
        "Crime",
        "Mystery",
        "Thriller"
    ],
    "runtimes": "166",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Germany:12",
        "India:A",
        "New Zealand:M",
        "Singapore:PG",
        "South Africa:PG",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)"
    ],
    "original air date": "09 Apr 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDkxNTUyYjUtZjNlYS00NmRiLWE4MTUtOWYwZjk1MmMzNTk2XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0406977",
    "plot outline": "A murder is committed in a town in India and the Police ask a senior policeman to deal with his matter. His name is Sikanker and he begins his investigations and after doing so, he finds that he has three suspects. Three men, who are all married, but have been involved in seducing a woman named Monica. The three men are Amar, Prem, and Meet, who all claim their innocence - but in Sikander's books - they are all guilty until they prove themselves innocent. How can they prove themselves innocent, when their very wives will refuse to speak up on their behalf?",
    "languages": "Hindi",
    "title": "Masti",
    "kind": "movie",
    "directors": "Indra Kumar",
    "writers": [
        "Milap Zaveri",
        "Tushar Hiranandani",
        "",
        "Milap Zaveri"
    ],
    "producers": [
        "Indra Kumar",
        "Ashok Thakeria"
    ],
    "composers": [
        "Anand Raj Anand",
        "Sanjay Wandrekar"
    ],
    "cinematographers": "Mazhar Kamran",
    "editors": "Sanjay Sankla",
    "art directors": "Omung Kumar",
    "costume designers": [
        "Theia Bomanbehran",
        "Anna Singh",
        "Theia Tekchandaney"
    ],
    "make up department": [
        "Sanjay Pardesi",
        "Nitin Shitole",
        "Harish Wadhone"
    ],
    "production managers": "Vikas Mehta",
    "assistant directors": [
        "Ved Prakash",
        "Hamza Rahim",
        "Mazahir Rahim",
        "Niraj Rathod"
    ],
    "art department": "Aabid Shaikh",
    "sound department": [
        "Sajjan Choudhary",
        "Alok De",
        "Amrit Pritam Dutta",
        "Vijay Kumar",
        "Ashish Manchanda",
        "Chiranjeevi Nanda",
        "Asad Shaikh",
        "Karnail Singh",
        "Subodh Kumar Singh"
    ],
    "visual effects": [
        "Vinay Singh Chuphal",
        "Manoj Gohil",
        "P. Mohan",
        "Prasad Sutar"
    ],
    "stunts": [
        "P. Kumar",
        "Pradyumna Kumar Swain",
        "R.P. Yadav"
    ],
    "camera department": [
        "Aniket Khandagale",
        "Mujahid Raza",
        "Rajendra Upadhyaya"
    ],
    "music department": [
        "Abhijeet",
        "Gayatri Iyer",
        "Udit Narayan",
        "Meghna Oberoi",
        "Sneha Pant",
        "Shaan"
    ],
    "miscellaneous": [
        "Ganesh Acharya",
        "Sanjeev Arora",
        "Ravi Botalje",
        "Murli Chhatwani",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Binny Padda",
        "Ravi Padda",
        "Akhil Rajendra"
    ],
    "akas": [
        "Fun (Canada, English title)",
        "Fun (United States)",
        "Отрываясь по полной... (Russia)"
    ],
    "writer": [
        "Milap Zaveri",
        "Tushar Hiranandani",
        "Milap Zaveri"
    ],
    "director": "Indra Kumar",
    "production companies": "Maruti International",
    "distributors": [
        "Panorama Studios",
        "Eros Worldwide",
        "EuroVideo",
        "Shemaroo Video Pvt. Ltd."
    ],
    "other companies": [
        "HR Enterprises",
        "Super Cassettes Industries Limited (T-Series)"
    ],
    "plot": [
        "Bored of their wives, best friends, Meet, Prem and Amar, reunite after three years and decide to have an affair - but instead become the prime suspects in a murder investigation.",
        "A murder is committed in a town in India and the Police ask a senior policeman to deal with his matter. His name is Sikanker and he begins his investigations and after doing so, he finds that he has three suspects. Three men, who are all married, but have been involved in seducing a woman named Monica. The three men are Amar, Prem, and Meet, who all claim their innocence - but in Sikander's books - they are all guilty until they prove themselves innocent. How can they prove themselves innocent, when their very wives will refuse to speak up on their behalf?::Sumitra (corrected by Carrie)",
        "Meet, Amar and Prem have been married for the last 3 years and bored of their quirky wives. So when they meet for the first time in three years, they decide to indulge in affairs and \"get some action\". They meet again after a month to compare notes, but discover each one of them has had a liaison with a wily woman Monica. She blackmails her into bringing her a lot of money or else she would inform their wives of their infidelity. The friends manage to get the money somehow, but the events soon escalate into a nightmare: the trio have to deal with a murder, a dead body, another blackmailer, and an extremely suspicious police officer named Inspector Sikandar while ensuring that not a word reaches their wives.::Soumitra",
        "Amar ,Prem and Meet are best friends having a joy life.But after their marriages life doesn't remain the same Amar's wife it to dominating Prem's is a religious which effects their sex life.While Meet's wife is over possessive about him.Bored with their life they decide to have an affair at first all three fail.All three successfully have an affair and to their blunder it's with the same women Monica who blackmails them for money or else she will expose their affairs to their respective wives.While the trio goes to do settlement with Monica they find her dead while another blackmailer asks them for money to keep Monica's death a secret.Insepctor Sikander believes them to be main suspects and checks on their every move.::alex.mjacko@gmail.com",
        "Marriage is supposed to be made in heaven. But, for three friends -- Meet, Amar and Prem -- it has become hell on earth. For Meet, whose name means \"lover\" in Hindi, marriage has crimped his \"cool stud\" lifestyle. His wife Aanchal makes sure he cools his heels at home. Prem's parents forced him to marry Geeta, a sweet, innocent and \"my husband-is-my-god\" kind of woman. She would rather press his feet than \"you know what.\" Amar is terrified of his wife Bindiya and her equally domineering mother, who lives with them. When these three buddies meet up after three years, their frustrations with marriage fuel their conversation. They decide the only way to spice up their lives is have as many affairs as possible for the next month. Then, they'll regroup and exchange notes. So, the rollicking process starts as the three men go looking for \"biryaani.\" With Inspector Sikander hot on their trial, they find themselves in one crazy situation after another as the film races to its hilarious climax.::Sujit R. Varma",
        "Meet three married men, Prem, Meet and Amar, who have been married for a few years, but already have the \"seven year itch\". They decide to be bachelors for a few days, and take advantage of their new-found freedom by flirting and having affairs with attractive young women. They do find three women, one who turns to be a transvestite; the second who wants to take photos of naked men for a commercial; and the third lifeless = dead. Before the hapless trio can stock of what has happened, they find themselves as prime suspects by a very suspicious Police Inspector Sikander, who has taken a personal dislike to them, and wants them to be in his custody, so he can work them over, in return for a confession; and of a black-mailer who has some very revealing photographs, for which he wants a hefty sum - a sum the trio can only obtain by stealing.::rAjOo (gunwanti@hotmail.com)"
    ]
}