{
    "id": "0408976",
    "localized title": "Krishna Cottage",
    "cast": [
        "Sohail Khan",
        "Isha Koppikar",
        "Anita Hassanandani Reddy",
        "Rati Agnihotri",
        "Hiten Tejwani",
        "Divya Palat",
        "Vrajesh Hirjee",
        "Raj Zutshi",
        "Shaukat Baig",
        "Bobby Bedi",
        "Shama Deshpande",
        "Madhavi Gogate",
        "Rajendra Gupta",
        "Ali Hassan",
        "Dinesh Kaushik",
        "Usha Nadkarni",
        "Jayant Rawal",
        "Jitendra Trehan"
    ],
    "genres": [
        "Horror",
        "Mystery"
    ],
    "runtimes": "124",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+::(Netflix self-rating)",
        "India:A",
        "Singapore:NC16",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "02 Apr 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYzZiYjkzODAtNmE0OS00ZTNkLWI0NjYtMTgzYzcxZWRmNWIxXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0408976",
    "plot outline": "During the year 1990 Professor-Author Siddharth Das releases his first book 'Kahi Unkahi Baatein' which contain a total of 10 short stories albeit with the last story 'Krishna Cottage' without any ending. A total of fifty thousand copies are printed and distributed to five different cities in India. Three trucks carrying these copies meet with mysterious accidents, two toppling off cliffs, and one catching fire; and one ship sinks losing it's entire consignment. One copy of this book is found and kept under lock and key in the store-room of J.C. College. Then in 2002 collegians Akshay, Kabir, Nupur, Pulit, Shanti, and Manav, induct new-comer, Disha, to their group, and also invite her to the engagement ceremony of Shanti and Manav. The group will soon find out that her induction will set loose a chain of events that will throw their lives in jeopardy as she may be a ferocious shape-changing entity that is out to claim her lover, Amar Khanna, from a past life, and also prevent anyone from reading the last chapter of Professor Das' book.",
    "languages": "Hindi",
    "title": "Krishna Cottage",
    "kind": "movie",
    "directors": "Santram Varma",
    "producers": [
        "Ekta Kapoor",
        "Shobha Kapoor",
        "Bantoo Khanna",
        "Vishal Mehra"
    ],
    "composers": "Anu Malik",
    "cinematographers": "Basheer Ali",
    "art directors": "Smita Gupta",
    "costume designers": "Shabinaa Khan",
    "make up department": "Raju Naag",
    "sound department": [
        "Jassi Sokhi",
        "Anchal Srivastava"
    ],
    "special effects": "Uday Wagh",
    "visual effects": [
        "Biju Dhanpalan",
        "Wilson Louis",
        "Amol Thakur",
        "Anirbandeep Dutta"
    ],
    "camera department": "Piyush Acharya",
    "costume departmen": [
        "Karim Baksh",
        "Shahjade Khan",
        "Manohar Sawant"
    ],
    "music department": [
        "Nivedita Basu",
        "Sunidhi Chauhan",
        "Shreya Ghoshal",
        "Neelesh Misra",
        "Kumar Sanu",
        "Shaan",
        "Vishal",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Abu Kumar Jain",
        "Pravin Solanki"
    ],
    "akas": "Кришна коттедж (Russia)",
    "director": "Santram Varma",
    "production companies": "Balaji Films",
    "plot": [
        "A group of collegians are forced to take shelter in a mysterious _Krishna Cottage_ (qv) for the night. Little do they know that the cottage is haunted by a spirit.",
        "During the year 1990 Professor-Author Siddharth Das releases his first book 'Kahi Unkahi Baatein' which contain a total of 10 short stories albeit with the last story '_Krishna Cottage_ (qv)' without any ending. A total of fifty thousand copies are printed and distributed to five different cities in India. Three trucks carrying these copies meet with mysterious accidents, two toppling off cliffs, and one catching fire; and one ship sinks losing it's entire consignment. One copy of this book is found and kept under lock and key in the store-room of J.C. College. Then in 2002 collegians Akshay, Kabir, Nupur, Pulit, Shanti, and Manav, induct new-comer, Disha, to their group, and also invite her to the engagement ceremony of Shanti and Manav. The group will soon find out that her induction will set loose a chain of events that will throw their lives in jeopardy as she may be a ferocious shape-changing entity that is out to claim her lover, Amar Khanna, from a past life, and also prevent anyone from reading the last chapter of Professor Das' book.::rAjOo (gunwanti@hotmail.com)",
        "Professor Siddharth Das launches his first story book titled \"Kahi Unkahi Baatein\" amounting to a total of 10 short stories with the last story being \"_Krishna Cottage_ (qv)\" a 22 year old love chemistry between a couple Amar Khanna and his beloved Disha and how they meet their drastic end. A story that does not have any ending; however this book spell destruction as no copy to date has met its destination. Never the less a copy is kept behind closed doors in J.C. College and manages to get into the hands of 6 collegians Akshay, Kabir, Nupur, Pulit, Shanti and Manav. Not knowing that these fellows lives are in great danger as Disha's soul has resurrect from the dead and is out to befriend them so that she can kill them with a motive of drawing Manav the look-alike of Amar into her dark world with no power on earth that can stop her from having her way.::gavin (racktoo@hotmail.com)",
        "Professor Siddharth Das launches his book Kahi Unkahi Baatein with 10 stories where the last story _Krishna Cottage_ (qv) is without the ending.The published books never reached anyone as the trucks carrying it either met with accident or caught fire.Many years later Manav and Shanti are college sweethearts a beautiful Disha enters the college and Manav feels attracted towards her.He saves her life on his day of engagement with Shanti.He tells Shanti thou he loves her has cold feelings for Disha.Shanti can't see Manav and Disha getting closer and goes to her house to scold her.She meets Disha's mother who tells her that she has passed 22 years back.::alex.mjacko@gmail.com",
        "_Krishna Cottage_ (qv) is the story of Manav and Shanti who attends the same college along with there friends Nupur and others. Manav and Shanti loves each other for a very long time and there love have blossom to engagement. On there engagement day a woman name Disha enter the college as a new student and decides to attend Shanti and Manav's engagement. Shanti suspects Disha that she was in love with Manav. Her doubt came through one day when she visits Disha's house and hears from Disha's mom that she had die twenty two years ago, she along with a man called Amar who was Disha's previous love in her lifetime was said to be in resemblance with Manav, Shanti's love. Disha is a spirit and Disha uses her spirit powers in order to kill Nupur and Tali, two members from there group. But Manav only love Shanti and has no feelings for Disha, the spirit, so on Shanti's and Manav's wedding day Disha's spirit try to harm Shanti. But Manav didn't allow such things to happen since he kills and surrenders himself to Disha for the sake of Shanti. But he can be alive again and well since he had to go to a place called \"_Krishna Cottage_ (qv)\" and remove all evidences of Disha and Amar.::hEmRaJ (gavin_coolhgr@hotmail.com)"
    ]
}