{
    "id": "0414040",
    "localized title": "Gayab",
    "cast": [
        "Tusshar Kapoor",
        "Antara Mali",
        "Raghuvir Yadav",
        "Rasika Joshi",
        "Ikhlaq Khan",
        "Govind Namdeo",
        "Natasha",
        "Rajendra Sethi",
        "Raman Trikha",
        "Puneet Vashisht"
    ],
    "genres": [
        "Drama",
        "Fantasy",
        "Thriller"
    ],
    "runtimes": "138",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "India:U",
        "New Zealand:M",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)"
    ],
    "original air date": "16 Jul 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BOGZlMzU1NTMtMzk3MS00Y2E5LWE0NTItNDAzYzdkNTk5ZThlXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0414040",
    "plot outline": "A very honest, simple and prestigious young man named Vishnu lives with his parents in a Bombay city slum. Everyone including his parents and people around his neighborhood hates his site because of the way he looks, he makes his living by working as a sales man but due to the lack of confidence and education his status could not be raise. He is quite shy and spend most of the time by himself. Then one day he spots a young woman named Mohini and is attracted to her at that very moment, he keeps on staring at her most of the time and sometimes blushes by himself. A young man named Sameer later marry Mohini and is settled with her. Enraged and fed up of life at this stage Vishnu prays everyday to god so that he can be an invisible person. One day his wish came through and he decides to territorialize and punish his perpetrators namely his parents and Mohini and her husband. He gets into the bad books of the police when he attempts to rob a bank but soon the police comes to know that there culprit is invisible and that he only territorialize Mohini. So they need Mohini's help in order to apprehend Vishnu but Mohini persuades Vishnu to go away from there lives before the police could apprehend him and he agrees to do so.",
    "languages": "Hindi",
    "title": "Gayab",
    "kind": "movie",
    "directors": "Prawaal Raman",
    "producers": "Ram Gopal Varma",
    "composers": [
        "Ajay",
        "Ajay-Atul",
        "Amar Mohile"
    ],
    "cinematographers": "Pietro Zuercher",
    "editorial department": [
        "Rohan Desai",
        "Shakti Hasija",
        "Srinivas Mamidi",
        "Vikram Parmar"
    ],
    "costume designers": "Reza Shariffi",
    "make up department": [
        "Narendra Jethwa",
        "Devdas Gupta Raju"
    ],
    "production managers": [
        "Kandagatla Bhaskar",
        "Sada Bhuvad",
        "Shirish Gathe",
        "Amish Thakore",
        "Rameshchandra Yadav"
    ],
    "assistant directors": [
        "Binoy Gandhi",
        "Kanishk Gangwal",
        "Aneel Laxman Ganji",
        "Ranjeet Jha",
        "Moin Khan",
        "Babar Rao"
    ],
    "sound department": [
        "Madhu Apsara",
        "Vijay Kumar",
        "Kunal Mehta",
        "Ajay Kumar P.B.",
        "Karnail Singh",
        "Anchal Srivastava",
        "Jayant Vajpayee",
        "Dwarak Warrier"
    ],
    "special effects": "Rana Shyamlal",
    "visual effects": [
        "Arumugam Aravindan",
        "Mahesh Baria",
        "Keith Gomes",
        "Ketan Kale",
        "Sandeep Kamal",
        "Shaan Kathau",
        "Huzefa Lokhandwala",
        "Sheel Nimbalkar",
        "Tushar Shah",
        "Arup Sinha"
    ],
    "stunts": "Late Shahid Parwez",
    "camera department": [
        "Arjun Singh Bhurji",
        "Dharmendra Bhurji"
    ],
    "music department": [
        "Sunidhi Chauhan",
        "David Dominique",
        "Kunal Ganjawala",
        "Zubeen Garg",
        "Sonu Nigam",
        "Shweta Pandit",
        "Vinod Rathod",
        "Tabees Romani"
    ],
    "miscellaneous": [
        "Amit J. Chaudhary",
        "Vinay Chaukar",
        "Sanjay Mehta"
    ],
    "akas": "Человек-невидимка (Russia)",
    "director": "Prawaal Raman",
    "production companies": [
        "K Sera Sera",
        "Varma Corporation"
    ],
    "special effects companies": "Prime Focus",
    "plot": [
        "A neglected young man wishes to be invisible and the wish comes true. However in an attempt to get his ladylove, he gets in the bad books of police who wants him dead.",
        "A very honest, simple and prestigious young man named Vishnu lives with his parents in a Bombay city slum. Everyone including his parents and people around his neighborhood hates his site because of the way he looks, he makes his living by working as a sales man but due to the lack of confidence and education his status could not be raise. He is quite shy and spend most of the time by himself. Then one day he spots a young woman named Mohini and is attracted to her at that very moment, he keeps on staring at her most of the time and sometimes blushes by himself. A young man named Sameer later marry Mohini and is settled with her. Enraged and fed up of life at this stage Vishnu prays everyday to god so that he can be an invisible person. One day his wish came through and he decides to territorialize and punish his perpetrators namely his parents and Mohini and her husband. He gets into the bad books of the police when he attempts to rob a bank but soon the police comes to know that there culprit is invisible and that he only territorialize Mohini. So they need Mohini's help in order to apprehend Vishnu but Mohini persuades Vishnu to go away from there lives before the police could apprehend him and he agrees to do so.::hEmRaJ (gavin_coolhgr@hotmail.com)",
        "Vishnu Prasad Singh lives with his parents and is employed as a salesman; he is always ignored and demean by other people due to the old-fashion way he dresses and his attitude of keeping to himself - while at home his mother leave no stone upturn in nagging and physically abusing him while in the neighborhood the boys teases him. The only bright spot in Vishnu's life is his next door neighbor, Mohini the girl he love with all his heart but unfortunately she give her heart to U.S. return, Sameer while Vishnu continues to stay in his dream world by admiring her on the sly. To worsen matter on one occasion Sameer physically assault Vishnu; fed up of life Vishnu plead with the almighty to make him invisible and to his shock the next moment his wish comes through. Not so happy with being invisible at first Vishnu starts to rue over destiny until he find the right use of it by attempting to make right for himself by physically harassing the people who used to taunt him while he was visible - his main targets are Sameer and his very own mother. His exercise gets out of control forcing the lawmen to intervene by creating a situation using Mohini as the medium so that they can easily shoot him.::gavin (racktoo@hotmail.com)",
        "Vishnu Prasad Singh lives a middle-class life with his dad, Balwant, and mom. He is generally ignored by his dad, pestered and abused by his mom. He works as a salesman, but due to his lack of confidence in himself, he is unable to accomplish much. To make matters worse, the boys in the neighborhood make fun of him all the time. This compounds his shyness and timidity all the more. The one bright spot in his life is a young woman named Mohini, who he is attracted to and keeps on staring at her on the sly. Then a young man named Sameer, from the U.S., enters Mohini's life, bursting yet another bubble in Vishnu's dreamworld. Fed-up, he prays with all his heart that since no one really notices him, he would be better off invisible - and his wish comes true. Alarmed at first, then delighted with his new powers and gift, he goes about trying to make things right for himself, and avenging himself against those who had wronged him, including his mom and Sameer. He gets so caught up in this that one thing leads to another, and soon he is living a life of crime. When the police find out that their culprit is invisible and has a crush on Mohini, they use her to entrap him. The question is does Mohini have any feelings for Vishnu or will she fully cooperate in entrapping Vishnu to the police - who have been ordered to shoot-to-kill.::rAjOo (gunwanti@hotmail.com)"
    ]
}