{
    "id": "0416120",
    "localized title": "Police Force: An Inside Story",
    "cast": [
        "Akshay Kumar",
        "Raveena Tandon",
        "Amrish Puri",
        "Mohan Joshi",
        "Govind Namdeo",
        "Alok Nath",
        "S.M. Zaheer",
        "Raj Babbar",
        "Ashalata Wabgaonkar",
        "Achyut Potdar",
        "Jaspal Sandhu",
        "Vinay Apte",
        "Rami Reddy"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama"
    ],
    "runtimes": "138",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "India:A",
        "United Kingdom:15",
        "United States:Not Rated"
    ],
    "original air date": "28 May 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMDQxMWVlODktMGZlOC00YTc4LWI0NzYtNDFmNDZiODIwMzUzXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0416120",
    "plot outline": "Senior police officer Pandey is called in to train a new batch of trainee officers that the Indian police force wants to recruit. He does manages to induct some sense of fair-play in these officers and gets them assign to their place of duty; but these officers will find that there real life scenario are different and must deal with the world at large consisting of corrupt high-ranking police officers, dishonest politicians and gangsters. How they deal with them will shape their destinies.",
    "languages": "Hindi",
    "title": "Police Force: An Inside Story",
    "kind": "movie",
    "directors": "Dilip Shukla",
    "writers": "Dilip Shukla",
    "producers": [
        "Hardesh Gupta",
        "Kulbhushan Gupta"
    ],
    "composers": [
        "Anand Chitragupth",
        "Milind Chitragupth"
    ],
    "cinematographers": "Pramod Pathak",
    "editors": "A.R. Rajendran",
    "production managers": "Anant Kumar Gupta",
    "assistant directors": [
        "Taraknath Mourya",
        "Dheeraj Rattan"
    ],
    "sound department": "Prakash Gupta",
    "visual effects": "Avik Banerjee",
    "stunts": "James Barla",
    "music department": [
        "Abhijeet",
        "Shreya Ghoshal",
        "Sonu Nigam",
        "Poornima",
        "Vinod Rathod",
        "Sameer",
        "Sadhana Sargam",
        "Richa Sharma",
        "Alka Yagnik"
    ],
    "akas": "Полицейская история (Russia)",
    "writer": "Dilip Shukla",
    "director": "Dilip Shukla",
    "production companies": "K.B. Productions",
    "other companies": "Glamsham.com",
    "plot": [
        "Senior police officer Pandey is called in to train a new batch of trainee officers that the Indian police force wants to recruit. He does manages to induct some sense of fair-play in these officers and gets them assign to their place of duty; but these officers will find that there real life scenario are different and must deal with the world at large consisting of corrupt high-ranking police officers, dishonest politicians and gangsters. How they deal with them will shape their destinies.::gavin (racktoo@hotmail.com)",
        "Police Academy trainer, Pandey, has been assigned to train some new recruits who are likely candidates in senior positions of India's Police Force. He does his best to train them, and get them assigned to their duties. What he is unable to teach them is about dishonest police officers, especially high-ranking ones; equally dishonest politicians, who have open links with gangsters and terrorists. These young men must now decide to carry on and compromise with this situation, or become rebels and ultimately lose their jobs.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "Police Force an Inside Story is based on the popular book written by IPS officer Y. P. Singh and it effectively brings out the quarrels and gamesmanship between the honest police officers willing to lay down their life in service of their country and corrupt officers who are looking only for their self-enrichment, power and money.Trainee police officer Vijay (Akshay Kumar) is a middle class small town man who gets sucked into the political system where leaders have turned the battle of ballot into exploitation, opportunism for self benefit and to deprive the country of its true, selfless & sacrificing leaders.Ratan Sethi (Raj Babbar) is a politician who subverts the political system. As a senior police officer, Mr. Bhonsle (Mohan Joshi) runs a virtual mafia operation for politicians and friends from inside the department. But honest senior officer Mr. Pandey (Amrish Puri) trains the young officers with dedication, seeing to it that they imbibe values of truth and honesty and emphasizing with them to lay down their lives in service of their motherland. He tells the officer that they are the lucky few who have got the opportunity to serve their motherland. In his fight against the enemies of the country, he gets trapped into Mr. Bhosles web and Mr. Pandey has to put all his experience and contacts to save his cadets life and career. Pandey and Vijay join hands together to free their motherland from the evil forces and clean up the corruption, exploitation, gundaism from our society."
}