{
    "id": "0418362",
    "localized title": "Mujhse Shaadi Karogi",
    "cast": [
        "Salman Khan",
        "Akshay Kumar",
        "Priyanka Chopra Jonas",
        "Amrish Puri",
        "Rajpal Naurang Yadav",
        "Satish Shah",
        "Supriya Karnik",
        "Kader Khan",
        "Rekha Rao",
        "Shashikala",
        "Upasna Singh",
        "Amrita Arora",
        "Dinyar Contractor",
        "Parth Dave",
        "Kurush Deboo",
        "Kapil Dev",
        "Mushtaq Khan",
        "Prasoon Narayan",
        "Shefali Zariwala",
        "Mohammad Kaif",
        "Ashish Nehra",
        "Parthiv Ajay Patel",
        "Irfan Pathan",
        "Navjot Singh Sidhu",
        "Harbhajan Singh",
        "Javagal Srinath"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "163",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Brazil:12",
        "Germany:6",
        "India:UA",
        "Malaysia:U",
        "Norway:A::(iTunes rating)",
        "Singapore:PG",
        "South Korea:15",
        "United Kingdom:PG"
    ],
    "original air date": "30 Jul 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTg3N2YyZDAtY2QyNy00MDYzLTliYzctZTVkZTE2NzY0NDU4XkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0418362",
    "plot outline": "Sunny rents a room in a City called Goa in India. His room-mate is Sameer, who likes to fool around with woman, then dump them. He eventually falls in love, then gets dumped. Sorrowful and repentant, Sameer also has had many misadventures, especially when he ended up slapping an elderly man. Now Sameer has fallen for his next door neighbor, Rani. Now Sameer has two problems to overcome in order to wed Rani. The first he has to eliminate his competitor, none other than Sunny himself, who is also in love with Rani, and will do anything to marry her; and the second is Rani's father, ironically the very man who Sameer had slapped earlier. Will Sunny end up getting married to Rani, leaving Sameer to repent for the rest of his life?",
    "languages": "Hindi",
    "title": "Mujhse Shaadi Karogi",
    "kind": "movie",
    "directors": "David Dhawan",
    "writers": [
        "Anees Bazmee",
        "",
        "Rumi Jaffery"
    ],
    "producers": [
        "Shabuddin Choudhary",
        "Sajid Nadiadwala"
    ],
    "composers": [
        "Sajid Ali",
        "Salim Merchant"
    ],
    "cinematographers": "Sanjay F. Gupta",
    "editors": [
        "Reupal D. Rawal",
        "Nitin Rokade"
    ],
    "editorial department": [
        "Rupa Shukla Ahire",
        "Srinivas Mamidi"
    ],
    "production designers": "Sabir Khan",
    "art directors": "Sharmishta Roy",
    "costume designers": "Vikram Phadnis",
    "make up department": [
        "Narendra Jethwa",
        "Manoj Limbachia",
        "Joyce Luize",
        "Suresh Mohanty",
        "Raju Naag",
        "Pradeep Pemgirikar"
    ],
    "assistant directors": [
        "Sabir Khan",
        "A.K. Rana",
        "Munesh Rawat",
        "Mahendra Verma"
    ],
    "art department": [
        "Braj Bhushan",
        "Mohammed Kasim"
    ],
    "sound department": [
        "Pallikonda Adrushta Deepak",
        "Jitendra Chaudhary",
        "Javed Khan",
        "Parikshit Lalwani",
        "Kunal Mehta",
        "Kuldip Sood",
        "Anchal Srivastava",
        "Vinay Upadhyay",
        "Jayant Vajpayee"
    ],
    "special effects": "Babu Tyagi",
    "visual effects": [
        "Arumugam Aravindan",
        "Mahesh Baria",
        "Goolzar Buchia",
        "Vivek Gaur",
        "Rohinton Irani",
        "Ketan Kale",
        "Sandeep Kamal",
        "Jignesh Patel",
        "Susheel Peris",
        "Reupal D. Rawal",
        "Tushar Shah",
        "Arup Sinha",
        "Merzin Tavaria"
    ],
    "stunts": "Abbas Ali Moghul",
    "camera department": [
        "Piyush Acharya",
        "Avinash Gowarikar",
        "Pramod Khandale",
        "Pradip Mishra",
        "Prameelkumar"
    ],
    "music department": [
        "Pallikonda Adrushta Deepak",
        "Arun Bhairav",
        "Sunidhi Chauhan",
        "Abhijit Deo",
        "John Stewart Eduri",
        "Anu Malik",
        "Ashish Manchanda",
        "Udit Narayan",
        "Sonu Nigam",
        "Shabaab Sabri",
        "Sameer",
        "Jalees Sherwani",
        "Sandeep Shirodkar",
        "Sukhwinder Singh",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Ganesh Acharya",
        "Ramjanam Dubey",
        "Prem Chandra Jha",
        "Nitin Keni",
        "Farah Khan",
        "Javed Khan",
        "Noor Jumma Khan",
        "Himanshu Nanda",
        "Rahul Nanda",
        "Binny Padda",
        "Ravi Padda",
        "Ravindra Passi",
        "Imran Pathan",
        "Vinay Rajput",
        "Prakash Upadhyay"
    ],
    "thanks": [
        "Kapil Dev",
        "Mohammad Kaif",
        "Atul Kasbekar",
        "Sajid Khan",
        "Anu Malik",
        "Ashish Nehra",
        "Parthiv Ajay Patel",
        "Irfan Pathan",
        "Navjot Singh Sidhu",
        "Harbhajan Singh",
        "Javagal Srinath"
    ],
    "akas": [
        "Will You Marry Me? (World-wide, English title)",
        "Will You Marry Me? (United States)",
        "Will You Marry Me (Canada, English title)",
        "Zwei Herzen für Rani (Germany)",
        "Kẻ Nóng Tính (Vietnam)"
    ],
    "writer": [
        "Anees Bazmee",
        "Rumi Jaffery"
    ],
    "director": "David Dhawan",
    "production companies": "Nadiadwala Grandsons'",
    "distributors": [
        "Nittin Keni Creations",
        "Splendid Film",
        "Zee Networks"
    ],
    "other companies": [
        "Empire Audio Center Pvt. Ltd.",
        "Prime Focus"
    ],
    "plot": [
        "Sameer, fast at losing his temper is re-located to Goa where he falls in love with Rani. But Sameer's new roommate Sunny, has some plans of his own.",
        "Sunny rents a room in a City called Goa in India. His room-mate is Sameer, who likes to fool around with woman, then dump them. He eventually falls in love, then gets dumped. Sorrowful and repentant, Sameer also has had many misadventures, especially when he ended up slapping an elderly man. Now Sameer has fallen for his next door neighbor, Rani. Now Sameer has two problems to overcome in order to wed Rani. The first he has to eliminate his competitor, none other than Sunny himself, who is also in love with Rani, and will do anything to marry her; and the second is Rani's father, ironically the very man who Sameer had slapped earlier. Will Sunny end up getting married to Rani, leaving Sameer to repent for the rest of his life?::Sumitra (corrected by Calista)",
        "Sameer is a hot-headed youngsters with a knack of getting into brawls. When his girlfriend dumps him, he is heartbroken and relocates to Goa to work as a lifeguard. He falls for his next-door neighbour Rani, but Rani dislikes him because Sameer had slapped her father by mistake. On top of it, Sameer's new roommate Sunny is a lecherous playboy who has the hots for Rani. This results into a zany battle of wits between Sameer and Sunny over who will win Rani's heart .::Soumitra",
        "Sameer, fast at losing his temper is re-located to Goa in India. Where he rents a room, he likes to fool around with woman, then dump them. He eventually falls in love, then gets dumped. Sorrowful and repentant, Sameer also has had many misadventures, especially when he ended up slapping an elderly man. One day suddenly Sunny appears and became Sameer's room-mate. Now Sameer has fallen head over heels in love with his next door neighbor, Rani. Now Sameer has two problems to overcome in order to wed Rani. The first he has to eliminate his competitor, none other than Sunny himself, who is also in love with Rani, and will do anything to marry her; and the second is Rani's father, ironically the very man who Sameer had slapped earlier. A battle prevails between the two young men at this stage and the winner will have Rani's hand in marriage.::gavin@sunny_deol2009@yahoo.com",
        "Hot-headed at a very young age, Sameer, has now matured but has not changed his ways. He has had many misadventures in life and now relocates to Goa at Mr. Duggal's house, while residing there he meets and falls in love with his next door neighbor, Rani but her father, Colonel Dugraj Singh does not approve of him since he is slapped by Sameer in public. To make matters worse for Sameer he has got a new room-mate, Sunny who creates more misunderstandings between Sameer and Dugraj and Rani herself begins to hate Sameer. While Sameer loves Rani truly, Sunny is just a misunderstanding between both. What will be the outcome of Sameer's love for Rani? How will he get rid of all obstacles in his life and be able to web Rani?::gAvInDrA (brave_loverboy2004@hotmail.com)",
        "A Pandit predicts that Sameer Malhotra will grow up to be a very violent child; fast at losing tempers. This prediction does comes to light when Sameer starts to get himself involved in fights and brawls which force him to migrate taking up a supervisor work at sea. Sameer now take up resident by renting the room of Mr. Duggal; Sameer falls in love with his neighbor's retired Colonel Dugraj Singh's daughter, Rani. He finds his life turn up-side down when his room is shared by Sunny who is also attracted to Rani.::gavin (racktoo@hotmail.com)",
        "Sameer is short temper guy who looses his temper very early because of which his girlfriend ditches him and marries another guy,he travels to Goa in search of work and starts living as a tenant in house of Duggal Sahab who daily has different disabilities.Sameer comes across a beautiful Rani but is already in her bad books for slapping her father Colonel Jugraj Singh for negligence in driving ,Sameer falls in love with Rani and convinces her to forgive him and express's his love.Things are going well for Sameer but his astrologer predicts that whatever troubles he faced recently was just a start and worst his yet to come.There arrives Sunny who starts to live in house of Duggal Sahab sharing room with Sameer he befriends Colonel and his family and comes in their good books and also tries to snatch Rani away from Sameer.::alex.mjacko@gmail.com"
    ],
    "synopsis": "Sameer (Salman Khan) is ill-tempered, with anger-management issues since his parents died during his childhood. When he beats up a group of goons who tried to assault his girlfriend Roma (Amrita Arora), she breaks up with him because of his temper. According to his horoscope, Sameer is unlucky in love. To escape further similar issues, he becomes a lifeguard in Goa.On the train Sameer meets Suraj Prakash (Satish Shah), who makes him think that he is a thief by asking him where he keeps important things (like money) in his luggage. Sameer stays awake all night to avoid being robbed, while Suraj sleeps after conning Sameer into guarding his luggage. Suraj admits this to Sameer the next morning at the station. Sameer learns that Suraj is a security guard at his resort, and puts him on night guard duty for three months. This puts a crimp in Suraj's marriage and, although he apologizes, Sameer is adamant.Sameer meets Rani (Priyanka Chopra), an up-and-coming fashion designer, and falls in love with her. After a rough start with her father Jugraj Singh (Amrish Puri), a former colonel, Rani and Sameer become friends. Sameer's bad luck comes into play; he disagrees with Singh, and Rani becomes angry with him when she overhears him saying bad things about her to Pandit Raj Purohit Jyotshi (Rajpal Yadav).Trouble arrives in the form of Sunny (Akshay Kumar), who shares a room with Sameer. He meets Rani, falls in love with her and decides to capitalize on Sameer's mistakes. This causes friction between the roommates. Sameer gives Rani the money she needs for a fashion competition, calling himself her \"well-wisher\". Rani wins the competition, and wants to thank her \"well-wisher\" in person. Sameer (who gave Rani the money he had saved for his grandmother's eye surgery and his sister's wedding) goes to meet her but Sunny gets there first, claims to be the well-wisher and takes her away. Sameer follows on his motorcycle, and accidentally injures Singh (Rani's father). Sunny, who takes credit for a painting of Rani by Sameer, kidnaps her dog Tommy and frames Sameer. Sameer buys an identical dog, and tells Singh that he has found Tommy. He is unmasked when the dog bites Singh and runs away.Although Sameer is angry, he reconciles with Rani with the help of a magician at a New Year's Eve party. Sunny places a bar dancer in Sameer's room one morning; Rani, who went there to invite him for breakfast, sees the dancer sleeping there and assumes that they had sex.Sameer makes another attempt to apologize. When he goes to Rani's house, he is surprised to see Suraj; Suraj is Rani's uncle, who now knows that he loves her. Sameer apologizes, and takes Suraj off night duty. Sameer's partially-blind grandmother mistakes Rani's mother for Rani and tries to persuade her to marry Sameer. Rani's mother tells her daughter to carefully consider whom she loves more: Sameer or Sunny.Sameer decides to leave Goa, and Sunny taunts him that he got close to Rani through Sameer's mistakes. Sameer says that he has had enough dreaming, and wishes Sunny happiness. Sunny taunts Sameer again, and Sameer loses his temper. He chases Sunny through the crowd at a cricket stadium where India and Pakistan are playing a friendly match. Sameer breaks through security, takes the microphone from guest of honor Kapil Dev and apologizes to Rani and her parents. He asks her to marry him in front of the crowd, and Rani runs onto the field and embraces him, thus reuniting with him.Sunny reveals that he is Arun, Sameer's childhood friend who came to Goa to cure Sameer's anger-management issues. He also reveals that he went to visit Sameer after returning from America after 19 years and met Sameer's grandmother, who told him about Sameer's heartbreak and departure for Goa. Arun decided to help Sameer by posing as his enemy, telling Rani and her parents earlier. Sameer is reunited with Arun, who conducts his and Rani's wedding."
}