{
    "id": "0422320",
    "localized title": "Ghilli",
    "cast": [
        "Joseph Vijay",
        "Trisha Krishnan",
        "Prakash Raj",
        "Ashish Vidyarthi",
        "Janaki Sabesh",
        "Nagendra Prasad",
        "Tanikella Bharani",
        "Dhamu",
        "Baby Jeniffer",
        "Brahmanandam",
        "Mayilsamy",
        "'Nandha' Saravanan",
        "Saai Sundar",
        "Murugadass",
        "Karate Raja",
        "Pandi",
        "Vimal",
        "Appukutty",
        "Chaplin Balu",
        "Mozammel Hoshen Chowdhury",
        "Vijay Sethupathi"
    ],
    "genres": [
        "Action",
        "Drama",
        "Romance",
        "Sport"
    ],
    "runtimes": "160",
    "countries": "India",
    "country codes": "in",
    "language codes": "ta",
    "color info": "Color",
    "certificates": [
        "Canada:G::(Quebec)",
        "India:UA",
        "New Zealand:M",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "17 Apr 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2MyOTA2MjUtZmI5Ny00MmU0LTk4ZTUtYmU1ZDA1NTBkODRjXkEyXkFqcGdeQXVyOTA3MTc1OTg@._V1_SY150_CR5,0,101,150_.jpg",
    "imdbID": "0422320",
    "plot outline": "Muthu Pandi, a village strongman, decides to marry his niece Dhanalakshmi, and begins his quest by eliminating everyone who opposes their union - starting with both her brothers. In desperation, Dhanalakshmi decides to escape from the village, and in the process is unwittingly assisted by a university Kabaddi player Velu.",
    "languages": "Tamil",
    "title": "Ghilli",
    "kind": "movie",
    "directors": "Dharani",
    "writers": [
        "Bharathan",
        "",
        "Dharani",
        "",
        "Gunasekhar"
    ],
    "producers": "A.M. Rathnam",
    "composers": "Vidyasagar",
    "cinematographers": "S. Gopinath",
    "editors": "V.T. Vijayan",
    "sound department": [
        "Alagiakoothan",
        "Ajith Abraham George"
    ],
    "visual effects": [
        "Ramesh Karthikeyan",
        "Thirumurugan Krishnan",
        "Srinivas Mohan",
        "Caarthick Raju",
        "Stalin Saravanan",
        "Andrew Shibi",
        "Narasimhan Srinivasan",
        "Srirengaraj"
    ],
    "akas": "Смельчак (Russia)",
    "writer": [
        "Bharathan",
        "Dharani",
        "Gunasekhar"
    ],
    "director": "Dharani",
    "production companies": "Sri Surya Films",
    "distributors": [
        "Ayngaran International",
        "Amazon Prime Video",
        "Sun TV"
    ],
    "special effects": "Indian Artists Computer Graphics",
    "other companies": [
        "AP International",
        "Five Star"
    ],
    "plot": [
        "Velu, an aspiring kabaddi player, goes to Madurai to participate in a regional match, where he rescues Dhanalakshmi from Muthupandi, a powerful man keen on marrying the girl against her will.",
        "Muthu Pandi, a village strongman, decides to marry his niece Dhanalakshmi, and begins his quest by eliminating everyone who opposes their union - starting with both her brothers. In desperation, Dhanalakshmi decides to escape from the village, and in the process is unwittingly assisted by a university Kabaddi player Velu.::Joyojeet Pal"
    ],
    "synopsis": "Saravanavelu alias Velu (Vijay) is a state-level kabaddi player who is the son of Chennai's Assistant Commissioner of Police Sivasubramanian (Ashish Vidyarthi). Sivasubramanian is not fond of his son, constantly chiding him for his lack of interest in studies and his love for kabaddi. In contrast, his mother (Janaki Sabesh) dotes on him, and his younger sister Bhuvana (Nancy Jennifer), a sharp and inquisitive schoolgirl, constantly gets Velu into trouble with their father, but nevertheless adores him.Meanwhile, in Madurai, there is a ruthless factionalist leader Muthupandi (Prakash Raj), who lusts after Dhanalakshmi (Trisha) and would do anything to marry her. Muthupandi kills Dhanalakshmi's first elder brother as he rejects his offer to marry her. Then Dhanalakshmi's second elder brother is also killed by Muthupandi when he tries to avenge his brother's murder. Dhanalakshmi's father (Vinod Raj) is a meek person who gets horrified by Muthupandi's acts and asks Dhanalakshmi to leave Madurai and lead a peaceful life at her uncle's place in the United States by giving her the necessary certificates and money. Muthupandi catches her when she starts fleeing, because by coincidence, she gets into one of the lorries owned by him. At this juncture, Velu, who is in Madurai to play in a kabaddi tournament, rescues Dhanalakshmi and takes her to Chennai.Velu takes Dhanalakshmi to his house and hides her in his room, unknown to his family. With the help of his friends, he arranges passport, visa, and flight tickets for Dhanalakshmi so that she can go to the US. Meanwhile, Muthupandi and his father (Tanikella Bharani), who is the Home Minister, ask Sivasubramanian to search for Dhanalakshmi and the apparent kidnapper. When Sivasubramanian discovers that it is his own son who did the \"crime\", Velu and Dhanalakshmi run away and hide in the lighthouse. Dhanalakshmi has by now fallen in love with Velu, and has been accepted by his mother and sister. So she is reluctant to go to the US. Velu however, is adamant on sending her to the US, and he, along with his friends, get her to the airport in time for her flight before their kabaddi match against Punjab in the final of the National League.Sivasubramanian, enraged that his son is a wanted criminal and yet is playing in a kabaddi match, goes to the stadium to arrest Velu. By now, Velu too has fallen in love with Dhanalakshmi and begins to miss her, only to spot her in the stadium during the match. Velu's lack of focus in the game is replaced by his best performance on seeing Dhanalakshmi, winning Tamil Nadu the championship. After winning the championship, Velu is arrested by his father, but is then stopped by Muthupandi, who wants to fight Velu, having been incited by Dhanalakshmi to do so to prove his worth. Velu defeats Muthupandi and embraces Dhanalakshmi, but when Muthupandi regains consciousness and tries to kill Velu, he accidentally falls on a floodlight and dies."
}