{
    "id": "0422236",
    "localized title": "Fida",
    "cast": [
        "Kareena Kapoor",
        "Fardeen Khan",
        "Shahid Kapoor",
        "Kim Sharma",
        "Aashima Kapoor Bhanushali",
        "Dinesh Hingoo",
        "Viju Khote",
        "Akhilendra Mishra",
        "Naresh Suri",
        "Vivek Vaswani"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Romance",
        "Thriller"
    ],
    "runtimes": "122",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": [
        "Australia:MA15+",
        "Canada:14A::(Alberta)",
        "Canada:G::(Quebec)",
        "Germany:16",
        "India:UA",
        "Netherlands:16",
        "New Zealand:R16",
        "Philippines:18+::(self-applied)",
        "Singapore:PG",
        "South Africa:13",
        "United Kingdom:15",
        "United Kingdom:15::(DVD rating)",
        "United Kingdom:12A"
    ],
    "original air date": "20 Aug 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BMWIwOWZkZjYtMmZkMy00OTk1LTg4ZWMtNmE3YTJiYzA2NjU5XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0422236",
    "plot outline": "Fida tells the story of Jai who one day happen to meet a young and beautiful woman called Neha and he falls in love with her at first sight. However trying to persuade Neha was in vane to Jai, because she has no such feelings for him as he has for her. Jai turn crazy in love with Neha and couldn't find no more alternative to persuade her than suicide but his suicide attempt is unsuccessful since he is save by his best friend and Neha finally falls in love with Jai. Little by little Jai began to know that he is in love with a criminal daughter and her father owes 60 million to the underworld don. Jai decides to help Neha by grabbing the money for her because he is in love with her, to fulfilled his motive he decides to rob a bank but follow computer hacker Vikram to his house where he was trapped in a net. Neha his love turn against him and goes towards Vikram. The two accounts that were hacked by the bank belongs to underworld don Babu Anna and he also begins to chase Jai. Jai now has to run form the police and Babu Anna. But in the final showdown Jai was forced to kill Neha and rein Vikram in such a way that he had to distribute the remaining money to charity.",
    "languages": "Hindi",
    "title": "Fida",
    "kind": "movie",
    "directors": "Ken Ghosh",
    "writers": [
        "Lalit Mahajan",
        "Sunny Mahajan",
        "",
        "Kiran Kotrial"
    ],
    "producers": [
        "Shabuddin Choudhary",
        "Kumar Sadhuram Taurani",
        "Ramesh Sadhuram Taurani"
    ],
    "composers": [
        "Anu Malik",
        "Raju Singh"
    ],
    "cinematographers": "Amit Roy",
    "editors": "V.N. Mayekar",
    "art directors": "Omung Kumar",
    "costume designers": [
        "Shaahid Amir",
        "Manish Malhotra",
        "Falguni Thakore"
    ],
    "production managers": [
        "Rashid Ali Khan",
        "Harish Pujari"
    ],
    "assistant directors": [
        "Kookie Gulati",
        "Akkhilesh Mishra",
        "Kshiti Nijhawan"
    ],
    "sound department": [
        "Subir Kumar Das",
        "Anup Dev",
        "Prakash Gupta",
        "Vijay Kumar",
        "Anuj Mathur",
        "Karnail Singh",
        "Vikram Biswas"
    ],
    "visual effects": [
        "Vinay Singh Chuphal",
        "Tarun Kripalani",
        "P. Mohan",
        "Prasad Sutar",
        "Jayadev Tiruveaipati"
    ],
    "stunts": [
        "Allan Amin",
        "Sanober Pardiwalla"
    ],
    "costume departmen": "Shabina Khan",
    "music department": [
        "Alisha Chinai",
        "Subir Kumar Das",
        "Abhijit Deo",
        "Kareena Kapoor",
        "Shahid Kapoor",
        "Pritesh Mehta",
        "Sapna Mukherjee",
        "Udit Narayan",
        "Sonu Nigam",
        "Sameer",
        "Kumar Sanu",
        "Alka Yagnik"
    ],
    "miscellaneous": [
        "Dilip Advani",
        "Vaibhavi Merchant",
        "Rakesh Shrestha",
        "Prakash Talreja",
        "Milap Zaveri"
    ],
    "akas": "Игра в любовь (Russia)",
    "writer": [
        "Lalit Mahajan",
        "Sunny Mahajan",
        "Kiran Kotrial"
    ],
    "director": "Ken Ghosh",
    "production companies": "Tips Films Pvt. Ltd.",
    "distributors": [
        "Rainbow Films U.S.A.",
        "STAR India"
    ],
    "other companies": [
        "Manish Malhotra & Co.",
        "Seek Red",
        "Tips Cassettes & Records Co."
    ],
    "plot": [
        "A young man is hellbent to destroy his arch enemy and his lover, who destroyed his life.",
        "_Fida_ (qv) tells the story of Jai who one day happen to meet a young and beautiful woman called Neha and he falls in love with her at first sight. However trying to persuade Neha was in vane to Jai, because she has no such feelings for him as he has for her. Jai turn crazy in love with Neha and couldn't find no more alternative to persuade her than suicide but his suicide attempt is unsuccessful since he is save by his best friend and Neha finally falls in love with Jai. Little by little Jai began to know that he is in love with a criminal daughter and her father owes 60 million to the underworld don. Jai decides to help Neha by grabbing the money for her because he is in love with her, to fulfilled his motive he decides to rob a bank but follow computer hacker Vikram to his house where he was trapped in a net. Neha his love turn against him and goes towards Vikram. The two accounts that were hacked by the bank belongs to underworld don Babu Anna and he also begins to chase Jai. Jai now has to run form the police and Babu Anna. But in the final showdown Jai was forced to kill Neha and rein Vikram in such a way that he had to distribute the remaining money to charity.::hEmRaJ (gavin_coolhgr@hotmail.com)",
        "On a chance encounter, Jai Malhotra reaches up with Neha Mehra of whom he falls head over heels in love with. Neha tells Jai that she is in need of 60 million rupees to pay her debts, determined to help her, Jai tries to rob Vikram Singh, but gets caught. Vikram, is an Internet hacker, he agrees to help Jai on condition that he takes the blame for the Internet thefts. Jai agrees, gives the money to Neha and turns himself in. The accounts that were hacked by Vikram belongs to underworld don, Babu Anna, who wants revenge from the hacker. On hearing that the thief has been found, Babu tries to capture Jai, who escapes. With both the police and the underworld after him, Jai goes to Neha's apartment. He finds Vikram there and realizes that he has become the fall guy for them both. He escapes from the apartment, but is shot and presumed dead. He is, however, alive and will not rest until he gets to take revenge against Neha and Vikram.::gavin (gunmasterM@hotmail.com)",
        "In a view to acquire huge sums of money; a young couple Vikram and Neha are equally involve in computer bank hacking. When Vikram finds out that Jai Malhotra is in love with Neha he decides to frame him by making him confess to this crime. When Jai is arrested he makes a drastic escape and is on the run from the police, meet with an accident and is believe to be dead. 6 months later Jai re-surface with a motive of taking revenge on the couple.::gavin (racktoo@hotmail.com)",
        "Babu Anna an underworld Don is conned for a huge amount from his bank account by modern technique of computer hacking.Jai lives with his friend Sonia but when he meets Neha he falls in love with her at first site but she ignores him until he tries to commit suicide by consuming pills.Once Jai sees Neha trying to hang herself as her father as left huge debut behind her and is being harassed by the creditors.Jai tries to arrange the money in many ways but the amount is to big so decides to eye a bank customer who will withdraw huge sum from bank.Jai finds such person and goes to loot him in the night but gets attacked by him. He becomes conscious and the person introduces himself as Vikram and is ready to help Jai on condition that he should take the blame on himself of the bank fraud which took place sometime ago which was done by Vikram.Jai gets arrested and while on the way to court Anna's man attack him as they feel he had done the fraud Jai escapes to save his life and reaches Neha's house where he is shocked to see Vikram and Neha together who had planned everything to frame Jai.::alex.mjacko@gmail.com",
        "Jai has a vision of the girl he is going to fall in love with, and one day, he sees her. Because of his sheer determination and willingness to do anything for Neha, she also finally falls in love with him. Jai thinks theirs is the perfect love story, but unfortunately, someone else is writing it. Vikram's love story is a passionate one, but it did not go as planned. '_Fida_ (qv)' is about two love stories. But, both do not have perfect ending.::Sujit R. Varma",
        "Computer Hacker, Vikram, frames Jai Malhotra for this crime, and has him arrested, on condition that he will pay him 60 million rupees to pay for, Neha, his girlfriend's debts, to which Jai agrees. The bank account that was hacked is that of Babu Anna, a notorious Bombay criminal Don, who is engraged at this upstart for robbing him. He arranges to kill Jai when he is escorted to Court to be tried, but Jai manages to escape, only to find out that it was not only Vikram who framed him, but Neha also. This devastates Jai, and now he must run, not only from the police, but also Babu Anna's men, as well as his own memories.::rAjOo (gunwanti@hotmail.com)"
    ]
}