{
    "id": "0440463",
    "localized title": "Hava Aney Dey",
    "cast": [
        "Aniket Vishwasrao",
        "Nishikant Kamat",
        "Tannishtha Chatterjee",
        "Rajshree Thakur",
        "Chinmay Kelkar",
        "Hridaynath Jadhav",
        "Tejas D. Parvatkar",
        "Nikhil Ratnaparkhi",
        "Mangala Kenkre",
        "Pubali Sanyal",
        "Niaal Saad",
        "Richa Nayyar",
        "Deepak Qazir",
        "Ganesh Yadav",
        "Shumona Bannerjee",
        "Pravina Bano",
        "Preeti Joshi",
        "Yogesh Vinayak Joshi",
        "Rupa Magar",
        "Rakesh Mehra",
        "Shailaja Mehta",
        "Sudhir Nema",
        "Radha Pal",
        "Ashmita Sharma",
        "Nishi Singh",
        "Rajan Swani"
    ],
    "genres": "Drama",
    "runtimes": "93",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "mr",
        "en"
    ],
    "color info": "Color",
    "aspect ratio": "1.85 : 1",
    "sound mix": "DTS",
    "certificates": [
        "India:(Banned)",
        "United States:Not Rated"
    ],
    "cover url": "https://m.media-amazon.com/images/M/MV5BMjA3MjgxMTYwNl5BMl5BanBnXkFtZTcwOTg3NjE1MQ@@._V1_SY150_CR1,0,101,150_.jpg",
    "imdbID": "0440463",
    "plot outline": "Arjun lives a impoverished lifestyle with his widowed mother in a Chawl in Vikhroli, attends college and hangs out with Chabia. His mother wants him to complete his education and get hired with the Railways, but Arjun wants something better. He is attracted to fellow-collegian, Salma, and even takes part in acting classes just to be close to her. After a number of dramatic events, including being arrested for molesting women, Chabia asks him to borrow money from his mother so that they can make passports and re-locate to Dubai to earn a decent wage and improve their lifestyles. Amidst rising tensions of a war between Pakistan and India, Arjun is all set to ask his mother for a loan; while Chabia's brother, Sudhakar, will accuse him of stealing jewelry.",
    "languages": [
        "Hindi",
        "Marathi",
        "English"
    ],
    "title": "Let the Wind Blow",
    "kind": "movie",
    "directors": "Partho Sen-Gupta",
    "writers": [
        "Yogesh Vinayak Joshi",
        "",
        "Partho Sen-Gupta"
    ],
    "producers": [
        "Marie-Cécile Destandau",
        "Rakesh Mehra",
        "Brij Rathi"
    ],
    "composers": "Eryck Abecassis",
    "cinematographers": "Jean-Marc Ferriere",
    "editors": "Annick Raoul",
    "editorial department": "Rahul Srivastava",
    "casting directors": "Yogesh Vinayak Joshi",
    "production designers": "Agnes Vergne",
    "production managers": "Vrajesh Sampat",
    "assistant directors": [
        "Snigda Khatawkar",
        "Punarvasu Naik",
        "Sudeep Sengupta"
    ],
    "sound department": [
        "Charles Autrand",
        "Nicolas Becker",
        "Nikolas Javelle",
        "Jacques Sans",
        "Nathalie Vidal"
    ],
    "visual effects": "Bertrand Levallois",
    "camera department": [
        "Abdul Hamid Shaikh",
        "G. Monic Kumar",
        "Rishi Umrania"
    ],
    "script department": "Tanvi Mehta",
    "miscellaneous": [
        "Rajendra Shukla",
        "Hemant Tailor"
    ],
    "akas": "Let the Wind Blow (World-wide, English title)",
    "writer": [
        "Yogesh Vinayak Joshi",
        "Partho Sen-Gupta"
    ],
    "director": "Partho Sen-Gupta",
    "production companies": [
        "Independent Movies",
        "Mystique Media Ltd.",
        "Santocha Productions"
    ],
    "distributors": [
        "Global Film Initiative",
        "Global Film Initiative"
    ],
    "plot": [
        "A collegian in turbulent Mumbai attempts to improve his lifestyle.",
        "Arjun lives a impoverished lifestyle with his widowed mother in a Chawl in Vikhroli, attends college and hangs out with Chabia. His mother wants him to complete his education and get hired with the Railways, but Arjun wants something better. He is attracted to fellow-collegian, Salma, and even takes part in acting classes just to be close to her. After a number of dramatic events, including being arrested for molesting women, Chabia asks him to borrow money from his mother so that they can make passports and re-locate to Dubai to earn a decent wage and improve their lifestyles. Amidst rising tensions of a war between Pakistan and India, Arjun is all set to ask his mother for a loan; while Chabia's brother, Sudhakar, will accuse him of stealing jewelry.::rAjOo (gunwanti@hotmail.com)"
    ],
    "synopsis": "India is in the throes of the new global economy. The new capitalist order is changing peoples lives. But a new war of ideals is separating the old values from the new There is also the war with Pakistanthe two brothers who are fighting for Kashmir. The two countries have equipped themselves with Oppenheimers deadly toy\nArjun, 18 years old, lives in the northern suburbs of Bombay with his widowed mother Sheela, who works hard to make ends meet. She has one goal in life that Arjun gets a diploma and a good job. Arjun is attracted to Salma, a girl from a Muslim upper class family. Somewhere Arjun knows that she is beyond his reach.\nChabia, 21 yrs old, is Arjuns best friend, a mechanic in a garage. Chabia loves Mona, a dancer in a cabaret bar. Chabia hates seeing those rich men showering her with money as she dances for them. She wants to go and work in Dubai. Rohit, a rich young boy brings his BMW car to service it in Chabias garage. Chabia fixes his car with some cheap spares that he has procured from some dubious sources.\nRohit is happy and invites Chabia for a drink in a posh club in downtown Bombay. Chabia thinks that this is an opportunity for him to meet people from the upper class. But things turn out badly for them and the bouncers beat them up. Rohit does not help them. The tensions on the border increasethe military build-up intensifies. Both countries test their intercontinental ballistic missiles.\nChabia steals money from his brother and plans to run away with Mona and start a new life. But she has cold feet at the last minute and goes off to work in the cabarets of Dubai. Arjun fails his diploma examination as he tries to cheat using fake examination papers that Chabia had procured for him. The two friends want to do something to leave this climate of despair. An old friend returns from abroad, with stories of his fortunes. He was going to retire in a few years. He had made his money. Chabia tries to convince Arjun to go abroad with him, but Arjun does not want to leave his mother alone. Chabia & Arjun decide to meet an employment agent who promises them jobs for a huge fee. Chabia manages to arrange for his fee but Arjun cannot manage his. Chabia tells him to ask his mother Sheela to lend him the money. At first, Sheela is very angry but finally succumbs to her sons demand.\nThe day before their departure, they celebrate their farewell. The mood is upbeat. They are going to be the masters of their destinies. But, can they rewrite their destiny?"
}