{
    "id": "0488414",
    "localized title": "Omkara",
    "cast": [
        "Ajay Devgn",
        "Kareena Kapoor",
        "Saif Ali Khan",
        "Konkona Sen Sharma",
        "Vivek Oberoi",
        "Bipasha Basu",
        "Naseeruddin Shah",
        "Deepak Dobriyal",
        "Pankaj Tripathi",
        "Kamal Tiwari",
        "Manav Kaushik",
        "Avtar Sahani",
        "Santosh Kaushik",
        "Rahul Kumar"
    ],
    "genres": [
        "Action",
        "Crime",
        "Drama",
        "Thriller"
    ],
    "runtimes": "155",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "aspect ratio": "2.35 : 1",
    "sound mix": "Dolby Digital",
    "certificates": [
        "Australia:M",
        "Canada:14A::(Alberta)",
        "Canada:PG::(British Columbia)",
        "Canada:13+::(Quebec)",
        "India:A",
        "Mexico:B",
        "New Zealand:M",
        "United Kingdom:12A",
        "United Kingdom:12::(DVD rating)",
        "United States:Not Rated"
    ],
    "original air date": "28 Jul 2006 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BY2NmNjlhYzQtMWU5MS00YTVmLWIyOWEtOGFmY2ZjMjY2ZGRkXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_SX101_CR0,0,101,150_.jpg",
    "imdbID": "0488414",
    "plot outline": "Advocate Raghunath Mishra has arranged the marriage of his daughter, Dolly, with Rajan, knowing fully well that Dolly loves Omkara Shukla. Before the marriage could take place, the groom's party is attacked, they flee, and Dolly is reportedly abducted. Raghunath is able to trace Dolly to Omkara, a criminal and hit-man, a verbal confrontation ensues until Politician Bhaisaab telephonically intervenes, and a crestfallen Raghunath faces the reality that Dolly was not abducted but is here with Omkara by her own free will. He warns Omkara, and departs. Shortly thereafter, Bhaisaab is shot at and wounded, announces that Omkara should stand in the next election, and as a result, Omkara appoints one of his lieutenants', Keshav Upadhyay in his place as the 'Bahubali\". Omkara realizes that he may have blundered in having Keshav succeed him, as Keshav is unable to control his temper when under the influence of alcohol, which puts him in the bad books of Omkara. Then Omkara suspects that Keshav is having an affair with Dolly, as both had been fellow-collegians. With Omkara's marriage with Dolly getting close, he asks his other lieutenant, Ishwar Tyagi, to obtain proof of Keshav's affair with Dolly or face the consequences, as Omkara remembers Raghunath's warning that when a daughter is not true to her father, she will never be true to anyone. Watch what happens when Ishwar produces proof shortly after the marriage, and the impact this has on Dolly, Omkara, Keshav, Ishwar, and Ishwar's wife, Indu.",
    "languages": "Hindi",
    "title": "Omkara",
    "kind": "movie",
    "directors": "Vishal Bhardwaj",
    "writers": [
        "Vishal Bhardwaj",
        "Robin Bhatt",
        "Abhishek Chaubey",
        "",
        "Vishal Bhardwaj",
        "",
        "William Shakespeare",
        "",
        "Vishal Bhardwaj"
    ],
    "producers": [
        "Inderjit Chadha",
        "Sanjeev Joshi",
        "Ketan Maru",
        "Abhishek Pathak",
        "Amita Pathak",
        "Kumar Mangat Pathak",
        "Neelam Pathak"
    ],
    "composers": "Vishal Bhardwaj",
    "cinematographers": "Tassaduq Hussain",
    "editors": "Meghna Manchanda Sen",
    "editorial department": [
        "Parth Y. Bhatt",
        "Rohan Desai",
        "Navin Shetty"
    ],
    "casting directors": "Honey Trehan",
    "production designers": "Samir Chanda",
    "art directors": "Nitin Wable",
    "costume designers": [
        "Dolly Ahluwalia",
        "Shaahid Amir"
    ],
    "make up department": [
        "Vikram Gaikwad",
        "Shailesh Keskar",
        "Ritesh Naik",
        "Nitin Shitole",
        "Harish Wadhone"
    ],
    "production managers": [
        "Rashid Ali Khan",
        "Santosh K. Mishra",
        "Rama Rao",
        "Punam Sawhney",
        "Abhishek Sharma",
        "Anshul Sharma",
        "Vipin Singh",
        "Anil Thakur"
    ],
    "assistant directors": [
        "Ajit Ahuja",
        "Lara Bhalla",
        "Aasmaan Bhardwaj",
        "Abhishek Chaubey",
        "Shyamali Dey",
        "Mansi Maroo",
        "Abhishek Sharma",
        "Shlok Sharma",
        "Honey Trehan"
    ],
    "art department": [
        "Manish Baba",
        "Ramdas Kundaikar",
        "Choudhari Nilesh",
        "Somenath Pakre"
    ],
    "sound department": [
        "Sajjan Choudhary",
        "Anup Dev",
        "Amrit Pritam Dutta",
        "Uday Girkar",
        "Shajith Koyeri",
        "Vijay Kumar",
        "Kiran Nalwade",
        "Santosh Sahoo",
        "Subash Sahoo",
        "K.J. Singh",
        "Karnail Singh",
        "Sreejesh"
    ],
    "visual effects": [
        "Swapnil Ambre",
        "Chetan Gaur",
        "Piyush Khandelwal",
        "Anup Kumar",
        "Anand Nayak",
        "Dinesh Solanki",
        "Merzin Tavaria"
    ],
    "stunts": "Jai Singh",
    "camera department": [
        "Debal Banerjee",
        "Amol Gole",
        "Sanjay Kumar Kesari",
        "Pramod Khandale",
        "Samanta Mahendra",
        "Prameelkumar",
        "Mahendra Samanta",
        "Sujit Sen"
    ],
    "costume departmen": "Soni Nandlal",
    "music department": [
        "Rahat Fateh Ali Khan",
        "Rekha Bhardwaj",
        "Vishal Bhardwaj",
        "Clinton Cerejo",
        "Sunidhi Chauhan",
        "Subir Kumar Das",
        "Shreya Ghoshal",
        "Gulzar",
        "Barnali Kalita",
        "Nitin Shankar",
        "Sukhwinder Singh",
        "Hitesh Sonik",
        "Suresh Wadkar"
    ],
    "script department": "Debashree Mukherjee",
    "miscellaneous": [
        "Ganesh Acharya",
        "Joe D'Souza",
        "Parull Gossain",
        "Bhushan Lakandri",
        "Himanshu Nanda",
        "Rahul Nanda"
    ],
    "akas": "Омкара (Russia)",
    "writer": [
        "Vishal Bhardwaj",
        "Robin Bhatt",
        "Abhishek Chaubey"
    ],
    "director": "Vishal Bhardwaj",
    "production companies": [
        "Shemaroo Video Pvt. Ltd.",
        "Big Screen Entertainment",
        "Panorama Studios"
    ],
    "distributors": [
        "Eros Worldwide",
        "Eros Worldwide"
    ],
    "special effects": "Prime Focus",
    "other companies": [
        "Adlabs Films",
        "Aum Advertising & Media",
        "Lakdawala's Sound City",
        "Shemaroo Entertainment"
    ],
    "plot": [
        "A politically-minded enforcer's misguided trust in his lieutenant leads him to suspect his wife of infidelity in this adaptation of Shakespeare's 'Othello'.",
        "Advocate Raghunath Mishra has arranged the marriage of his daughter, Dolly, with Rajan, knowing fully well that Dolly loves _Omkara_ (qv) Shukla. Before the marriage could take place, the groom's party is attacked, they flee, and Dolly is reportedly abducted. Raghunath is able to trace Dolly to _Omkara_ (qv), a criminal and hit-man, a verbal confrontation ensues until Politician Bhaisaab telephonically intervenes, and a crestfallen Raghunath faces the reality that Dolly was not abducted but is here with _Omkara_ (qv) by her own free will. He warns _Omkara_ (qv), and departs. Shortly thereafter, Bhaisaab is shot at and wounded, announces that _Omkara_ (qv) should stand in the next election, and as a result, _Omkara_ (qv) appoints one of his lieutenants', Keshav Upadhyay in his place as the 'Bahubali\". _Omkara_ (qv) realizes that he may have blundered in having Keshav succeed him, as Keshav is unable to control his temper when under the influence of alcohol, which puts him in the bad books of _Omkara_ (qv). Then _Omkara_ (qv) suspects that Keshav is having an affair with Dolly, as both had been fellow-collegians. With _Omkara_ (qv)'s marriage with Dolly getting close, he asks his other lieutenant, Ishwar Tyagi, to obtain proof of Keshav's affair with Dolly or face the consequences, as _Omkara_ (qv) remembers Raghunath's warning that when a daughter is not true to her father, she will never be true to anyone. Watch what happens when Ishwar produces proof shortly after the marriage, and the impact this has on Dolly, _Omkara_ (qv), Keshav, Ishwar, and Ishwar's wife, Indu.::rAjOo (gunwanti@hotmail.com)",
        "This tale finds Shakespeare's \"Othello\" transplanted to gritty modern India. _Omkara_ (qv) strong-arms the locals into following his boss, the politician Tiwari Bhaisaab. Eventually, Omi enters politics himself and appoints one of his lieutenants, Kesu, to fill his place. This entices the jealousy of Langda, and he hatches a revenge plot. Langda plants seeds of doubt in Omi's mind, concerning the faithfulness of Omi's new bride Dolly...::L. Hamre"
    ],
    "synopsis": "Omkara 'Omi' Shakula (Ajay Devgan) heads a gang of outlaws supporting the local politician Tiwar Bhaisaab (Naseerudin Shah). Omi's most trusted lieutenants are Ishwar 'Langda' Tyagi (Saif Ali Khan) and Keshwar 'Kesu Firangi' Upadhayay (Vivek Oberoi). The film opens with Langda attacking a marriage procession. He convinces the bridegroom Raju (Deepak Dobriyal) to chase after the bride, Dolly (Kareena Kapoor), who has been kidnapped by Omi. Raju, however, fails and wedding doesn't take place.Dolly's father (Kamal Tiwari), a high-profile lawyer Ragunath Mishra, angrily storms Omi's place and demands the return of his daughter. Omi, however, claims that Dolly chose to be with him rather than Raju. Bhaisaab smooths the situation over by having Dolly tell her father that she consented to elope with Omi and was not violently abducted. Mishra feels humiliated and betrayed, leaving his daughter with Omi.Omi's gang eventually organizes a MMS sex scandal, smearing Bhaisaab's political opponent's reputation and helping him secure a Parlimentary position. Showing his appreciation, Bhaisaab promotes Omi from the role of a political enforcer to a candidate for the upcoming elections. When it comes time to promote one of his lieutenants, Omi chooses Kesu over Langda. Angered, Langda decides to get revenge on both Omi and Kesu. As the gang celebrates thier victory with Kesu's dancer-girl mistress Billo (Bipasha Basu) Langda takes advantage of Kesu's low threshold for alcohol. Getting Kesu drunk, Langda instigates a drunken brawl between Kesu and Raju. Omi is enraged and admonishes Kesu, starting to regret his decision.Pretending to be a concerned friend, Langda suggets that Kesu get on Dolly's good side so she can plead his case to Omi. Kesu agrees and starts spending more time with Dolly. Langda, using petty insinuations, poisons Omi's mind against Kesu and Dolly, suggesting that they are having an affair. A piece of jewellery gifted from Omi to Dolly is stolen by Langda's wife Indu (Konkona Sen Sharma) and given to him. Langda plants this on Billo, who gives it to Kesu. This is used as more evidence for Dolly's infidelity. Jealousy clouds Omi's mind until everything is seen as more evidence against Kesu and Dolly. He gives Langda the heads up to kill Kesu.In the end, Omi confronts Dolly of her supposed unfaithfullness. In a fit of rage, he smothers her and kills her. Indu enters and weeps over Dolly's dead body. She discovers Omi's gift and admits she stole it; Indu and Omi realize that Langda's web of lies. Angered and upset, Indu slashes Langda's throat. Omi, out of depression, commits suicide."
}