{
    "id": "0810394",
    "localized title": "Gajendra",
    "cast": [
        "Sarath Babu",
        "Rajat Bedi",
        "Flora",
        "Liyaqat Ali Khan",
        "Ramesh Khanna",
        "Laya",
        "RajKapur",
        "Nizhalgal Ravi",
        "Radha Ravi",
        "Seetha",
        "Vijayakanth",
        "Vinuchakravarthy"
    ],
    "genres": "Action",
    "runtimes": "145",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "hi",
        "ta"
    ],
    "color info": "Color",
    "sound mix": "DTS::(RCA Sound System)",
    "certificates": "India:U",
    "original air date": "22 Sep 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTdhNzNhMDUtNDExYi00YzJlLWI2MjAtNDIwYzBiNzc1NTAzXkEyXkFqcGdeQXVyOTk3NTc2MzE@._V1_SY150_CR23,0,101,150_.jpg",
    "imdbID": "0810394",
    "plot outline": "Vijaykanth is Gajendra the loyal servant of the rich man Sarath Babu. Gajendra an orphan was brought by Sarath Babu. Gajendra dotes on Laya a mentally deranged girl who stays with a couple who takes care of her. Flora the granddaughter of Sarath is in love with Vijaykanth. Sarath Babu decides to marry off Flora to Vijaykanth and to overcome the protests from his son in law Nizhalagal Ravi he decides to adopt Vijaykant as his son. At this juncture Ravi comes up with Laya and questions his relationship with her. Vijaykanth is unable to say anything and Sarath Babu mistakes this silence and asks him to go out of the house. Vijaykanth along with Laya goes for a temple festival where Sarath Babu and family too turn up. A gang led by RajKapur on behalf of a don Rana languishing in the jail comes to kill Vijaykanth while yet another gang led by Radha Ravi comes to help Vijaykanth. Sarath Babu witnesses the fierce battle in which Vijaykanth wins. Laya who gets hurt in the fight regains her senses. She takes an iron rod and stabs Vijaykanth saying that he only killed her father. Vijaykanth is battling for his life in a hospital. Hundreds of people throng the hospital shouting Gaja Gaja. Now Vijaykanth's aide Ramesh Kanna reveals the past. Vijaykanth had gone to Hyderabad with a mission to bring back Sarath Babu's estranged daughter Seetha who eloped with Rajiv , now running an ayurvedic hospital. Laya daughter of Seetha falls in love with Vijaykanth. Vijaykanth manages to convince Rajiv about reuniting with his father in law. At this point don Rana's brother kills Seetha. Radha Ravi an ACP in the city is helpless before the power of Rana. Vijaykanth in turn kills Rana's brother and becomes the savior to those suffering from the don's atrocities. The don and Vijaykanth battle it out. Rajiv and his daughter decide to go to Chennai. Rana plants a bomb in the suitcase of Rajiv because the CM is also travelling in it. Vijaykanth left with no option but to shoot down Rajiv who is about to board the train. Laya who is thrown off the train suffers a brain damage. On hearing that Vijaykant is in the hospital, Rana comes out of jail to wreck vengeance. A gory battle takes place in which Rana is killed. Vijayykanth hams his way through while Liagath Ali Khan makes use of all possible way to squeeze in politically loaded dialogues. The two heroines having nothing much to do. Suresk Krishna as a director does not have much to do since the major part of the film is fights. Camera-work by Prathap is innovative and Deva has a soothing song in the film. A careful adaptation to suit the Tamil audience could have done the trick.",
    "languages": [
        "Hindi",
        "Tamil"
    ],
    "title": "Gajendra",
    "kind": "movie",
    "directors": "Suresh Krishna",
    "writers": [
        "Vijayendra Prasad",
        "",
        "S.S. Rajamouli",
        "",
        "Suresh Krishna"
    ],
    "producers": [
        "V.A. Durai",
        "Sanjay Singh"
    ],
    "composers": "Deva",
    "sound department": [
        "G. Siva Kumar",
        "Shyam Sundar S."
    ],
    "visual effects": "Ravichandran",
    "stunts": "Rocky Rajesh",
    "akas": "The Return of Khuda Gawah (India, Hindi title)",
    "writer": [
        "Vijayendra Prasad",
        "S.S. Rajamouli",
        "Suresh Krishna"
    ],
    "director": "Suresh Krishna",
    "production companies": "Tamilanai Cine Creation",
    "distributors": "Sun TV",
    "other companies": "Five Star",
    "plot": "Vijaykanth is _Gajendra_ (qv) the loyal servant of the rich man Sarath Babu. _Gajendra_ (qv) an orphan was brought by Sarath Babu. _Gajendra_ (qv) dotes on Laya a mentally deranged girl who stays with a couple who takes care of her. Flora the granddaughter of Sarath is in love with Vijaykanth. Sarath Babu decides to marry off Flora to Vijaykanth and to overcome the protests from his son in law Nizhalagal Ravi he decides to adopt Vijaykant as his son. At this juncture Ravi comes up with Laya and questions his relationship with her. Vijaykanth is unable to say anything and Sarath Babu mistakes this silence and asks him to go out of the house. Vijaykanth along with Laya goes for a temple festival where Sarath Babu and family too turn up. A gang led by RajKapur on behalf of a don Rana languishing in the jail comes to kill Vijaykanth while yet another gang led by Radha Ravi comes to help Vijaykanth. Sarath Babu witnesses the fierce battle in which Vijaykanth wins. Laya who gets hurt in the fight regains her senses. She takes an iron rod and stabs Vijaykanth saying that he only killed her father. Vijaykanth is battling for his life in a hospital. Hundreds of people throng the hospital shouting Gaja Gaja. Now Vijaykanth's aide Ramesh Kanna reveals the past. Vijaykanth had gone to Hyderabad with a mission to bring back Sarath Babu's estranged daughter Seetha who eloped with Rajiv , now running an ayurvedic hospital. Laya daughter of Seetha falls in love with Vijaykanth. Vijaykanth manages to convince Rajiv about reuniting with his father in law. At this point don Rana's brother kills Seetha. Radha Ravi an ACP in the city is helpless before the power of Rana. Vijaykanth in turn kills Rana's brother and becomes the savior to those suffering from the don's atrocities. The don and Vijaykanth battle it out. Rajiv and his daughter decide to go to Chennai. Rana plants a bomb in the suitcase of Rajiv because the CM is also travelling in it. Vijaykanth left with no option but to shoot down Rajiv who is about to board the train. Laya who is thrown off the train suffers a brain damage. On hearing that Vijaykant is in the hospital, Rana comes out of jail to wreck vengeance. A gory battle takes place in which Rana is killed. Vijayykanth hams his way through while Liagath Ali Khan makes use of all possible way to squeeze in politically loaded dialogues. The two heroines having nothing much to do. Suresk Krishna as a director does not have much to do since the major part of the film is fights. Camera-work by Prathap is innovative and Deva has a soothing song in the film. A careful adaptation to suit the Tamil audience could have done the trick.::Krishanthan"
}