{
    "id": "0928152",
    "localized title": "Malliswari",
    "cast": [
        "Venkatesh Daggubati",
        "Katrina Kaif",
        "Kota Srinivasa Rao",
        "Ganesh Babu",
        "Banerjee",
        "Tanikella Bharani",
        "Brahmanandam",
        "Chalapathi Rao",
        "Gajala",
        "Hema",
        "Balaiah M.",
        "Aahuthi Prasad",
        "Rajitha",
        "Gautam Raju",
        "C.V.L. Narasimha Rao",
        "Raghunatha Reddy",
        "Chitram Seenu",
        "Smita",
        "Smitha",
        "Dharmavarapu Subramanyam",
        "Suneel"
    ],
    "genres": [
        "Comedy",
        "Romance"
    ],
    "runtimes": "150",
    "countries": "India",
    "country codes": "in",
    "language codes": [
        "te",
        "en"
    ],
    "color info": "Color",
    "certificates": [
        "India:U",
        "United Kingdom:PG"
    ],
    "original air date": "18 Feb 2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTRiMTcwYzktZGUzMS00ZDFjLWI0NzAtZTEwYzE4MDI2ZGM3XkEyXkFqcGdeQXVyMzA0NTI2OTM@._V1_SY150_CR2,0,101,150_.jpg",
    "imdbID": "0928152",
    "plot outline": "Malliswari is the heiress of Raja of Mirjapur. Her deceased father wrote in his will that she would inherit the property worth 750 crores after she is no longer legally a minor - at the age of 21. The entire property is under the care-taking of Bhavani Prasad, who wants to inherit the entire property by killing her. As he hatches the plans to eliminate Malliswari, she is sent to Vizag to a relative's place as a normal girl so that she can live with anonymity. Prasad works as bank accountant in Andhra Bank at Vizag. He is a bachelor who has been desperately seeking for marriage alliance for the past seven years. He would be looking at every unmarried girl with dreams in his eyes. Just call him 'Pellikaani Prasad' and he would get instantly irritated. He accidentally meets Malliswari and falls deeply in love with her. Malliswari is traced by the goons in Vizag and they start running after her. Prasad escorts her and drops her safely in Hyderabad. To know what happened next, you must watch Malliswari on a big screen.",
    "languages": [
        "Telugu",
        "English"
    ],
    "title": "Malliswari",
    "kind": "movie",
    "directors": "Vijay K. Bhaskar",
    "writers": [
        "Vijay K. Bhaskar",
        "",
        "Trivikram Srinivas",
        "",
        "Trivikram Srinivas"
    ],
    "producers": [
        "D. Suresh Babu",
        "Vijay Jagarlamudi"
    ],
    "composers": "Koti",
    "cinematographers": "Sameer Reddy",
    "editors": "A. Sreekar Prasad",
    "art directors": "Bhupesh R. Bhupathi",
    "assistant directors": [
        "R. Samala",
        "Sunitha Tati"
    ],
    "sound department": "Anand Pawar",
    "visual effects": [
        "Raaju Bonagaani",
        "Bonagani Shravan Raju"
    ],
    "stunts": "Stun Shiva",
    "music department": [
        "S.P. Balasubrahmanyam",
        "Bhuvanchandra",
        "K.S. Chithra",
        "Karthik",
        "Krishnakumar Kunnath",
        "Shankar Mahadevan",
        "Kumar Sanu",
        "Sirivennela Seetharama Sastry",
        "Sunitha"
    ],
    "miscellaneous": [
        "Krishna Reddy",
        "Nitya Santoshini",
        "Raja Sekhar",
        "Raju Sundaram",
        "Sunitha",
        "Lakshmi Venugopal"
    ],
    "thanks": [
        "M.S. Narayana",
        "Sharmishta Roy"
    ],
    "akas": [
        "The Princess (World-wide, English title)",
        "Принцесса Маллишвари (Russia)"
    ],
    "writer": [
        "Vijay K. Bhaskar",
        "Trivikram Srinivas",
        "Trivikram Srinivas"
    ],
    "director": "Vijay K. Bhaskar",
    "production companies": "Suresh Productions",
    "other companies": "Aditya Music",
    "plot": [
        "When her father dies, a wealthy heiress is sent to another city to protect her from people who try to harm and manipulate her. Living under an assumed identity, she meets a handsome banker and falls in love with him.",
        "_Malliswari_ (qv) is the heiress of Raja of Mirjapur. Her deceased father wrote in his will that she would inherit the property worth 750 crores after she is no longer legally a minor - at the age of 21. The entire property is under the care-taking of Bhavani Prasad, who wants to inherit the entire property by killing her. As he hatches the plans to eliminate _Malliswari_ (qv), she is sent to Vizag to a relative's place as a normal girl so that she can live with anonymity. Prasad works as bank accountant in Andhra Bank at Vizag. He is a bachelor who has been desperately seeking for marriage alliance for the past seven years. He would be looking at every unmarried girl with dreams in his eyes. Just call him 'Pellikaani Prasad' and he would get instantly irritated. He accidentally meets _Malliswari_ (qv) and falls deeply in love with her. _Malliswari_ (qv) is traced by the goons in Vizag and they start running after her. Prasad escorts her and drops her safely in Hyderabad. To know what happened next, you must watch _Malliswari_ (qv) on a big screen.::Anonymous"
    ]
}