{
    "id": "1137434",
    "localized title": "Aabra Ka Daabra",
    "cast": [
        "Naveen Bawa",
        "Prabhu Deva",
        "Satish Kaushik",
        "Anupam Kher",
        "Krrishna",
        "Vishal Lalwani",
        "Johny Lever",
        "Hansika Motwani",
        "Athit Naik",
        "Archana Puran Singh",
        "Tiara",
        "Shweta Tiwari",
        "Razak Khan"
    ],
    "genres": "Fantasy",
    "runtimes": "144",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "certificates": "United States:Not Rated",
    "original air date": "2004 (India)",
    "cover url": "https://m.media-amazon.com/images/M/MV5BNzk5ZWYxZWYtNWQ4Ny00MThlLTg0MzQtOGMyNmYzMDljNjRhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_SY150_CR6,0,101,150_.jpg",
    "imdbID": "1137434",
    "plot outline": "Shanu Singh lives a middle-class lifestyle with his dad, Rahul, and mom, Shivani. Rahul is a magician and performs Houdini-like tricks. Once while being locked in a iron cask and thrown into the sea, he does not surface and everyone believes he is dead, leaving Shanu to become a waiter in Dilbaug's Dhaba, while Shivani becomes a governess to Pinky, who is the daughter of Sindhi businessman, Maneklal. Shanu and Pinky wins Parle-G and Camlin Pencils contest and are enrolled in Aabra Ka Daabra - the school of magic, that was founded by Sage Adityanand, which is now run by a magician Rang Birangi, who has enormous magical powers. It is here that Shanu will find out about Rang Birangi's quest for Sanjeevani, a magic portion that will make her not only younger but also immortal, as well as her evil desire to rule the world, the whereabouts of his dad, and a deep dark secret that has been dormant for more than 200 years.",
    "languages": "Hindi",
    "title": "Aabra Ka Daabra",
    "kind": "movie",
    "directors": "Dheeraj Kumar",
    "producers": "Zuby Kocchar",
    "composers": "Himesh Reshammiya",
    "editors": "Ballu Saluja",
    "sound department": [
        "Suraj Jaisingh",
        "Nikhil v Pathare",
        "Alok De"
    ],
    "visual effects": [
        "Brijesh Bharatia",
        "Sudeepto Bose",
        "Prathap Karunakaran",
        "Vinay Naik",
        "Shailendra Swarnkar"
    ],
    "stunts": "Deepaksharmastunt",
    "miscellaneous": "Vishnudeva",
    "director": "Dheeraj Kumar",
    "distributors": "Sahara One",
    "plot": "Shanu Singh lives a middle-class lifestyle with his dad, Rahul, and mom, Shivani. Rahul is a magician and performs Houdini-like tricks. Once while being locked in a iron cask and thrown into the sea, he does not surface and everyone believes he is dead, leaving Shanu to become a waiter in Dilbaug's Dhaba, while Shivani becomes a governess to Pinky, who is the daughter of Sindhi businessman, Maneklal. Shanu and Pinky wins Parle-G and Camlin Pencils contest and are enrolled in _Aabra Ka Daabra_ (qv) - the school of magic, that was founded by Sage Adityanand, which is now run by a magician Rang Birangi, who has enormous magical powers. It is here that Shanu will find out about Rang Birangi's quest for Sanjeevani, a magic portion that will make her not only younger but also immortal, as well as her evil desire to rule the world, the whereabouts of his dad, and a deep dark secret that has been dormant for more than 200 years.::rAjOo (gunwanti@hotmail.com)"
}