{
    "id": "7396230",
    "localized title": "Woh",
    "cast": [
        "Ashutosh Gowariker",
        "Mamik Singh",
        "Lilliput",
        "Anupam Bhattacharya",
        "Asif Basra",
        "Daya Shankar Pandey",
        "Amit Mistry",
        "Ramesh Goyal",
        "Sukanya Kulkarni",
        "Gyan Prakash",
        "Kannu Gill",
        "Vicky Ahuja",
        "K.K. Goswami",
        "Aadesh Raathi",
        "Pratibha Goregaonkar",
        "Dr. Vilas Ujawane",
        "Amarnath Mukherjee",
        "Nayan Bhatt",
        "Saurabh Dubey",
        "Shobha Pradhan",
        "Dolly Dotiwalla",
        "Mukesh Jadhav",
        "Shreyas Talpade",
        "Nasir Khan",
        "Manoj Joshi",
        "Parzaan Dastur",
        "Sulabha Deshpande",
        "Shonali Malhotra",
        "Ankush Mohla",
        "Juhi Parmar",
        "Seema Shetty",
        "Ankur Zaveri",
        "Sumeet Goradia"
    ],
    "genres": "Horror",
    "runtimes": "25",
    "countries": "India",
    "country codes": "in",
    "language codes": "hi",
    "color info": "Color",
    "cover url": "https://m.media-amazon.com/images/M/MV5BYTU5ODBlMzUtMWVhYi00ODJjLWFiYmQtMDg0M2QxMGIzODg5XkEyXkFqcGdeQXVyODU1NDA5NDc@._V1_SY150_CR14,0,101,150_.jpg",
    "imdbID": "7396230",
    "plot outline": "In town of Panchgani 15 years ago seven school friends Ashutosh ,Raja,Julie,Shiva,Ronnie,Sanjeev and Rahul had overcome an evil force Woh who would kidnap the children and later murder them.years later in Ashutosh starts seeing balloons where children have been kidnapped and realizes that Woh has returned back.He immediately contacts his friends everyone returns except Sanjeev who has been killed by Woh on his way and has taken his place.They then with the help of Samidha daughter of their professor who guided them to capture Woh team and overcome the evil spirit.Radhika wife of Ashutosh is pregnant around same time and gives birth to a son Siddarth while Raja marries Samidha and friends return to their normal life until few years later they realize that Woh has returned in form of Siddarth.",
    "languages": "Hindi",
    "title": "Woh",
    "kind": "tv series",
    "series years": "1998-1998",
    "akas": "Оно (Russia)",
    "seasons": "1",
    "writer": "Stephen King",
    "production companies": "Zee TV",
    "distributors": "Zee5",
    "plot": [
        "The Hindi adaptation of the 1990 American TV miniseries It.",
        "In town of Panchgani 15 years ago seven school friends Ashutosh ,Raja,Julie,Shiva,Ronnie,Sanjeev and Rahul had overcome an evil force _Woh_ (qv) who would kidnap the children and later murder them.years later in Ashutosh starts seeing balloons where children have been kidnapped and realizes that _Woh_ (qv) has returned back.He immediately contacts his friends everyone returns except Sanjeev who has been killed by _Woh_ (qv) on his way and has taken his place.They then with the help of Samidha daughter of their professor who guided them to capture _Woh_ (qv) team and overcome the evil spirit.Radhika wife of Ashutosh is pregnant around same time and gives birth to a son Siddarth while Raja marries Samidha and friends return to their normal life until few years later they realize that _Woh_ (qv) has returned in form of Siddarth.::alex.mjacko@gmail.com"
    ]
}